<p align=center><b>Accord sur l'&eacute;valuation</b></p>

<p>Dans la phase de remise des travaux et d'&eacute;valuation, deux
diff&eacute;rents processus d'&eacute;valuation d'un travail
peuvent &ecirc;tre choisis par l'enseignant&nbsp;:</p>

<ol>

<li>L'&eacute;tudiant qui a fait le travail ne peut
r&eacute;agir aux &eacute;valuations faites par ses pairs. Il n'y
a donc pas d'&eacute;change entre l'&eacute;tudiant dont le
travail est &eacute;valu&eacute; et ceux qui ont
&eacute;valu&eacute; le travail. Si l'enseignant a choisi de
noter lui-m&ecirc;me le travail (une des options de l'atelier),
il peut faire des commentaires et accorder une note au travail.
Ces commentaires et cette note sont alors visibles par toutes les
parties impliqu&eacute;es dans le processus d'&eacute;valuation.
Le feedback n'a lieu qu'&agrave; sens unique de la part des pairs
pour chaque &eacute;l&eacute;ment de l'&eacute;valuation.</li>

<li>L'&eacute;tudiant qui a fait le travail peut r&eacute;agir
&agrave; l'&eacute;valuation faite par ses pairs. Il peut
&ecirc;tre en accord ou en d&eacute;saccord. S'il est en accord,
le processus d'&eacute;valuation est termin&eacute; pour cet
&eacute;l&eacute;ment de l'&eacute;valuation et elle est
utilis&eacute;e pour le calcul de la note accord&eacute;e par
les pairs. Si au contraire il y a d&eacute;saccord, les
&eacute;tudiants qui ont fait l'&eacute;valuation ont
l'occasion de la r&eacute;viser. Les &eacute;tudiants entrent
alors dans une boucle de r&eacute;visions/d&eacute;saccords
jusqu'&agrave; ce qu'ils parviennent &agrave; un accord ou que la
date d'&eacute;ch&eacute;ance soit atteinte. Une
&eacute;valuation qui est toujours sujette &agrave; discussion
entre les &eacute;tudiants &agrave; la date
d'&eacute;ch&eacute;ance ne sera pas utilis&eacute;e pour le
calcul de la note. Le feedback se fait dans les deux sens entre
les &eacute;tudiants qui &eacute;valuent et l'&eacute;tudiant
dont le travail est &eacute;valu&eacute;.</li> </ol>

<p>L'enseignant peut activer l'option de ne pas afficher les
notes pendant la phase d'&eacute;valuation, lorsqu'il choisit le
deuxi&egrave;me processus (une des options de l'atelier). Pendant
les n&eacute;gociations avec les &eacute;tudiants qui ont
&eacute;valu&eacute; son travail, seuls seront alors visibles
les commentaires de l'&eacute;tudiant dont le travail est
&eacute;valu&eacute;. Lorsqu'il y a accord, la note est alors
affich&eacute;e pour cet &eacute;l&eacute;ment de
l'&eacute;valuation. Cette option est disponible seulement
lorsque l'accord entre les parties est requis.</p>

















