<p align="center"><b>Analyse des &eacute;valuations</b></p>

<p>Cette analyse permet d'examiner les &eacute;valuations faites sur les
exemples, comme sur celles effectu&eacute;es durant la phase
d'&eacute;valuation par les pairs. Elle tente de
s&eacute;lectionner les meilleures parmi les &eacute;valuations
d'&eacute;tudiants et d'enseignants. Ces
&laquo;&nbsp;bonnes&nbsp;&raquo; &eacute;valuations sont alors
utilis&eacute;es dans le calcul de la note finale.</p>

<p>L'analyse est meilleure si les &eacute;valuations de
l'enseignant sont disponibles. Ces &eacute;valuations peuvent
servir de r&eacute;f&eacute;rences par rapport auxquelles celles
des &eacute;tudiants peuvent &ecirc;tre jug&eacute;es.
L'enseignant <b>n'a pas besoin</b> d'&eacute;valuer chaque
exemple et chaque travail, mais pour que l'analyse soit
significative, il est mieux d'avoir de la part de l'enseignant
plus d'&eacute;valuations celles faites par la moyenne des
&eacute;tudiants. Plus il y a d'&eacute;valuations faites par
l'enseignant, plus les r&eacute;sultats de l'analyse seront
fiables.</p>

<p>L'analyse se fait habituellement &agrave; plusieurs reprises,
en changeant &agrave; chaque fois une ou plusieurs options.
L'analyse est contr&ocirc;l&eacute;e par trois options
apparaissant en haut de la page.</p>

<ol>

<li>L'option &laquo;&nbsp;<b>Coefficient des
&eacute;valuations de l'enseignant</b>&nbsp;&raquo; permet de
fixer le poids des &eacute;valuations faites par l'enseignant en
comparaison avec celles des &eacute;tudiants, lors de la phase
d'analyse d'erreurs. Si l'enseignant d&eacute;sire que sa propre
strat&eacute;gie d'&eacute;valuation domine celles des
&eacute;tudiants, alors il devrait &ecirc;tre parmi tous ceux qui
ont donn&eacute; des notes celui ayant l'erreur moyenne la plus
faible dans la &laquo;&nbsp;Table d'erreurs&nbsp;&raquo;. Si
l'enseignant n'est pas en t&ecirc;te de liste, on augmente
prgressivement le coefficient de ses
&eacute;valuations jusqu'&agrave; ce qu'il ait la plus petite
erreur moyenne. En cons&eacute;quence, les
&eacute;valuations de l'enseignant sont dominantes et celles des
&eacute;tudiants qui &eacute;valuent comme lui se retrouvent
aussi dans la partie sup&eacute;rieure de la liste de la Table
d'erreurs. Les &eacute;tudiants situ&eacute;s au bas de la liste
sont ceux qui &eacute;valuent d'une fa&ccedil;on
diff&eacute;rente de celle de l'enseignant (ou de celle des
&eacute;tudiants du haut de la liste).<br />

Plus l'enseignant a effectu&eacute; d'&eacute;valuations,
moins l'on aura besoin d'utiliser cette option pour forcer
l'enseignant &agrave; appara&icirc;tre au haut de la liste. Il
est &agrave; noter que cette option <b>n'applique pas</b> un
coefficient aux &eacute;valuations de l'enseignant lors du calcul
des notes finales. Dans ce calcul, les &eacute;valuations de
l'enseignant ont le m&ecirc;me poids que celles des
&eacute;tudiants. Ainsi par exemple, si un travail
d'&eacute;tudiant est not&eacute; 41% par l'enseignant et 45% et
55% par ses pairs, la note finale de ce travail sera de (41% +
45% + 55%) / 3, c'est-&agrave;-dire 47%.</li>

<li>L'option &laquo;&nbsp;<b>Coefficient de la performance
d'&eacute;valuation</b>&nbsp;&raquo; est utilis&eacute;e dans
le calcul de la note finale. Pour calculer la
&laquo;&nbsp;performance d'&eacute;valuation&nbsp;&raquo; d'un
&eacute;tudiant, une formule simple est utilis&eacute;e&nbsp;:
c'est le rapport entre le nombre des
&laquo;&nbsp;bonnes&nbsp;&raquo; &eacute;valuations d'un
&eacute;tudiant et le nombre maximum de celles qu'il peut
effectuer. Si par exemple la consigne demande aux
&eacute;tudiants d'&eacute;valuer 3 travaux d'exemples et 5
travaux de pairs, et que l'&eacute;tudiant &eacute;value au total
7 travaux et qu'une &eacute;valuation parmi celles-ci est
rejet&eacute;e lors de l'analyse (voir ci-dessous), sa
performance d'&eacute;valuation est alors de (7 - 1)/8,
c'est-&agrave;-dire 75%. La note finale d'un &eacute;tudiant est
une moyenne pond&eacute;r&eacute;e de sa performace
d'&eacute;valuation et de la note de son propre
travail (ou du meilleur, s'il a rendu plusieurs travaux). Le
coefficient de la note du travail est toujours 1. Donc si vous
choisissez de r&eacute;gler cette option sur 0.5, cela signifie
que la performance d'&eacute;valuation aura pour la note finale
la moiti&eacute; de la valeur de la note du travail.</li>

<li>L'option &laquo;&nbsp;<b>Nombre d'&eacute;valuations &agrave;
rejeter</b>&nbsp;&raquo; d&eacute;termine le nombre des
&eacute;valuations &agrave; rejeter lors du calcul des notes
finales. Ce nombre peut &ecirc;tre fix&eacute; de deux
fa&ccedil;ons.

<ul>

<li>Selon la fa&ccedil;on dont la performance
d'&eacute;valuation est calcul&eacute;e et si aucune
&eacute;valuation n'est rejet&eacute;e, chaque &eacute;tudiant
pourrait obtenir la note maximale en &eacute;valuant
tous les travaux qui lui sont soumis. Si l'enseignant
d&eacute;sire avoir une moyenne plus raisonnable, il peut, en
r&eacute;glant par exemple cette option &agrave; 30%, faire en
sorte que la moyenne des performances d'&eacute;valuation soit
d'environ 70% (pour autant bien s&ucirc;r que tous les
&eacute;tudiants aient &eacute;valu&eacute; tous les travaux qui
leur &eacute;taient soumis).</li>

<li>Autrement, le nombre d'&eacute;valuations &agrave; rejeter
peut &ecirc;tre fix&eacute; de telle mani&egrave;re que les
Erreurs moyennes (quatri&egrave;me colonne de la Table d'erreurs)
des &laquo;&nbsp;bonnes&nbsp;&raquo; &eacute;valuations restantes
demeurent en de&ccedil;&agrave; d'une valeur raisonnable. Par
exemple, on pourrait penser que toutes les &eacute;valuations des
&eacute;tudiants devraient se situer (en moyenne) dans un
intervalle de 20%. Dans ce cas, l'analyse est
r&eacute;p&eacute;t&eacute;e en ajustant &agrave; chaque fois le
nombre d'&eacute;valuations &agrave; rejeter, jusqu'&agrave; ce
que les valeurs de cette colonne soient dans cette limite.</li>

</ul>

</ol>

<p>En plus de la Table d'erreur, l'analyse &eacute;num&egrave;re
les notes de toutes les &eacute;valuations et les notes finales
donn&eacute;es aux &eacute;tudiants. Cette table devrait
&ecirc;tre examin&eacute;e pour s'assurer que les
r&eacute;sultats sont raisonnables. En particulier si un grand
nombre d'&eacute;valuations sont rejet&eacute;es, certains
travaux pourraient rest&eacute;s sans &eacute;valuation et la
note finale de l'&eacute;tudiant beaucoup trop basse. L'analyse
affiche le nombre de travaux remis au haut de la page et
&eacute;galement juste avant le &laquo;&nbsp;Tableau des
notes&nbsp;&raquo;. Ces deux nombres devraient &ecirc;tre
&eacute;gaux. S'il y a un ou plusieurs travaux sans
&eacute;valuation et que l'enseignant ne veut pas diminuer le
nombre d'&eacute;valuations &agrave; rejeter, ces travaux doivent
alors &ecirc;tre &eacute;valu&eacute;s par l'enseignant et
l'analyse r&eacute;p&eacute;t&eacute;e. Il est essentiel que tous
les travaux remis soient &eacute;valu&eacute;s au moins une fois
lors de la derni&egrave;re phase de l'analyse,
c'est-&agrave;-dire lorsque les notes finales sont
calcul&eacute;es.</p>

<p>Il existe un &eacute;quilibre entre le nombre
d'&eacute;valuations rejet&eacute;es et les notes finales. Plus
il y a d'&eacute;valuations rejet&eacute;es, et plus les notes
finales risqueront d'&ecirc;tre basses. Cependant, si les
&eacute;valuations m&eacute;diocres <b>ne sont pas</b>
rejet&eacute;es, les &eacute;tudiants pourraient se plaindre de
la qualit&eacute; des &eacute;valuations qui leur sont
donn&eacute;es et qui comptent dans la note finale de leur
travail. Si l'enseignant a fait suffisamment d'&eacute;valuations
de fa&ccedil;on &agrave; dominer l'analyse pas trop
artificiellement, une valeur raisonnable du pourcentage
d'&eacute;valuations &agrave; rejeter se situe entre 15% et
30%.</p>

<p>Il est &agrave; remarquer que cette analyse prend du temps,
car elle comprend un processus it&eacute;ratif. De longs
d&eacute;lais sont donc &agrave; pr&eacute;voir.</p>