<p align="center"><b>Calcul de la note finale</b></p>

<p>Le tableau affich&eacute; sur cette page montre comment sont
calcul&eacute;es les notes finales des &eacute;tudiants. Les
notes finales sont une moyenne pond&eacute;r&eacute;e d'au
maximum de cinq composantes. Les voici&nbsp;:</p>

<ol>

<li>La note accord&eacute;e par l'enseignant pour le travail
remis par l'&eacute;tudiant. Cette note est facultative et sera
employ&eacute;e si l'enseignant &eacute;value r&eacute;ellement
le travail de l'&eacute;tudiant. Si l'&eacute;tudiant remet plus
d'une version du travail, on utilise alors la
&laquo;&nbsp;meilleure&nbsp;&raquo; note pond&eacute;r&eacute;e.
La meilleure note signifie la note pond&eacute;r&eacute;e la plus
haute, qui est une combinaison de la note de l'enseignant et de
la note de ses pairs.</li>

<li>La moyenne des notes accord&eacute;es par ses pairs pour le
travail remis par l'&eacute;tudiant. Si l'&eacute;tudiant remet
plus d'une version du travail, on utilise alors la
&laquo;&nbsp;meilleure&nbsp;&raquo; note pond&eacute;r&eacute;e.
La note des pairs peut optionnellement inclure la note de
l'enseignant. Cette note pourra &ecirc;tre incluse si par exemple
le nombre des notes accord&eacute;es par les pairs est
tr&egrave;s bas ou si l'enseignant met en doute les notes des
pairs &agrave; cause d'un manque de fiabilit&eacute;, de notes
trop basses ou trop &eacute;lev&eacute;es. Lorsque la note de
l'enseignant est incluse, elle a le m&ecirc;me poids que les
notes des &eacute;tudiants dans le calcul de la moyenne. </li>

<li>Le biais que l'&eacute;tudiant introduit par des notes trop
hautes ou trop basses dans l'&eacute;valuation par les pairs. Ce
n'est pas une mesure absolue, car elle est bas&eacute;e sur la
diff&eacute;rence entre la note de l'&eacute;tudiant et les
moyennes des notes des autres &eacute;tudiants pour chacun des
travaux remis qu'ils ont &eacute;valu&eacute;s. En
g&eacute;n&eacute;ral, il ne faut pas donner &agrave; cette
composante un coeffient tr&egrave;s &eacute;lev&eacute;.</li>

<li>La fiabilit&eacute; des &eacute;valuations faites par
l'&eacute;tudiant. C'est une mesure qui indique si les notes
accord&eacute;es par l'&eacute;tudiant correspondent &agrave; la
moyenne des notes accord&eacute;es par les autres
&eacute;tudiants pour les m&ecirc;mes travaux. La mesure
enl&egrave;ve le biais introduit par l'&eacute;tudiant et fait la
moyenne des diff&eacute;rences absolues entre la note
accord&eacute;e par l'&eacute;tudiant et les notes moyennes des
autres &eacute;tudiants. En th&eacute;orie, l'&eacute;tudiant qui
donne une note &eacute;lev&eacute;e pour les bons travaux et une
note faible pour les mauvais travaux sera consid&eacute;r&eacute;
comme fiable. Si l'enseignant estime que les &eacute;tudiants ne
sont pas en g&eacute;n&eacute;ral de bons correcteurs, la note du
professeur devrait &ecirc;tre incluse pour rendre plus
significative la valeur de la fiabilit&eacute;.</li>

<li>La note moyenne donn&eacute;e par l'enseignant pour les
&eacute;valuations de l'&eacute;tudiant. Celles-ci comprennent
les deux &eacute;valuations pr&eacute;liminaires faites par
l'&eacute;tudiant sur les exemples de travaux fournis par
l'enseignant et toutes les notes de l'enseignant sur les
&eacute;valuations effectu&eacute;es pendant la phase
d'&eacute;valuation par les pairs. En g&eacute;n&eacute;ral,
cette composante est plus importante que le biais et la
fiabilit&eacute;. Son coefficient (lorsque la pond&eacute;ration
est disponible) devrait donc &ecirc;tre sup&eacute;rieur.</li>

</ol>

<p>Ces cinq composantes peuvent &ecirc;tre
pond&eacute;r&eacute;es suivant les objectifs de l'enseignant et
en fonction du type de travail. Par exemple, la note de
l'enseignant pourrait avoir un coefficient &eacute;lev&eacute; si
l'&eacute;valuation par les pairs a une importance minime dans le
travail. Ou, si l'enseignant &eacute;value seulement quelques-uns
des travaux remis ou s'il consid&egrave;re comme tr&egrave;s
important le r&ocirc;le de correcteur pour les &eacute;tudiants,
les notes accord&eacute;es par l'enseignant peuvent &ecirc;tre
ignor&eacute;es en leur donnant un poids nul ou tr&egrave;s
faible. Dans ce dernier exemple, c'est la performance
d'&eacute;valuation des &eacute;tudiants qui d&eacute;terminent
leur note finale.</p>

<p>Il est &agrave; noter que cette page est s'utilise dans un
processus it&eacute;ratif et que les notes finales ne sont
normalement pas d&eacute;voil&eacute;es aux &eacute;tudiants
avant la phase finale du travail. Une fois que l'enseignant est
satisfait des notes finales et de leurs pond&eacute;rations,
elles sont alors d&eacute;voil&eacute;es aux &eacute;tudiants.</p>