<p align="center"><b>&Eacute;valuation des travaux remis</b></p>

<p>Pour faciliter l'&eacute;valuation, on utilise des
crit&egrave;res qui couvrent un aspect particulier du travail.
Selon le type de strat&eacute;gie d'&eacute;valuation qui a
&eacute;t&eacute; choisi, vous devriez pour chaque
crit&egrave;re&nbsp;:</p>

<ol> <li>Choisir une note en cliquant sur le bouton
appropri&eacute; ou en s&eacute;lectionnant la note
d&eacute;sir&eacute;e &agrave; partir d'un menu
d&eacute;roulant.</li>

<li>Saisir une explication dans le champ pr&eacute;vu pour le
feedback en expliquant pourquoi vous avez donn&eacute; cette
note. Si vous estimez que la raison est &eacute;vidente,  
laissez le champ vide. Cependant, veuillez noter que l'enseignant
peut examiner votre &eacute;valuation. Il y a plus de chances
qu'il remette en question les notes que vous avez
attribu&eacute;es pour les crit&egrave;res o&ugrave; il n'y a pas
d'explication.</li> </ol>

<p>Dans certains types d'&eacute;valuation, on peut vous demander
de d&eacute;terminer si divers &eacute;l&eacute;ments sont
pr&eacute;sents ou absents du travail. Vous pourrez aussi avoir
&agrave; choisir quel &eacute;nonc&eacute; d&eacute;crit le mieux
la qualit&eacute; du travail, et ce parmi un ensemble
d'&eacute;nonc&eacute;s. Vous pourrez dans ces deux cas ajuster
l&eacute;g&egrave;rement la note pour qu'elle refl&egrave;te le
mieux possible votre &eacute;valuation.</p>

<p>Le dernier champ de cette page vous permet de faire un
commentaire g&eacute;n&eacute;ral sur le travail, afin de
justifier votre &eacute;valuation dans son ensemble. Ce
commentaire doit &ecirc;tre respectueux et constructif. Il sera
vu par celui qui a fait le travail.</p>

<p>Une fois que vous avez remis votre &eacute;valuation, vous
aurez environ 30 minutes pour la modifier si vous changez d'avis
sur vos notes et vos commentaires. Ce d&eacute;lai est
fix&eacute; par l'administrateur du site Moodle. La personne dont
vous avez &eacute;valu&eacute; le travail sera avertie par
courriel que son &eacute;valuation est disponible. Vous ne
pourrez alors que consulter l'&eacute;valuation sans pouvoir la
modifier.</p>