<p align="center"><b>Strat&eacute;gie d'&eacute;valuation</b></p>

<p>Pour faciliter l'&eacute;valuation, tout travail d'un atelier
devrait comprendre un nombre raisonnable
d'<b>&eacute;l&eacute;ments d'&eacute;valuation</b>. Suivant sa
complexit&eacute; et sa longueur, un travail devrait avoir entre
5 et 15 &eacute;l&eacute;ments d'&eacute;valuation, chacun
couvrant un aspect particulier du devoir. Un travail ne
comprenant qu'un &eacute;l&eacute;ment est possible&nbsp;; la
strat&eacute;gie d'&eacute;valuation d'un tel travail est
semblable &agrave; celle d'un devoir Moodle.</p>

<p>Le type des &eacute;l&eacute;ments d'&eacute;valuation
d&eacute;pend de la <b>strat&eacute;gie d'&eacute;valuation
d&eacute;sir&eacute;e</b>&nbsp;:</p>

<ol>

<li><b>&Eacute;valuation formative avec grille d'observation.</b>
Les crit&egrave;res peuvent prendre la forme de descriptions de
certains aspects du travail, de questions, de commentaires. Le
correcteur doit fournir ses observations sur le travail en
fonction de ces crit&egrave;res. Comme avec toutes les
strat&eacute;gies d'&eacute;valuation, un espace est pr&eacute;vu
pour des commentaires d'ordre g&eacute;n&eacute;ral.
L'&eacute;valuation est de type qualitatif et donc le correcteur
n'attribue pas de note. L'enseignant peut toutefois accorder une
note pour l'&eacute;valuation du correcteur qui sera &agrave; la
base de la note qui appara&icirc;tra dans le rapport des
r&eacute;sultats du cours. Aucune note n'appara&icirc;tra si
l'enseignant ne donne pas de note.</li>

<li><b>Crit&egrave;res avec une &eacute;chelle
d'appr&eacute;ciation.</b> C'est la strat&eacute;gie par
d&eacute;faut. L'&eacute;valuation se fait &agrave; partir
d'&eacute;nonc&eacute;s qui d&eacute;crivent&nbsp;des aspects
d&eacute;sir&eacute;s dans le travail. Le correcteur attribue une
note &agrave; partir d'une &eacute;chelle d'appr&eacute;ciation
pour chaque crit&egrave;re. Chaque crit&egrave;re a les trois
caract&eacute;ristiques suivantes&nbsp;:</li>

<ul> <li><i>Une description</i>&nbsp;: la description explique
clairement quel aspect de la t&acirc;che est
&eacute;valu&eacute;. Si l'&eacute;valuation est qualitative, on
doit inclure des d&eacute;tails sur ce qui est
consid&eacute;r&eacute; comme excellent, moyen et faible.</li>

<li><i>Une &eacute;chelle d'appr&eacute;ciation</i>&nbsp;: Moodle
offre plusieurs &eacute;chelles pr&eacute;d&eacute;finies qui
vont du simple Oui/Non &agrave; une &eacute;chelle en
pourcentage, en passant par une &eacute;chelle de plusieurs
points allant d'excellent &agrave; tr&egrave;s faible.
L'enseignant choisit l'&eacute;chelle en fonction du type de
crit&egrave;re. Le nombre de division sur l'&eacute;chelle ne
d&eacute;termine pas l'importance relative du
crit&egrave;re&nbsp;: c'est le coefficient du crit&egrave;re qui
remplit cette fonction.</li>

<li><i>Un coefficient</i> : par d&eacute;faut, tous les
crit&egrave;res ont le m&ecirc;me coefficient dans le calcul de
la note finale du travail. L'enseignant peut toutefois modifier
l'importance relative de chaque crit&egrave;re en accordant un
poids plus grand que 1 &agrave; un crit&egrave;re plus important
et un poids inf&eacute;rieur &agrave; 1 &agrave; un
crit&egrave;re moins important (on peut donner au coefficient une
valeur n&eacute;gative). Le changement des coefficients n'a  pas
d'influence sur la note maximale, qui est fix&eacute;e dans les
r&eacute;glages de l'atelier. </li> </ul>

<li><b>Liste de v&eacute;rification.</b> Des crit&egrave;res
d&eacute;crivent les &eacute;l&eacute;ments qui doivent
&ecirc;tre pr&eacute;sents ou les aspects qui doivent &ecirc;tre
couverts dans le travail. Le correcteur doit d&eacute;terminer si
<i>oui</i> ou <i>non</i> ces &eacute;l&eacute;ments ou ces
aspects se retrouvent dans le travail qui a &eacute;t&eacute;
remis. L'enseignant &eacute;tablit un bar&egrave;me de correction
d&eacute;terminant la note lorsque tous les
&eacute;l&eacute;ments sont pr&eacute;sents, un
&eacute;l&eacute;ment est absent, deux &eacute;l&eacute;ments
sont absents, etc. Il peut aussi modifier le coefficient de
chaque crit&egrave;re pour &eacute;tablir son importance
relative. La somme des erreurs correspond &agrave; la somme
pond&eacute;r&eacute;e des &eacute;l&eacute;ments manquants. Il
n'est pas n&eacute;cessaire que la distribution des coefficients
soit lin&eacute;aire. Par exemple, pour dix &eacute;nonc&eacute;s
les notes pourraient &ecirc;tre : 90%, 70%, 50%, 40%, 30%, 20%,
10%, 0%, 0%, 0%. Le correcteur peut toujours faire une
r&eacute;vision des notes sugg&eacute;r&eacute;es pouvant aller
jusqu'&agrave; 20%.</li>

<li><b>Niveaux d'atteinte global des objectifs.</b> L'enseignant
fournit plusieurs &eacute;nonc&eacute;s qui d&eacute;crivent des
niveaux diff&eacute;rents d'atteinte des objectifs. Le correcteur
doit choisir l'&eacute;nonc&eacute; qui correspond le mieux au
travail qui a &eacute;t&eacute; remis. Les &eacute;nonc&eacute;s
peuvent d&eacute;crire des niveaux successifs ou &ecirc;tre
ind&eacute;pendants les uns des autres. L'enseignant
&eacute;tablit un bar&egrave;me de correction. Le correcteur peut
apporter&nbsp;une r&eacute;vision des notes
sugg&eacute;r&eacute;es pouvant aller jusqu'&agrave; 20%.</li>

<li><b>Grille d'&eacute;valuation crit&eacute;ri&eacute;e.</b>
Cette strat&eacute;gie est semblable &agrave; celle du niveau
d'atteinte global des objectifs &agrave; la diff&eacute;rence
qu'elle comporte plusieurs crit&egrave;res. Le nombre de
crit&egrave;res est d&eacute;termin&eacute; dans les
param&egrave;tres de l'atelier. Pour chaque crit&egrave;re, il
peut y avoir jusqu'&agrave; cinq &eacute;nonc&eacute;s
d&eacute;crivant les niveaux atteints. Ce nombre de niveaux peut
varier d'un crit&egrave;re &agrave; l'autre. Un niveau
laiss&eacute; vide par l'enseignant signale que le niveau
pr&eacute;c&eacute;dent est le dernier. Les crit&egrave;res
peuvent &ecirc;tre pond&eacute;r&eacute;s. Les niveaux sont
marqu&eacute;s par les chiffres 0, 1, 2, 3 et 4. Ces chiffres
correspondent &agrave; la note accord&eacute;e &agrave; chaque
niveau. La note finale pour ce travail est la somme
pond&eacute;r&eacute;e des notes pour chaque crit&egrave;re.</li>

</ol>