<p align="center"><b>Administration d'un atelier</b></p>

<p>Un atelier est plus complexe qu'une activit&eacute; ordinaire.
L'enseignant, apr&egrave;s avoir cr&eacute;&eacute; l'atelier et
choisi ses param&egrave;tres, g&egrave;re son d&eacute;roulement
en activant tour &agrave; tour les diff&eacute;rentes phases de
cet atelier&nbsp;:</p>

<ol>

<li> <p><b>Mise en place du travail</b> La premi&egrave;re phase
est automatiquement activ&eacute;e lors de la cr&eacute;ation de
l'atelier. L'enseignant a d&eacute;cid&eacute; des
param&egrave;tres de l'atelier et il doit maintenant fournir les
crit&egrave;res ou les &eacute;nonc&eacute;s qui serviront
&agrave; l'&eacute;valuation des travaux qui seront remis par les
&eacute;tudiants. L'&eacute;valuation sera moins arbitraire et
plus &eacute;quitable si l'on donne aux &eacute;tudiants un cadre
de r&eacute;f&eacute;rence pour &eacute;valuer les travaux de
leurs pairs. L'enseignant a la responsabilit&eacute; de fournir
la grille et le bar&egrave;me d'&eacute;valuation (pour plus de
d&eacute;tails, voir l'aide sur ce sujet).</p>

<p>L'enseignant pr&eacute;sente ensuite des &eacute;chantillons
de travaux qui vont servir d'exemples et de contre-exemples. Les
&eacute;tudiants devront les &eacute;valuer afin de bien
comprendre les crit&egrave;res d'&eacute;valuation avant de
cr&eacute;er et de remettre leurs propres travaux. Cependant,
avant que les &eacute;tudiants ne puissent remettre leurs
travaux, l'enseignant devrait &eacute;valuer lui-m&ecirc;me ces
exemples. Il aura ainsi &agrave; sa disposition des
sp&eacute;cimens d'&eacute;valuations pour comparaison avec les
&eacute;valuations de ces exemples faites par les
&eacute;tudiants (lors de la phase suivante).</p>

<p>L'enseignant n'est pas oblig&eacute; de fournir des exemples
de travaux. Dans certains cas, cela pourrait m&ecirc;me se
r&eacute;v&eacute;ler inappropri&eacute;.</p> </li>

<li> <p><b>Permettre la remise des travaux</b>
Le travail peut maintenant d&eacute;buter pour les
&eacute;tudiants. Si l'enseignant a fourni des exemples de
travaux, les &eacute;tudiants devront en &eacute;valuer un
certain nombre (selon un des param&egrave;tres de l'atelier). Une
fois qu'un &eacute;tudiant a corrig&eacute; le nombre d'exemples
requis, il peut alors remettre son propre travail. S'il n'y a pas
d'exemples &agrave; corriger, les &eacute;tudiants peuvent tout
de suite remettre leurs travaux.</p>

<p>Il est pr&eacute;f&eacute;rable de laisser l'atelier dans
cette phase pendant un certain temps afin de recueillir un nombre
suffisant de travaux pour en assurer une meilleure distribution
aupr&egrave;s des &eacute;tudiants. Les travaux seront
distribu&eacute;s pour &eacute;valuation dans les deux phases
suivantes. Si le travail passe sans d&eacute;lai dans la phase
&laquo;&nbsp;Permettre la remise des travaux et des
&eacute;valuations&nbsp;&raquo; (cela est
possible), les &eacute;tudiants qui remettent leurs travaux en
premier n'auront que ces premiers travaux &agrave;
&eacute;valuer, tandis que les derniers &eacute;tudiants auront
les leurs &agrave; corriger. La mise en place de ce d&eacute;lai
r&egrave;gle en grande partie ce probl&egrave;me.</p>

<p>Lorsqu'un &eacute;tudiant remet un travail, l'enseignant peut,
s'il le d&eacute;sire, &eacute;valuer ce travail. Cette
&eacute;valuation peut &ecirc;tre incorpor&eacute;e &agrave; la
note finale de l'&eacute;tudiant. Ces &eacute;valuations peuvent
avoir lieu dans les phases de remise et d'&eacute;valuation du
travail. Les &eacute;valuations de l'enseignant faites
apr&egrave;s le calcul des notes finales ne seront
&eacute;videmment pas consid&eacute;r&eacute;es.</p> </li>

<li> <p><b>Permettre la remise des travaux et des &eacute;valuations</b>
Si l'enseignant a inclus
l'&eacute;valuation par les pairs dans l'atelier, les
&eacute;tudiants qui ont remis leur travail ont alors
acc&egrave;s aux travaux de leurs pairs pour qu'ils puissent en
faire l'&eacute;valuation. Les autres &eacute;tudiants peuvent
remettre leur travail, mais <b>sans voir</b> les travaux des
autres. Dans cette phase, les &eacute;tudiants peuvent remettre
plusieurs versions de leur travail, chaque version peut
&ecirc;tre am&eacute;lior&eacute;e, le travail remis de nouveau,
le travail am&eacute;lior&eacute; encore, et ainsi de suite.</p>

<p>L'enseignant peut dissocier l'&eacute;tape de remise du
travail et celle de son &eacute;valuation par les pairs en deux
phases distinctes. La premi&egrave;re phase permet &agrave; tous
les &eacute;tudiants de remettre leur travail avant une date
d'&eacute;ch&eacute;ance. Par la suite, tous les travaux ayant
&eacute;t&eacute; remis, la phase d'&eacute;valuation peut
commencer. Une telle strat&eacute;gie rend inutile la phase 3
&laquo;&nbsp;Permettre la remise des travaux et des
&eacute;valuations&nbsp;&raquo;, puisque l'on passe directement
de la phase &laquo;&nbsp;Permettre la remise des
travaux&nbsp;&raquo; &agrave; la phase &laquo;&nbsp;Permettre les
&eacute;valuations&nbsp;&raquo;.</p>

<p>Par contre si l'enseignant ne d&eacute;sire pas cette
distinction, il utilise alors la phase 3 o&ugrave; les remises et
les &eacute;valuations sont faites simultan&eacute;ment.
L'enseignant devrait ajuster le nombre de travaux &agrave;
corriger &agrave; 1 ou 2 pour permettre une meilleure
distribution des travaux (voir les param&egrave;tres de l'atelier
pour plus de d&eacute;tails). Il est &agrave; noter que cela aura
pour cons&eacute;quence que certains travaux seront
&eacute;valu&eacute;s par des &eacute;tudiants plus souvent que
d'autres.</p>

<p>Lorsque son travail a &eacute;t&eacute; &eacute;valu&eacute;
par un pair, l'&eacute;tudiant peut alors consulter cette
&eacute;valuation. Il a le loisir de la commenter si l'enseignant
a activ&eacute; ce param&egrave;tre de l'atelier. De plus,
l'enseignant peut &eacute;valuer les &eacute;valuations faites
par les &eacute;tudiants et la note ainsi obtenue peut servir au
calcul de la note finale (voir l'aide sur le calcul de la note
finale).</p> </li>

<li> <p><b>Permettre l'&eacute;valuation</b> Dans cette phase,
les &eacute;tudiants peuvent encore &eacute;valuer les travaux de
leurs pairs, mais ne peuvent plus remettre leur travail ou
d'autres versions de leur travail. Les &eacute;tudiants n'ayant
pas encore remis leur travail et qui essaient de le faire verront
un message indiquant que cela n'est plus possible. Par
cons&eacute;quent, <b>ils ne pourront pas &eacute;valuer de
travaux de leurs pairs</b>.</p>

<p>S'il le d&eacute;sire, l'enseignant peut continuer &agrave;
&eacute;valuer les &eacute;valuations des &eacute;tudiants et les
notes serviront aux calculs de la note finale. La plupart du
temps, cela n'est pas n&eacute;cessaire&nbsp;(voir la phase
suivante).</p> </li>

<li> <p><b>Calculer les notes finales</b> Une fois
l'&eacute;ch&eacute;ance d'&eacute;valuation des travaux par les
&eacute;tudiants &eacute;chue, l'enseignant passe &agrave; la
phase suivante. Le travail des &eacute;tudiants dans cet atelier
est alors termin&eacute;. Le professeur peut, lui,
compl&eacute;ter l'&eacute;valuation (1) des &eacute;valuations
de ses exemples par les &eacute;tudiants, (2) des travaux des
&eacute;tudiants et (3) des &eacute;valuations des travaux faites
par leurs pairs. Cette derni&egrave;re &eacute;valuation n'est
pas n&eacute;cessaire si le nombre d'&eacute;valuations par les
pairs est suffisant pour chaque travail, puisque les notes
automatiquement accord&eacute;es (repr&eacute;sentant la
qualit&eacute; des &eacute;valuations) seront
repr&eacute;sentatives.</p>

<p>L'enseignant calcule les notes finales des &eacute;tudiants
lorsque toutes les &eacute;valuations sont termin&eacute;es. Ces
notes se comportent trois composantes&nbsp;: la note
accord&eacute;e par le professeur, la moyenne des notes
accord&eacute;es par les pairs et une note repr&eacute;sentant la
qualit&eacute; des &eacute;valuations faites par
l'&eacute;tudiant. Cette derni&egrave;re note peut inclure une
&laquo;&nbsp;note moyenne&nbsp;&raquo; donn&eacute;e par le
professeur en cons&eacute;quence des commentaires de
l'&eacute;tudiant dans ses &eacute;valuations. L'enseignant fixe
un coefficient &agrave; chaque composante de la note avant que le
calcul soit effectu&eacute;.</p> </li>

<li> <p><b>Afficher les notes finales</b> La phase finale de
l'atelier permet aux &eacute;tudiants de voir leurs notes
finales. Toutefois, le professeur peut revenir &agrave; une phase
pr&eacute;c&eacute;dente pour, par exemple, r&eacute;viser les
coefficients des composantes des notes. Les &eacute;tudiants
verront alors les notes r&eacute;vis&eacute;es.</p>

<p>Les &eacute;tudiants et l'enseignant voient &eacute;galement
un tableau des meilleurs travaux produits dans l'atelier. Ils
sont class&eacute;s selon les notes obtenues, le meilleur travail
&eacute;tant plac&eacute; en premier. Les notes dans ce tableau
se composent des notes accord&eacute;es par l'enseignant et de la
moyenne des notes accord&eacute;es par les pairs. Les notes sont
pond&eacute;r&eacute;es selon les coefficients fix&eacute;s
&agrave; la phase pr&eacute;c&eacute;dente.</p> </li>

</ol>

<p>L'enseignant peut &agrave; tout moment ouvrir la page
<b>d'administration</b> de l'atelier pour y voir l'&eacute;tat
actuel de l'atelier et en suivre ainsi les progr&egrave;s. On y
retrouve&nbsp;:</p>

<ul> <li>la liste des exemples de l'enseignant,</li> <li>la liste
des &eacute;valuations par les &eacute;tudiants</li> <ul> <li>des
exemples de l'enseignant,</li> <li>de leur propre travail et</li>
<li>des travaux de leurs pairs,</li> </ul> <li>la liste des
travaux remis par les &eacute;tudiants.</li> </ul>

&Agrave; partir de cette page, l'enseignant peut &eacute;valuer
et r&eacute;&eacute;valuer les travaux, noter et renoter les
&eacute;valuations, effacer des travaux et des &eacute;valuations.