<p align="center"><b>Nombre d'&eacute;valuations par les pairs</b></p>

<p>Dans un atelier, l'enseignant peut demander &agrave; chaque
&eacute;tudiant d'&eacute;valuer un certain nombre de travaux
d'autres &eacute;tudiants. Dans la phase d'&eacute;valuation par
les pairs et selon la complexit&eacute; et la longueur du
travail, les &eacute;tudiants pourront ainsi corriger de trois
&agrave; huit travaux. Plus le travail est d'envergure, plus ce
nombre devrait &ecirc;tre petit, sans quoi le travail
d'&eacute;valuation devient trop grand pour les &eacute;tudiants.
Cependant, chaque &eacute;tudiant devrait corriger suffisamment
de travaux pour saisir ce qui constitue un bon et un mauvais
travail. Aussi, plus un &eacute;tudiant &eacute;value de travaux,
plus Moodle pourra mesurer sa capacit&eacute; &agrave;
&eacute;valuer correctement des travaux. Cette mesure est
impr&eacute;cise et peu fiable pour un nombre de travaux
&eacute;valu&eacute;s inf&eacute;rieur &agrave; trois ou
quatre.</p>

<p>S'il y a assez de travaux remis (10 ou plus) et que
l'enseignant a corrig&eacute; les travaux AVANT que Moodle ne les
r&eacute;partisse pour &eacute;valuation par les pairs, Moodle
donnera &agrave; chaque &eacute;tudiant au moins un
&laquo;&nbsp;bon&nbsp;&raquo; travail et au moins un travail
&laquo;&nbsp;faible&nbsp;&raquo;. L'enseignant n'est pas
oblig&eacute; d'&eacute;valuer tous les travaux (un
&eacute;chantillon est suffisant). De plus, les
&eacute;valuations de l'enseignant n'ont pas besoin d'&ecirc;tre
compl&egrave;tes, une &eacute;valuation pr&eacute;liminaire est
suffisante. Il est &agrave; noter que les &eacute;valuations
seront visibles pour l'&eacute;tudiant &agrave; la fin de la
phase de remise des travaux, si le param&egrave;tre correspondant
est activ&eacute;.</p>

<p>Le nombre d'&eacute;tudiants peut &ecirc;tre nul. Dans ce cas,
le travail devient soit un travail auto&eacute;valu&eacute;, soit
un travail &eacute;valu&eacute; par l'enseignant, selon
l'&eacute;tat des param&egrave;tres de l'atelier.</p>