Individuella inl&auml;gg kan bed&ouml;mas/v&auml;rderas med hj&auml;lp av en skala och utifr&aring;n teorin om 
<strong>enskilt (rationellt) och socialt (empatiskt) inriktat vetande (kunskap)</strong>.
Denna teori kan hj&auml;lpa Dig att betrakta m&auml;nskliga mellanhavanden p&aring; ett nytt s&auml;tt.
Den beskriver tv&aring; olika s&auml;tt att som vi kan anv&auml;nda f&ouml;r att utv&auml;rdera 
det vi ser eller h&ouml;r. &Auml;ven om var och en av oss kan t&auml;nkas anv&auml;nda 
dessa tv&aring; metoder i olika omfattning i olika sammanhang s&aring; kan det vara tj&auml;nligt
att f&ouml;rest&auml;lla oss tv&aring; personer som exempel, en som framf&ouml;rallt &auml;r en
<strong>enskilt (rationellt) inriktad vetare</strong> (Jonas) och den andra (Anna) som huvudsakligen &auml;r 
en <strong>socialt (empatiskt) inriktad vetare</strong>.

<ul>
  <li>Jonas tycker om att f&ouml;rbli s&aring; 'objektiv' 
  som m&ouml;jligt utan att inbegripa sina k&auml;nslor. N&auml;r han diskuterar med andra
  m&auml;nniskor som kanske har andra &aring;sikter &auml;n honom, s&aring; tycker han om att
  f&ouml;rsvara sina egna id&eacute;er genom att utnyttja logik f&ouml;r att hitta 
  luckor i den andres argumentation.
  Jonas &auml;r en mycket starkt <strong>enskilt (rationellt) inriktad vetare</strong>.
  <br /><br />
  </li>
  <li>
  Anna &auml;r mer k&auml;nslig gentemot andra m&auml;nniskor.
  Hon har utvecklad empatisk f&ouml;rm&aring;ga och hon tenderar att lyssna 
  och st&auml;lla fr&aring;gor tills hon k&auml;nner att hon f&aring;r kontakt
  och kan f&ouml;rst&aring; den andres utg&aring;ngspunkter.
  Hon l&auml;r sig genom att dela de erfarenheter som ledde till den kunskap hon finner 
  hos andra m&auml;nniskor.	N&auml;r hon talar med andra s&aring; undviker hon konfrontation
  och f&ouml;rs&ouml;ker ofta att hj&auml;lpa den andre om hon ser en m&ouml;jlighet att g&ouml;r det,
  genom att anv&auml;nda logiska f&ouml;rslag.
  Anna &auml;r en mycket starkt <strong>socialt (empatiskt) inriktad vetare</strong>.
   <br /><br />
   </li>
</ul>
Lade Du m&auml;rke till den k&ouml;nsm&auml;ssiga skillnaden h&auml;r? En del studier tyder
p&aring; att det statistiskt tycks finnas en tendens till en s&aring;dan skillnad. Enskilda m&auml;nniskor kan
dock befinna sig var som helst p&aring; en skala mellan dessa tv&aring; extremfall.
Om man vill att en samarbetsinriktad och effektiv grupp av l&auml;rande s&aring; vore det b&auml;st om
var och en hade f&ouml;rm&aring;ga att anv&auml;nda b&aring;da formerna av vetande (kunskap).
I en speciell typ av situation som i ett n&auml;tbaserat forum s&aring; kan ett enskilt
inl&auml;gg av en person visa upp endera av dessa kvaliteter, eller t o m b&aring;da.
N&aring;gon som normalt &auml;r v&auml;ldigt socialt (empatiskt) inriktad kan  g&ouml;ra ett
inl&auml;gg som l&aring;ter v&auml;ldigt enskilt (rationellt), och vice versa.
Syftet med att bed&ouml;ma/v&auml;rdera varje inl&auml;gg &auml;r att:
<blockquote>
a) hj&auml;lpa Dig att t&auml;nka p&aring; dessa fr&aring;gor n&auml;r Du l&auml;ser andra inl&auml;gg
<br />
b) ge &aring;terkoppling till varje f&ouml;rfattare ang&aring;ende hur
de uppfattas av andra
</blockquote>
Resultaten anv&auml;nds inte p&aring; n&aring;got s&auml;tt f&ouml;r att bed&ouml;ma/v&auml;rdera/betygss&auml;tta
studenterna/eleverna/deltagarna/de l&auml;rande p&aring; n&aring;got s&auml;tt, de &auml;r enkom till f&ouml;r att
hj&auml;lpa till att f&ouml;rb&auml;ttra kommunikationen och l&auml;randet.
<hr />
Om Du &auml;r intresserad s&aring; f&aring;r Du h&auml;r n&aring;gra referenser till
de f&ouml;rfattare som ursprungligen utvecklade dessa id&eacute;er:
<ul>
  <li>Belenky, M.F., Clinchy, B.M., Goldberger, N.R., &amp; Tarule, J.M. (1986). 
    Women's ways of knowing: the development of self, voice, and mind. New York, 
    NY: Basic Books.</li>
  <li>Clinchy, B.M. (1989a). The development of thoughtfulness in college women: 
    Integrating reason and care. American Behavioural Scientist, 32(6), 647-657.</li>
  <li>Clinchy, B.M. (1989b). On critical thinking &amp; connected knowing. Liberal 
    education, 75(5), 14-19.</li>
  <li>Clinchy, B.M. (1996). Connected and separate knowing; Toward a marriage 
    of two minds. In N.R. Goldberger, Tarule, J.M., Clinchy, B.M. &amp;</li>
  <li>Belenky, M.F. (Eds.), Knowledge, Difference, and Power; Essays inspired 
    by &#8220;Women&#8217;s Ways of Knowing&#8221; (pp. 205-247). New York, NY: 
    Basic Books.</li>
  <li>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., &amp; Mansfield, 
    A. F. (1999). A New Way of Assessing Ways of Knowing: The Attitudes Towards 
    Thinking and Learning Survey (ATTLS). Sex Roles, 40(9/10), 745-766.</li>
  <li>Galotti, K. M., Reimer, R. L., &amp; Drebus, D. W. (2001). Ways of knowing 
    as learning styles: Learning MAGIC with a partner. Sex Roles, 44(7/8), 419-436. 
    <br>
  </li>
</ul>

