
<P ALIGN=CENTER><B>Tipus de recursos</B></P>

<P>Els recursos poden incloure qualsevol contingut en qu&egrave; pogu&eacute;ssiu 
  somiar. Aquests s&oacute;n els diferents tipus que, b&agrave;sicament, especifiquen 
  com s'accedeix al contingut: 
<P><B>Text pla</B>- el tipus m&eacute;s senzill. Nom&eacute;s cal que escriviu 
  o editeu la p&agrave;gina en un formulari que us apareixer&agrave; en la seg&uuml;ent 
  pantalla. Alguns trossos del que escriviu es formataran autom&agrave;ticament 
  de la mateixa manera que passa en un f&ograve;rum. <a href="help.php?file=text.html">Més 
  informació sobre el text autoformatat</a></p>

<P><B>Text HTML</B> - per a usuaris avan&ccedil;ats. No hi ha cap autoformatatge 
  del text sin&oacute; que cal fer-ho manualment usant codi HTML. <a href="help.php?file=html.html">Més 
  informació sobre text HTML</a></p>
<P><B>Refer&egrave;ncia</B> - una refer&egrave;ncia escolar a un diari o llibre. 
<P><B>Arxiu carregat</B> - mostra els arxius que heu carregat al curs. Veieu la 
  secci&oacute; &quot;Arxius&quot;. 
<P><B>Enlla&ccedil; web</B> - una URL de qualsevol p&agrave;gina d'Internet. Quan 
  alg&uacute; clica sobre el recurs &eacute;s dut fora del curs. La p&agrave;gina 
  que heu especificat omplir&agrave; la finestra del navegador o, si aix&iacute; 
  ho especifiqueu, obrir&agrave; una nova finestra. 
<P><B>P&agrave;gina web</B> - una URL d'algun lloc d'Internet. Com el tipus anterior 
  mostrar&agrave; una una p&agrave;gina web. Per&ograve; a difer&egrave;ncia seva 
  la p&agrave;gina es mostrar&agrave; <b>en un marc</b>, com si estigu&eacute;s 
  integrada en el curs.
<P><B>Programari</B> - un programa extern que necessita informaci&oacute; passada 
  des de l'actual curs i usuari de Moodle. Aix&ograve; permet a aplicacions web 
  externes cooperar amb Moodle . <a href="help.php?file=program.html&module=resource">Més 
  informació sobre recursos de programari</a></p>

<p><b>Text Wiki </b> - permet m&eacute;s opcions de formatatge que el text pla 
  per&ograve; sense necessitat de saber codi HTML. S'escriu text pla per&ograve; 
  s'hi poden incloure una gran quantitat de car&agrave;cters de format per crear 
  f&agrave;cilment un format complex. Per exemple, *aix&ograve; ser&agrave; negreta* 
  o b&eacute; /aix&ograve; ser&agrave; emfasitzat/. <a href="help.php?file=wiki.html">Més 
  informació sobre el format Wiki</a></p>
