<p align="center"><b>Par&agrave;metres de la finestra</b></p>

<p>Aquests par&agrave;metres es poden mostrar/ocultar fent clic al bot&oacute; etiquetat Mostra par&agrave;metres o Oculta par&agrave;metres.</p>

<p>Generalment els recursos es visualitzen en una finestra dins d'un marc, amb els controls de navegaci&oacute; de Moodle al marc del capdamunt. Si ho preferiu podeu suprimir aquest marc i fer que el recurs ompli la finestra com una p&agrave;gina web normal.</p>

<p>Tamb&eacute; podeu fer que el recurs aparegui en una nova finestra emergent. Doneu aquests passos:</p>

<ol>
  <li>En la secci&oacute; <b>Finestra:</b>, seleccioneu 'Nova finestra'.</li>
  <li>Desseleccioneu les opcions que no voleu fer servir.<br />

<blockquote>
  <b>Permet redimensionar la finestra</b>
  <p>
  Si manteniu seleccionat aquest element permetreu que els usuaris canvi&iuml;n la mida de la finestra que heu definit. En general &eacute;s aconsellable deixar-lo seleccionat, per&ograve; de vegades el recurs t&eacute; una mida fixa i pot tenir sentit blocar la mida de la finestra.</p>

  <b>Permet el despla&ccedil;ament dins de la finestra</b>
  <p>
  Aquest element permet que els usuaris es desplacin dins de la finestra per veure tot el recurs. Si aquest element es desactiva, els usuaris nom&eacute;s veuran la part que c&agrave;piga dins de les mides de finestra definides i no podran despla&ccedil;ar-se per veure la resta del recurs.</p>

  <b>Mostra la barra d'enlla&ccedil;os del navegador</b>
  <p>Aquest element permet que els usuaris vegin a la finestra la barra d'enlla&ccedil;os/adreces/favorits del seu navegador.</p>

  <b>Mostra la brra d'ubicaci&oacute;</b>
  <p>Voleu que els usuaris vegin l'URL (adre&ccedil;a web) del recurs?  Si &eacute;s aix&iacute;, deixeu activada aquesta opci&oacute;. Si no, s'ocultar&agrave; la ubicaci&oacute; del recurs.</p>

  <b>Mostra la barra de men&uacute;s</b>
  <p>Deixeu aquest element activat per tal que els usuaris tinguin acc&eacute;s la barra de men&uacute;s en aquesta finestra. Generalment aix&ograve; &eacute;s &uacute;til, per&ograve; algunes presentacions gr&agrave;fiques queden millor sense barra de men&uacute;s.</p>

  <b>Mostra la barra d'eines</b>
  <p>Mostrar la barra d'eines far&agrave; m&eacute;s f&agrave;cil la navegaci&oacute; als usuaris gr&agrave;cies als botons Endarrere/Endavant, Inici, i Refresc.</p>

  <b>Mostra la barra d'estat</b>
  <p>Mostrar la barra d'estat del navegador permet accedir a la informaci&oacute; del navegador: p. ex. quina part del recurs s'ha baixat, o informaci&oacute; de seguretat.</p>

</blockquote>

  <li>Determineu la mida de la finestra que voleu obrir. <br />

<blockquote>
  <p>Molta gent segueix utilitzant una resoluci&oacute; mitjana de 800x600. En molts casos ser&agrave; millor que definiu una mida inicial una mica m&eacute;s petita, p. ex. 600 d'al&ccedil;ada i 480 d'ampl&agrave;ria.</p>

  <p>Si deixeu aquests camps en blanc la finestra emergent tindr&agrave; exactament la mateixa mida que la finestra principal de Moodle en la qual far&agrave; clic l'usuari per veure el recurs.</p>

</blockquote>
</li>
</ol>
