<?PHP // $Id$ 
      // admin.php - created with Moodle 1.2 Beta ++ (2004031100)


$string['cachetext'] = 'テキストキャッシュ保存時間';
$string['filteruploadedfiles'] = 'アップロードファイルをフィルタする';
$string['upgradelogs'] = '正常に動作させる為には古いログのアップグレードが必要です。<a href=\"$a\">詳細はこちら</a>';
$string['upgradelogsinfo'] = 'ログの保存方法に変更点があります。全活動ベースのログを閲覧することが出来るようにするには、古いログをアップグレードする必要があります。サイトによってはアップグレード作業に長時間(例 数時間)を要し、規模が大きなサイトではデータベースに負担がかかります。処理を開始した場合は終了するまでそのまま(ブラウザを開いたまま)にしてください。心配する必要はありません - ログが更新された後に、あなたのサイトは正常に動作します。<br/><br/>本当にログをアップグレードしても宜しいですか?';
$string['upgradinglogs'] = 'ログのアップグレード';

?>
