<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
</head>
<body>
<p align="center"><b>Format d'affichage</b></p>
<p>Ce r&eacute;glage d&eacute;termine la fa&ccedil;on dont chaque
entr&eacute;e est affich&eacute;e dans le glossaire. Les formats
propos&eacute;s par d&eacute;faut sont&nbsp;:</p>
<blockquote>
  <dl>
    <dt><b>Simple, style dictionnaire</b>&nbsp;:</dt>
    <dd>Ressemble &agrave; un dictionnaire avec des entr&eacute;es
s&eacute;par&eacute;es. Les auteurs ne sont pas affich&eacute;s. Les
annexes sont porpos&eacute;es comme liens.</dd>
    <dt><b>Continu sans auteur</b>&nbsp;:</dt>
    <dd>Les entr&eacute;es sont affich&eacute;es les unes apr&egrave;s
les autres, sans autre s&eacute;parateur que l'ic&ocirc;ne
d'&eacute;didion.</dd>
    <dt><b>Complet avec auteur</b>&nbsp;:</dt>
    <dd>Un affichage ressemblant &agrave; celui des forums, avec les
information sur l'auteur. Les annexes sont porpos&eacute;es comme liens.</dd>
    <dt><b>Complet avec auteur</b>&nbsp;:</dt>
    <dd>Un affichage ressemblant &agrave; celui des forums, sans les
information sur l'auteur. Les annexes sont propos&eacute;es comme liens.</dd>
    <dt><b>Encyclop&eacute;die</b>&nbsp;:</dt>
    <dd>Identique au format &laquo;&nbsp;Complet avec
auteur&nbsp;&raquo;, mais les images en annexe sont affich&eacute;es en
ligne.</dd>
    <dt><b>FAQ</b>&nbsp;:</dt>
    <dd>Utile pour l'affichage des Foires Aux Questions. Les mots
&laquo;&nbsp;Question&nbsp;&raquo; et
&laquo;&nbsp;R&eacute;ponse&nbsp;&raquo; sont affich&eacute;s
automatiquement au concept, respectivment &agrave; la d&eacute;finition.</dd>
  </dl>
</blockquote>
<hr>
<p>Lea administrateurs du Moodle peuvent cr&eacute;er de nouveaux
formats d'affichage de la fa&ccedil;on suivante&nbsp;:</p>
<ol>
  <li>Regarder dans le dossier mod/glossary/formats. Un fichier
num&eacute;rot&eacute; y existe pour chaque format existant.</li>
  <li>Copier un de ces fichiers et lui donner un autre nombre N (les
nombres 0 et 1 sont r&eacute;serv&eacute;s).</li>
  <li>Modifier ce fichier de fa&ccedil;on &agrave; cr&eacute;er un
nouveau format (une connaissance minimale du langage PHP est requise).</li>
  <li>Ins&eacute;rer pour terminer une nouvelle variable <b>displayformatN</b>
dans chaque fichier de langue utilis&eacute;. Cette variable contiendra
le nom de votre nouveau format, court mais significatif.</li>
</ol>
</body>
</html>
