<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<!-- Traducci&oacute;n al espa&ntilde;ol: Emmanuelle Guti&eacute;rrez y Restrepo (emmanuelle@sidar.org) y Claudio Tavares (claudio@enlaceacademico.com-->
</head>
<body>
<h2>Antecedentes</h2>
<p>Moodle es un proyecto activo y en constante evoluci&oacute;n.</p>
<p>He estado trabajando en &eacute;l, de una manera u otra, durante
bastantes a&ntilde;os. Comenz&oacute; en los a&ntilde;os 90 cuando yo
era Webmaster en <a href="http://www.curtin.edu.au/" target="_top"><span
 lang="en">Curtin University of Technology</span></a> y administrador de
sistemas en su instalaci&oacute;n <abbr title="Web Course Tools"
 lang="en">WebCT</abbr>. Encontr&eacute; muchas cosas frustrantes con
la bestia de <abbr title="Web Course Tools" lang="en">WebCT</abbr> y me
sali&oacute; un sarpullido que ten&iacute;a que rascar continuamente.
Ten&iacute;a que haber una manera mejor (no, no el <em lang="en">Blackboard</em>
:-)</p>
<p>Tambi&eacute;n conozco un mont&oacute;n de gente en colegios e
instituciones peque&ntilde;as (&iexcl;y algunas grandes!) que quieren
hacer un mejor uso de Internet pero que no saben por d&oacute;nde
comenzar en el laberinto de tecnolog&iacute;as y sistemas
pedag&oacute;gicos disponibles. Siempre he tenido la esperanza de que
podr&iacute;a haber una alternativa libre que esas personas
podr&iacute;an usar para trasladar su habilidades educativas al entorno
en l&iacute;nea.</p>
<p>Mi convicci&oacute;n en las posibilidades a&uacute;n por relizar de
la educaci&oacute;n basada en Internet me llevaron a hacer una
maestr&iacute;a y un doctorado en educaci&oacute;n, combinando mi
anterior carrera en Ciencias de la Computaci&oacute;n
(Inform&aacute;tica) con el recientemente adquirido conocimiento sobre
la naturaleza del aprendizaje y la colaboraci&oacute;n.</p>
<p>Desde entonces Moodle ha progresado, a trav&eacute;s de varios
prototipos muy diferentes, hasta el lanzamiento de la versi&oacute;n
1.0, en un mundo en gran parte confiado, el 20 de agosto de 2002, y
desde entonces se han lanzado una serie de mejoras estables.</p>
<p>Yo lo he estado usando en varios cursos y me parece una herramienta
en extremo fiable y &uacute;til para crear cursos en l&iacute;nea de
alta calidad (otras personas tambi&eacute;n lo consideran as&iacute;).
Dado el contexto en el que est&aacute; siendo dise&ntilde;ado, funciona
particularmente bien para instituciones peque&ntilde;as o para clases
peque&ntilde;as o m&aacute;s &iacute;ntimas.</p>
<p>Cuando se compara con las grandes herramientas comerciales tales
como <abbr title="Web Course Tools" lang="en">WebCT</abbr> o <em
 lang="en">Blackboard</em> creo que se sigue quedando corto en algunas
&aacute;reas (tales como el soporte de est&aacute;ndares y la
escalabilidad) pero les aventaja en muchas otras (ver: <a
 href="index.php?file=features.html">Caracter&iacute;sticas</a>).</p>
<p>&nbsp;</p>
<p style="text-align: center; font-size: 0.7em;"><a href="."
 target="_top">Documentaci&oacute;n de Moodle</a></p>
<p style="text-align: center; font-size: 0.7em;">Version: $Id:
background.html,v 1.3 2003/01/28 03:06:52 moodler Exp $</p>
</body>
</html>
