<P ALIGN=CENTER><B>Envoyer une image</B></P>
<P>Il est possible d'envoyer une image &agrave; partir de votre
ordinateur vers ce site (t&eacute;l&eacute;verser). Cette image sera
utilis&eacute;e &agrave; diff&eacute;rents endroits pour vous
repr&eacute;senter : par exemple, cette image appara&icirc;tra pr&egrave;s
de chaque message que vous posterez dans les forums.</P>
<P>Pour cette raison, il est pr&eacute;f&eacute;rable d'utiliser une
photo qui cadre votre visage d'assez pr&egrave;s. L'utilisation d'une
photo personnelle rend plus r&eacute;el les &eacute;changes dans les
forums. Vous pouvez utiliser toutefois toute image qui vous plaira.
Elle doit cependant &ecirc;tre au format JPEG ou PNG (g&eacute;n&eacute;ralement
leur nom se termine par &laquo; .jpg &raquo; ou &laquo; .png &raquo;).
Pour obtenir cette image utilisez l'une de ces m&eacute;thodes : 
</P>
<OL>
	<LI>utiliser un appareil photo num&eacute;rique, dans ce cas vos
	photos devraient se trouver sur votre ordinateur au bon format ; 
	<LI>num&eacute;riser une photo papier avec un num&eacute;riseur,
	choisissez le format JPEG ou PNG ; 
	<LI>si vous avez un don artisitique, vous pouvez dessiner une image
	avec un logiciel de dessin sur ordinateur ; 
	<LI><P>enfin, vous pouvez utiliser une image depuis le Web si elle
	libre de droits  d'auteur . <A HREF="http://images.google.fr/" TARGET="google">http://images.google.fr</A>
	est l'endroit indiqu&eacute; pour trouver des images (une fois que
	vous avez trouv&eacute; l'image qui vous pla&icirc;t, cliquez dessus
	avec le bouton droit de la souris pour choisir l'option &laquo;
	Enregistrer l'image &raquo; dans le menu). 
	</P>
</OL>
<P>Pour envoyer l'image, cliquez sur le bouton &laquo; Parcourir... &raquo;
dans le formulaire et choisissez l'image sur le disque de votre
ordinateur. Puis cliquez sur le button &laquo; Enregistrer mon profil
&raquo; en bas de la page, l'image sera retaill&eacute;e en carr&eacute;e
avec une taille de 100 pixels sur 100.</P>
<P>Lorsque vous reviendrez sur la page de votre profil il se peut que
l'image ne soit pas mise-&agrave;-jour, dans ce cas utilisez le
bouton &laquo; Actualiser &raquo; de votre navigateur.</P>
</BODY>
</HTML>
