<h2>How To Wiki ิวิธีการใช้ Wiki</h2>

<p>
wiki &#3648;&#3611;&#3655;&#3609;&#3585;&#3634;&#3619; &#3651;&#3594;&#3657;&#3614;&#3639;&#3657;&#3609;&#3600;&#3634;&#3609;&#3586;&#3629;&#3591; <a href="http://erfurtwiki.sourceforge.net/?id=ErfurtWiki" target="_blank">ErfurtWiki</a>,&#3595;&#3638;&#3656;&#3591;&#3648;&#3611;&#3655;&#3609;&#3585;&#3634;&#3619;&#3611;&#3619;&#3632;&#3618;&#3640;&#3585;&#3605;&#3660;&#3619;&#3632;&#3610;&#3610;&#3652;&#3630;&#3648;&#3611;&#3629;&#3619;&#3660;&#3648;&#3607;&#3655;&#3585;&#3595;&#3660;&#3586;&#3629;&#3591; <a href="http://c2.com/cgi/wiki?WikiWikiWeb" target="_blank">WikiWikiWeb</a> &#3617;&#3634;&#3651;&#3594;&#3657; &#3594;&#3656;&#3623;&#3618;&#3651;&#3609;&#3585;&#3634;&#3619;&#3619;&#3656;&#3623;&#3617;&#3585;&#3633;&#3609;&#3649;&#3585;&#3657;&#3652;&#3586;&#3649;&#3621;&#3632;&#3626;&#3619;&#3657;&#3634;&#3591;&#3648;&#3623;&#3655;&#3610;&#3585;&#3633;&#3609;&#3652;&#3604;&#3657;&#3591;&#3656;&#3634;&#3618;&#3586;&#3638;&#3657;&#3609;</p>

<p>

<ul>

<li>&#3623;&#3636;&#3608;&#3637;&#3585;&#3634;&#3619;&#3626;&#3619;&#3657;&#3634;&#3591;&#3627;&#3609;&#3657;&#3634;&#3648;&#3623;&#3655;&#3610;  <a href="#createpages">CreatePages</a></li>

<li>&#3588;&#3621;&#3636;&#3658;&#3585;&#3607;&#3637;&#3656;<img src="pix/t/edit.gif"> &#3627;&#3619;&#3639;&#3629;&#3648;&#3621;&#3639;&#3629;&#3585;&#3607;&#3637;&#3656; &quot;&#3649;&#3585;&#3657;&#3652;&#3586;&#3627;&#3609;&#3657;&#3634;&#3609;&#3637;&#3657;&quot; ("Edit this page") &#3592;&#3634;&#3585;&#3648;&#3617;&#3609;&#3641;  drop down &#3648;&#3614;&#3639;&#3656;&#3629;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3648;&#3609;&#3639;&#3657;&#3629;&#3627;&#3634;&#3586;&#3629;&#3591;&#3627;&#3609;&#3657;&#3634;&#3648;&#3614;&#3592;</li>

<li>&#3588;&#3640;&#3603;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3592;&#3633;&#3604;&#3615;&#3629;&#3619;&#3660;&#3649;&#3617;&#3607;&#3627;&#3609;&#3657;&#3634;&#3652;&#3604;&#3657;&#3604;&#3657;&#3623;&#3618; <a href="#wikimarkup">Wiki Markup</a>, &#3627;&#3619;&#3639;&#3629;&#3604;&#3657;&#3623;&#3618;&#3650;&#3588;&#3657;&#3604; HTML (&#3627;&#3634;&#3585;  wiki &#3651;&#3627;&#3657;&#3607;&#3634;&#3591;&#3648;&#3621;&#3639;&#3629;&#3585;&#3651;&#3609;&#3585;&#3634;&#3619;&#3649;&#3585;&#3657;&#3652;&#3586;)</li>

<li>&#3651;&#3594;&#3657;&#3588;&#3635;&#3626;&#3633;&#3656;&#3591; &#3588;&#3657;&#3609;&#3627;&#3634;&#3627;&#3609;&#3657;&#3634; (SearchPages)&#3627;&#3619;&#3639;&#3629;&#3652;&#3611;&#3607;&#3637;&#3656;&#3619;&#3634;&#3618;&#3585;&#3634;&#3619;&#3627;&#3609;&#3657;&#3634;&#3651;&#3627;&#3617;&#3656;&#3621;&#3656;&#3634;&#3626;&#3640;&#3604; ( NewestPages)</li>

<li>&#3609;&#3629;&#3585;&#3592;&#3634;&#3585;&#3609;&#3637;&#3657; &#3618;&#3633;&#3591;&#3617;&#3637;&#3619;&#3634;&#3618;&#3585;&#3634;&#3619;&#3627;&#3609;&#3657;&#3634;&#3607;&#3637;&#3656;&#3648;&#3586;&#3657;&#3634;&#3652;&#3611;&#3651;&#3594;&#3657;&#3610;&#3656;&#3629;&#3618; (MostVisitedPages),&#3627;&#3609;&#3657;&#3634;&#3607;&#3637;&#3656;&#3607;&#3635;&#3585;&#3634;&#3619;&#3649;&#3585;&#3657;&#3652;&#3586;&#3648;&#3611;&#3621;&#3637;&#3656;&#3618;&#3609;&#3649;&#3611;&#3621;&#3591;&#3610;&#3656;&#3629;&#3618; (MostOftenChangedPages) &#3649;&#3621;&#3632;&#3627;&#3609;&#3657;&#3634;&#3607;&#3637;&#3656;&#3648;&#3614;&#3636;&#3656;&#3591;&#3607;&#3635;&#3585;&#3634;&#3619;&#3611;&#3619;&#3633;&#3610;&#3611;&#3619;&#3640;&#3591; (UpdatedPages) &#3629;&#3637;&#3585;&#3604;&#3657;&#3623;&#3618;</li>

</ul>

</p>

<p>

<a name="createpages"></a>&#3585;&#3634;&#3619;&#3626;&#3619;&#3657;&#3634;&#3591;&#3627;&#3609;&#3657;&#3634;&#3651;&#3627;&#3617;&#3656; ( <b>Create Pages</b>):<br />

&#3588;&#3640;&#3603;&#3592;&#3632;&#3626;&#3619;&#3657;&#3634;&#3591;&#3627;&#3609;&#3657;&#3634;&#3651;&#3627;&#3617;&#3656;&#3604;&#3657;&#3623;&#3618;&#3585;&#3634;&#3619;&#3605;&#3633;&#3657;&#3591;&#3594;&#3639;&#3656;&#3629;&#3627;&#3609;&#3657;&#3634;&#3607;&#3637;&#3637;&#3656;&#3585;&#3635;&#3621;&#3633;&#3591;&#3648;&#3611;&#3636;&#3604;&#3651;&#3594;&#3657;&#3629;&#3618;&#3641;&#3656; &#3603; &#3586;&#3603;&#3632;&#3609;&#3633;&#3657;&#3609; &#3627;&#3609;&#3657;&#3634;&#3586;&#3629;&#3591; wiki &#3592;&#3632;&#3606;&#3641;&#3585;&#3605;&#3633;&#3657;&#3591;&#3594;&#3639;&#3656;&#3629;&#3650;&#3604;&#3618;&#3651;&#3594;&#3657; <a href="#camelcase">CamelCas</a> &#3627;&#3619;&#3639;&#3629; &#3604;&#3657;&#3623;&#3618;&#3585;&#3634;&#3619;&#3651;&#3626;&#3656;&#3652;&#3623;&#3657;&#3651;&#3609;&#3623;&#3591;&#3648;&#3621;&#3655;&#3610;&#3649;&#3610;&#3610; brackets ( [] ).</p>

<p>

&#3605;&#3633;&#3623;&#3629;&#3618;&#3656;&#3634;&#3591; :

<ul>

<li>&#3627;&#3609;&#3657;&#3634; Wiki &#3586;&#3629;&#3591;&#3593;&#3633;&#3609;  (Camel Case)</li>

<li>[&#3627;&#3609;&#3657;&#3634; Wiki &#3586;&#3629;&#3591;&#3593;&#3633;&#3609;] (&#3651;&#3626;&#3656;&#3652;&#3623;&#3657;&#3651;&#3609; brackets)</li>

</ul></p>

<p>

&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3607;&#3637;&#3656;&#3605;&#3633;&#3657;&#3591;&#3594;&#3639;&#3656;&#3629;&#3649;&#3610;&#3610;  wiki &#3592;&#3632;&#3617;&#3637;&#3626;&#3633;&#3597;&#3621;&#3633;&#3585;&#3625;&#3603;&#3660; '?'&#3605;&#3634;&#3617;&#3627;&#3621;&#3633;&#3591;&#3594;&#3639;&#3656;&#3629;. &#3651;&#3627;&#3657;&#3638;&#3588;&#3621;&#3636;&#3585;&#3607;&#3637;&#3656;&#3626;&#3633;&#3597;&#3621;&#3633;&#3585;&#3625;&#3603;&#3660;  '?'&#3649;&#3621;&#3657;&#3623;&#3588;&#3640;&#3603;&#3585;&#3655;&#3592;&#3632;&#3648;&#3586;&#3657;&#3634;&#3626;&#3641;&#3656;&#3650;&#3627;&#3617;&#3604;&#3649;&#3585;&#3657;&#3652;&#3586;&#3586;&#3629;&#3591;&#3627;&#3609;&#3657;&#3634;&#3609;&#3633;&#3657;&#3609; &#3592;&#3634;&#3585;&#3609;&#3633;&#3657;&#3609;&#3651;&#3627;&#3657;&#3614;&#3636;&#3617;&#3614;&#3660;&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3586;&#3629;&#3591;&#3588;&#3640;&#3603;&#3621;&#3591;&#3652;&#3611;&#3651;&#3609;&#3627;&#3609;&#3657;&#3634;&#3609;&#3633;&#3657;&#3609;&#3649;&#3621;&#3657;&#3623;&#3592;&#3633;&#3604;&#3648;&#3585;&#3655;&#3610; (save) &#3588;&#3640;&#3603;&#3585;&#3655;&#3592;&#3632;&#3652;&#3604;&#3657;&#3627;&#3609;&#3657;&#3634; wiki &#3651;&#3627;&#3617;&#3656;</p>

<p><a name="wikimarkup"></a><b>Wiki Markup</b>:<br />

&#3651;&#3609;&#3649;&#3605;&#3656;&#3621;&#3632;&#3627;&#3609;&#3657;&#3634;&#3586;&#3629;&#3591;  Wiki &#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3607;&#3635;&#3585;&#3634;&#3619;&#3649;&#3585;&#3657;&#3652;&#3586;&#3652;&#3604;&#3657;&#3650;&#3604;&#3618;&#3591;&#3656;&#3634;&#3618;&#3604;&#3657;&#3623;&#3618;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657;  wiki markup.

</p>

<h4> &#3585;&#3634;&#3619;&#3592;&#3633;&#3604;&#3618;&#3656;&#3629;&#3627;&#3609;&#3657;&#3634; (Paragraphs)</h4>

  <ul type="circle">

  <li> &#3649;&#3618;&#3585;&#3618;&#3656;&#3629;&#3627;&#3609;&#3657;&#3634;&#3616;&#3634;&#3618;&#3651;&#3609;&#3648;&#3609;&#3639;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3586;&#3629;&#3591;&#3627;&#3609;&#3657;&#3634;&#3609;&#3633;&#3657;&#3609; &#3604;&#3657;&#3623;&#3618;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3610;&#3619;&#3619;&#3607;&#3633;&#3604;&#3623;&#3656;&#3634;&#3591; (empty lines)</li>

  <li> &#3651;&#3594;&#3657;&#3648;&#3638;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3648;&#3611;&#3629;&#3619;&#3660;&#3648;&#3595;&#3655;&#3609; 3 &#3605;&#3633;&#3623; ( %%<em></em>%) &#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3585;&#3634;&#3619;&#3649;&#3618;&#3585;&#3610;&#3619;&#3619;&#3607;&#3633;&#3604;&#3609;&#3633;&#3657;&#3609; ( a line break)</li>

  <li>&#3606;&#3657;&#3634;&#3588;&#3640;&#3603;&#3648;&#3588;&#3634;&#3632; space bar &#3627;&#3619;&#3639;&#3629;&#3585;&#3604;&#3649;&#3607;&#3655;&#3610; (tab) &#3610;&#3619;&#3619;&#3607;&#3633;&#3604;&#3609;&#3633;&#3657;&#3609;&#3585;&#3655;&#3592;&#3632;&#3607;&#3635;&#3585;&#3634;&#3619;&#3618;&#3656;&#3629;&#3627;&#3609;&#3657;&#3634;&#3605;&#3634;&#3617;&#3607;&#3637;&#3656;&#3588;&#3640;&#3603;&#3585;&#3604;</li>

  </ul>



<h4> &#3585;&#3634;&#3619;&#3607;&#3635;&#3627;&#3633;&#3623;&#3586;&#3657;&#3629; (Headlines)</h4>

  <ul type="circle">

  <li>&#3651;&#3594;&#3657;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3629;&#3633;&#3624;&#3648;&#3592;&#3619;&#3637;&#3618;&#3660;&#3627;&#3609;&#3638;&#3656;&#3591;&#3605;&#3633;&#3623; (!) &#3651;&#3609;&#3605;&#3629;&#3609;&#3586;&#3638;&#3657;&#3609;&#3605;&#3657;&#3609;&#3610;&#3619;&#3619;&#3607;&#3633;&#3604;&#3609;&#3633;&#3657;&#3609;&#3648;&#3614;&#3639;&#3656;&#3629;&#3585;&#3635;&#3627;&#3609;&#3604;&#3651;&#3627;&#3657;&#3648;&#3611;&#3655;&#3609;&#3627;&#3633;&#3623;&#3586;&#3657;&#3629;&#3648;&#3621;&#3655;&#3585; at the beginning of a line to create a small headline</li>

  <li>&#3651;&#3594;&#3657;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3629;&#3633;&#3624;&#3648;&#3592;&#3619;&#3637;&#3618;&#3660;&#3626;&#3629;&#3591;&#3605;&#3633;&#3623; (!!) &#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3627;&#3633;&#3623;&#3586;&#3657;&#3629;&#3586;&#3609;&#3634;&#3604;&#3585;&#3621;&#3634;&#3591;</li>

  <li>&#3651;&#3594;&#3657;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3629;&#3633;&#3624;&#3648;&#3592;&#3619;&#3637;&#3618;&#3660;&#3626;&#3634;&#3617;&#3605;&#3633;&#3623; (!!!) &#3626;&#3635;&#3627;&#3619;&#3633;&#3610;&#3627;&#3633;&#3623;&#3586;&#3657;&#3629;&#3586;&#3609;&#3634;&#3604;&#3651;&#3627;&#3597;&#3656;</li>

  </ul>



<h4> &#3619;&#3641;&#3611;&#3649;&#3610;&#3610;&#3586;&#3629;&#3591;&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617; (text style)</h4>

  <ul type="circle">

  <li> &#3627;&#3634;&#3585;&#3588;&#3640;&#3603;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;<em>&#3648;&#3609;&#3657;&#3609;&#3618;&#3657;&#3635;&#3648;&#3609;&#3639;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;</em>&#3626;&#3656;&#3623;&#3609;&#3651;&#3604; &#3651;&#3627;&#3657;&#3588;&#3640;&#3603;&#3651;&#3626;&#3656;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3588;&#3635;&#3614;&#3641;&#3604; ( ''..........'') &#3649;&#3621;&#3657;&#3623;&#3648;&#3609;&#3639;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3609;&#3633;&#3657;&#3609;&#3592;&#3634;&#3585;&#3606;&#3641;&#3585;&#3648;&#3609;&#3657;&#3609;&#3618;&#3657;&#3635;&#3604;&#3657;&#3623;&#3618;&#3585;&#3634;&#3619;&#3607;&#3635;&#3648;&#3611;&#3655;&#3609;&#3605;&#3633;&#3623;&#3648;&#3629;&#3637;&#3618;&#3591;</li>

  <li> &#3627;&#3634;&#3585;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3627;&#3657;&#3648;&#3609;&#3639;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3609;&#3633;&#3657;&#3609;&#3648;&#3611;&#3655;&#3609;<strong>&#3605;&#3633;&#3623;&#3627;&#3609;&#3634;</strong> &#3651;&#3627;&#3657;&#3651;&#3594;&#3657;&#3586;&#3637;&#3604;&#3621;&#3656;&#3634;&#3591; (underscores __ )&#3588;&#3619;&#3629;&#3610;&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3609;&#3633;&#3657;&#3609; (&#3627;&#3619;&#3639;&#3629;&#3651;&#3626;&#3656;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3604;&#3629;&#3585;&#3592;&#3633;&#3609;&#3588;&#3621;&#3640;&#3617;&#3652;&#3623;&#3657;*....*)</li>

  <li> &#3627;&#3634;&#3585;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3627;&#3657;&#3648;&#3609;&#3639;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3609;&#3633;&#3657;&#3609;&#3617;&#3637;&#3586;&#3609;&#3634;&#3604;&#3651;&#3627;&#3597;&#3656;&#3651;&#3627;&#3657;&#3651;&#3626;&#3656;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;  ##</li>

  <li> &#3627;&#3634;&#3585;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3627;&#3657;&#3648;&#3609;&#3639;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3609;&#3633;&#3657;&#3609;&#3617;&#3637;&#3586;&#3609;&#3634;&#3604;&#3648;&#3621;&#3655;&#3585;&#3621;&#3591;&#3651;&#3627;&#3657;&#3651;&#3626;&#3656;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618; "ตต"</li>

  <li>&#3627;&#3634;&#3585;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3627;&#3657;&#3617;&#3637;&#3619;&#3641;&#3611;&#3649;&#3610;&#3610;&#3605;&#3633;&#3623;&#3629;&#3633;&#3585;&#3625;&#3619;&#3649;&#3610;&#3610;&#3605;&#3633;&#3623;&#3614;&#3636;&#3617;&#3614;&#3660;&#3604;&#3637;&#3604; (a <tt>typewrite like font)&#3651;&#3627;&#3657;&#3614;&#3636;&#3617;&#3614;&#3660;&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3609;&#3633;&#3657;&#3609;&#3652;&#3623;&#3657;&#3619;&#3632;&#3627;&#3623;&#3656;&#3634;&#3591;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3648;&#3607;&#3656;&#3634;&#3585;&#3633;&#3610;&#3626;&#3629;&#3591;&#3629;&#3633;&#3609;</tt></li>
  </ul>



<h4> &#3585;&#3634;&#3619;&#3607;&#3635;&#3619;&#3634;&#3618;&#3585;&#3634;&#3619; (Lists)</h4>



  <ul type="circle">

  <li> &#3648;&#3619;&#3636;&#3656;&#3617;&#3605;&#3657;&#3609;&#3610;&#3619;&#3619;&#3607;&#3633;&#3604;&#3609;&#3633;&#3657;&#3609;&#3604;&#3657;&#3623;&#3618;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3604;&#3629;&#3585;&#3592;&#3633;&#3609; * &#3648;&#3614;&#3639;&#3656;&#3629;&#3648;&#3619;&#3636;&#3656;&#3617;&#3605;&#3657;&#3609;&#3619;&#3634;&#3618;&#3585;&#3634;&#3619; ( list)</li>

  <li> &#3651;&#3594;&#3657;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618; # &#3627;&#3634;&#3585;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619;&#3651;&#3627;&#3657;&#3648;&#3611;&#3655;&#3609;&#3619;&#3634;&#3618;&#3585;&#3634;&#3619;&#3607;&#3637;&#3656;&#3609;&#3635;&#3627;&#3609;&#3657;&#3634;&#3604;&#3657;&#3623;&#3618;&#3605;&#3633;&#3623;&#3648;&#3621;&#3586;
    <ol>

    <li>&#3588;&#3640;&#3603;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3607;&#3635;&#3619;&#3634;&#3618;&#3585;&#3634;&#3619;&#3618;&#3656;&#3629;&#3618;&#3652;&#3604;&#3657;&#3604;&#3657;&#3623;&#3618;</li>

    <li> &#3649;&#3605;&#3656;&#3621;&#3632;&#3627;&#3633;&#3623;&#3586;&#3657;&#3629;&#3651;&#3609;&#3619;&#3634;&#3618;&#3585;&#3634;&#3619;&#3618;&#3656;&#3629;&#3618;&#3588;&#3623;&#3619;&#3648;&#3619;&#3636;&#3656;&#3617;&#3605;&#3657;&#3609;&#3604;&#3657;&#3623;&#3618;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657; * &#3627;&#3619;&#3639;&#3629; # &#3629;&#3618;&#3656;&#3634;&#3591;&#3651;&#3604;&#3629;&#3618;&#3656;&#3634;&#3591;&#3627;&#3609;&#3638;&#3656;&#3591;&#3651;&#3627;&#3657;&#3648;&#3627;&#3617;&#3639;&#3629;&#3609;&#3585;&#3633;&#3609;&#3607;&#3633;&#3657;&#3591;&#3619;&#3634;&#3618;&#3585;&#3634;&#3619;</li>

    </ol>

  </li>

  </ul>



<h4> &#3585;&#3634;&#3619;&#3607;&#3635;&#3652;&#3630;&#3648;&#3611;&#3629;&#3619;&#3660;&#3621;&#3636;&#3591;&#3588;&#3660; (HyperLinks)</h4>



  <ul type="circle">

  <li> &#3649;&#3588;&#3656;&#3648;&#3614;&#3637;&#3618;&#3591;&#3651;&#3626;&#3656; CamelCase WikiWord &#3651;&#3609;&#3648;&#3609;&#3639;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3607;&#3637;&#3656;&#3588;&#3640;&#3603;&#3614;&#3636;&#3617;&#3614;&#3660; &#3588;&#3640;&#3603;&#3585;&#3655;&#3592;&#3632;&#3652;&#3604;&#3657;  HyperLink</li>

  <li> &#3627;&#3619;&#3639;&#3629; &#3651;&#3626;&#3656;&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3651;&#3609;&#3623;&#3591;&#3648;&#3621;&#3655;&#3585;&#3626;&#3637;&#3656;&#3648;&#3627;&#3621;&#3637;&#3656;&#3618;&#3617; (<b>square brackets</b>) &#3648;&#3614;&#3639;&#3656;&#3629;&#3626;&#3619;&#3657;&#3634;&#3591;&#3652;&#3630;&#3648;&#3611;&#3629;&#3619;&#3660;&#3621;&#3636;&#3591;&#3588;&#3660;</li>

  <li> &#3651;&#3626;&#3656;&#3594;&#3639;&#3656;&#3629;&#3648;&#3623;&#3610;&#3652;&#3595;&#3604;&#3660;&#3651;&#3604;&#3654; &#3607;&#3637;&#3656;&#3618;&#3633;&#3591;&#3651;&#3594;&#3657;&#3585;&#3634;&#3619;&#3652;&#3604;&#3657;&#3610;&#3609;&#3629;&#3636;&#3609;&#3648;&#3605;&#3629;&#3619;&#3660;&#3648;&#3609;&#3655;&#3605;  (&#3586;&#3638;&#3657;&#3609;&#3605;&#3657;&#3609;&#3604;&#3657;&#3623;&#3618; <a href="http://">http://</a>) &#3648;&#3594;&#3656;&#3609;  http://www.example.com/&#3616;&#3634;&#3618;&#3651;&#3609;&#3648;&#3609;&#3639;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617; &#3649;&#3621;&#3657;&#3623;&#3648;&#3609;&#3639;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3609;&#3633;&#3657;&#3609;&#3585;&#3655;&#3592;&#3632;&#3606;&#3641;&#3585;&#3611;&#3619;&#3633;&#3610;&#3648;&#3611;&#3655;&#3652;&#3630;&#3648;&#3611;&#3629;&#3619;&#3660;&#3621;&#3636;&#3591;&#3588;&#3660;&#3607;&#3637;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3588;&#3621;&#3636;&#3585;&#3652;&#3604;&#3657;&#3650;&#3604;&#3618;&#3629;&#3633;&#3605;&#3650;&#3609;&#3617;&#3633;&#3605;&#3636;</li>

  <li> &#3651;&#3626;&#3656;&#3594;&#3639;&#3656;&#3629;&#3648;&#3623;&#3610;&#3652;&#3595;&#3604;&#3660; &#3627;&#3619;&#3639;&#3629; WikiLink &#3616;&#3634;&#3618;&#3651;&#3609;&#3623;&#3591;&#3648;&#3621;&#3655;&#3610;&#3626;&#3637;&#3656;&#3648;&#3627;&#3621;&#3637;&#3656;&#3618;&#3617;  [<a href="http://www.moodle.org/">Moodle</a>] &#3649;&#3621;&#3657;&#3623;&#3605;&#3633;&#3657;&#3591;&#3594;&#3639;&#3656;&#3629;&#3648;&#3623;&#3610;&#3652;&#3595;&#3604;&#3660;&#3609;&#3633;&#3657;&#3609;&#3651;&#3627;&#3657;&#3648;&#3627;&#3617;&#3634;&#3632;&#3626;&#3617;&#3604;&#3657;&#3623;&#3618;&#3585;&#3634;&#3619;&#3651;&#3594;&#3657;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3588;&#3635;&#3614;&#3641;&#3604;&#3588;&#3621;&#3640;&#3617;&#3652;&#3623;&#3657; &#3627;&#3619;&#3639;&#3629; | &#3649;&#3618;&#3585;&#3605;&#3633;&#3623;&#3629;&#3633;&#3585;&#3625;&#3619; 
    <ul type="circle">

    <li> [&#3594;&#3639;&#3656;&#3629;&#3648;&#3619;&#3639;&#3656;&#3629;&#3591; | http://example.com]</li>

    <li> [WikiWord "&#3594;&#3639;&#3656;&#3629;&#3648;&#3619;&#3639;&#3656;&#3629;&#3591;"] or ["&#3594;&#3639;&#3656;&#3629;&#3648;&#3637;&#3636;&#3637;&#3619;&#3639;&#3656;&#3629;&#3591;&#3626;&#3635;&#3627;&#3619;&#3633;&#3610;" WikiLink]    </li>

    </ul>

  </li>

  <li>&#3627;&#3634;&#3585;&#3588;&#3640;&#3603;&#3652;&#3617;&#3656;&#3605;&#3657;&#3629;&#3591;&#3585;&#3634;&#3619; WikiWord &#3627;&#3619;&#3639;&#3629;&#3651;&#3626;&#3656;&#3607;&#3637;&#3656;&#3629;&#3618;&#3641;&#3656;&#3586;&#3629;&#3591;&#3648;&#3623;&#3610;&#3652;&#3595;&#3604;&#3660; &#3627;&#3619;&#3639;&#3629;&#3649;&#3617;&#3657;&#3585;&#3619;&#3632;&#3607;&#3633;&#3656;&#3591;&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3651;&#3609;&#3623;&#3591;&#3648;&#3621;&#3655;&#3610;&#3626;&#3637;&#3656;&#3648;&#3627;&#3621;&#3637;&#3656;&#3618;&#3617;&#3585;&#3621;&#3634;&#3618;&#3648;&#3611;&#3655;&#3609;&#3652;&#3630;&#3648;&#3611;&#3629;&#3619;&#3660;&#3621;&#3636;&#3591;&#3588;&#3660;&#3652;&#3611;&#3618;&#3633;&#3591;&#3648;&#3623;&#3610;&#3652;&#3595;&#3604;&#3660;&#3609;&#3633;&#3657;&#3609;&#3654; &#3651;&#3627;&#3657;&#3588;&#3640;&#3603;&#3651;&#3626;&#3656;&#3657;&#3657;&#3657;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3629;&#3633;&#3624;&#3648;&#3592;&#3619;&#3637;&#3618;&#3660; &#3627;&#3619;&#3639;&#3629;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618; ~&#3652;&#3623;&#3657;&#3604;&#3657;&#3634;&#3609;&#3627;&#3609;&#3657;&#3634; &#3648;&#3594;&#3656;&#3609;
    <ul type="circle">

    <li> !NoHyperLink, ~NoHyperLink</li>

    <li> ![no hyperlink], !!http://nolink.org/    </li>

    </ul>

  </li>

  </ul>



<h4> &#3585;&#3634;&#3619;&#3607;&#3635;&#3605;&#3634;&#3619;&#3634;&#3591;&#3604;&#3657;&#3623;&#3618;  |</h4>

<table cellpadding="2" border="1" cellspacing="0">

<tr>

<td> &#3651;&#3627;&#3657;&#3588;&#3640;&#3603;&#3651;&#3626;&#3656;&#3586;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;</td>

<td> &#3652;&#3623;&#3657;&#3619;&#3632;&#3627;&#3623;&#3656;&#3657;&#3634;&#3591;&#3648;&#3588;&#3619;&#3639;&#3656;&#3629;&#3591;&#3627;&#3617;&#3634;&#3618;&#3586;&#3637;&#3604;&#3585;&#3621;&#3634;&#3591;</td>

<td> (dash)</td>

</tr><tr>

<td> &#3648;&#3614;&#3639;&#3656;&#3629;&#3626;&#3619;&#3657;&#3634;&#3591; </td>

<td> &#3650;&#3588;&#3619;&#3591;&#3626;&#3619;&#3657;&#3634;&#3591;&#3586;&#3629;&#3591;&#3605;&#3634;&#3619;&#3634;&#3591;</td>

</tr><tr>

<td> &#3650;&#3604;&#3618;&#3611;&#3585;&#3605;&#3636; &#3648;&#3610;&#3619;&#3634;&#3648;&#3595;&#3629;&#3619;&#3660;</td>

<td> &#3592;&#3632;&#3607;&#3636;&#3657;&#3591;&#3648;&#3595;&#3621;&#3621;&#3660;&#3607;&#3637;&#3656;&#3623;&#3656;&#3634;&#3591;</td>

<td> &#3648;&#3629;&#3634;&#3652;&#3623;&#3657; </td>

</tr>

</table>





<p>

&#3585;&#3619;&#3640;&#3603;&#3634;&#3648;&#3623;&#3657;&#3609;&#3610;&#3619;&#3619;&#3607;&#3633;&#3604;&#3623;&#3656;&#3634;&#3591;&#3648;&#3611;&#3621;&#3656;&#3634;&#3605;&#3619;&#3591;&#3604;&#3657;&#3634;&#3609;&#3610;&#3609;&#3649;&#3621;&#3632;&#3633;&#3604;&#3657;&#3634;&#3609;&#3621;&#3656;&#3634;&#3591;&#3586;&#3629;&#3591;&#3605;&#3634;&#3619;&#3634;&#3591; &#3648;&#3614;&#3639;&#3656;&#3629;&#3651;&#3627;&#3657;&#3605;&#3634;&#3619;&#3634;&#3591;&#3609;&#3633;&#3657;&#3609; &#3604;&#3641;&#3649;&#3618;&#3585;&#3629;&#3629;&#3585;&#3592;&#3634;&#3585;&#3648;&#3609;&#3639;&#3657;&#3629;&#3588;&#3623;&#3634;&#3617;&#3626;&#3656;&#3623;&#3609;&#3586;&#3657;&#3634;&#3591;&#3648;&#3588;&#3637;&#3618;&#3591;&#3629;&#3618;&#3656;&#3634;&#3591;&#3594;&#3633;&#3637;&#3604;&#3648;&#3592;&#3609;</p>



<h4> การใส่รูป (Pictures)</h4>





  <ul type="circle">

  <li> สำหรับการแทรกรูปนั้น ให้ใส่ชื่อของที่อยู่รูปนั้น ในวงเล็บสี่เหลี่ยม ดังนี้ [http://www.example.com/pics/image.png] 
 </li>
ยังมีอีกทางเลือกหนึ่ง นั่นคือ คุณสามารถใช้ฟังก์ชั่นอัพโหลดภาพได้เลย </li>

  </ul>



ยังคงมีฟังก์ชั่นอื่นๆ ที่สามารถทำได้ด้วย Wiki mark-up. คุณสามารถศึกษาเพิ่มเติมได้ืีที่ <a href="http://erfurtwiki.sourceforge.net" target="_new">Erfurt Wiki Homepage</a>.



<p>

<a name="camelcase"></a><b>Camel Case</b>:<br />

<p>

CamelCase สามารถอธิบายได้ว่า WikiWords มีลักษณะหน้าตาเป็นอย่างไร คำหลายคำที่พิมพ์ติดต่อกันโดยไม่มีการแยกด้วยการเคาะสามารถแยกคำได้ด้วยการใช้ตัวพิมพ์เล็กและตัวพิมพ์ใหญ่ ตัวพิมพ์ใหญ่(uppercase) และตัวพิมพ์เล็ก(lowercase) เปรียบเหมือนกับเป็นหนอกบนหลังอูฐ (the humps of camels.)

แนวทางการลิงค์นี้ ยังเรียกอีกอย่างว่า BumpyText.

ในขณะที่นักเขียนภาษาคอมพิวเตอร์แท้ๆ จะรังเกียจ Wikis อันเนื่องมาจากแนวการตั้งชื่อ แต่ความจริงแล้วเรื่องนี้เป็นเรื่องปกติและเป็นที่รู้จักกันดีในแวดวงคอมพิวเตอร์และนักเขียนโปรแกรมในโลกปัจจุบันเลยทีเดียว
</p>





