<P ALIGN=CENTER><B>Domande</B></P>

<P>Un buon modo di aiutare gli altri a riflettere su un argomento &egrave; di porre loro delle domande in merito. Ricevere una buona domanda pu&ograve; davvero aiutare a raccogliere informazioni, valutare le proprie idee e crearne nuove.</P>

<P>Il metodo di porre domande che sono specificamente intese per aiutare gli altri ad imparare &egrave; detto <I>interrogatorio socratico</I>, in riferimento al Socrate dell'antica Grecia.</P>

<P>Le domande socratiche prevedono un ascolto molto attento dell'altra persona affinch&eacute; ci&ograve; aiuti a giudicare ed a formulare la propria domanda in modo utile, costruttivo e, si spera, non conflittuale.</P>

<P>Ecco alcuni esempi di tali domande:</P>

<h3>Domande di chiarimento</h3>
<ul>
  <li>Cosa intendi quando dici ______?</li>
  <li>Qual &egrave; il tuo punto essenziale?</li>
  <li>Come _____ si rapporta a ______?</li>
  <li>Potresti esprimerlo in maniera diversa?</li>
  <li>Fammi capire se ti comprendo, vuoi dire ______ oppure______?</li>
  <li>Che rapporto ha questo con il nostro problema/discussione/questione?</li>
  <li>Jane, potresti riassumere a parole tue quello che ha detto Richard? ... Richard, &egrave; questo quello che volevi dire?</li>
  <li>Potresti farmi un esempio?</li>
  <li>______ sarebbe un buon esempio di ci&ograve;?</li>
</ul>
<h3>Domande che analizzano le presupposizioni</h3>
<ul>
  <li>Cosa presupponi qui?</li>
  <li>Cosa presuppone Jenny?</li>
  <li>Cosa potremmo presupporre invece?</li>
  <li>Sembri presupporre ______. Ti ho compreso correttamente?</li>
  <li>Tutto il tuo ragionamento dipende dall'idea che_______. Perch&eacute; hai basato il tuo ragionamento su ______ invece che su _______?</li>
  <li>Sembri presupporre _______. Come giustifichi il fatto che lo dai per scontato?</li>
  <li>&Egrave; sempre quella la causa? Perch&eacute; pensi che la presupposizione regga qui?</li>
  <li>Perch&eacute; qualcuno dovrebbe presupporre quello?</li>
</ul>
<h3>Domande che analizzano ragioni e prove</h3>
<ul>
  <li>Potresti spiegarci le tue ragioni?</li>
  <li>Come si applica quello a questo caso?</li>
  <li>Esiste un motivo per dubitare di quella prova?</li>
  <li>Chi si trova nella posizione di sapere se ci&ograve; &egrave; vero?</li>
  <li>Cosa diresti a qualcuno che ha detto che _____?</li>
  <li>Qualcun altro &egrave; in grado di fornire una prova che sostenga quel punto di vista?</li>
  <li>Attraverso quale ragionamento sei giunto a quella conclusione?</li>
  <li>Come potremmo scoprire se ci&ograve; &egrave; vero?</li>
</ul>
<h3>Domande su punti di vista o su prospettive</h3>
<ul>
  <li>Cosa sottintendi con quello?</li>
  <li>Quando dici _____, stai sottintendendo ______?</li>
  <li>Ma,s e avvenisse ci&ograve;, cos'altro accadrebbe come conseguenza? Perch&eacute;?</li>
  <li>Che effetto avrebbe ci&ograve;?</li>
  <li>Ci&ograve; accadrebbe necessariamente o accadrebbe solo possibilmente/probabilmente?</li>
  <li>Qual' &egrave; l'alternativa?</li>
  <li>Se ______ e _____stanno cos“, allora cos'altro potrebbe essere vero?</li>
  <li>Se diciamo che ______ &egrave; etico, che diremo di ______?</li>
</ul>
<h3>Domande che analizzano implicazioni e conseguenze</h3>
<ul>
  <li>Come possiamo scoprire?</li>
  <li>Cosa presuppone questa domanda?</li>
  <li>_____ porrebbe questa domanda in maniera diversa?</li>
  <li>Come si potrebbe sistemare questa questione?</li>
  <li>&Egrave; possibile analizzare dettagliatamente questa domanda?</li>
  <li>&Egrave; chiara questa domanda? La capiamo?</li>
  <li>&Egrave; facile o difficile rispondere a questa domanda? Perch&eacute;?</li>
  <li>Siamo tutti d'accordo che la questione sia questa?</li>
  <li>Per rispondere a questa domanda, a quali altre domande dobbiamo rispondere prima?</li>
  <li>Come porrebbe il problema _____?</li>
  <li>Perch&eacute; questo problema &egrave; importante?</li>
  <li>&Egrave; questa la domanda pi&ugrave; importante o ce n'&egrave; una basilare?</li>
  <li>Riesci a comprendere come questo possa relazionarsi a _________?</li>
</ul>

<HR>
<FONT SIZE=1><I>Domande adattate da Paul, R. (1993). Critical Thinking: How To Prepare Students for a Rapidly Changing World: Foundation for Critical Thinking, Santa Rosa, CA.</I></FONT>

<p align=right><a href="help.php?file=writing.html">Pi&ugrave; informazioni riguardo il modo di scrivere</a></p>
<p align=right><a href="help.php?file=reading.html">Pi&ugrave; informazioni riguardo il modo di leggere</a></p>
