<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
</head>
<body>
<p align="center"><b>Fragetypen</b></p>
<p>Diese Fragentypen werden im Lektionenmodul zur Zeit
unterst&uuml;tzt:
</p>
<ol>
  <li>
    <p><b>Multiplechoice</b>: Multiplechoicefragen bestehen aus Fragen
mit einer Reihe von optionalen Antworten ,von denen jedoch nur eine
richtig ist. Diese Fragenform ist als Standard eingestellt. Die
richtige Antwort f&uuml;hrt zur n&auml;chsten Seite der Lektion, die
falsche Antwort tut dies nicht. Die falsche Antwort wird h&auml;ufig
auch als St&ouml;rung oder Verunsicherung bezeichnet. Sie f&uuml;hrt zu
einem neuen Nachdenkprozess und verbessert die Lernwirkung.</p>
    <p>Jede Antwort kann optional mit einer R&uuml;ckmeldung verbunden
werden, die nach dem Anklicken der Antwort gezeigt wird. Wenn Sie keine
R&uuml;ckmeldung festlegen, wird standardm&auml;ssig der Hinweis "Die
Antwort ist richtig" oder "Die Antwort ist falsch" angezeigt. </p>
    <p>Es ist m&ouml;glich, mehr als eine richtige Antwort bei einer
Multiplechoicefrage zu definieren. Die verschiedenen richtigen
Antworten k&ouml;nnen unterschiedliche R&uuml;ckmeldungen umfassen und
auf unterschiedliche n&auml;chste Seiten verlinken. Verschiedene
richtige Antworten werden bei der Bewertung immer gleich gewertet. Es
ist m&ouml;glich, alle Antworten als richtig zu definieren und von
jeder zu einer anderen Folgeseite zu verlinken.</p>
    <p>Eine weitere Variante ("Multiplechoicefrage mit mehreren
richtigen Antworten") erfordert es, mehrere Antworten als richtig zu
markieren, um eine Frage insgesamt als richtig zu beantworten.
Beispiel: Erst wenn alle drei richtigen Antworten markiert wurden, ist
die Frage richtig beantwortet. Sie k&ouml;nnen bei der Formulierung der
Frage darauf hinweisen, wie viele Antworten richtig sind oder darauf
verzichten. Diese Frageform kann auch nur eine richtige Antwort
umfassen. Die/der Teilnehmer/in kann dann dennoch mehrere Antworten
markieren, richtig ist dann jedoch nur die Markierung der einen
richtigen Antwort.</p>
    <p>Die richtige Antwort f&uuml;hrt zur n&auml;chsten Seite. Eine
falsche Antwort zur Wiederholung der vorherigen Seite oder zu einer
fr&uuml;heren Seite (zur Wiederholung). Wenn mehrere Antworten richtig
sind, sollte jede zur gleichen n&auml;chsten Seite f&uuml;hren. Wenn
dies nicht so eingerichtet wird, erfolgt ein Warnhinweis f&uuml;r
die/den Trainer/in.
R&uuml;ckmeldungen auf die Antworten sollten jeweils bei der ersten
richtigen Antwort oder der ersten falschen Antwort angegeben werden.
R&uuml;ckmeldungen bei weiteren Antworten werden ohne Warnhinweis
ignoriert.</p>
  </li>
  <li>
    <p><b>Kurzantworten:</b> Die Teilnehmer/innen m&uuml;ssen einen
kurzen Text als Antwort eingeben. Diese wird mit einer oder mehreren
Antworten verglichen. F&uuml;r jede Antwort kann eine R&uuml;ckmeldung
festgelegt werden. Wen keine R&uuml;ckmeldung definiert ist, wird ein
Standardtext als Hinweis ausgegeben (s.o.) Wenn der eingebenen
Antworttext nicht zu einer der vorgegebenen richtigen oder falschen
Antworten passt, wird die Antwort als falsch bewertet.</p>
    <p>Standardm&auml;ssig wird die Gro&szlig;- und Kleinschreibung der
Antworten ignoriert. Sie k&ouml;nnen diese jedoch hinzuschalten. </p>
  </li>
  <li><b>Richtig/Falsch:</b>
Als Antwort auf diese Fragen gibt es nur zwei Optionen: Richtig oder
Falsch.
    <p></p>
  </li>
  <li>
    <p><b>Matching:</b> Dies ist eine sehr m&auml;chtige und flexible
Fragenform. Sie besteht aus einer Liste von Namen oder Aussagen, die
mit einer Liste abgeglichen werden mu&szlig;. Zum Beispiel: Ordne die
Hauptst&auml;dte den L&auml;ndern zu mit den Listen Kanada, Japan,
Italien und Tokio, Ottawa, Rom. Eintr&auml;ge in den Listen k&ouml;nnen
sich wiederholen, sie m&uuml;ssen dann jedoch eine identische
Schreibweise aufweisen. Zum Beispiel: Ordnen Sie die Kreaturen den
Gattungen zu: Lerche, Kuh, Ameise, Elefant und Vogel, Tier, Insekt,
Tier.</p>
    <p>Wenn Sie diese Fragen erstellen, wird die erste von Ihnen
erstellte Liste den Fragen, die zweite Liste den Antworten zugeordnet.
Wenn die/der Teilnehmer/in die Fragen richtig beantwortet hat, erfolgt
der Verweis zu der in der ersten Antwort angegeben n&auml;chsten Seite.
R&uuml;ckmeldungen zu den Antworten sind nicht vorgesehen. Die/der
Teilnehmerin erh&auml;lt eine Information &uuml;ber die Zahl der
richtigen Eintr&auml;ge.</p>
    <p>Im Unterschied zu den Multiplechoice-Fragen werden hier die
Fragen in der eingegebenen Reihenfolge angezeigt. So k&ouml;nnen
geordnete Reihen von Fragen eingerichtet werden. Ein Beispiel: "Ordnen
Sie die folgenden Politiker in der Reihenfolge Ihres Geburtsjahres" mit
der Liste "1., 2., 3., 4." und "Sokrates, Caesar, Bismark, Napoleon".
Die
zweite Liste wird vor der Anzeige gemischt. Die erste Liste bleibt in
der Reihenfolge bestehen.</p>
    <p></p>
  </li>
  <li>
    <p><b>Numerische Fragen</b>: Diese Art von Fragen erfordert
Zahlenangaben als Antwort. In der einfachsten Form wird eine zuvor
festgelegt Zahl als Antwort erwartet. Beispiel: "Was ist 2 plus 2?".
Die Antwort 4 f&uuml;hrt zur n&auml;chsten Seite.
Manchmal ist es sinnvoll als richtige Antwort eine Bandbreite von
Zahlen zu akzeptieren und dazu ein Minimum und ein Maximum festzulegen.
Dieses wird durch einen Doppelpunkt markiert (Aufgabe: "Wiviel ist 10
geteilt durch 3?". Richtige Antwortbandbreite ist 3.33:3.34). Alle
dazwischen liegenden Antworten werden als richtig bewertet. Die
Antworten 3.3 oder 3.4 w&auml;ren hingegen falsch.</p>
    <p>Mehr als eine richtige Antwort kann angegeben werden. Dabei
sollten die Antworten in der Reihenfolge von der exakt richtigen zu
einer noch akzeptablen Antwort erstellt werden. Beispiel: Wann wurde
Larkin geboren? Antwort "1922" als exakte Antwort oder "1920:1929",
also in den 20er Jahren, als noch akzeptbale Antwort. Die erste Antwort
sollte als R&uuml;ckmeldung enthalten:"Das ist exakt die richtige
Antwort." Die andere R&uuml;ckmeldug k&ouml;nnte lauten: "Das ist das
richtige Jahrzehnt."</p>
    <p>Auch falsche Antwortvorgaben k&ouml;nnen vordefiniert werden
(z.B. h&auml;ufige Falschberechnungen einer Aufgabe). Sie werde wie die
richtigen Antwortvorgaben definiert. Wenn Sie auf die obige Frage 10
geteilt durch drei als richtige Antwort 3.33:3.34 definieren,
k&ouml;nnen Sie danach 3:4 als falsche Antwort definieren. Alle
Antworten zwischen 3 und 4, die nicht zwischen 3.33 und 3.34 liegen
werden als falsch bewertet. Sie k&ouml;nnen dann z.B. als
R&uuml;ckmeldungen festlegen "Falsche Antwort, aber nicht weit von der
richtigen L&ouml;sung entfernt." </p>
  </li>
</ol>
</body>
</html>
