<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
</head>
<body>
<p align="center"><b>HTML Editor benutzen<br>
</b></p>
<p>Wenn Sie diese Option ausw&auml;hlen, aktivieren Sie damit die
Benutzung des HTML-Editors anstatt der einfachen Text-Eingabefelder.
Durch die Benutzung des HTML Editors haben Sie die M&ouml;glichkeit
sowohl Ihre Texte besser zu formatieren, als auch fortgeschrittene
Mittel wie z.B. das Einf&uuml;gen von Links zu verwenden. <br>
</p>
Klicken Sie in das K&auml;stchen neben <b>HTML Editor benutzen, </b>um
den HTML Editor zu aktivieren. Dies aktiviert den Editor <span
 style="font-style: italic;">nur</span> f&uuml;r die jeweils
gew&auml;hlte Antwort bzw. Reaktion (z.B. Reaktion 1) - <span
 style="font-style: italic;">nicht f&uuml;r alle </span>Antwort- bzw.
Reaktions-Eingabefelder.<br>
Wenn Sie den Editor also f&uuml;r mehrere Eingabefelder ben&ouml;tigen,
so markieren Sie zuerst alle entsprechende <span
 style="font-weight: bold;">HTML Editor benutzen</span> K&auml;stchen
der jeweiligen Reaktionen bzw. Antworten. Dann klicken Sie auf den
Knopf&nbsp; <span style="font-weight: bold;">Seite erneut anzeigen</span>
am Ende der Seite, damit die HTML Editor Eingabefelder nach einem
Neuladen der Seite zur Verf&uuml;gung stehen.<br>
<br>
Bitte seien Sie vorsichtig bei der Benutzung des Editors. In den
meisten F&auml;llen sollte es keine Probleme geben, trotzdem wird <span
 style="font-style: italic;">nicht </span>empfohlen, den Editor
f&uuml;r Antworten von <span style="font-weight: bold;">Kurzantworten</span>
und <span style="font-weight: bold;">Numerischen Fragen</span> zu
nutzen. Der Editor k&ouml;nnte "unsichtbare' HTML-Ausdr&uuml;cke
hinzuf&uuml;gen, die das Ergebnis bei Vergleichen <span
 style="font-style: italic;">verf&auml;lschen</span>. Ein weiterer
Punkt ist, dass die <span style="font-weight: bold;">Beschreibungen</span>
in Verzweigungsseiten f&uuml;r Kn&ouml;pfe benutzt werden - auch hier
k&ouml;nnte es Probleme geben, wenn diese Beschreibungen
HTML-Ausdr&uuml;cke enthalten.<br>
Es gibt <span style="font-style: italic;">keine</span> Probleme mit
Antworten, die nur f&uuml;r die normale Anzeige benutzt werden (wie
z.B. bei Fragen mit Mehrfachauswahl). Auch die Benutzung des Editors
f&uuml;r Reaktions-Felder solcher Fragen sollte keine Probleme
verursachen..
<p>Wenn Sie das Gef&uuml;hl haben, dass es ein Problem mit einem dieser
Eingabefelder gibt, ist es absolut sicher den HTML Editor f&uuml;r
diese Eingabefelder auszuschalten, indem Sie das H&auml;kchen aus dem <span
 style="font-weight: bold;">HTML Editor benutzen</span> K&auml;stchen
einfach wieder entfernen.Wenn Sie dann die Seite neu anzeigen lassen,
sehen Sie wieder die 'Rohfassung' des Textes im Eingabefeld. Sie
k&ouml;nnen dann den Text ganz normal bearbeiten. Mehrfaches An- und
Ausschalten des HTML-Editors f&uuml;r ein oder mehrere Eingabefelder
wird also den Text <span style="font-style: italic;">nicht</span>
ver&auml;ndern.</p>
<p>Der "Zustand" des <span style="font-weight: bold;">HTML Editor
benutzen</span> K&auml;stchens wird immer mit jedem Eingabefeld
gespeichert. Wenn Sie also die Seite sp&auml;ter erneut bearbeiten,
wird der HTML-Editor f&uuml;r die angehakten Eingabefelder automatisch
wieder erscheinen.<br>
<br>
Noch eine letzte Bemerkung: Der Editor ben&ouml;tigt leider viel
Rechenzeit innerhalb des Browsers. Wenn Sie den Editor also f&uuml;r
bestimmte Eingabefelder nicht benutzen, dann ist es schneller und
'schonender' f&uuml;r Ihr System das normale Eingabefeld zu benutzen.</p>
<br>
</body>
</html>
