

<P>Einzelne Pfosten k&ouml;nnen steuerpflichtigsein-MITEINER Skala, DES W&uuml;rfelaufderTheorie unterschiedlichen <STRONG> und verbundenen basiert Wissens </STRONG>.<p>Kann Ihnen Diese Theorie helfen, menschliche Abh&auml;ngigkeiten im einer neuen zu Weise betrachten.  Beschreibtzweiunterschiedliche M&ouml;glichkeiten, W&uuml;rfelwirund&uuml;berw&uuml;rfel Sachen Sie erlernen k&ouml;nnen auswerten, sterben, wir sehen und h&ouml;ren.<p>Diese zwei Methoden Obgleich Jedes von Uns im Den unterschiedlichen Mengen, das ein Den Zeiten verwenden kann unterschiedlichen, kannes-n&uuml;tzlichsein, als Beispiele sichzweiLeute vorzustellen, eine, des unddasandereeinmeistensverbundenesknower des wereinmeistensunterschiedlichesknower (Jim) ist (Mary).</p>
<ul>
  <li>Mag-als ' Zielsetzung ' Jim bleiben, wiem&ouml;glich, und Gef&uuml;hle ohnewadenetzGef&uuml;hle.  Wenn im MITDEN Leuten, W&uuml;rfelunterschiedliche Ideen einerDiskussion haben k&ouml;nnen, er Wadenetz eigenen verteidigen-Mag MITS Logik Ideen, Bohrungen in den Wadenetzen DenIdeen, das, zu Konkurrenten finden.  Er neuen istgegen&uuml;ber kritisch Ideen, hochwertigenQuellen es-seidennsienachgewieseneTatsachen von Den wie Lehrb&uuml;chern, respektierten oderseiner Lehrern eigenen direkten sind Erfahrung.  Isteinsehr- unterschiedliche&szlig;$+2 knower Jim .<br><br>
  </li>
  <li>Empfindlicher Maryistf&uuml;rw&uuml;rfelLeute.  Ist Sie ein empathy erfahren undneigtzu h&ouml;ren zu undFragen stellen, BIS-sieglaubt, da&szlig;sie anschliessen kannund "verstehen Sie Sachen von Ihrem Gesichtspunkt".  Erlernt Sie, indemsieversucht, zu W&uuml;rfelErfahrungen teilen, f&uuml;hrte W&uuml;rfeldaszudasWissen, sie im findet DenLeuten.  DerUnterhaltung Bei MIT anderen, versuchen undwirdh&auml;ufig vermeidetsieKonfrontation, anderen der Person, die zu helfen, sehen wennsieeine Weise kann, also logischen zubottich-MIT Vorschl&auml;gen.  Maryisteinsehr- <STRONG> verbundenesknower </STRONG>.</li></ul>
<p>Beachteten Sie diesen innen Beispielen, da&szlig;dasunterschiedlicheknowerm&auml;nnlichistunddasverbundeneknowerweiblichist?  Einige Studien haben gezeigt, da&szlig;statistischdieserneigt, derfallzusein, gleichwohleinzelne Leute im Spektrum zwischen diesen &uuml;berallsein zwei&Uuml;bermassen k&ouml;nnen.</p>
<p>EinegemeinschaftlicheundwirkungsvolleGruppe Anf&auml;nger F&uuml;r kann es morgens besten sein, wennjeder im der LageWAREN, zu DES Wissens BEIDE Weisen verwenden.</p>
<p>Im einer bestimmten einAuf-LinieForum Situationsm&ouml;genSie, durcheineperson kanneineinzelnerPfosten, die entweder von oder Eigenschaften diesen, sogar von ausstellen beiden.  Jemand, sehr der das im Allgemeinen angeschlossen wird, sehrtrennen-klingen kannAnzeige bekanntgeben undumgekehrt.  Jedes Pfostens, diese verwendet Skala des der, ist DES Veranschlagens Der Zweck:</p>
<blockquote>
  <p>A)  Hilfe, W&uuml;rfel Sie, das ein diese Ausgaben denken, andere Pfosten wennSie lesen<br>B) stellen zujedemAutor R&uuml;ckgespr&auml;ch aufzur Verf&uuml;gung, wiesiedurchandere gesehen werden</p>
</blockquote>
<p>W&uuml;rfel Resultate werden nicht im zu Kursteilnehmereinsch&auml;tzung Richtung im verwendet keinerWeise, sindsiegeradezu helfen, verbessern und Lernen Kommunikation des zu.</p>
<hr>
<p><br>Interessiertsind FallSie, etwasHinweise des sind hier aufPapieren durchw&uuml;rfel Autoren, W&uuml;rfelurspr&uuml;nglich diese Ideen entwickelten:</p>
<ul>
  <li>Belenky, M.F., Clinchy, B.M., Goldberger, N.R. U. Tarule, J.M. (1986).  DerFrauen Weisen DES Wissens:  W&uuml;rfel Entwicklung von Selbst -, und von Verstand von Stimme.  Neues York, NY:  Grundlegende B&uuml;cher.</li><li>Clinchy, B.M. (1989a).  W&uuml;rfel Entwicklung von Thoughtfulness im Den Hochschulfrauen:  Und Obacht Integrierengrund.  Amerikanischer VerhaltenscWissenschaftler, 32(6), 647-657.</li><li>Clinchy, B.M. (1989b).  DaskritischeDenken Auf u.-verbundenes Wissen.  Liberale Ausbildung, 75(5), 14-19.</li><li>Clinchy, B.M. (1996).  Undunterschiedliches Wissen Verbundenes;  Im zueiner Verbindung von Zwei Verstand Richtung.  In N.R. Goldberger, Tarule, J.M., Clinchy, B.M. U.</li><li>Belenky, M.F. (Eds.), Wissen, und Energie Unterschied;  Versuche spornten durch Womensweisen von Knowing (pp. 205-247).  Neues York, NY:  Grundlegende B&uuml;cher.</li><li>Galotti, K.-m., Clinchy, B.-m., Ainsworth, K., Lavin, B.-U. Mansfield, A. F. (1999).  NeueWeise Eine DES Wissens DES Festsetzens von Weisen:  Und Lernen&uuml;bersicht (ATTLS) W&uuml;rfeleinstellungengegen&uuml;berDenken.  GeschlechtcRollen, 40(9/10), 745-766.</li><li>Galotti, K.-m., Reimer, R. L. U. Drebus, D. W. (2001).  Als Lernenarten DES Wissens Weisen:  MITEINEMPARTNER LernencMagie.  GeschlechtcRollen, 44(7/8), 419-436.<br>
  </li>
</ul>

