<?PHP // $Id$ 
      // admin.php - created with Moodle 1.3.1 + (2004052501)


$string['cachetext'] = 'Время существования тектового кэша (Text cache)';
$string['filteruploadedfiles'] = 'Фильтрация загружаемых файлов';
$string['upgradelogs'] = 'Для более полной функциональнойти Вашу старую системную информацию (logs) необходимо обновлять. <a href=\"$a\">Больше информации</a>';
$string['upgradelogsinfo'] = 'Некоторые изменения могут происходить с системной информацией (logs) и ее записью. Для того, чтобы можно было просматривать все старые logs на основе per-activity basis, Ваши старые logs должны периодически обновляться. Это зависит от Вашего сайта  и может занимать много времени (даже несколько часов) и Вы можете даже превышать допустимые пределы в БД для очень больших сайтов. Однако, Вы должны запускать такой процесс  обновления системной информации и не прерывать его (не закрывать окна броузера) до полного окончания. Не волнуйтесь во время такой работы сайт для других пользователей будет работать в обычном режиме. Вы хотите провести обновление системной информации (logs) прямо сейчас? ';
$string['upgradinglogs'] = 'Обновление системной информации (logs) ';

?>
