<?PHP // $Id$ 
      // attendanceblk.php - created with Moodle 1.5.3+ (2005060230)


$string['description'] = 'Вы можете добавить только один данный модуль в каждый курс.<br />
Удаление этого модуля не повлечет удаление данных о посещаемости! Данный модуль может использоваться только совместно с блоком \"Посещаемость\" и предназначен для добавления баллов за посещаемость в общую оценку за курс.';
$string['modulename'] = 'Посещаемость (для Блока)';
$string['modulenameplural'] = 'Посещаемость (для Блока)';
$string['modulenamesimple'] = 'Посещаемость';

?>
