<?PHP // $Id$ 
      // enrol_flatfile.php - created with Moodle 1.4 development (2004070800)


$string['enrolname'] = 'Текстовый файл';
$string['filelockedmail'] = 'Текстовый файл, используемый вами для регистрации не удается удалить с помошью процесса cron. Обычно это означает неверную установку прав доступа. Пожалуйста исправьте права доступа к файлу, так чтобы Moodle мог уго удалить, иначе он может быть обработан более одного раза.';
$string['filelockedmailsubject'] = 'Важная ошибка: Файл регистрации';

?>
