<?PHP // $Id$ 
      // admin.php - created with Moodle 1.3.1 + (2004052501)


$string['cachetext'] = 'Час існавання тэкставага кэшу (Text cache)';
$string['filteruploadedfiles'] = 'Фільтраванне файлаў, якія загружаюцца';
$string['upgradelogs'] = 'Для больш поўнай функцыянальнасці Вашу старую сістэмную інфармацыю (logs) неабходна ўзнаўляць. <a href=\"$a\">Больш інфармацыі</a>';
$string['upgradelogsinfo'] = 'Некаторыя змены могуць адбывацца з сістэмнай інфармацыяй (logs) і яе запісам. Для таго, каб можна было праглядаць усе старыя logs на аснове per-activity basis, Вашы старыя logs павінны перыядычна узнаўляцца. Гэта залежыць ад Вашага сайту і можа займаць шмат часу (нават некалькі гадзінаў) і Вы можаце нават перавышаць дазволеныя межы ў БД для надзвычай вялікіх сайтаў. Аднак, Вы мусіце запускаць такі працэс аднаўлення сістэмнай інфармацыі і не перапыняць яго (не зачыняць вокны браўзера) да поўнага завяршэння. Не хвалюйцеся падчас такой працы сайт для іншых карыстальнікаў будзе працаваць у звычайным рэжыме. Вы жадаеце правесці узнаўленне сістэмнай інфармацыі (logs) неадкладна? ';
$string['upgradinglogs'] = 'Узнаўленне сістэмнай інфармацыі (logs) ';

?>


