<?PHP // $Id$ 
      // admin.php - created with Moodle 1.4.3 + (2004083131)


$string['adminseesallevents'] = 'Адміністратары могуць бачыць усе падзеі';
$string['adminseesownevents'] = 'Адміністратары, якія падобныя на іншых карыстальнікаў';
$string['blockinstances'] = 'Прыклады';
$string['blockmultiple'] = 'Шматлікі';
$string['cachetext'] = 'Час існавання тэкставага кэшу (Text cache)';
$string['calendarsettings'] = 'Каляндар';
$string['change'] = 'змяніць';
$string['confirmation'] = 'Пацвярджэнне';
$string['confirmdeletedst'] = 'Калі выдаліце регіяльныя ўстаноўкі, якія названы <strong>$a</strong>, то яны будуць знішчаны для ўсіх карыстальнікаў, якія іх выкарыстоўваюць. Гэтая аперацыя зменіць настройкі часу без паведамлення. Вы ўпэўнены, што патрэбна прадоўжыць?';
$string['confirmdeletedstdefault'] = '<strong>Регіянальныя ўстаноўкі $a выкарыстоўваюцаа для ўсіх карыстальнікаў сайта!</strong> Выдаленне іх  зменіць настройкі часу для карыстальнікаў без папярэдняга паведамлення. Вы ўпэўнены, што патрэбна прадоўжыць?';
$string['dstisapreference'] = 'Кожны карыстальнік можа абраць, які ';
$string['dstisforcedto'] = 'Прымусова ўсе карыстальнікі выкарыстоўваюць';
$string['dstpresets'] = 'Рэгіянальныя настройкі';
$string['editingdstpreset'] = 'Рэдагаваць рэгіянальныя настройкі';
$string['emptydstlist'] = 'Зараз не вызначаны рэгіянальныя ўстаноўкі. Вы можаце дадаць іх, націснуў на кнопку Дадаць.';
$string['errordstpresetactivateearlier'] = 'Месяц актывацыі павінен быць раней чым месяц дэактывацыі';
$string['errordstpresetnameempty'] = 'Назва рэгіянальных настроек на павінна быць пустой';
$string['errordstpresetnameexists'] = 'Іншыя рэгіянальныя настройкі з такой назвай існуюць';
$string['filteruploadedfiles'] = 'Фільтраванне файлаў, якія загружаюцца';
$string['helpadminseesall'] = 'Дазволіць адміністратарам бачыць усе паведамленні, падзеі каляндара ці толькі іх асабістыя?';
$string['helpcalendarsettings'] = 'Настроіць каляндар і розныя аспекты, звязаныя з рэгіянальнымі настройкамі Moodle';
$string['helpdstforusers'] = 'Кожны карыстальнік можа выкарыстоўваць асабістыя рэгіянальныя настройкі?';
$string['helpmanagedstpresets'] = 'Націсніце на кнопку, каб дадаць, адрэдагаваць і выдаліць рэгіянальныя настройкі, якія магчымы для гэтага сайта.';
$string['helpstartofweek'] = 'З якога дня пачынаецца тыдзень у каляндары?';
$string['helpupcominglookahead'] = 'Як шмат дзён у будучыні павінны адлюстроўвацца ў каляндары для наступаючых падзей па змаўчанню?';
$string['helpupcomingmaxevents'] = 'Як шмат (максімум) наступаючых падзей павінны адлюстроўвацца карыстальнікам па змаўчанню?';
$string['helpweekenddays'] = 'Якія дні тыдня разглядаюцца як яго канец і павінны адлюстроўвацца іншымі колерамі?';
$string['managedstpresets'] = 'Настроіць рэгіянальныя устаноўкі';
$string['nodstpresetsexist'] = 'Падтрымка рэгіянальных настроек заблакіравана для ўсіх карыстальнікаў таму, што яны не пазначаны. Вы можаце іх настроіць, калі выкарыстаеце кнопку ніжэй.';
$string['therewereerrors'] = 'Былі памылкі ў Вашых дадзеных';
$string['upgradelogs'] = 'Для больш поўнай функцыянальнасці Вашу старую сістэмную інфармацыю (logs) неабходна ўзнаўляць. <a href=\"$a\">Больш інфармацыі</a>';
$string['upgradelogsinfo'] = 'Некаторыя змены могуць адбывацца з сістэмнай інфармацыяй (logs) і яе запісам. Для таго, каб можна было праглядаць усе старыя logs на аснове per-activity basis, Вашы старыя logs павінны перыядычна узнаўляцца. Гэта залежыць ад Вашага сайту і можа займаць шмат часу (нават некалькі гадзінаў) і Вы можаце нават перавышаць дазволеныя межы ў БД для надзвычай вялікіх сайтаў. Аднак, Вы мусіце запускаць такі працэс аднаўлення сістэмнай інфармацыі і не перапыняць яго (не зачыняць вокны браўзера) да поўнага завяршэння. Не хвалюйцеся падчас такой працы сайт для іншых карыстальнікаў будзе працаваць у звычайным рэжыме. Вы жадаеце правесці узнаўленне сістэмнай інфармацыі (logs) неадкладна? ';
$string['upgradesure'] = 'Вашыя файлы Moodle былі зменены і Вам неабходна аўтаматычна аднавіць ваш сервер да гэтаў версіі:
<p><b>$a</b></p>
<p>Майце на ўвазе, калі абнавіце версію, то не зможаце вярнуцца да папярэдняга варыянту.</p>
<p>Вы ўпэнены, што хочаце абнавіць гэты сервер да гэтай версіі?</p>';
$string['upgradinglogs'] = 'Узнаўленне сістэмнай інфармацыі (logs) ';

?>
