<?PHP // $Id$ 
      // auth.php - created with Moodle 1.4 development (2004070800)


$string['auth_dbdescription'] = 'Гэты метад выкарыстае знешнюю базу дадзеных для праверкі пары лагін/пароль. Пры стварэнні новага ўліковага запісу, інфармацыя з палёў можа быць скапіяваная ў сістэму.';
$string['auth_dbextrafields'] = 'Гэтыя палі дадатковыя. Вы можаце выбраць папярэдняе запаўненне некаторых палёў карыстальніцкіх дадзеных ад палёў знешняй базы дадзеных, паказанай тут. <p>Не запаўняйце поле, для выкарыстання настроек па-змаўчанні.</p>
<p>У любым выпадку, карыстальнік зможа рэдагаваць усе палі пасля таго, як ён зойдзе ў сістэму.</p>';
$string['auth_dbfieldpass'] = 'Назва поля, якое змяшчае пароль';
$string['auth_dbfielduser'] = 'Назва поля, якое змяшчае лагін';
$string['auth_dbhost'] = 'Камп'ютэр, на якім запушчаны сэрвер базы дадзеных.';
$string['auth_dbname'] = 'Назва базы дадзеных';
$string['auth_dbpass'] = 'Пароль, адпаведны паказанаму лагіну';
$string['auth_dbpasstype'] = 'Вызначае фармат выкарыстаных пароляў.  MD5-кадаванне найбольш прыдатнае пры злучэнні да іншых web-дадаткаў, напрыклад, PostNuke';
$string['auth_dbtable'] = 'Назва табліцы ў базе дадзеных';
$string['auth_dbtitle'] = 'Выкарыстаць знешнюю базу дадзеных';
$string['auth_dbtype'] = 'Тып базы дадзеных (См. <A HREF=../lib/adodb/readme.htm#drivers>Дакументацыю па ADO db</A> для дэталяў)';
$string['auth_dbuser'] = 'Лагін карыстальніка з правамі толькі на чытанне для базы дадзеных';
$string['auth_emaildescription'] = 'Пацвярджэнне з дапамогай электроннай пошты - выкарыстаны па-змаўчанні метад аўтэнтыфікацыі. Пры рэгістрацыі карыстальніка, праз паказаны адрас электроннай пошты адпраўляецца ліст з просьбай пацвердзіць рэгістрацыю. Ліст утрымлівае выпадкова створаную (бяспечную) спасылку на старонку, дзе карыстальнік можа пацвердзіць уліковы запіс. У далейшым пры ўваходзе ў сістэму адбываецца зверка імя карыстальніка і паролю з іх значэннямі ў базе дадзеных.';
$string['auth_emailtitle'] = 'E-mail - аўтэнтыфікацыя';
$string['auth_imapdescription'] = 'Гэты метад выкарыстовае IMAP-сэрвер для праверкі адпаведнасці пары лагін/пароль.';
$string['auth_imaphost'] = 'Адрас  IMAP-сэрвера. Выкарыстайце IP-адрас, не DNS-імя.';
$string['auth_imapport'] = 'Нумар порта для IMAP-сэрвера. Звычайна ў дыяпазоне ад 143 да 993.';
$string['auth_imaptitle'] = 'Выкарыстаць IMAP-сэрвер';
$string['auth_imaptype'] = 'Тып сэрвера IMAP. Сэрверы IMAP могуць мець розныя тыпы ідэнтыфікацыі і пратаколаў.';
$string['auth_ldap_bind_dn'] = 'Калі Вы жадаеце звязанага карыстальніка для пошуку карыстальнікаў, азначце гэта тут. Напрыклад, \'cn=ldapuser,ou=public,o=org\'';
$string['auth_ldap_bind_pw'] = 'Пароль для звязвання карыстальніка.';
$string['auth_ldap_contexts'] = 'Спіс кантэкстаў, дзе размешчаныя карыстальнікі . Аддзеліце розныя кантэксты \';\'. Напрыклад: \'ou=users,o=org; ou=others,o=org\'';
$string['auth_ldap_create_context'] = 'Калі Вы дазволілі стварэнне карыстальнікаў пры пацверджанні праз пошту, вызначыце кантэкст, у які будуць заводзіцца карыстальнікі. Гэты кантэкст павінен адрознівацца ад іншых, каб прадухіліць праблемы з бяспекай. Няма неабходнасці дадаваць, назву кантэксту да ldap_context-пераменным, сістэма будзе шукаць карыстальнікаў ад гэтага кантэксту аўтаматычна.';
$string['auth_ldap_creators'] = 'Спіс групаў, сябрам якіх дазваляецца ствараць новыя курсы. Спіс групаў падзяляйце з дапамогай \';\'. Напрыклад,\'cn=teachers,ou=staff,o=myorg\'';
$string['auth_ldap_host_url'] = 'Азначце LDAP-хост у выглядзе URL\'а, напрыклад \'ldap://ldap.myorg.com/\' або \'ldaps://ldap.myorg.com/\' ';
$string['auth_ldap_memberattribute'] = 'Вызначыце карыстальніцкі атрыбут, які вызначае прыналежнасць карыстальніка да групы. Звычайна \'удзельнік\'';
$string['auth_ldap_search_sub'] = 'Азначце значэнні <> 0 калі Вам падабаецца шукаць карыстальнікаў па субкантэкстам.';
$string['auth_ldap_update_userinfo'] = 'Абнаўляйце карыстальніцкую інфармацыю (Імя, Прозвішча, адрас ..) ад LDAP да сістэмы. Глядзіце /auth/ldap/attr_mappings.php для таго, каб адлюстраваць інфармацыю.';
$string['auth_ldap_user_attribute'] = 'Атрыбут, выкарыстаны для імя/пошук. Звычайна, \'cn\'.';
$string['auth_ldap_version'] = 'Версія LDAP пратаколу, якую выкарыстае Вашы сэрвер.';
$string['auth_ldapdescription'] = 'Гэты метад забяспечвае аўтэнтыфікацыю з дапамогай LDAP-сэрвера. Калі дадзены лагін і пароль маюць моц, ствараецца новы карыстальніцкі ўліковы запіс у базе дадзеных сістэмы. Гэты модуль можа чытаць палі ад LDAP-сэрвера і запаўняць неабходныя палі ў сістэме. У далейшым правяраюцца толькі лагін і пароль';
$string['auth_ldapextrafields'] = 'Гэтыя палі дадатковыя. Вы можаце выбіраць папярэдняе запаўненне некаторых палёў карыстальніцкіх дадзеных ад палёў LDAP, паказанага тут. <p>Не запаўняйце гэтае поле, для таго, каб не пераносіць дадзеныя з LDAP.</p><p>У любым выпадку, карыстальнік зможа рэдагаваць усе палі пасля таго, як ён зойдзе ў сістэму.</p>';
$string['auth_ldaptitle'] = 'Выкарыстаць LDAP-сэрвер';
$string['auth_manualdescription'] = 'Гэты метад выдаляе любы шлях для карыстальнікаў, для стварэння ўласных уліковых запісаў. Усе ўліковыя запісы павінны быць уручную створаныя карыстальнікам адміністрацыі.';
$string['auth_manualtitle'] = 'Толькі ў ручную заведзеныя ўліковыя запісы.';
$string['auth_multiplehosts'] = 'У выпадку некалькіх хастоў яны павінны быць паказаныя наступным чынам: host1.com;host2.com;host3.com
';
$string['auth_nntpdescription'] = 'Гэты метад выкарыстоўвае NNTP-сэрвер для вызначэння адпаведнасці лагіна і пароля.';
$string['auth_nntphost'] = 'Адрас NNTP-сэрвера. Выкарыстайце IP-адрас, не DNS-імя.';
$string['auth_nntpport'] = 'Нумар порту сэрвера (звычайна, 119)';
$string['auth_nntptitle'] = 'Выкарыстаць NNTP-сэрвер';
$string['auth_nonedescription'] = 'Карыстальнікі могуць рэгістравацца і ствараць уліковыя запісы неадкладна, без ідэнтыфікацыі са знешняга сэрвера і пацвярджэнняў праз электронную пошту. Будзьце ўважлівым выкарыстоўваючы гэтую опцыю - падумайце аб абароне і праблемах адміністравання, якія могуць паўстаць.';
$string['auth_nonetitle'] = 'Не выкарыстоўваць аўтэнтыфікацыю';
$string['auth_pop3description'] = 'Гэты метад выкарыстоўвае POP3-сэрвер для вызначэння адпаведнасці і правільнасці пары лагін/пароль.';
$string['auth_pop3host'] = 'Адрас POP3-сэрвера. Выкарыстайце IP-адрас, не DNS-імя.';
$string['auth_pop3port'] = 'Нумар порту сэрвера (звычайна, 110)';
$string['auth_pop3title'] = 'Выкарыстаць POP3-сэрвер';
$string['auth_pop3type'] = 'Тып сэрверу. Калі Ваш сэрвер выкарыстае абарону заснаваную на сертыфікатах, выкарыстайце pop3cert.';
$string['auth_user_create'] = 'Дазволіць стварэнне карыстальнікаў';
$string['auth_user_creation'] = 'Новыя (ананімныя) карыстальнікі могуць ствараць уліковыя запісы на знешняй крыніцы аўтэнтыфікацыі і пацвярджаць праз электронную пошту. Калі Вы дазволіце гэта, не забудзьце таксама сканфігураваць вызначаныя модулем опцыі для стварэння карыстальніка.';
$string['auth_usernameexists'] = 'Выбраны лагін ужо існуе. Выберыце іншы.';
$string['authenticationoptions'] = 'Настройка аўтэнтыфікацыі';
$string['authinstructions'] = 'Тут Вы можаце напісаць інструкцыі для Вашых карыстальнікаў, для таго, каб яны ведалі, які лагін і пароль яны павінны выкарыстаць. Тэкст, які Вы ўводзіце, тут - з'явіцца на старонцы ўваходу ў сістэму. Калі Вы пакінеце поле пустым, ніякіх інструкцый друкавацца не будзе.';
$string['changepassword'] = 'Змяніць URL з паролем';
$string['changepasswordhelp'] = 'Тут Вы можаце вызначыць спосаб, якім карыстальнікі могуць вярнуць або змяніць іх лагін/пароль, калі яны забылі яго. Карыстальнікі ўбачаць кнопку на старонцы ўваходу ў сістэму і іх карыстальніцкай старонцы. Калі Вы не запоўніце поле, кнопка выводзіцца не будзе.';
$string['chooseauthmethod'] = 'Выберыце метад аўтэнтыфікацыі: ';
$string['guestloginbutton'] = 'Кнопка гасцявога ўваходу';
$string['instructions'] = 'Інструкцыі';
$string['md5'] = 'MD5-шыфраванне';
$string['plaintext'] = 'Тэкст';
$string['showguestlogin'] = 'Вы можаце выбраць: паказваць або не кнопку гасцявога доступу ў сістэму.';

?>