<?PHP // $Id$ 
      // enrol_paypal.php - created with Moodle 1.4.3 + (2004083131)


$string['business'] = 'Электронны адрас вашага ўліковага запісу PayPal';
$string['description'] = 'Модуль PayPal дазваляе Вам усталяваць платныя курсы. Калі кошт для любога курса - нуль, то студэнты не будуць запытвацца аб аплаце. Велічыню аплаты, якую Вы пазначыце як велічыню па змаўчанню для ўсяго сайта, будзе прымяняцца ў цэлым на ўсім сайце. Калі ў настройках курса для пэўнага курса, Вы вызначыце іншае значэнне, то яна будзе выкарыстоўвацца толькі ў межах дадзенага курса.';
$string['enrolname'] = 'Paypal';
$string['sendpaymentbutton'] = 'Аплаціць з дапамогай Paypal';

?>
