<?PHP // $Id$ 
      // enrol_flatfile.php - created with Moodle 1.4 development (2004080300)


$string['description'] = 'Дадзеным метадам правяраецца і апрацоўваецца тэкставы файл адмысловага фармату шляхам, паказаным Вамі. Файл можа выглядаць прыкладна так:
<pre>
add, student, 5, CF101
add, teacher, 6, CF101
add, teacheredit, 7, CF101
del, student, 8, CF101
del, student, 17, CF101
add, student, 21, CF101, 1091115000, 1091215000
</pre>';
$string['enrolname'] = 'Тэкставы файл';
$string['filelockedmail'] = 'Тэкставы файл, выкарыстаны Вамі для рэгістрацыі не атрымліваецца выдаліць з дапамогай працэсу cron. Звычайна гэта азначае няправільную устаноўку права доступу. Калі ласка, выправіце правы доступу да файла так, каб Moodle мог яго выдаліць, іначай ён можа быць апрацаваны больш аднога разу.';
$string['filelockedmailsubject'] = 'Важная памылка: Файл рэгістрацыі';
$string['location'] = 'Шлях да файла';
$string['mailadmin'] = 'Паведаміць адміністратару поштай';
$string['mailusers'] = 'Паведаміць карыстальніку поштай';

?>