<?PHP // $Id$ 
      // enrol_database.php - created with Moodle 1.4.3 + (2004083131)


$string['dbhost'] = 'Імя хаста сэрвера базы дадзеных';
$string['dbname'] = 'База дадзеных, якая выкарыстоўваецца';
$string['dbpass'] = 'Пароль для доступу да сэрвера';
$string['dbtable'] = 'Табліца базы дадзеных';
$string['dbtype'] = 'Тып сэрвера базы дадзеных';
$string['dbuser'] = 'Імя карыстальніка для доступу да сэрвера';
$string['description'] = 'Вы можаце выкарыстаць знешнюю базу дадзеных для кантролю за рэгістрацыяй. Дазваляецца каб знешняя база дадзеных утрымлівала полем з нумарам курса і поле з нумарам карыстальніка. Параўноўваюцца з палямі, якія вы выбралі ў табліцах для курсаў і карыстальнікаў .';
$string['enrolname'] = 'Знешняя база дадзеных';
$string['localcoursefield'] = 'Назва поля ў табліцы для курсаў, якую Вы выкарыстоўваеце, будзе параўновацца з запісам ў знешняй базе дадзеных';
$string['localuserfield'] = 'Назва поля ў табліцы для карыстальнікаў, якую Вы выкарыстоўваеце, будзе параўновацца з запісам ў знешняй базе дадзеных';
$string['remotecoursefield'] = 'Поле знешняй БД у якім знаходзіцца course ID';
$string['remoteuserfield'] = ' Поле знешняй БД у якім знаходзіцца user ID';

?>
