<?PHP // $Id$ 
      // enrol_internal.php - created with Moodle 1.4.3 + (2004083131)


$string['description'] = 'Гэта форма для рэгістрацыі па змаўчанню. Існуе два асноўных спосаба каб студэнты зарэгістраваліся ў пэўным курсе.
<ul>
<li>Выкладчыка ці адміністратар могуць уручную дадаць студэнтаў у курс праз меню кіравання курсам.</li>
<li>Для курса можа быць пазначаны пароль, які больш вядомы як \"кодавае слова\". Любы, хто яго ведае, можа дадаць сябе ў склад удзельніказ курса.</li>
</ul>';
$string['enrolname'] = 'Унутраная рэгістрацыя на курсе';

?>
