<?PHP // $Id$ 
      // error.php - created with Moodle 1.4.3 + (2004083131)


$string['confirmsesskeybad'] = 'Прабачце, але код Вашай сесіі не можа быць падцверджаны. Гэтая асаблівасць бяспекі папярэджвае выпадковае альбо зламыснае выкананне важных функцый ад Вашага імя. Калі ласка, падумайце, перад тым як выканаць гэтую функцыю.';
$string['coursegroupunknown'] = 'Курс, адпаведнай групе $a не вызначаны';
$string['erroronline'] = 'Памылка ў радку $a';
$string['fieldrequired'] = '\"$a\" неабходнае поле';
$string['filenotfound'] = 'Прабачце, файл, які Вы шукаеце не можа быць знойдзены';
$string['groupalready'] = 'Карыстальнік ужо належыць да групы $a';
$string['groupunknown'] = 'Група $a не звязаная з выбраным курсам';
$string['invalidfieldname'] = '\"$a\" няслушнае імя поля';
$string['missingfield'] = 'Поле ';
$string['modulerequirementsnotmet'] = 'Модуль \"$a->modulename\" ($a->moduleversion) не можа быць усталяваны. Ён патрабуе навейшай версіі сістэмы (зараз Вы выкарыстоўваеце $a->currentmoodle, а Вам неабходна  $a->requiremoodle).';
$string['notavailable'] = 'Зараз гэта не даступна.';
$string['restricteduser'] = 'Прабачце, але Ваш рэгістрацыйны запіс \"$a\" не дазваляе Вам рабіць гэта.';
$string['sessionipnomatch'] = 'Прабачце, але Ваш IP-адрас змяніўся пасля Вашага першага ўваходу. Гэтая асаблівасць бяспекі папярэджвае ўваход ад Вашага імя іншых карыстальнікаў на сайт. Звычайныя карыстальнікі не атрымліваюць гэтае паведамленне. Калі ласка звярніцеся да адміністратора сайта за дапамогай.';
$string['unknowncourse'] = 'Невядомая назва курсу ';
$string['usernotaddederror'] = 'Карыстальнік ';
$string['usernotaddedregistered'] = 'Карыстальнік \"$a\" не дададзены - ужо зарэгістраваны';
$string['usernotavailable'] = 'Інфармацыя аб дадзеным карыстальніку Вам недаступная.';

?>
