<?PHP // $Id$ 
      // install.php - created with Moodle 1.4.3 + (2004083131)


$string['admindirerror'] = 'Абраны каталог адміністратара няслушны';
$string['admindirname'] = 'Каталог адміністратара';
$string['admindirsetting'] = 'Толькі некаторыя web-сайты выкарыстоўваюць /admin як спецыяльны адрас для доступу да панелі кіравання ці іншага. На жаль, ён канфліктуе з стандартным змяшчэннем старонак адміністравання Moodle. Вы можаце адрэдагаваць гэтую памылку, пераназваў папку admin ў вашай інсталяцыі і пазначыў яе імя тут. Напрыклад:
<br /> <br /><b>moodleadmin</b><br /> <br />
Будзе правільная настроўваць спасылкі на admin ў Moodle.';
$string['caution'] = 'Папярэджанне';
$string['chooselanguage'] = 'Выбярыце мову';
$string['compatibilitysettings'] = 'Праверка настроек PHP...';
$string['configfilenotwritten'] = 'Скрыпт ўстаноўкі не змог аўтаматычна стварыць файл config.php, які ўтрымлівае Вамі абраныя настроўкі, па прычыне, што нельга пісаць у папку з устаноўкай Moodle. Вы можаце ўручную скапіяваць наступны код ў файл з назвай config.php і змясць яго ў карнявую папку ўстаноўкі Moodle.';
$string['configfilewritten'] = 'config.php быў паспяхова створаны';
$string['configurationcomplete'] = 'Настройка завершаная';
$string['database'] = 'База Дадзеных';
$string['databasesettings'] = 'Зараз трэба аформіць базу дадзеных, дзе будзе змяшчацца большасць дадзеных Moodle.  Гэтая база мусіць быць ужо створана імя карыстальніка і пароль доступу.<br />
<br />&nbsp;<br />
<b>Тып:</b> mysql or postgres7<br />
<b>Хост:</b> напрыклад, лакальны хостынг або db.isp.com<br />
<b>Імя:</b> база дадзеных  імя, eg moodle<br />
<b>Карыстальнік:</b> ваша імя карыстальніка базай<br />
<b>Пароль:</b> ваш пароль для базы<br />
<b>Табліцы прэфіксаў:</b> неабавязковы прэфікс для ўсіх імёнаў у табліцы
';
$string['dataroot'] = 'Каталог дадзеных';
$string['datarooterror'] = '\'Інфармацыйная дырэкторыя\', якую Вы пазначылі не можа быць створана.  Праверце шлях або стварыце дырэкторыю ўручную.';
$string['dbconnectionerror'] = 'Мы не змаглі злучыць з базай дадзеных, якую Вы пазначылі. Праверце настройкі базы.';
$string['dbcreationerror'] = 'Памылка стварэння базы. Не змаглі стварыць зададзенае імя базы з такімі настройкамі.';
$string['dbhost'] = 'Хост сэрвера';
$string['dbpass'] = 'Пароль';
$string['dbprefix'] = 'Прэфікс табліцаў';
$string['dbtype'] = 'Тып';
$string['directorysettings'] = '<p>Калі ласка, пацвердзіце размяшчэнне гэтай устаноўкі Moodle.</p>

<p><b>Інтэрнэт адрас:</b>
Пазначце поўны Інтэрнэт адрас, з якога будуць заходзіць на Moodle.  
Калі Ваш сайт даступны праз розныя URL выберыце той, якім студэнты будуць карыстацца звычайна.  Не ўключайце касую рысу.</p>

<p><b>Moodle каталог:</b>
Вызначце поўны пароль да дырэкторыі для гэтай устаноўкі.
Пераканайцеся, што верхняя  ніжняя частка правільныя.</p>

<p><b>Звесткі пра каталог:</b>
Вам патрэбнае месца, дзе Moodle можа захаваць загружаныя файлы.  Гэту дырэкторыю мусіць быць можна прачытаць і перапісаць карыстальніку. 
(звычайна \'nobody\' або \'apache\'), але яе нельга будзе дасягнуць проста праз сеціва.</p>
';
$string['dirroot'] = 'Каталог Moodle';
$string['dirrooterror'] = '\'Moodle каталог\' устаноўкі падаюцца няправільнымі – мы не можам знайсці там устаноўкі Moodle. Значэнне ўнізе было перазагружана.';
$string['download'] = 'Загрузіць';
$string['fail'] = 'Памылка';
$string['fileuploads'] = 'Файл запампоўваецца';
$string['fileuploadserror'] = 'Гэта мусіць быць уключана';
$string['fileuploadshelp'] = '<p>Файл запампоўкі не актывізаваны на Вашым сэрверы.</p>

<p>Moodle усё яшчэ можна інсталяваць, але без гэтай магчымасці Вы не зможаце запампоўваць курсавыя файлы або здымкі.</p>

<p>Каб актывізаваць запампоўку Вы (або Ваш сістэмны адміністратар) мусіце адрэдагаваць галоўны php.ini файл і змяніць настройкі для <b>file_uploads</b> на \'1\'</p>';
$string['gdversion'] = 'GD версія';
$string['gdversionerror'] = 'Бібліятэка GD неабходна для стварэння і апрацоўкі малюнкаў';
$string['gdversionhelp'] = '<p>На Вашым сэрверы не ўсталявана GD.</p>

<p>GD гэта бібліятэка, якую патрабуе PHP, каб Мoodle апрацоўваў малюнкі (напрыклад, профілі карыстальнікаў) і ствараў новыя (напрыклад, графікі).  Moodle будзе працаваць і без GD – але вышэйзгаданыя опцыі будуць недаступныя.</p>
   
<p>Каб дадаць GD да PHP у Unix, складзіце PHP скарыстаўшы --with-gd параметр.</p>

<p>У Windows звычайна можна складаць php.ini і дэманціраваць спасылку на радок libgd.dll.</p>
';
$string['installation'] = 'Ладаванне';
$string['magicquotesruntime'] = 'Аўтазамена на парныя дзвухкоссі';
$string['magicquotesruntimeerror'] = 'Мусіць быць выключана';
$string['magicquotesruntimehelp'] = '<p>Аўтазамена на парныя дзвухкоссі мусіць быць выключана, каб  Moodle нармальна працаваў.</p>

<p>Звычайна яна выключана па-змаўчанні ... глядзі настройку <b>magic_quotes_runtime</b> у тваім php.ini файле.</p>

<p>Калі не маеце доступу да php.ini, можа, атрымаецца змясціць у файл наступнае пад назвай .htaccess у Вашай дырэкторыі Moodle:
</p><blockquote>php_value magic_quotes_runtime Off</blockquote>';
$string['memorylimit'] = 'Мяжа памяці';
$string['memorylimiterror'] = 'Ліміт памяці PHP даволі нізкі ... далей могуць узнікнуць праблемы.';
$string['memorylimithelp'] = '<p>Ліміт памяці PHP для вашага сэрвера выстаўлены на $a.</p>
<p>Надалей гэта можа выклікаць праблемы з памяццю, асабліва, калі адначасова актывізавана шмат модуляў іабо ёсць шмат карыстальнікаў.</p>
<p>Мы рэкамендуем надаць PHP большы ліміт пры магчымасці, скажам, 16M.  
   Можна зрабіць гэта па-рознаму:</p>
<ol>
<li>Калі здолееце, перааформіце PHP з <i>--enable-memory-limit</i>.  
Гэта дазволіць Moodle самому выстаўляць ліміты памяці.</li>
<li>Калі маеце доступ да php.ini file, можна памяняць <b>memory_limit</b> устаноўку на прыкладна 16M.  Калі доступу няма, папрасіце адміністратара зрабіць гэта.</li>
<li>На некаторых сэрверах PHP можна стварыць.htaccess файл у дырэкторыі Moodle, якая ўтрымлівае радок:
<p><blockquote>php_value memory_limit 16M</blockquote></p>
<p>Аднак, на некаторых сэрверах, гэта створыць перашкоды <b>all</b> для працы PHP старонак 
(на старонках будуць памылкі) так, што Вам давядзецца выдаліць .htaccess файл.</p></li>
</ol>
';
$string['mysqlextensionisnotpresentinphp'] = 'PHP не прыстасавана да MySQL расшырэння так, што MySQL недаступны.  Праверце php.ini file або пераладуйце PHP.';
$string['pass'] = 'Пропуск';
$string['phpversion'] = 'PHP версія';
$string['phpversionerror'] = 'Версія PHP мусіць быць па меншай меры 4.1.0';
$string['phpversionhelp'] = '<p>Moodle патрабуе версію PHP па меншай меры 4.1.0.</p>
<p>Ваша версія зараз $a</p>
<p>Трэба актуалізаваць PHP або перайсці на сэрвер з пазнейшай версіяй PHP!</p>
';
$string['safemode'] = 'Бяспечны рэжым';
$string['safemodeerror'] = 'У Moodle могуць быць праблемы з уключаным бяспечным рэжымам';
$string['safemodehelp'] = '<p>У Moodle можа быць цэлы шэраг праблем з уключаным бяспечным рэжымам, напрыклад, можа стаць немагчыма ствараць новыя файлы.</p>
   
<p>Бяспечны рэжым звычайна ўключаны на ідыёцкіх грамадскіх сэрверах, так што найлепей будзе проста знайсці новы хостынг для вашага Moodle сайта.</p>
   
<p>Можаце, канечне, працягваць загрузку, але чакайце праблем апасля.</p>
';
$string['sessionautostart'] = 'Запусціць аўтаматычны доступ';
$string['sessionautostarterror'] = 'Гэта мусіць быць выключана';
$string['sessionautostarthelp'] = '<p>Moodle патрабуе падтрымку сесіі і не будзе без яе працаваць.</p>

<p>Сесіі можна выключыць у php.ini file ... шукайце параметр session.auto_start parameter.</p>
';
$string['wwwroot'] = 'Інтэрнэт адрас';
$string['wwwrooterror'] = 'Інтэрнэт адрас падаецца няправільным – гэтая ўстаноўка Moodle не там.';

?>
