<p align="center"><b>Det mninimala antalet fr&aring;gor i en lektion</b></p>

<p>
N&auml;r en lektion inneh&aring;ller en eller flera f&ouml;rgreningstabeller s&aring; b&ouml;r Du som (distans)l&auml;rare
normalt sett st&auml;lla in den h&auml;r parametern. Dess v&auml;rde s&auml;tter en l&auml;gre gr&auml;ns f&ouml;r det antal fr&aring;gor 
som ing&aring;r i ber&auml;kningen av betyg/omd&ouml;men.
Det tvingar<b> inte</b> studenter/elever/deltagare/l&auml;rande att besvara s&aring; m&aring;nga fr&aring;gor i lektionen.</p>

<p>
Om parametern &auml;r inst&auml;lld till t ex 20, s&aring; inneb&auml;r det att betygen/omd&ouml;mena s&auml;tts som om
studenterna/eleverna/deltagarna/de l&auml;rande <b>&aring;tminstone</b> har sett det h&auml;r antalet fr&aring;gor.
L&aring;t oss s&auml;ga att en student/elev/deltagare/l&auml;rande ser bara en enskild f&ouml;rgrening i en lektion med, s&auml;g, 5 sidor
och svarar korrekt p&aring; alla de aktuella fr&aring;gorna. Denne skulle kunna v&auml;lja att avsluta lektionen 
(under f&ouml;ruts&auml;ttning att det alternativet finns med p&aring; den &ouml;vergripande f&ouml;rgreningstabellen, 
vilket man kan anta att det g&ouml;r). Om denna parameter inte var aktiverad s&aring; skulle
deras betyg/omd&ouml;me bli 5 av 5 vilket blir 100%. Om parametern d&auml;remot &auml;r inst&auml;lld till 20 s&aring; skulle betyget/omd&ouml;met reduceras till 5 av 20, 
dvs 25%. Ifall en annan person g&aring;r igenom alla f&ouml;rgreningar och ser, s&auml;g, 25 sidor och besvarar alla utom tv&aring; av fr&aring;gorna korrekt
s&aring; kommer betyget att bli 23 av 25, dvs 92%.</p>

<p>Om den h&auml;r parametern anv&auml;nds s&aring; kommer den f&ouml;rsta sidan i lektionen att inneh&aring;lla n&aring;gonting i stil med:<p>

<p><blockquote>P&aring; den h&auml;r lektionen f&ouml;rv&auml;ntas Du f&ouml;rs&ouml;ka besvara &aring;tminstone n fr&aring;gor. Du kan f&ouml;rs&ouml;ka besvara fler
om Du vill. Dock &auml;r det s&aring; att om Du besvarar f&auml;rre &auml;n n fr&aring;gor s&aring; kommer Ditt betyg/omd&ouml;me att ber&auml;knas utifr&aring;n f&ouml;ruts&auml;ttningen 
att Du f&ouml;rs&ouml;kt besvara n fr&aring;gor.</blockquote></p>

<p>&quot;n&quot; ers&auml;tts f&ouml;rst&aring;s av det faktiska talet (v&auml;rdet) som den h&auml;r parametern &auml;r inst&auml;lld till.
</p>

<p>N&auml;r den h&auml;r parametern &auml;r inst&auml;lld s&aring; f&aring;r studenten/eleven/deltagaren/den l&auml;rande veta hur m&aring;nga fr&aring;gor han/hon har
f&ouml;rs&ouml;kt besvara och hur m&aring;nga han/hon f&ouml;rv&auml;ntas besvara.
</p>
