<p align="center"><b>&Ouml;versikt</b></p>

<ol>
<li>En lektion &auml;r uppbyggd av ett antal 
 <b>sidor</b> och som valfri m&ouml;jlighet av <b>f&ouml;rgreningstabeller</b>.</li>
 
<li>En sida har ett visst <b>inneh&aring;ll</b> och den avslutas normalt sett med en 
    <b>fr&aring;ga</b>. D&auml;rav begreppet <b>Fr&aring;gesidan</b>.</li>
	
<li>Varje sida har normalt sett en upps&auml;ttning <b>svar</b>. </li>

<li>Varje svar kan visa ett kort stycke text efter det att anv&auml;ndaren har valt ett svar.
 Detta stycke kallas f&ouml;r <b>&aring;terkoppling</b>.</li>
 
<li>N&aring;got som ocks&aring; &auml;r kopplat till varje sida &auml;r ett <b>hopp</b>. Hoppet kan vara relativt -
den h&auml;r sidan, n&auml;sta sida eller absolut. Om det &auml;r absolut s&aring; refererar det till vilken som helst
av sidorna i lektionen eller lektionens slut.</li>

<li>Som standard s&aring; hoppar det f&ouml;rsta svaret till <b>n&auml;sta sida</b> i lektionen. 
De d&auml;rp&aring; f&ouml;ljande svaren hoppar till samma sida. Dvs att studenten/eleven/deltagaren/den l&auml;rande
visas samma sida i lektionen igen om de inte v&auml;ljer det f&ouml;rsta svaret.</li>

<li>Vad som &auml;r n&auml;sta sida avg&ouml;rs av lektionens <b>logiska f&ouml;ljd</b>. Det &auml;r den f&ouml;ljd som (distans)l&auml;raren
har arrangerat sidorna i. Du kan &auml;ndra p&aring; den f&ouml;ljden genom att flytta sidor inom lektionen.</li>

<li>Lektionen har ocks&aring; en <b>navigationsf&ouml;ljd</b>. Det &auml;r den f&ouml;ljd som studenterna/eleverna/deltagarna/de l&auml;rande 
ser sidorna i. Detta avg&ouml;rs av de hopp som &auml;r angivna f&ouml;r varje individuellt svar
och denna f&ouml;ljd kan skilja sig mycket fr&aring;n den logiska f&ouml;ljden.
(&Auml;ven om standardv&auml;rdena f&ouml;r hoppen <i>inte</i> har &auml;ndrats s&aring; &auml;r de tv&aring; starkt relaterade till varandra.) 
Som (distans)l&auml;rare har Du alternativet att markera navigationsf&ouml;ljden.</li>

<li>N&auml;r svaren visas f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande s&aring; &auml;r de vanligtvis
blandade. Dvs, det f&ouml;rsta svaret som Du anger beh&ouml;ver inte n&ouml;dv&auml;ndigtvis vara det f&ouml;rsta svar som visas
f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande. (Vidare s&aring; &auml;r det s&aring; att svaren kommer att visas i en ny f&ouml;ljd 
varje g&aring;ng.) Undantaget fr&aring;n detta &auml;r upps&auml;ttningar av svar p&aring; fr&aring;gor av typen para-ihop. 
H&auml;r visas n&auml;mligen svaren i samma f&ouml;ljd som Du som (distans)l&auml;rare har angivit.</li> 

<li>Antalet svar kan variera fr&aring;n sida till sida. Det g&aring;r t ex att l&aring;ta n&aring;gra sidor sluta med
en SANT/FALSKT-fr&aring;ga medan andra har fr&aring;gor med ett korrekt svar och, s&auml;g tre, felaktiga. </li>

<li>Det &auml;r m&ouml;jligt att skapa en sida utan svar. Studenterna/eleverna/deltagarna/de l&auml;rande f&aring;r d&aring; se en 
<b>Forts&auml;tt</b>-l&auml;nk ist&auml;llet f&ouml;r en upps&auml;ttning blandade svar.</li>

<li>I syfte att s&auml;tta betyg/omd&ouml;men p&aring; lektioner s&aring; &auml;r <b>korrekta</b> svar s&aring;dana som &auml;r hoppar till en
sida som &auml;r l&auml;ngre <i>ner</i> i den logiska f&ouml;ljden &auml;n den aktuella sidan. 
    <b>Felaktiga</b> svar &auml;r s&aring;dana som antingen hoppar till samma sida eller till en sida 
	som &auml;r l&auml;ngre <i>upp</i> i den logiska f&ouml;ljden &auml;n den aktuella sidan. S&aring;lunda &auml;r det s&aring; att om hoppen
    <i>inte</i> &auml;ndras s&aring; &auml;r det f&ouml;rsta svaret det som &auml;r korrekt och de andra svaren &auml;r felaktiga.</li>
	
<li>Fr&aring;gor kan ha mer &auml;n ett korrekt svar. Om t ex tv&aring; av svaren hoppar till n&auml;sta sida d&aring; &auml;r b&aring;da godk&auml;nda som korrekta svar. 
 (&Auml;ven om samma m&aring;lsida visas f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande s&aring; kan den &aring;terkoppling som visas
 p&aring; v&auml;gen till denna sida mycket v&auml;l vara olika f&ouml;r de tv&aring; olika svaren.)</li>
	
<li>P&aring; den (lektions)sida som visas f&ouml;r (distans)l&auml;raren s&aring; har de korrekta svaren 
svarsetiketter som &auml;r understrukna.</li>
	
<li><b>F&ouml;rgreningstabeller</b> &auml;r helt enkelt sidor som har en upps&auml;ttning l&auml;nkar till andra sidor i lektionen.
Det  vanliga &auml;r att en lektion inleds med en f&ouml;rgreningstabell som fungerar som en <b>Tabell &ouml;ver inneh&aring;ll</b>.</li>
	
<li>Varje l&auml;nk i en f&ouml;rgreningstabell har tv&aring; komponenter, en beskrivning och 
och titeln p&aring; sidan l&auml;nken ska hoppa till. </li>
	
<li>En f&ouml;rgreningstabell delar effektivt in lektionen i ett antal
    <b>f&ouml;rgreningar</b> (eller sektioner). Varje f&ouml;rgrening kan inneh&aring;lla ett antal sidor (som antagligen relaterar
	till samma &auml;mne). Slutet p&aring; f&ouml;rgreningen &auml;r vanligtvis markerad med en <b>Slut p&aring; f&ouml;rgrening</b>-sida. 
	Det h&auml;r &auml;r en speciell sida som, som standard, tar studenten/eleven/deltagaren/den l&auml;rande tillbaka till den f&ouml;reg&aring;ende
	f&ouml;rgreningstabellen.  
    &quot;tillbaka&quot;-hoppet p&aring; en Slut-p&aring;-f&ouml;rgreningen-sida kan Du, om det beh&ouml;vs, &auml;ndra genom att redigera sidan.
	 </li>
	
<li>Det kan finnas mer &auml;n en f&ouml;rgreningstabell i en lektion. En lektion kan t ex 
vara anv&auml;ndbart strukturerad s&aring; att f&ouml;rdjupningar och specialfall l&auml;ggs in i under-f&ouml;rgreningar
inom huvud&auml;mnets f&ouml;rgreningar.</li>
	
<li>Det &auml;r viktigt att studententerna/eleverna/deltagarna/de l&auml;rande har
m&ouml;jligheter att avsluta lektionen. Detta kan t ex ske genom att Du tar med
en l&auml;nk f&ouml;r att &quot;Avsluta lektionen&quot; i den &ouml;vergripande f&ouml;rgreningen.
Detta g&ouml;r att anv&auml;ndaren hoppar till en (t&auml;nkt) sida f&ouml;r  <b>Slut p&aring; lektionen</b>. 
En annan m&ouml;jlighet &auml;r att den sista f&ouml;rgreningen i lektionen (h&auml;r anv&auml;nds &quot;sista&quot; i meningen
   logisk ordning) helt enkelt forts&auml;tter till slutet p&aring; lektionen,
    dvs, den avslutas <i>inte</i> med en Slut-p&aring;-f&ouml;rgreningen-sida.</li>
	
<li>N&auml;r en lektion inneh&aring;ller mer &auml;n en f&ouml;rgreningstabell s&aring; b&ouml;r Du st&auml;lla in 
parametern &quot;Minimalt antal fr&aring;gor&quot; till ett rimligt v&auml;rde. Detta
anger en l&auml;gre gr&auml;ns f&ouml;r det antal sidor som r&auml;knas in n&auml;r betyget/omd&ouml;met ber&auml;knas.
Utan denna parameter skulle studenten/eleven/deltagaren/den l&auml;rande kunna g&aring; igenom en
enskild f&ouml;rgrening i lektionen, besvara alla fr&aring;gorna d&auml;r korrekt och sedan 
l&auml;mna lektionen och f&aring; ut ett maximalt betyg/omd&ouml;me f&ouml;r hela lektionen.</li>
	
<li>
Vidare, n&auml;r en f&ouml;rgreningstabell finns tillg&auml;nglig s&aring; har en student/elev/deltagare/l&auml;rande
m&ouml;jlighet att g&aring; igenom samma f&ouml;rgrening flera g&aring;nger. Det &auml;r dock s&aring; att betyget/omd&ouml;met 
ber&auml;knas genom att man anv&auml;nder antalet <i>unika</i> fr&aring;gor som &auml;r besvarade. Att man 
svarar flera g&aring;nger p&aring; samma upps&auml;ttning fr&aring;gor h&ouml;jer allts&aring; inte betyget/omd&ouml;met.
I sj&auml;lva verket &auml;r det tv&auml;rtom s&aring; att det s&auml;nker betyget/omd&ouml;met eftersom r&auml;knaren 
av visade sidor anv&auml;nds i n&auml;mnaren n&auml;r ber&auml;kningen av betyg/omd&ouml;men inkluderar 
flerfaldig visning av sidor. I syfte att ge studenterna/eleverna/deltagarna/de l&auml;rande en rimlig uppfattning om 
hur de presterar under lektionens g&aring;ng s&aring; f&aring;r de, p&aring; varje f&ouml;rgreningstabell, se detaljer ang&aring;ende hur m&aring;nga fr&aring;gor 
de har besvarat korrekt, antal sidor som &auml;r visade och deras aktuella betyg/omd&ouml;me.</li>
	
<li><b>Slutet p&aring; lektionen</b> n&aring;r de antingen genom att uttryckligen hoppa till den platsen
eller genom att hoppa till n&auml;sta sida fr&aring;n den sista (logiska) sidan av lektionen.
N&auml;r de har n&aring;tt slutet p&aring; lektionen s&aring; f&aring;r de se ett gratulationsmeddelande och sitt betyg/omd&ouml;me.
Betyget/omd&ouml;met &auml;r lika med (antal fr&aring;gor som har besvarats korrekt/antal sidor som har visats) * betyget/omd&ouml;met f&ouml;r lektionen.
</li>
	
<li>Om slutet p&aring; lektionen <i>inte</i> &auml;r uppn&aring;tt och studenten/eleven/deltagaren/den l&auml;rande avbryter den n&aring;gonstans inne i den,
s&aring; f&aring;r han/hon n&auml;sta g&aring;ng d&aring; han/hon &aring;terupptar lektionen, m&ouml;jlighet att v&auml;lja om han/hon vill b&ouml;rja om fr&aring;n b&ouml;rjan
eller om han/hon vill forts&auml;tta d&auml;r han/hon l&auml;mnade sitt senaste korrekta svar.
</li>
	
<li>N&auml;r det g&auml;ller lektioner som man f&aring;r g&ouml;ra om s&aring; kan (distans)l&auml;raren v&auml;lja om han/hon 
ska anv&auml;nda det b&auml;sta betyget eller medelbetyget f&ouml;r alla f&ouml;rs&ouml;k som det  &quot;slutliga&quot; betyget/omd&ouml;met p&aring; lektionen.
Det betyget/omd&ouml;met visas t ex p&aring; sidan f&ouml;r Betyg/omd&ouml;men.</li>
</ol>

