<p align="center"><b>Typer av fr&aring;gor</b></p>

<p>De typer av fr&aring;gor som f n st&ouml;djs av Lektionsmodulen &auml;r:</p>

<ol>
<li><p><b>Flerval</b><br /> Det h&auml;r &auml;r standardtypen av fr&aring;gor. Flervalsfr&aring;gor
&auml;r popul&auml;ra. Det finns en fr&aring;ga och ett antal svarsalternativ att v&auml;lja bland.
Ett korrekt svar inneb&auml;r att man f&aring;r g&aring; vidare i lektionen. 
Felaktiga svar kallas ibland f&ouml;r &quot;distraherare&quot;. V&auml;rdet av en fr&aring;ga som inneh&aring;ller 
s&aring;dana svarsalternativ beror i h&ouml;g grad p&aring; kvaliteten hos dessa &quot;distraherare&quot;.</p>

<p> Varje svar kan som alternativ ge en &aring;terkoppling (t.ex. en kommentar till svaret).
Om det inte finns n&aring;gon &aring;terkoppling f&ouml;r ett visst svar s&aring; visas som standard: 
    &quot;Det &auml;r ett korrekt svar&quot; eller &quot;Det &auml;r ett felaktigt svar&quot;.
    </p>

<p>Det &auml;r m&ouml;jligt att ange mer &auml;n ett korrekt svar till en flervalsfr&aring;ga.
De olika korrekta svaren kan ge olika typer av &aring;terkoppling och leda vidare i lektionen
 men de ger samma betyg/omd&ouml;me, dvs. en del svar &auml;r <b>inte</b> mer korrekta &auml;n andra, 
   &aring;tminstone inte vad avser betyg. Det &auml;r m&ouml;jligt att alla svar kan vara korrekta
    och de kan f&ouml;ra studenten/eleven/deltagaren/den l&auml;rande (vidare) till olika delar av
	lektionen beroende p&aring; vilket svar man har valt.</p>

<p>Det finns en variant av flervalsfr&aring;gor som kallas <b>&quot;Flervals/Flersvarsfr&aring;gor&quot;</b> 
Om man v&auml;ljer Alternativ f&ouml;r fr&aring;ga s&aring; ombeds man att v&auml;lja alla de svarsalternativ som &auml;r korrekta.
Det kan, eller inte, framg&aring; av fr&aring;gan  <i>hur m&aring;nga</i> korrekta svar det finns.
Ett exempel: fr&aring;gan &quot;Vilka av de f&ouml;ljande personerna var presidenter i USA?&quot; talar inte om hur m&aring;nga det &auml;r.
&quot;V&auml;lj de tv&aring; personer som har varit presidenter i USA.&quot; g&ouml;r det.
Det faktiska antalet korrekta svar kan vara allt fr&aring;n ett till samtliga svarsalternativ.
En fr&aring;ga av typen flerval med ett korrekt svar skiljer sig fr&aring;n 
en flersvarsfr&aring;ga p&aring; s&aring; s&auml;tt att den senare ger Dig m&ouml;jlighet att v&auml;lja mer &auml;n ett svar 
vilket den f&ouml;rra inte g&ouml;r.</p>

<p>&Aring;terigen s&aring; &auml;r de korrekta svaren flaggade s&aring; att de leder vidare medan felaktiga svar g&ouml;r att man stannar
kvar p&aring; samma sida eller leds bak&aring;t i lektionen. I de fall d&aring; det finns flera korrekta svar s&aring; b&ouml;r hoppen 
leda vidare till samma sida liksom f&ouml;r de felaktiga. Om det <b>inte</b> &auml;r arrangerat p&aring; det s&auml;ttet, s&aring;  visas det en varning 
 p&aring; distansl&auml;rarens vy &ouml;ver lektionen. &Aring;terkopplingen p&aring; korrekta svar, om den kr&auml;vs, b&ouml;r l&auml;mnas som reaktion p&aring; 
 det f&ouml;rsta korrekta svaret och &aring;terkopplingen p&aring; felaktiga svar, om den kr&auml;vs, b&ouml;r l&auml;mnas som reaktion p&aring; 
 det f&ouml;rsta  felaktiga svaret. &Aring;terkopplingen p&aring; &ouml;vriga svar r&auml;knas inte (utan varning).
    </p></li>

<li><p><b>Kortsvar</b> <br />Studenten/eleven/deltagaren/l&auml;rande ombeds att skriva in ett kort stycke text.
Det l&auml;mnade svaret j&auml;mf&ouml;rs med ett eller flera inlagda svar. Svar kan vara antingen korrekta eller felaktiga. 
Varje svar kan som alternativ ha &aring;terkoppling. Om ingen &aring;terkoppling har skrivits in f&ouml;r ett visst svar s&aring; visas 
som standard: &quot;Det &auml;r ett korrekt svar&quot; eller &quot;Det &auml;r  ett felaktigt svar&quot;
f&ouml;r studenten/eleven/deltagaren/den l&auml;rande. Om den text som har skrivits in inte passar ihop med
n&aring;got av svaren s&aring;  &auml;r svaret felaktigt och  studenten/eleven/deltagaren/ den l&auml;rande f&aring;r se
&aring;terkopplingen f&ouml;r felaktigt svar. 
    </p>

<p>Som standard &auml;r j&auml;mf&ouml;relserna inte skiftl&auml;gesk&auml;nsliga. Detta finns dock som 
en alternativ inst&auml;llning.</p>

<p>Tecknet (*) asterisk (*) kan anv&auml;ndas i svar som ett &quot;wild card&quot;-tecken.
 Det kan representera vilket antal tecken som helst (eller inga tecken).
   Som exempel s&aring; kan svaret &quot;kort*&quot; matcha  
    &quot;kortare&quot;, &quot;kortast&quot; och &quot;kort&quot;. Om ett av svaren bara &auml;r
    &quot;*&quot; (en enda *) s&aring; kommer detta svar att matcha vad som helst.
	Vanligtvis anv&auml;nds det som det sista &quot;f&aring;nga-upp-alla&quot;-svaret.
	Processen att matcha g&aring;r igenom alla svar i den ordning som som visar sig p&aring;
	sk&auml;rmen. N&auml;r en matchning har hittats avbryts processen och det motsvarande 
	resultatet (och &aring;terkopplingen om det finns en s&aring;dan) returneras.
    Allts&aring;, om till exempel svaren &auml;r kortast, kort* och * (i den ordningen)
	s&aring; kommer inmatningen &quot;kortare&quot; att matcha det andra svaret, och, i det
	h&auml;r fallet s&aring; kommer det tredje svaret, &auml;ven om det matchar, inte att r&auml;knas.
	</p>

<p> Om en asterisk (*) faktiskt beh&ouml;vs i ett svar s&aring; b&ouml;r den skrivas in som \*, backslash asterisk.</p></li>

<li><p><b>Sant/Falskt</b><br /> Det finns bara tv&aring; svarsalternativ p&aring; den h&auml;r typen av fr&aring;ga, sant eller falskt.
Studenten/eleven/deltagaren/den l&auml;rande uppmanas att v&auml;lja vilket som &auml;r det korrekta alternativet.
    Den h&auml;r typen av fr&aring;ga &auml;r i grunden en flervalsfr&aring;ga med bara tv&aring; alternativ.</p>
	</li>

<li><p><b>Para-ihop</b><br /> Det h&auml;r &auml;r fr&aring;gor av en ganska kraftfull och flexibel typ. De 
utg&ouml;rs av en lista med namn eller p&aring;st&aring;enden som m&aring;ste paras ihop p&aring; ett korrekt s&auml;tt gentemot 
 en annan lista med namn eller p&aring;st&aring;enden. Ett exempel:  &quot;Para ihop huvudstaden med  landet&quot; 
 och anv&auml;nd de tv&aring; listorna Japan, Kanada, Italien och Tokyo, Ottawa, Rom. 
 Det g&aring;r att ha upprepade bidrag till listan men se till att de &auml;r identiska.
 Ett exempel: &quot;Identifiera vad det h&auml;r &auml;r f&ouml;r typ av varelser
    &quot; med hj&auml;lp av listorna sparv, ko, myra, hund och katt, f&aring;gel, djur, insekt, djur. </p>

<p>N&auml;r Du skapar den h&auml;r typen av fr&aring;gor s&aring; placerar Du komponenter fr&aring;n den f&ouml;rsta listan i svarsboxen 
och komponenter fr&aring;n den andra listan i boxen f&ouml;r &aring;terkopplingen.
 N&auml;r Du v&auml;l har skapat detta s&aring; visas en vettigare modell f&ouml;r att s&auml;tta etiketter. 
 N&auml;r studenten/eleven/deltagaren/den l&auml;rande lyckas para ihop komponenterna s&aring; anv&auml;nds
 hoppet p&aring; det f&ouml;rsta svaret. Ett misslyckat svar hoppar till sidan p&aring; det andra svaret.
    Fr&aring;gan st&ouml;djer <b>inte</b>  &aring;terkopplingar i standardform,  studenten/eleven/deltagaren/den l&auml;rande 
	f&aring;r veta hur m&aring;nga ihop-parningar som &auml;r korrekta eller om alla ihop-parningar &auml;r det.
</p>

<p>Till skillnad fr&aring;n en flervalsfr&aring;ga d&auml;r alternativen visas i slumpm&auml;ssig ordning
s&aring; blandas <b>inte</b> den f&ouml;rsta listan utan visas i samma ordning som den har blivit gjord i.
Detta g&ouml;r det m&ouml;jligt att konstruera <b>&quot;Ordnade&quot;</b> fr&aring;gor.
 Titta p&aring; den h&auml;r fr&aring;gan: &quot; Placera de h&auml;r personerna i den ordning som de
 &auml;r f&ouml;dda, den tidigaste f&ouml;rst&quot; med hj&auml;lp av listorna 1., 2., 3., 4. och 
     Stiernhielm, Bellman, Fr&ouml;ding, Ferlin. Den andra listan blandas naturligtvis om innan den
	anv&auml;nds i fr&aring;gan. </p></li>

<li><p><b>Numerisk</b> <br />Den h&auml;r typen av fr&aring;ga kr&auml;ver ett tal som svar.
I sin enklaste form s&aring; kr&auml;ver den bara att man anger ett enda svar. Ett exempel:
 &quot;Hur mycket &auml;r 2 plus 2?&quot; med svaret 4 som leder till ett hopp fram&aring;t i 
 lektionen. Det &auml;r emellertid b&auml;ttre att ange ett omf&aring;ng eftersom den interna avrundningen
 av numeriska v&auml;rden kan g&ouml;ra att enskilda numeriska j&auml;mf&ouml;relser snarare tr&auml;ffar r&auml;tt
 &auml;n missar. Allts&aring; om fr&aring;gan g&auml;llde &quot;Hur mycket &auml;r 10 dividerat med 3? &quot; s&aring; skulle det vara n&ouml;dv&auml;ndigt 
 att ange svaret som <b>&quot;Minimum:Maximum&quot;</b>, det &auml;r <b>tv&aring;</b> v&auml;rden separerade med ett kolon (:).
 Allts&aring; om 3.33:3.34 &auml;r angivet som ett acceptabelt omf&aring;ng p&aring; svaret d&aring; kommer svaren 3.33, 3.333, 3.3333... 
 att bed&ouml;mas som korrekta. &quot;Felaktiga&quot; svar skulle inkludera 3.3 (mindre &auml;n minimum) och 3.4 (st&ouml;rre &auml;n maximum).</p>

<p>Fler &auml;n ett korrekt svar &auml;r till&aring;tna och svaren kan vara antingen enskilda eller par av 
v&auml;rden. L&auml;gg m&auml;rke till att den ordning enligt vilken svaren testas &auml;r Svar 1, Svar 2, Svar 3...
s&aring; Du b&ouml;r vara noga med att det blir den &ouml;nskade &aring;terkopplingen som visas.

   Ett exempel: Fr&aring;gan &quot;N&auml;r f&ouml;ddes August Strindberg?&quot; 
    kunde ha det enskilda v&auml;rdet av 1849 som det exakta svaret och paret av v&auml;rden
    1840:1849, 1840-talet, som det mindre exakta svaret. Den ordning i vilken 
	dessa v&auml;rden b&ouml;r testas i &auml;r naturligtvis f&ouml;rts 1849 och sedan 1840:1849. Det f&ouml;rsta 
	  svaret skulle kunna ha &aring;terkopplingen &quot;Det &auml;r exakt korrekt&quot; 
    medan det andra svarets &aring;terkoppling skulle kunna vara &quot;Det &auml;r n&auml;ra, det &auml;r korrekt &aring;rtionde&quot;.</p>
    
<p>Felaktiga svar kan anges men beroende p&aring; deras faktiska omf&aring;ng s&aring; b&ouml;r Du vara 
noga med att placera dem efter de korrekta svaren. Om Du till exempel n&auml;r Du l&auml;gger till 
det felaktiga svaret 3:4 till fr&aring;gan &quot;10 dividerat med 3&quot; s&aring; m&aring;ste det komma efter 
det korrekta svaret. Allts&aring;, svaren &auml;r ordnade s&aring; h&auml;r 3.33:3.34 (det  
    &quot;korrekta&quot; svaret) och sedan 3:4 (det &quot;felaktiga&quot; svaret, men inte ett 
	ett felaktigt svar som bara &auml;r en vild gissning!).</p></li>
</ol>

