<p align="center"><b>Att anv&auml;nda HTML-redigeraren</b></p>
<p>N&auml;r Du redigerar sidor s&aring; aktiverar det h&auml;r alternativet anv&auml;ndning av HTML-redigeraren
ist&auml;llet f&ouml;r enkla textrutor. Med redigeraren kan Du enkelt formattera texten eller
l&auml;gga till &quot;avancerade&quot; saker som l&auml;nkar.</p>
<p>Du startar redigeraren genom att klicka p&aring; kryssrutan invid 
 <b>Anv&auml;nd redigeraren</b>. Redigeraren &auml;r kopplad till individuella komponenter.
 Om Du t.ex. aktiverar redigeraren f&ouml;r komponenten 
 <b>Svarsreaktion 1</b> s&aring; st&auml;lls redigeraren in bara f&ouml;r den komponenten och 
 <i>inte</i> f&ouml;r alla rutor f&ouml;r svarsreaktioner.</p>
<p>Om Du beh&ouml;ver anv&auml;nda redigeraren f&ouml;r n&aring;gra av komponenterna p&aring; en sida
s&aring; markerar Du f&ouml;rst kryssrutorna f&ouml;r <b>Anv&auml;nd redigeraren</b>. 
Sidan visas d&aring; igen f&ouml;r att aktivera anv&auml;ndning av redigeraren.
Det h&auml;r &aring;stadkommer Du genom att klick p&aring; knappen <b>Visa sidan igen</b> 
l&auml;ngst ner p&aring; sidan.</p>
<p>L&auml;gg m&auml;rke till att Du b&ouml;r vara f&ouml;rsiktig n&auml;r Du anv&auml;nder redigeraren.
I de flesta fall s&aring; uppst&aring;r inga problem alls. Men Du b&ouml;r <i>inte</i> anv&auml;nda redigeraren 
  f&ouml;r  <b>Svar p&aring; fr&aring;gor av typen kortsvar eller numerisk</b>. Redigeraren kan 
d&aring; l&auml;gga till extra &quot;osynliga&quot; HTML-taggar som  <b>f&ouml;rhindrar</b> 
  att j&auml;mf&ouml;relserna fungerar som det &auml;r t&auml;nkt. 
  Dessutom s&aring; anv&auml;nds <b>Beskrivningar</b> i f&ouml;rgreningstabeller i knappar och om de inneh&aring;ller
  HTML-taggar s&aring; kan detta f&ouml;rorsaka problem. Det finns inga problem med svar som bara 
  ska visas, som t.ex. i fr&aring;gor av typen flervalsvar. </p>
<p>Om Du misst&auml;nker att det &auml;r n&aring;got problem med n&aring;gon av textkomponenterna 
s&aring; &auml;r det riskfritt att avaktivera redigeraren. N&auml;r sidan visas igen s&aring; kan Du se den
&quot;r&aring;a&quot; texten i textrutan. Du kan redigera texten enligt &ouml;nskem&aring;l.
</p>
<p>&quot;Status&quot; f&ouml;r alternativet <b>Anv&auml;nd redigeraren</b> sparas i samband
med varje komponent. Allts&aring;, om en sida ska redigeras om, s&aring; kommer de komponenter
som anv&auml;nde redigeraren att dyka upp igen inne i redigeraren.</p>
<p>Slutligen &auml;r det s&aring; att redigeraren &auml;r ganska &quot;resurskr&auml;vande&quot; inom webbl&auml;saren. 
Om komponenterna inte kr&auml;ver redigeraren s&aring; &auml;r det snabbare och resurssn&aring;lare att anv&auml;nda vanliga enkla textrutor.</p>