<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Documentaci&oacute;n de Moodle: Antecedentes</title>
  <link rel="stylesheet" href="../theme/standard/styles.php" type="TEXT/CSS">
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
<body bgcolor="#ffffff">
  
<h2>Antecedentes</h2>

<p>Moodle es un proyecto activo y en constante evolución. El desarrollo fue iniciado 
  por <a href="http://moodle.org/user/view.php?id=1&course=1" target="_top">Martin 
  Dougiamas</a> que contin&uacute;a dirigiendo el proyecto:</p>

<blockquote>
  <p><em>He estado trabajando en él, de una manera u otra, durante bastantes años. 
    Comenzó en los años 90 cuando yo era Webmaster en la <a href="http://www.curtin.edu.au/" target="_top"><span

 lang="en">Curtin University of Technology</span></a> y administrador de sistemas 
    en su instalación <abbr title="Web Course Tools"

 lang="en">WebCT</abbr>. Encontré muchas cosas frustrantes con la bestia de <abbr title="Web Course Tools" lang="en">WebCT</abbr> 
    y me salió un sarpullido que tenía que rascar continuamente. Tenía que haber 
    una manera mejor (no, Blackboard no :-)</em></p>
  <p><em>También conozco un montón de gente en colegios e instituciones pequeñas 
    (&iexcl;y algunas grandes!) que quieren hacer un mejor uso de Internet pero 
    que no saben por dónde comenzar en el laberinto de tecnologías y sistemas 
    pedagógicos disponibles. Siempre he tenido la esperanza de que pudiese haber 
    una alternativa libre que esas personas pudiesen usar para trasladar su habilidades 
    educativas al entorno en línea.</em></p>
  <p><em>Mi convicción en las posibilidades aún por relizar de la educación basada 
    en Internet me llevaron a hacer un M&aacute;ster (Maestr&iacute;a) y un Doctorado 
    en Educación, combinando mi anterior carrera de Inform&aacute;tica (Ciencias 
    de la Computación) con el recientemente adquirido conocimiento sobre la naturaleza 
    del aprendizaje y la colaboración. Estoy influenciado particularmente por 
    la epistemolog&iacute;a del constructivismo social - que no s&oacute;lo trata 
    el aprendizaje como una actividad social, sino que presta atenci&oacute;n 
    al aprendizaje que ocurre al contruir activamente artefactos (como pueden 
    ser textos) para que otros los consunten o usen.</em></p>
  <p><em>Es crucial para m&iacute; que este programa sea f&aacute;cil de usar 
    - de hecho deber&iacute;a ser lo m&aacute;s intuitivo posible. </em></p>
  <p><em>Me he comprometido a continuar mi trabajo en Moodle y a mantenerlo Abierto 
    y Libre. Tengo una convicci&oacute;n profunda sobre la importancia de la educaci&oacute;n 
    sin restricciones y el refuerzo de la ense&ntilde;anza, y Moodle es medio 
    principal que tengo pra contribuir a la realizaci&oacute;n de estos ideales.</em></p>
</blockquote>

<p>Desde entonces Moodle ha progresado, a través de varios prototipos muy diferentes, 
  hasta el lanzamiento de la versión 1.0 hacia un mundo desconocido, el 20 de 
  agosto de 2002. Esta versi&oacute;n se orient&oacute; a las clases m&aacute;s 
  peque&ntilde;as, m&aacute;s intimas a nivel de Universidad, y fue objeto de 
  estudios de investigaci&oacute;n de casos concretos que analizaron con detalle 
  la naturaleza de la colaboraci&oacute;n y la reflexi&oacute;n que ocurr&iacute;a 
  entre estos peque&ntilde;os grupos de participantes adultos.</p>
<p>Desde entonces, han salido nuevas versiones que a&ntilde;ad&iacute;an nuevas 
  caracter&iacute;sticas, mayor compatibilidad y mejoras de rendimiento.</p>
<p>Al extenderse Moodle y haber crecido la comunidad, se consigue m&aacute;s informaci&oacute;n 
  de una mayor variedad de personas en diferentes situaciones de ense&ntilde;anza. 
  Por ejemplo, Moodle actualmente no s&oacute;lo se usa en las universidades, 
  tambi&eacute;n se usa en ense&ntilde;anza secundaria, ense&ntilde;anza primaria, 
  organziaciones sin &aacute;nimo de lucro, empresas privadas, profesores independientes 
  e incluso padres de alumnos. Un n&uacute;mero cada vez mayor de personas de 
  todo el Mundo contribuyen al desarrollo de Moodle de varias maneras - para m&aacute;s 
  detalles consulte la p&aacute;gina de <a href="?file=credits.html">Cr&eacute;ditos</a>. 
<p>Una importante caracter&iacute;stica del proyecto Moodle es la p&aacute;gina 
  web <a href="http://moodle.org" target="_top">moodle.org</a>, que proporciona 
  un punto central de informaci&oacute;n, discusi&oacute;n y colaboraci&oacute;n 
  entre los usuarios de Moodle, incluyendo administradores de sistemas, profesores, 
  investigadores, dise&ntilde;adores de sistemas de formaci&oacute;n y, por supuesto, 
  desarrolladores. Al igual que Moodle, esta web est&aacute; continuamente evolucionando 
  para ajustarse a las necesidades de la coumunidad, y al igul que Moodle, siempre 
  ser&aacute; Libre.
<p>A mediados del 2003, se ha presentado <a href="http://moodle.com/">moodle.com</a> 
  como una empresa que oferta soporte comercial adicional para aquellos que lo 
  necesiten, as&iacute; como una variedad de interesantes y novedosos servicios.
<p>Para m&aacute;s informaci&oacute;n sobre los planes de futuro para Moodle, 
  consulte el apartado de <a href="?file=future.html">Futuro</a></p>

<p align="CENTER"><font size="1"><a href="." target="_top">Documentaci&oacute;n 
  de Moodle</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>

</body>
</html>