<head>
    <title>Documentaci&oacute;n de Moodle: Futuro</title>
	<link rel="stylesheet" href="../theme/standard/styles.php" type="TEXT/CSS">
    <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
    <style type="text/css">
       DT {font-family: "Trebuchet MS", Verdana, Arial, Helvetica, sans-serif; font-weight: bold;}
       DD {margin-bottom:1em;} 
    </style>
</head>

<body bgcolor="#FFFFFF">
<h2>Futuro</h2>

<p>Al irse convirtiendo Moodle en un producto maduro, su orientaci&oacute;n est&aacute; 
  influida por la comunidad de desarrolladores y usuarios. Se puede consultar 
  una base de datos din&aacute;mica de propuestas de mejora y su estado en <a target=_top href="http://moodle.org/bugs/">moodle.org/bugs</a>. 
  Sus contribuciones <a href="?file=credits.html">contribuciones</a> en forma 
  de ideas, c&oacute;digo, comentarios y promoci&oacute;n son bienvenidas - consulte 
  el <a href="?file=developer.html"> Manual del desarrollador</a> para m&aacute;s 
  detalles.</p>
<p>Aqu&iacute; tiene un esbozo del futuro de Moodle (susceptible de modificaci&oacute;n):
<dl>
  <dt>Versi&oacute;n 1.2 - &iquest;Octubre de 2003?</dt>
  <dd>Entre los objetivos m&aacute;s importantes de esta versi&oacute;n est&aacute;n: 
    <ul>
      <li>Soporte para grupos/cohortes dentro de los cursos.</li>
      <li>Nueva arquitectura para las inscripciones con extensiones (como las 
        de la arquitectura de Autenticaci&oacute;n existente) de tal forma que 
        los sistemas externos (por ejemplo Registros de estudiantes, Paypal, LDAP, 
        etc.) puedan controlar el acceso de los estudiantes a los cursos.</li>
      <li>C&oacute;digo aportado variado y correcci&oacute;n de fallos.</li>
    </ul>
  </dd>
  <dt>Versi&oacute;n 2.0 - A principios de 2004</dt>
  <dd>Esta versi&oacute;n principal incluir&aacute; cambios importantes en la 
    estructura interna dise&ntilde;ada para a&ntilde;adir flexibilidad y escalabilidad 
    a muchas &aacute;reas. Entre los objetivos principales est&aacute;n: 
    <ul>
      <li> Reescritura de la capa de representaci&oacute;n usando c&oacute;digo 
        compatible XHTML e implementaci&oacute;n completa de plantillas para los 
        mayores est&aacute;ndares - compatibilidad, flexibilidad y accesibilidad 
      </li>
      <li> Uso mayor de las clases PHP en &aacute;reas clave del c&oacute;digo 
        de Moodle, para hacer que algunas cosas sean m&aacute;s sencillas para 
        los programadores que escriben nuevos m&oacute;dulos o que integran Moodle 
        con sistemas externos.</li>
      <li> Mayor soporte pedag&oacute;gico para profesores y estudiantes. </li>
      <li> Sistema de control de acceso que permita roles y derechos definidos 
        con precisi&oacute;n</li>
      <li>Soporte b&aacute;sico para IMS y SCORM </li>
      <li> Mayor integraci&oacute;n de Moodle con moodle.org</li>
      <li>Cualquier otra cosa que se nos ocurra :-)</li>
    </ul>
  </dd>
</dl>
<p align="CENTER">&nbsp;</p>
<p align="CENTER"><font size="1"><a href="." target="_top">Documentaci&oacute;n 
  de Moodle</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>
</body>
</html>