<p>Az egyes &uuml;zenetek oszt&aacute;lyozhat&oacute;k egy sk&aacute;la alapj&aacute;n, amely a <strong>k&uuml;l&ouml;n&aacute;ll&oacute; (egyedi) 
&eacute;s az &ouml;sszekapcsolt (integr&aacute;lt) tud&aacute;s</strong> elm&eacute;let&eacute;n alapul. Ezen elm&eacute;let szerint az emberi interakci&oacute;kat &uacute;jfajta 
megk&ouml;zel&iacute;t&eacute;sben szeml&eacute;lhetj&uuml;k. K&eacute;t k&uuml;l&ouml;nb&ouml;z&#337; m&oacute;dot &iacute;r le, melyeket 
&eacute;rt&eacute;kelhet&uuml;nk &eacute;s ismereteket szerezhet&uuml;nk az &aacute;ltalunk hallott &eacute;s l&aacute;tott dolgokr&oacute;l. 
J&oacute;llehet, a k&eacute;t m&oacute;dszert mindegyik&uuml;nk m&aacute;s-m&aacute;s id&#337;pontokban elt&eacute;r&#337; mennyis&eacute;gben 
alkalmazhatja, &eacute;rdemes p&eacute;ldak&eacute;nt &ouml;sszevetni k&eacute;t embert, akik k&ouml;z&uuml;l az egyik (A) alapvet&#337;en 
k&uuml;l&ouml;n&aacute;ll&oacute; tud&aacute;ssal, m&aacute;sikuk (B) t&ouml;bbnyire &ouml;sszekapcsolt tud&aacute;ssal rendelkezik.</p>
<ul>
  <li>'A' igyekszik lehet&#337;leg objekt&iacute;v maradni, &eacute;rzelmeit kirekeszteni. M&aacute;s, elt&eacute;r&#337; n&eacute;zeteket 
  vall&oacute; emberekkel folytatott megbesz&eacute;l&eacute;sei sor&aacute;n szereti megv&eacute;deni gondolatait, a logika 
  bevet&eacute;s&eacute;vel keresi partnere elgondol&aacute;saiban a h&eacute;zagokat. Kritikusan viszonyul az &uacute;j &ouml;tletekhez, hacsak 
  azok nem elismert tank&ouml;nyvekb&#337;l, tiszteletnek &ouml;rvend&#337; oktat&oacute;kt&oacute;l vagy saj&aacute;t k&ouml;zvetlen&uuml;l 
  tapasztal&aacute;s&aacute;b&oacute;l sz&aacute;rmaznak. 'A' egy igen <strong>egyedi tud&aacute;ssal </strong> 
  rendelkez&#337; szem&eacute;ly. </li>
  <li>'B' &eacute;rz&eacute;kenyebben viszonyul az emberekhez. Nagy emp&aacute;ti&aacute;val rendelkezik, odafigyel &eacute;s addig 
  pr&oacute;b&aacute;l k&eacute;rd&eacute;seket feltenni, am&iacute;g r&aacute; nem tud kapcsol&oacute;dni a gondolkod&aacute;s menet&eacute;re 
  &eacute;s "m&aacute;s szempontb&oacute;l nem tudja l&aacute;tni a dolgokat". &Uacute;gy tesz szert ismeretekre, hogy megosztja m&aacute;sokkal 
  azt a tapasztalatot, amely a n&aacute;luk felfedezett tud&aacute;shoz vezetett. M&aacute;sokkal besz&eacute;lve igyekszik elker&uuml;lni a 
  konfront&aacute;ci&oacute;t &eacute;s gyakran pr&oacute;b&aacute;l logikus javaslatokkal seg&iacute;ts&eacute;get ny&uacute;jtani m&aacute;soknak. 
  'B' egy igen <strong>integr&aacute;lt tud&aacute;ssal</strong> rendelkez&#337; szem&eacute;ly.</li>
</ul>
<p>A p&eacute;ld&aacute;kban a k&uuml;l&ouml;n&aacute;ll&oacute; tud&aacute;ssal rendelkez&#337; szem&eacute;ly tipikusan f&eacute;rfi, m&iacute;g 
az &ouml;sszekapcsolt tud&aacute;s ink&aacute;bb n&#337;kre jellemz&#337;. Ezt egyes vizsg&aacute;l&oacute;d&aacute;sok statisztikailag 
al&aacute;t&aacute;masztj&aacute;k ugyan, a val&oacute;s&aacute;gban az emberek valahol ezen k&eacute;t sz&eacute;ls&#337;s&eacute;g 
k&ouml;z&ouml;tt foglalnak helyet. Egy egy&uuml;ttm&#369;k&ouml;d&#337; &eacute;s hat&eacute;kony tanul&oacute;csoport eset&eacute;n a legjobb, ha 
mindk&eacute;t tud&aacute;st mindenki hasznos&iacute;tani tudja. On-line f&oacute;rum eset&eacute;n egy &uuml;zenetben ezen ism&eacute;rvek 
k&uuml;l&ouml;n-k&uuml;l&ouml;n, de egyszerre is megjelenhetnek. Az, aki &aacute;ltal&aacute;ban er&#337;sen &ouml;sszekapcsolt 
tud&aacute;sr&oacute;l tesz tan&uacute;bizonys&aacute;got, k&ouml;zz&eacute;tehet egy igencsak k&uuml;l&ouml;n&aacute;ll&aacute;st sugall&oacute; 
&uuml;zenetet, &eacute;s megford&iacute;tva. Az &uuml;zenetek jelen sk&aacute;la felhaszn&aacute;l&aacute;s&aacute;n alapul&oacute; 
oszt&aacute;lyoz&aacute;s&aacute;nak a c&eacute;lja:</p>
<blockquote>
a) el&#337;seg&iacute;teni az ilyen k&eacute;rd&eacute;seken val&oacute; elt&ouml;preng&eacute;st m&aacute;sok &uuml;zeneteinek az olvas&aacute;sa 
k&ouml;zben; <br /> b) visszajelz&eacute;st adni a szerz&#337;knek arr&oacute;l, hogyan l&aacute;tj&aacute;k &#337;ket m&aacute;sok.
</blockquote>
<p>Az eredm&eacute;ny a tanul&oacute;i &eacute;rt&eacute;kel&eacute;sben semmilyen szerepet nem j&aacute;tszik, feladata mind&ouml;ssze a 
kommunik&aacute;ci&oacute; &eacute;s a tanul&aacute;s el&#337;seg&iacute;t&eacute;se.</p>
<hr />
<p>Annak, akit &eacute;rdekelnek a r&eacute;szletek, al&aacute;bb k&ouml;zreadunk n&eacute;h&aacute;ny hivatkoz&aacute;st az adott elk&eacute;pzel&eacute;seket kidolgoz&oacute; szerz&#337;k munk&aacute;ira vonatkoz&oacute;an:</p> 
<ul>
  <li>Belenky, M.F., Clinchy, B.M., Goldberger, N.R., &amp; Tarule, J.M. (1986). Women's ways of knowing: the development of self, voice, and mind. New York, NY: Basic Books.</li>
  <li>Clinchy, B.M. (1989a). The development of thoughtfulness in college women: Integrating reason and care. American Behavioural Scientist, 32(6), 647-657.</li>
  <li>Clinchy, B.M. (1989b). On critical thinking &amp; connected knowing. Liberal education, 75(5), 14-19.</li>
  <li>Clinchy, B.M. (1996). Connected and separate knowing; Toward a marriage of two minds. In N.R. Goldberger, Tarule, J.M., Clinchy, B.M. </li>
  <li>Belenky, M.F. (Eds.), Knowledge, Difference, and Power; Essays inspired by &ldquo;Women&rsquo;s Ways of Knowing&rdquo; (pp. 205-247). New York, NY: Basic Books.</li>
  <li>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., &amp; Mansfield, A. F. (1999). A New Way of Assessing Ways of Knowing: The Attitudes Towards Thinking and Learning Survey (ATTLS). Sex Roles, 40(9/10), 745-766.</li>
  <li>Galotti, K. M., Reimer, R. L., &amp; Drebus, D. W. (2001). Ways of knowing as learning styles: Learning MAGIC with a partner. Sex Roles, 44(7/8), 419-436.  </li>
</ul>

