<?PHP // $Id$ 
      // admin.php - created with Moodle 1.4 development (2004060400)


$string['cachetext'] = 'ระยะเวลาที่เก็บไว้ในความจำสำรอง';
$string['filteruploadedfiles'] = 'ฟิลเตอร์ไฟล์อัพโหลด';
$string['upgradelogs'] = 'เพื่อให้เว็บไซต์ทำงานได้ตามปกติคุณควรจะทำการอัพเกรดบันทึกการใช้งานเว็บไซต์ <a href=\"$a\"> เพิ่มเติม </a>';
$string['upgradelogsinfo'] = 'มีการเปลี่ยนแปลงวิธีการเก็บไฟล์บันทึกการใช้งานเว็บไซต์เมื่อไม่นานนี้ ถ้าหากคุณต้องการดูบันทึกการใช้งานเก่าที่เก็บไว้คุณควรจะทำการอัพเกรดบันทึกนี้เสียก่อน ส่วนเวลาที่ใช้จะนานหรือไม่ขึ้นอยู่กับขนาดของเว็บไซต์ และขนาดของฐานข้อมูลที่มีอยู่ อาจจะใช้เวลาเป็นชั่วโมงก็ได้ ในการอัพเกรดเมื่อเริ่มอัพเกรดแล้วให้เปิดหน้าจอนี้ทิ้งไว้จนกว่าจะเสร็จสิ้นกระบวนการ สมาชิกอื่น ๆ ก็ยังสามารถใช้เว็บไซต์ได้ตามปกติในช่วงระยะเวลานี้  <b> คุณต้องการอัพเกรดบันทึกการใช้งานเว็บไซต์ตอนนี้เลยหรือเปล่าคะ ?</b>';
$string['upgradinglogs'] = 'อัพเกรดบันทึกการใช้งานเว็บไซต์';

?>
