<?PHP // $Id$ 
      // admin.php - created with Moodle 1.6 development (2005052400)


$string['blockinstances'] = 'ตัวอย่าง';
$string['blockmultiple'] = 'หลายส่วน';
$string['cachetext'] = 'ระยะเวลาที่เก็บไว้ในความจำสำรอง';
$string['change'] = 'เปลี่ยนแปลง';
$string['configallowunenroll'] = 'ถ้าเลือก \"ใช่\" นักเรียนสามารถออกจากการวิชาที่เรียนได้เองเมื่อไหร่ก็ได้ แต่ถ้าเลือก \"ไม่\" เฉพาะอาจารย์ หรือผู้ดูแลระบบเท่านั้นจึงสามารถทำได้';
$string['configallusersaresitestudents'] = 'ต้องการตั้งค่าให้สมาชิกทุกคนเป็นนักเรียนในกิจกรรมหน้าแรกของเว็บไซต์หรือไม่  ถ้าต้องการให้เลือก \"ใช่\"  ถ้าเลือก\"ไม่\"  เฉพาะสมาชิกที่เป็นนักเรียนในรายวิชาใดรายวิชาหนึ่งเท่านั้นจึงจะสามารถร่วมทำกิจกรรมในหน้าแรกได้  ผู้ดูและระบบและอาจารย์ที่ได้รับมอบหมายเป็นพิเศษเท่านั้นจึงจะเป็นอาจารย์ในหน้าแรกของเว็บไซต์ได้';
$string['configautologinguests'] = 'ให้บุคคลทั่วไปล็อกอินเข้าไปในรายวิชาที่อนุญาตให้บุคคลทั่วไปเข้าศึกษาอัตโนมัติหรือไม่';
$string['configcachetext'] = 'ค่าที่ตั้งนี้จะมีประโยชน์สำหรับเว็บไซต์ขนาดใหญ่หรือเว็บที่ใช้ฟิลเตอร์เพราะว่าสำเนาของข้อความจะถูกเก็บเอาไว้ในช่วงเวลาที่ระบุเอาไว้  หากระบุค่านี้ไว้ต่ำอาจจะทำให้เว็บช้าลงเล็กน้อยแต่ถ้าตั้งค่าไว้สูงเกินไปจะทำให้ใช้เวลานานในการรีเฟรช';
$string['configclamactlikevirus'] = 'กำหนดให้เป็นไฟล์ที่ติดไวรัส';
$string['configclamdonothing'] = 'กำหนดให้เป็นไฟล์ปกติ';
$string['configclamfailureonupload'] = 'ในกรณีที่กำหนดให้ clam ทำการสแกนอัพโหลดไฟล์ก่อนแต่มีการตั้งค่าไม่ถูกต้องทำให้ไม่สามารถทำงานได้ โดยไม่ทราบเหตุผลเบื้องต้น ระบบควรจะตัดสินใจอย่างไร...
ถ้าเลือก \"กำหนดให้เป็นไฟล์ที่ติดไวรัส\"  ระบบจะทำการย้ายไฟล์เหล่านี้ไปไว้ในไดเรกทอรีการันตีหรือลบไฟล์ดังกล่าว   ในกรณีที่เลือก \"กำหนดให้เป็นไฟล์ปกติ\" ระบบจะทำการย้ายไฟล์ไปยังไดเรกทอรีปลายทางเหมือนปกติ  ไม่ว่าจะเลือกรูปแบบใดผู้ดูแลระบบจะได้รับแจ้งก่อนเสมอว่า Clam ไม่ทำงาน ถ้าเลือก \"กำหนดให้เป็นไฟล์ที่ติดไวรัส\" และจะด้วยเหตุผลใดก็ตามที่ทำให้ Clam ไม่ทำงาน (ทั่วไปแล้วเกิดจากการระบุ path ไม่ถูกต้อง) ไฟล์ทั้งหมดจะถูกย้ายไปยังไดเรกทอรีการันตี หรือลบทิ้งไปจึงควรระมัดระวังในการตั้งค่านี้';
$string['configcountry'] = 'ถ้าหากคุณเลือกประเทศในส่วนนี้ ประเทศดังกล่าวจะเป็น ค่าหลักสำหรับสมาชิกใหม่ ถ้าต้องการให้สามาชิกเลือกประเทศไม่จำเป็นต้องใส่ค่าใด ๆ';
$string['configdbsessions'] = 'ถ้าเปิดใช้งานค่านี้ ระบบจะเก็บข้อมูลเกี่ยวกับเซสชันปัจจุบันไว้ในฐานข้อมูล การตั้งค่านี้มีประโยชน์สำหรับไซต์ที่ใหญ่และมีผู้ใช้จำนวนมาก สำหรับเว็บไซต์ทั่วไปไม่แนะนำให้เปิดใช้งานเพราะเป็นการเปลืองพื้นที่โดยใช่เหตุ พึงระลึกไว้ว่าการเปลี่ยนค่านี้จะทำให้สมาชิกทั้งหมดที่กำลังใช้งานในระบบถูกนำออกจากระบบ';
$string['configdebug'] = 'ถ้าหากคุณเปิดใช้ส่วนนี้ เมื่อมีข้อผิดพลาดของ โค้ด PHP  จะมีการแสดงผลข้อผิดพลาดให้ทราบ มีประโยชน์สำหรับนักพัฒนาโปรแกรม';
$string['configdeleteunconfirmed'] = 'หากเลือกใช้การอนุมัติผ่านอีเมล นี่เป็นการระบุระยะเวลาในการตอบรับการเป็นสมาชิกจากผู้สมัคร หลังจากระยะเวลาที่ระบุไว้นี้ accounts ที่ไม่มีการยืนยันจะถูกลบทิ้งไป';
$string['configdigestmailtime'] = 'สมาชิกที่เลือกให้มีการส่งอีเมลในรูปแบบ ไดเจสท์ นั่นคือจะมีส่งอีเมลไปยังสมาชิกทุกวันในเวลาที่กำหนดไว้ (เช่นถ้าคุณตั้ง cron script ไว้ทุกหนึ่งชั่วโมง ก็จะมีการส่งอีเมลในชั่วโมงต่อไป)';
$string['configdisplayloginfailures'] = 'เลือกแสดงผลการล็อกอินเข้าสู่ระบบที่ไม่สำเร็จครั้งที่ผ่านมาให้สมาชิกได้ทราบ';
$string['configenablerssfeeds'] = 'การอนุญาตให้ใช้งาน RSS  ข้ามเว็บไซต์ หากท่านต้องการเห็นข้อแตกต่างให้ทำการอนุญาตการใช้ RSS ในแต่ละโมดูลด้วย  สามารถทำได้โดยการไปที่ การตั้งค่าโมดูล ในหน้าการจัดการระบบ';
$string['configenablerssfeedsdisabled'] = 'ไม่สามารถใช้งานได้เพราะว่าไม่มีการอนุญาตให้ใช้งาน RSS  สำหรับทั้งเว็บไซต์  หากต้องการใช้งานให้ไปที่ การตั้งค่าตัวแปรในหน้าการจัดการระบบ';
$string['configerrorlevel'] = 'เลือกจำนวนการเตือนของ PHP ที่ต้องการให้แสดง ควรเลือก ปกติ ( Normal)';
$string['configextendedusernamechars'] = 'การตั้งค่านี้เป็นการอนุญาตให้นักเรียนใช้อักษรอะไรก็ได้ในชื่อผู้ใช้ (ไม่มีผลกระทบกับชื่อจริง) ค่าที่ระบบตั้งไว้ คือ \"ไม่\"  นั่นคืออนุญาตให้นักเรียนใช้ชื่อผู้ใช้ได้เฉพาะตัวหนังสือและตัวเลขเท่านั้น';
$string['configfilteruploadedfiles'] = 'การเลือกค่านี้จะทำให้ Moodle ทำการประมวลผล ไฟล์ html และ text โดยผ่านฟิลเตอร์ก่อนที่จะแสดงผล';
$string['configforcelogin'] = 'ปกติแล้วบุคคลทั่วไปสามารถเข้าไปยังหน้าแรกของเว็บไซต์และหน้ารวมรายวิชา โดยไม่จำเป็นต้องล็อกอินเข้าสู่ระบบแต่ถ้าหากต้องการบังคับให้สมาชิกล็อกอินก่อนก็ให้เลือกตัวเลือกนี้';
$string['configforceloginforprofiles'] = 'การเลือกค่านี้เป็นค่าบังคับให้สมาชิก ล็อกอินเข้าสู่ระบบด้วย account จริง ๆ ก่อนที่จะเข้าไปดูหน้าประวัติส่วนตัวของสมาชิกคนอื่นได้  ค่าที่ตั้งไว้เบื้องต้นคือ\"ไม่อนุญาต (false)\" เพื่อให้นักเรียนสามารถดูรายละเอียดของผู้สอนได้ ซึ่งก็หมายความว่า เว็บที่ใช้ในการค้นหาก็สามารถแสดงรายละเอียดดังกล่าวนี้ได้เช่นกัน';
$string['configframename'] = 'หากคุณฝังโปรแกรมนี้ไว้ในเฟรม ให้ใส่ชื่อของเฟรมไว้ตรงนี้ ไม่อย่างนั้นแล้วค่าจะเป็น _top';
$string['configfullnamedisplay'] = 'ตัวเลือกนี้จะเป็นการแสดงชื่อของสมาชิกว่าต้องการให้แสดงผลอย่างไร ค่าที่ตั้งไว้คือ ชื่อจริง และ นามสกุล แต่คุณสามารถเลือกที่จะซ่อนนามสกุล หรือว่าทิ้งไว้ให้ระบบเลือกให้เองอัตโนมัติขึ้นอยู่กับภาษาที่ใช้';
$string['configgdversion'] = 'เวอร์ชั่นของ  GD ที่ติดตั้งอยู่ ที่เลือกอยู่นี้เป็นการเลือกอัตโนมัติ กรุณาอย่าเปลี่ยนแปลงหากไม่แน่ใจ';
$string['confightmleditor'] = 'เลือกที่จะให้มีการแก้ไขโดยใช้โค้ด HTML หรือไม่  ถึงแม้เลือกที่จะใช้ โค้ดดังกล่าวจะทำงานได้กับ IE 5.5 ขึ้นไป';
$string['configidnumber'] = 'ระบุตัวเลือกนี้  a. ไม่มีการถามหมายเลข ID    b. ถาม ID จากสมาชิกแต่จะเติมหรือไม่ก็ได้ c.ถาม ID จากสมาชิกและจำเป็นต้องเติม ในกรณีที่เลือกให้แสดงเลขประจำตัวในหน้าข้อมูลส่วนตัว';
$string['configintro'] = 'คุณสามารถระบุตัวเลขของตัวแปรต่าง ๆ เพื่อให้ Moodle ทำงานบนเซิร์ฟเวอร์ของคุณโดยไม่มีปัญหา  โดยทั่วไปแล้วค่าที่ตั้งไว้ของโปรแกรมก็สามารถทำงานได้โดยไม่มีปํญหา คุณสามารถกลับมาแก้ไขหน้านี้ภายหลังได้';
$string['configintroadmin'] = 'ในหน้านี้คุณควรระบุผู้ดูแลระบบที่มีสิทธิในการจัดการเว็บไซต์  ทั้งนี้คุณสามารถเพิ่มเติมผู้ดูแลรายอื่นได้ในภายหลัง';
$string['configintrosite'] = 'ในหน้านี้คุณสามารถกำหนดรูปแบบและชื่อของเว็บไซต์ได้ และสามารถเปลี่ยนแปลงในภายหลังได้';
$string['configlang'] = 'เลือกภาษาหลักสำหรับเว็บไซต์  คุณสามารถเลือกเปลี่ยนเป็นภาษาอื่นได้ในภายหลัง';
$string['configlangdir'] = 'ภาษาส่วนใหญ่แล้ว จะพิมพ์จากซ้ายไปขวา แต่บางประเภท เช่น อาราบิก ฮิบรู จะพิมพ์จากขวาไปซ้าย';
$string['configlanglist'] = 'ไม่เติมก็ได้:: ถ้าคุณต้องการให้สมาชิกเลือกภาษาทั้งหมดที่คุณติดตั้ง อย่างไรก็ตามคุณสามารถให้เลือกได้เฉพาะบางภาษาได้   ตัวอย่างเช่น:   th,en,de';
$string['configlangmenu'] = 'เลือกที่จะแสดงและไม่แสดงตัวเปลี่ยนภาษา ';
$string['configlocale'] = 'เลือก locale เช่นลักษณะ ของแป้นพิมพ์ ตัวอักษร ภาษา วันที่ คุณต้องมี Locale นี้ติดตั้งในเครื่องของคุณ ถ้าหากไม่ทราบว่าจะเลือกอะไรให้ปล่อยว่างไว้ <b> สำหรับภาษาไทยให้ใส่ th_TH</b>';
$string['configloginhttps'] = 'หากเลือกข้อนี้ moodle จะใช้วิธีการติดต่อกับเซิร์ฟเวอร์โดยผ่าน secure https ในการล็อกอินเข้าสู่ระบบแต่ละครั้ง จากนั้นจะทำการเปลี่ยนมาใช้ http ธรรมดาเพื่อช่วยให้การใช้งานเร็วขึ้น 

คำเตือน ::  เว็บเซิร์ฟเวอร์จำเป็นต้องอนุญาตให้ใช้ Https ได้จึงจะสามารถตั้งค่านี้ได้  ถ้าหากค่าดังกล่าวไม่ได้รับการติดตั้งไว้ก่อนจะทำให้คุณถูกทำให้ออกจากระบบได้';
$string['configloglifetime'] = 'กำหนดช่วงเวลาเก็บบันทึกการใช้งานเว็บไซต์ของสมาชิก กำหนดให้นานเท่าที่คุณต้องการ แต่ทั้งนี้ก็จะทำให้มีการใช้ทรัพยากรระบบมากขึ้นตามไปด้วย สำหรับเว็บไซต์ที่มีสมาชิกจำนวนมากควรตั้งค่านี้ให้น้อยลง';
$string['configlongtimenosee'] = 'ถ้านักเรียนไม่ได้ล็อกอินเป็นเวลานาน ระบบจะทำการตัดชื่อนักเรียนออกจากรายวิชาที่เรียนโดยอัตโนมัติ ';
$string['configmaxbytes'] = 'ระบุขนาดไฟล์ที่ใหญ่ที่สุดที่สามารถจะอัพโหลดขึ้นบนเว็บไซต์ได้ ค่านี้จะถูกกำหนดไว้แล้วโดยเซิร์ฟเวอร์ เป็นการตั้งค่าของ PHP upload_max_filesize  และ Apache LimitRequestBody  แต่คุณก็สามารถจะระบุขนาดไฟล์ได้ตราบใดที่ไม่เกินค่าที่ตั้งไว้ก่อนแล้ว';
$string['configmaxeditingtime'] = 'ในส่วนนี้เป็นการระบุ เวลาที่ให้สมาชิก แก้ไข้โพสต์ของตน บนกระดาน รายงานความก้าวหน้า  feedback ส่วนใหญ่แล้ว ประมาณสามสิบนาที กำลังพอดี';
$string['confignoreplyaddress'] = 'ในบางครั้งระบบจะทำการส่งอีเมลในฐานะของสมาชิก เช่น ในกรณีโพสต์ในกระดานเสวนา อีเมลที่คุณระบุไว้ในหน้าประวัติส่วนตัวจะนำมาใช้ในช่อง From  แต่ถ้าสมาชิกไม่ต้องการให้ใครเห็นอีเมลให้ตั้งค่าไม่แสดงอีเมล ผู้รับจะไม่สามารถตอบเมล์ถึงสมาชิกได้โดยตรง';
$string['confignotifyloginfailures'] = 'ถ้าหากมีการบันทึกการล็อกอินเข้าสู่ระบบที่ไม่สำเร็จ ให้ระบบทำการส่งอีเมล์ออกไปถึงใครบ้าง';
$string['confignotifyloginthreshold'] = 'ถ้าเลือกที่จะแจ้งให้สมาชิกทราบเมื่อมีการล็อกอินไม่สำเร็จเกิดขึ้น  ต้องการให้สมาชิกล็อกอินได้กี่ครั้งต่อหนึ่งสมาชิกต่อหนึ่ง IP';
$string['configopentogoogle'] = 'ถ้าหากเลือกใช้ตัวเลือกนี้ Google จะสามารถเข้ามายังเว็บไซต์ของคุณในฐานะบุคคลทั่วไป ผู้ที่เข้ามาเว็บไซต์ของคุณผ่านทาง Google ก็จะมีการล็อกอินในฐานะบุคคลทั่วไปโดยอัตโนมัติ';
$string['configpathtoclam'] = 'Path ของ Clam AV เช่น  /usr/bin/clamscan or /usr/bin/clamdscan ต้องระบุค่านี้หากต้องการสแกนไวรัสในไฟล์';
$string['configproxyhost'] = 'ถ้า <b>server</b> จำเป็นต้องใช้ PROXY ในการเข้าอินเทอร์เน็ต ให้ระบุ proxy host และ port ในส่วนนี้';
$string['configquarantinedir'] = 'ถ้าคุณต้องการให้ Clam AV ทำการย้ายไฟล์ที่ติดไวรัสไปไว้ในไดเรกทอรีการันตีให้ระบุชื่อไดเรกทอรีดังกล่าวที่นี่  โดยไดเรกทอรีนี้จะต้องได้รับสิทธิ์ให้เขียนลงไดเรกทอรีได้ ถ้าหากปล่อยให้ช่องนี้ว่างไว้หรือระบุชื่อไดเรกทอรีที่ไม่มีอยู่จริง ไฟล์ที่ติดไวรัสจะถูกลบทิ้งทั้งหมด  

หมายเหตุ : ไม่ควรใส่เครื่องหมายสแลช';
$string['configrunclamonupload'] = 'เปิดใช้งาน Clam AV สำหรับไฟล์อัพโหลดหรือไม่?  ต้องแก้ไข path ชี้ไปยัง Clam ให้ถูกต้อง ( Clam AV เป็นโปรแกรมสแกนไวรัสฟรี ไม่มีค่าใช้จ่ายสามารถดาวน์โหลดได้ที่ http://www.clamav.net)';
$string['configsecureforms'] = 'การกำหนดระดับการรักษาความปลอดภัยในการรับข้อมูลจากสมาชิก ทั้งนี้อาจก่อให้สมาชิกบางคนที่ติดตั้งระบบไฟร์วอลไม่สามารถใช้งานได้';
$string['configsessioncookie'] = 'ตั้งชื่อของ cookies ที่ใช้ในแต่ละครั้งซึ่งไม่จำเป็นต้องระบุ การตั้งชื่อนี้จะมีประโยชน์ในกรณีที่คุณมี moodle อยู่บนเซิร์ฟเวอร์มากกว่าหนึ่งก้อปปี้';
$string['configsessiontimeout'] = 'ถ้าหากสมาชิกใช้ล็อกอินเป็นเวลานานโดยที่ไม่ได้เปิดดูหน้า ใดๆ เลย ระบบจะทำการล็อกเอาท์ให้อัตโนมัติ ภายในเวลาที่คุณระบุนี้';
$string['configshowsiteparticipantslist'] = 'รายชื่อของนักเรียนและอาจารย์ทั้งหมดบนเว็บนี้จะมีการแสดงไว้บนเว็บ กรุณาเลือกผู้ที่คุณอนุญาตให้มองเห็นรายการดังกล่าว';
$string['configslasharguments'] = 'ไฟล์ เช่น ภาพ อัพโหลด  จะถูกส่งผ่านสคริปต์ โดยใช้\'slash arguments\' (ตัวเลือกที่สอง) วิธีนี้ทำให้ ง่ายต่อการเก็บไฟล์ไว้ในระบบความจำชั่วคราวบนเว็บบราวเซอร์ หรือ  พร็อกซี่เซิร์ฟเวอร์  แต่กระนั้น สำหรับ php เซริฟ์เวอร์ บางประเภท ไม่สามารถจะใช้วิธีนี้ได้ จึงทำให้เกิดปัญหาในการดูไฟล์ที่อัพโหลดขึ้นไป หรือ การดูภาพ  ให้แก้ ปัญหาโดยการเลือกตัวแปรนี้เป็น ตัวเลือกที่หนึ่ง';
$string['configsmtphosts'] = 'ใส่ชื่อเต็มของ SMTP เซิร์ฟเวอร์ ที่โปรแกรม Moodle จะใช้สำหรับส่งเมล์ (เช่น mail.a.acom หรือ  mail.b.com; mail.c.com) ถ้าหากคุณทิ้งว่างไว้ moodle จะเลือกใช้ ค่าที่ตั้งไว้แล้ว ในการส่งเมล์';
$string['configsmtpuser'] = 'หากต้องการระบุ  SMTP เซิร์ฟเวอร์ข้างต้น และ เซิร์ฟเวอร์ต้องการรหัสผ่านให้ทำการ ใส่ username และ password';
$string['configteacherassignteachers'] = 'ครูทั่วไปสามารถตั้งครูเพิ่มในรายวิชาของตัวเองได้หรือไม่ ถ้าไม่ เฉพาะผู้ดูแลระบบและผู้สร้างเท่านั้นที่สามารถ จะตั้งครูเพิ่มได้';
$string['configtimezone'] = 'คุณสามารถตั้งโซนเวลาที่คุณอยู่ได้ โดยโซนเวลาที่คุณอยู่อาจไม่ตรงกับเวลาของเซิร์ฟเวอร์ ซึ่งเวลาดังกล่าวจะใช้ตลอดทั้งเว็บไซต์  สมาชิกสามารถที่จะเปลี่ยนโซนเวลาดังกล่าวให้ตรงกับที่ตนเองอยู่ได้';
$string['configunzip'] = 'แสดงที่ตั้งที่ติดตั้งโปรแกรม unzip ในระบบยูนิกซ์ เท่านั้น  สำหรับคลาย zip ไฟล์ นามสกุล .zip บนเซิร์ฟเวอร์';
$string['configvariables'] = 'แก้ไขตัวแปร';
$string['configwarning'] = 'ระวังในการเปลี่ยนแปลงค่าต่าง ๆ เหล่านี้ การตั้งค่าผิดพลาดจะทำให้เกิดปัญหาได้';
$string['configzip'] = 'แสดงที่ตั้งที่ติดตั้งโปรแกรม zip ในระบบยูนิกซ์ เท่านั้น  สำหรับเก็บไฟล์ นามสกุล .zip ไว้บนเซิร์ฟเวอร์';
$string['filteruploadedfiles'] = 'ฟิลเตอร์ไฟล์อัพโหลด';
$string['upgradelogs'] = 'เพื่อให้เว็บไซต์ทำงานได้ตามปกติคุณควรจะทำการอัพเกรดบันทึกการใช้งานเว็บไซต์ <a href=\"$a\"> เพิ่มเติม </a>';
$string['upgradelogsinfo'] = 'มีการเปลี่ยนแปลงวิธีการเก็บไฟล์บันทึกการใช้งานเว็บไซต์เมื่อไม่นานนี้ ถ้าหากคุณต้องการดูบันทึกการใช้งานเก่าที่เก็บไว้คุณควรจะทำการอัพเกรดบันทึกนี้เสียก่อน ส่วนเวลาที่ใช้จะนานหรือไม่ขึ้นอยู่กับขนาดของเว็บไซต์ และขนาดของฐานข้อมูลที่มีอยู่ อาจจะใช้เวลาเป็นชั่วโมงก็ได้ ในการอัพเกรดเมื่อเริ่มอัพเกรดแล้วให้เปิดหน้าจอนี้ทิ้งไว้จนกว่าจะเสร็จสิ้นกระบวนการ สมาชิกอื่น ๆ ก็ยังสามารถใช้เว็บไซต์ได้ตามปกติในช่วงระยะเวลานี้  <b> คุณต้องการอัพเกรดบันทึกการใช้งานเว็บไซต์ตอนนี้เลยหรือเปล่าคะ ?</b>';
$string['upgradesure'] = 'มีการเปลี่ยนแปลงไฟล์ใน Moodle  โปรแกรมจะทำการอัพเกรดเซิร์ฟเวอร์ของคุณเป็นเวอร์ชั่น<p><b>$a</b> อัตโนมัติ</p>
<p>หลังจากอัพเกรดแล้วคุณไม่สามารถกลับไปใช้เวอร์ชั่นเดิมได้นะคะ</p> 
<p>แน่ใจหรือเปล่าคะว่าต้องการอัพเกรดเซิร์ฟเวอร์ด้วยเวอร์ชั่นใหม่ <p>';
$string['upgradinglogs'] = 'อัพเกรดบันทึกการใช้งานเว็บไซต์';

?>
