<?PHP // $Id$ 
      // admin.php - created with Moodle 1.3 (2004052500)


$string['cachetext'] = 'เว าท ่เก็ ข้ ควา ไว้ใ ควา จำ ำ  ง';
$string['filteruploadedfiles'] = 'ไ  ์ ิ เต  ์ท ่ ัพโ   ';
$string['upgradelogs'] = ' ากต้ งกา ใ ้ ั ทึกกา ใช้งา เว็ ไซต์เ ิ ใช้กา ไ ้ก ุ า ัพเก  ค่ะ <a href=\"$a\"> า  ะเ    เพิ่ เติ </a>';
$string['upgradelogsinfo'] = 'ใ กา    ั ทึกกา ใช้งา เว็ ไซต์เ ิ จะต้ งทำกา  ัพเก  ก่  ค่ะ  ่ว เว าท ่ใช้ใ กา  ัพเก   ั้ ขึ้    ่กั เว็ ไซต์ข งคุ   างเว็  าจจะใช้เว าเ ็ ฃั่วโ ง  างเว็   าจจะใช้เว าเพ  งไ ่ก ่ าท   ากเ ิ่ ทำกา  ัพเก  แ ้วคว จะ  ่  ใ ้เว็  ัพเก  จ  ิ้  ุ ก ะ ว กา  คุ  ัง า า ถใช้เว็ ไซต์ไ ้ตา  กติใ ข ะท ่เว็ กำ ังทำกา  ัพเก  ข้     ังก ่าว  .<br /><br /> ต้ งกา  ัพเก  ต    ้ไ  คะ';
$string['upgradinglogs'] = ' ัพเก   ั ทึกกา ใช้งา เว็ ไซต์';

?>
