<?PHP // $Id$ 
      // admin.php - created with Moodle 1.2 Beta (2004022400)


$string['cachetext'] = 'เวลาที่เก็บข้อความไว้ในความจำสำรอง';
$string['upgradelogs'] = 'หากต้องการให้บันทึกการใช้งานเว็บไซต์เดิมใช้การได้กรุณาอัพเกรดค่ะ <a href=\"$a\">รายละเอียดเพิ่มเติม</a>';
$string['upgradelogsinfo'] = 'ในการดูบันทึกการใช้งานเว็บไซต์เดิมจะต้องทำการอัพเกรดก่อนค่ะ ส่วนเวลาที่ใช้ในการอัพเกรดนั้นขึ้นอยู่กับเว็บไซต์ของคุณ บางเว็บอาจจะใช้เวลาเป็นฃั่วโมง บางเว็บ อาจจะใช้เวลาเพียงไม่กี่นาที หากเริ่มทำการอัพเกรดแล้วควรจะปล่อยให้เว็บอัพเกรดจนสิ้นสุดกระบวนการ คุณยังสามารถใช้เว็บไซต์ได้ตามปกติในขณะที่เว็บกำลังทำการอัพเกรดข้อมูลดังกล่าว  .<br /><br /> ต้องการอัพเกรดตอนนี้ไหมคะ';
$string['upgradinglogs'] = 'อัพเกรดบันทึกการใช้งานเว็บไซต์';

?>
