<?PHP // $Id$ 
      // block_glossary_random.php - created with Moodle 1.6 development (2005072200)


$string['addentry'] = 'เพิ่มคำศัพท์';
$string['askaddentry'] = 'เมื่อสมาชิกเพิ่มคำศัพท์ลงในอภิธานศัพท์แล้ว แสดงลิงก์ด้วยข้อความนี้';
$string['askinvisible'] = 'เมื่อสมาชิกไม่สามารถแก้ไขหรือดูอภิธานศัพท์ได้ให้แสดงข้อความ(ไม่มีลิงก์)';
$string['askviewglossary'] = 'เมื่อสมาชิกสามารถดูอภิธานศัพท์แต่ไม่สามารถเพิ่มคำศัพท์ได้ให้แสดงลิงก์ด้วยข้อความนี้';
$string['blockname'] = 'สุ่มคำศัพท์';
$string['intro'] = 'ตรวจสอบให้แน่ใจว่าในอภิธานศัพท์มีคำศัพท์อย่างน้อย 1 คำ จากนั้นจึงสามารถปรับค่าต่อไปนี้';
$string['invisible'] = '(อ่านต่อคราวหน้า)';
$string['lastmodified'] = 'แก้ไขครั้งล่าสุด';
$string['nextone'] = 'คำต่อไป';
$string['noentriesyet'] = 'ยังไม่มีคำศัพท์ในอภิธานศัพท์นี้';
$string['notyetconfigured'] = 'กรุณาตั้งค่าบล็อคนี้โดยคลิกที่ไอคอนแก้ไข';
$string['notyetglossary'] = 'ต้องมีอภิธานศัพท์ให้เลือกอย่างน้อย 1 อัน';
$string['random'] = 'สุ่มคำศัพท์';
$string['refresh'] = 'จำนวนวันก่อนที่คำศัพท์ใหม่จะถูกเลือก';
$string['select_glossary'] = 'ใช้คำศัพท์จากอภิธานศัพท์นี้';
$string['showconcept'] = 'แสดงหัวข้อคำศัพท์พร้อมความหมาย';
$string['title'] = 'หัวข้อ';
$string['type'] = 'จำนวนคำที่เลือก';
$string['typehelp'] = '<b>คำศัพท์ที่แก้ไขล่าสุด</b> จะแสดงคำศัพท์ที่ได้รับการแก้ไขล่าสุด <b>สุ่มคำศัพท์</b> จะเลือกคำศัพท์แบบสุ่มในแต่ละครั้งที่มีการรีเฟรชหน้าจอ  <b>คำศัพท์ต่อไป</b>จะแสดงคำศัพท์เรียงตามลำดับโดยแสดงต่อเนื่องจากครั้งสุดท้ายที่มีการแสดงคำศัพท์ก่อนหน้า มีประโยชน์เมื่อมีการเลือกจำนวนวันที่ต้องการแสดงไปพร้อมกันด้วย ทำให้คุณสามารถสร้าง <i>คำคมประจำสัปดาห์k</i> หรือ <i>เทคนิคประจำวัน</i> แนะนำแก่สมาชิกทุกคน';
$string['viewglossary'] = 'คำศัพท์อื่น ๆ';
$string['whichfooter'] = 'สามารถแสดงลิงก์เพื่อทำการใด ๆ บนอภิธานศัพท์ที่เกี่ยวข้อกับบล็อคนี้ บล็อคจะทำหน้าที่แสดงลิงก์เมนูที่เปิดใช้สำหรับอภิธานศัพท์ดังกล่าวเท่านั้น';

?>
