<?PHP // $Id$ 
      // install.php - created with Moodle 1.6 development (2005101200)


$string['admindirerror'] = 'ไดเรกทอรี admin ที่ระบุไม่ถูกต้อง';
$string['admindirname'] = 'ไดเรกทอรี admin';
$string['admindirsetting'] = 'มีเว็บโฮสต์จำนวนน้อยที่ใช้ /admin  ในการติดตั้งระบบควบคุมเว็บไซต์เอาไว้ ซึ่งเป็นชื่อเดียวกับหน้าผู้ดูแลระบบใน moodle  วิธีหลีกเลี่ยงปัญหาคือให้คุณเปลี่ยนชื่อ admin ใน Moodle เป็นชื่ออื่นในระหว่างการติดตั้ง และใส่ชื่อใหม่ที่ต้องการตัวอย่างเช่น moodleadmin';
$string['caution'] = 'คำเตือน';
$string['chooselanguage'] = 'เลือกภาษา';
$string['compatibilitysettings'] = 'ตรวจสอบการตั้งค่า PHP';
$string['configfilenotwritten'] = 'ตัวติดตั้งอัตโนมัติไม่สามารถสร้างไฟล์ config.php ได้ อาจเป็นเพราะว่าไม่สามารถเขียนลงไดเรกทอรี moodle ได้ คุณสามารถสร้างไฟล์ดังกล่าวได้เองโดยการก้อปปี้โค้ดต่อไปนี้ลงในไฟล์ที่ต้องการสร้างใหม่';
$string['configfilewritten'] = 'สร้าง config.php เรียบร้อยแล้ว';
$string['configurationcomplete'] = 'ตั้งค่าตัวแปรเสร็จสิ้นแล้ว';
$string['database'] = 'ฐานข้อมูล';
$string['databasecreationsettings'] = 'คุณจำเป็นต้องตั้งค่าฐานข้อมูลที่ใช้ในการเก็บข้อมูลของ moodle ฐานข้อมูลดังกล่าวจะต้องมีการสร้างไว้แล้วล่วงหน้า 
<br /> <br />

<b>ประเภท:</b> ตั้งค่าไว้ที่ mysql <br />

<b>โฮสต์:</b> ตั้งค่าไว้ที่ localhost <br />

<b>ชื่อฐานข้อมูล:</b> ชื่อฐานข้อมูล, เช่นmoodle<br />

<b>ชื่อผู้ใช้ (username):</b>ตั้งค่าไว้ที่ root <br />

<b>รหัสผ่าน:</b> รหัสผ่านเข้าฐานข้อมูล<br />

<b>คำนำหน้าตาราง:</b> คำนำหน้าตาราง มีประโยชน์หากมีฐานข้อมูลของหลายโปรแกรมทำให้แยกออกได้ง่ายว่า ตารางใดเป็นของโปรแกรมใด เช่น mdl_';
$string['databasesettings'] = 'คุณจำเป็นต้องตั้งค่าฐานข้อมูลที่ใช้ในการเก็บข้อมูลของ moodle ฐานข้อมูลดังกล่าวจะต้องมีการสร้างไว้แล้วล่วงหน้า 
<br /> <br />

<b>ประเภท:</b> mysql หรือ postgres7<br />

<b>โฮสต์:</b> เช่น  localhost หรือ db.isp.com<br />

<b>ชื่อฐานข้อมูล:</b> ชื่อฐานข้อมูล, เช่นmoodle<br />

<b>ชื่อผู้ใช้ (username):</b> username ของฐานข้อมูล<br />

<b>รหัสผ่าน:</b> รหัสผ่านเข้าฐานข้อมูล<br />

<b>คำนำหน้าตาราง:</b> คำนำหน้าตาราง มีประโยชน์หากมีฐานข้อมูลของหลายโปรแกรมทำให้แยกออกได้ง่ายว่า ตารางใดเป็นของโปรแกรมใด เช่น mdl_';
$string['dataroot'] = 'ไดเรกทอรีข้อมูล';
$string['datarooterror'] = 'ไม่พบไดเรกทอรีข้อมูลที่คุณระบุไว้หรือไม่สามารถสร้างได้ กรุณาแก้ไข Path ให้ถูกต้องหรือสร้างไดเรกทอรีนี้ใหม่';
$string['dbconnectionerror'] = 'ไม่สามารถติดต่อฐานข้อมูลที่คุณระบุไว้ได้ กรุณาตรวจสอบค่าที่ตั้งไว้ของฐานข้อมูล';
$string['dbcreationerror'] = 'มีข้อผิดพลาดในการสร้างฐานข้อมูล ไม่สามารถสร้างฐานข้อมูลที่ระบุด้วยค่าที่ให้ไว้ได้';
$string['dbhost'] = 'โฮสต์เซิร์ฟเวอร์';
$string['dbpass'] = 'รหัสผ่าน';
$string['dbprefix'] = 'คำนำหน้าตาราง (Table Prefix)';
$string['dbtype'] = 'ประเภท';
$string['directorysettings'] = '<p>กรุณายืนยันที่ตั้งของการติดตั้ง  Moodle .</p>

<p><b>ที่อยู่ของเว็บ (Web Address):</b>

ระบุที่อยู่ของเว็บไซต์ที่คุณจะนำ Moodle ไปใช้ ถ้าหากเว็บของคุณเข้าผ่าน URLs หลายขั้นให้เลือกที่นักเรียนของคุณจะเข้าไปใช้ ไม่ต้องใส่เครื่องหมาย /  ปิดท้าย</p>

<p><b>ไดเรกทอรี moodle </b>

ระบุ path ของไดเรกทอรีเต็ม ๆ ที่ใช้ในการติดตั้ง ระวังเรื่องการใช้ชื่อตัวพิมพ์ใหญ่พิมพ์เล็กให้ดี ให้แน่ใจว่าถูกต้อง </p>

<p><b>ไดเรกทอรีข้อมูล:</b>

ไดเรกทอรีนี้จะเป็นที่เก็บไฟล์ที่ moodle จะทำการบันทึกไว้ เป็นข้อมูลของเว็บ ดังนั้นควรให้สิทธิ์ในการอ่าน และ เขียนลงไดเรกทอรีนี้  (ทั่วไปแล้ว \'nobody\' หรือ \'apache\') แต่ไม่ควรเข้าไปตรง ๆ ผ่านเว็บได้
</p>';
$string['dirroot'] = 'Moodle ไดเรกทอรี';
$string['dirrooterror'] = 'การตั้งค่า ไดเรกทอรี moodle ไม่ถูกต้อง ไม่พบไฟล์ติดตั้งที่ระบุ  ระบบทำการรีเซ็ตค่าด้านล่างนี้ ';
$string['download'] = 'ดาวน์โหลด';
$string['fail'] = 'ล้มเหลว';
$string['fileuploads'] = 'ไฟล์อัพโหลด';
$string['fileuploadserror'] = 'ควรจะเปิด(on)';
$string['fileuploadshelp'] = '<p>เซิร์ฟเวอร์ไม่ให้ใช้ไฟล์อัพโหลด</p>

<p>คุณสามารถติดตั้ง Moodle ได้ถึงแม้ค่านี้จะยังไม่ได้มีการอนุญาตแต่จะไม่สามารถอัพโหลดไฟล์ในด ๆ หรือรูปภาพประกอบประวัติส่วนตัวของสมาชิกได้

<p>ให้ติดต่อเว็บเซิร์ฟเวอร์ของท่านเพื่อให้ทำการเปิดให้ใช้ ไฟล์อัพโหลดซึ่งปกติทำได้โดยแก้ไขไฟล์  php.ini โดยเปลี่ยนค่า <b>file_uploads</b> เป็น\'1\'.</p>';
$string['gdversion'] = 'GD  เวอร์ชัน';
$string['gdversionerror'] = 'เซิร์ฟเวอร์ควรมีการใช้ GD library เพื่อที่ใช้';
$string['gdversionhelp'] = '<p>เซิร์ฟเวอร์ของคุณยังไม่มีการติดตั้ง GD </p>

<p>GD เป็นส่วนที่จำเป็นในการช่วยในการแสดงและประมวลผลรูปภาพต่าง ๆ ภายใน Moodle อาทิเช่น ภาพไอคอนในประวัติส่วนตัว และการสร้างภาพใหม่เช่นการประมลวผลกราฟของบันทึกการใช้งานเว็บไซต์ต่างๆ  อย่างไรก็ตามคุณยังสามารถใช้ Moodle ได้ถึงแม้ไม่มี GD ติดตั้งแต่จะไม่สามารถใช้งานเกี่ยวกับการแสดงและประมวลผลภาพได้เท่านั้น</p>

<p> การติดตั้ง GD ใน PHP ภายใต้ยูนิกซ์เซิร์ฟเวอร์นั้น ใช้ตัวเปร  --with-gd</p>

<p>ส่วนภายใต้การใช้งานวินโดว์คุณสามารถติดตั้งโดยการแก้ไขไฟล์  php.ini และเอาเครื่องหมายคอมเมนต์ด้านหน้า libgd.dll ออก</p>';
$string['globalsquotes'] = 'การใช้งานแบบ Globals ยังไม่ปลอดภัย';
$string['globalsquoteserror'] = 'แก้ไขค่า PHP ของท่านโดยปิดการใช้งาน register_globals และ/หรือ เปิดการใช้งาน magic_quotes_gpc';
$string['globalsquoteshelp'] = '<p>ไม่แนะนำให้เปิดการใช้งาน Magic Quotes GPC และ  Register Globals  ในเวลาเดียวกัน</p>
<p>แนะนำให้ใช้ค่าต่อไปนี้ใน php.ini <b>magic_quotes_gpc = On</b> และ <b>register_globals = Off</b></p>
<p> ถ้าหากท่านไม่สามารถเข้าทำการแก้ไขไฟล์ php.ini ได้สามารถทำการสร้างไฟล์ .httaccess ขึ้นมาโดยสร้างไฟล์ดังนี้ 
<blockquote>php_value magic_quotes_gpc On</blockquote>
<blockquote>php_value register_globals Off</blockquote> แล้วอัพโหลดขึ้นไปไว้ในไดเรกทอรี moodle 
</p> 
';
$string['installation'] = 'การติดตั้ง';
$string['magicquotesruntime'] = 'Magic Quotes Run Time';
$string['magicquotesruntimeerror'] = 'ควรจะปิด (off)';
$string['magicquotesruntimehelp'] = '<p>ควรทำการปิด Magic quotes runtime เพื่อให้ moodle ทำงานได้ถูกต้อง</p>

<p>โดยทั่วไปแล้วเซิร์ฟเวอร์จะทำการปิดค่านี้ไว้ก่อน โดยสามารถดูได้จากการตั้งค่าตัวแปร <b>magic_quotes_runtime</b> ในไฟล์ php.ini </p>

<p>ถ้าคุณไม่สามารถแก้ไขไฟล์ php.ini ได้ด้วยตนเองคุณสามารถทำการปิดฟังก์ชั่นนี้โดยการเพิ่มไฟล์ .htaccess ภายใต้ไดเรกทอรี moodle โดยสร้างไฟล์ที่มีการตั้งค่าดังนี้

<blockquote>php_value magic_quotes_runtime Off</blockquote>

</p> ';
$string['memorylimit'] = 'ความจำสูงสุด (Memory Limit)';
$string['memorylimiterror'] = 'ความจำสูงสุดที่คุณตั้งไว้ค่อนข้างต่ำ อาจมีปัญหาในภายหลังค่ะ';
$string['memorylimithelp'] = '<p>ค่าความจำสูงสุดของเซิร์ฟเวอร์ของคุณตั้งไว้ที่  $a</p>

<p>ความจำดังกล่าวมีค่าน้อยไปค่ะอาจทำให้มีปัญหาในการใช้งาน moodle ในภายหลังโดยเฉพาะเมื่อคุณใช้โมดูลหลาย ๆ ตัวรวมไปถึงมีสมาชิกจำนวนมาก

<p>ค่าที่ตั้งไว้นี้ควรตั้งให้มากที่สุดเท่าที่จะมากได้ ค่าทั่วไปแนะนำไว้ที่ 16M มีอยู่หลายวิธีในการเพิ่มค่าความจำสูงสุด กล่าวคือ:

<ol>

<li>รีคอมไพล์ PHP ใหม่ โดยเพิ่มคำสั่ง <i>--enable-memory-limit</i> ซึ่งเป็นการตั้งค่าให้ moodle กำหนดขีดจำกัดค่าสูงสุดเอง 

<li>ถ้าคุณสามารถแก้ไขไฟล์  php.ini ได้ด้วยตนเองก็สามารถเปลี่ยนค่า <b>memory_limit</b> ให้เป็นค่าอื่นได้เช่น  16M แต่ถ้าไม่สามารถเปลี่ยนค่านี้ได้ด้วยตนเองให้แจ้งผู้ดูแลระบบแก้ไข

<li>ในเซิร์ฟเวอร์ PHP บางตัวคุณสามารถสร้าง ไฟล์ .htaccess ภายใต้ไดเรกทอรี moodle ซึ่งมีบรรทัดต่อไปนี้อยู่:

<p><blockquote>php_value memory_limit 16M</blockquote></p>

<p>อย่างไรก็ตามในบางเซิร์ฟเวอร์คุณไม่สามารถใช้ วิธีนี้ได้ โดยจะมีการแสดง error ขึ้นมาคุณจำเป็นต้องลบไฟล์ดังกล่าวนี้ทิ้ง 
</ol>';
$string['mysqlextensionisnotpresentinphp'] = 'การตั้งค่า  PHP ให้ใช้กับ MySQL ไม่ถูกต้องกรุณาตรวจสอบใน php.ini อีกครั้งหรือรีคอมไฟล์ php';
$string['pass'] = 'สำเร็จ';
$string['phpversion'] = 'PHP เวอร์ชัน';
$string['phpversionerror'] = 'เวอร์ชันของ PHP ควรเป็นอย่างน้อย 4.1.0';
$string['phpversionhelp'] = '<p>Moodle จำเป็นต้องใช้ PHP เวอร์ชัน 4.1.0 เป็นอย่างน้อย</p>

<p>คุณกำลังใช้เวอร์ชัน $a</p>

<p>คุณต้องอัพเกรด  PHP หรือย้ายโฮสต์ใหม่ที่มี PHP เวอร์ชันใหม่กว่า</p>';
$string['safemode'] = 'Safe Mode';
$string['safemodeerror'] = 'moodle อาจมีปัญหาหาก safe mode on';
$string['safemodehelp'] = '<p>Moodle อาจมีปัญหาหาก safe mode on ซึ่งจะทำให้คุณไม่สามารถสร้างไฟล์ใหม่ได้</p>

<p>Safe mode โดยทั่วไปแล้วจะเปิดใช้ในบางเว็บโฮสติ้ง อาจจำเป็นต้องหาโฮสต์ใหม่ที่เหมาะสมสำหรับการใช้งาน Moodle </p>

<p>คุณสามารถเริ่มการติดตั้งในตอนนี้แต่อาจมีปัญหาตามมาภายหลัง</p>';
$string['sessionautostart'] = 'Session Auto Start';
$string['sessionautostarterror'] = 'ควรจะปิด (off)';
$string['sessionautostarthelp'] = '<p>Moodle จะทำงานก็ต่อเมื่อเซิร์ฟเวอร์สนับสนุน session </p>

<p>คุณสามารถทำให้ Sessions ทำงานได้โดยการแก้ไขไฟล์  php.ini ดูภายใต้ตัวแปร  session.auto_start </p>';
$string['wwwroot'] = 'ที่อยู่ของเว็บ';
$string['wwwrooterror'] = 'ที่อยู่ของเว็บไม่ถูกต้อง ระบบไม่พบว่ามี Moodle อยู่ที่นั่น';

?>
