<?PHP // $Id$ 
      // scheduler.php - created with Moodle 1.4.5 + (2004083150)


$string['action'] = 'ต้องการทำ..';
$string['addsession'] = 'เพิ่มช่องเวลา';
$string['addslot'] = 'คุณสามารถเพิ่มเวลานัดพบได้ตลอดเวลา';
$string['cantfit'] = 'เวลา $a นาทีไม่ลงตัวในช่วงดังกล่าว';
$string['choice'] = 'ตัวเลือก';
$string['composeemail'] = 'สร้างอีเมล';
$string['conflict'] = 'มีการนัดพบในช่วงนั้นแล้ว';
$string['date'] = 'วัน';
$string['divide'] = 'แบ่งช่องเวลา';
$string['duration'] = 'ระยะเวลา';
$string['end'] = 'สิ้นสุด';
$string['endtime'] = 'เวลาสิ้นสุด';
$string['invitation'] = 'เชิญ';
$string['invitationtext'] = 'กรุณาเลือกเวลาที่ต้องการนัดพบ';
$string['markseen'] = 'หลังจากที่พบนักเรียนที่ทำการนัดหมายแล้วกรุณาทำเครื่องหมาย \"พบแล้ว\" โดยคลิกที่ช่องสี่เหลี่ยมในตารางด้านบน';
$string['minutes'] = 'นาที';
$string['minutesperslot'] = 'นาทีต่อ 1 การนัดพบ';
$string['missingstudents'] = 'นักเรียน $a คนยังต้องการทำการนัดพบ';
$string['modulename'] = 'ตารางนัดพบ';
$string['modulenameplural'] = 'ตารางนัดพบ';
$string['moreslots'] = 'คุณมีนักเรียนมากกว่าช่วงเวลาที่มีอยู่จำเป็นต้องเพิ่มช่วงการนัดพบ';
$string['move'] = 'เปลี่ยน';
$string['moveslot'] = 'ย้ายเวลา';
$string['noslots'] = 'ไม่มีช่วงเวลาว่างกรุณาติดต่อผู้สอนทางอีเมลเพื่อทำการนัดหมายต่อไป';
$string['notselected'] = 'คุณยังไม่ทำการเลือก';
$string['reminder'] = 'เตือนความจำ';
$string['remindertext'] = 'ข้อความเป็นเพียงโน้ตเตือนความจำว่าคุณยังไม่ได้ทำการนัดพบกรุณาเลือกช่วงเวลานัดพบเร็วที่สุดเท่าที่จะทำได้';
$string['save'] = 'บันทึก';
$string['savechoice'] = 'บันทึกตัวเลือก';
$string['schedule'] = 'นัด';
$string['scheduleappointment'] = 'ตารางการนัดหมายสำหรับ $a';
$string['seen'] = 'พบแล้ว';
$string['slots'] = 'ช่วงเวลา';
$string['slotsadded'] = 'เพิ่ม $a ช่วงเวลาแล้ว';
$string['start'] = 'เริ่ม';
$string['startpast'] = 'คุณไม่สามารถเริ่มต้นช่วงเวลาที่ผ่านไปแล้ว';
$string['starttime'] = 'เวลาเริ่มต้น';
$string['welcomebackstudent'] = 'ตารางด้านล่างนี้แสดงช่วงเวลาที่คุณทำการนัดหมายไว้ด้วยเส้นหนาในตารางคุณสามารถเปลี่ยนแปลงช่วงเวลาเป็นช่วงอื่นที่ว่างอยู่ได้';
$string['welcomenewstudent'] = 'ตารางด้านล่างนี้แสดงช่วงเวลาที่ว่างอยู่คุณสามารถเลือกช่วงเวลาได้โดยการเลือกที่ปุ่มวงกลมแล้วให้คลิก \"บันทึกตัวเลือก\" หากต้องการเปลี่ยนแปลงในภายหลังให้กลับมาที่หน้านี้อีกครั้งค่ะ';
$string['welcomenewteacher'] = 'กรุณาคลิกที่ปุ่มด้านล่างเพื่อทำการเพิ่มช่วงเวลาสำหรับการนัดพบนักเรียน';

?>
