<?PHP // $Id$ 
      // survey.php - created with Moodle 1.4.5 + (2004083150)


$string['actual'] = 'ตามจริง';
$string['actualclass'] = 'สอนตามจริง';
$string['actualstudent'] = '$a ตามจริง';
$string['allquestions'] = 'คำถามเรียงตามลำดับ นักเรียนทุกคน';
$string['allscales'] = 'ทุกสเกล  นักเรียนทุกคน';
$string['alreadysubmitted'] = 'คุณส่งแบบสอบถามนี้ไปแล้ว';
$string['analysisof'] = 'การวิเคราะห์ของ $a';
$string['answers'] = 'คำตอบ';
$string['attls1'] = 'ในการประเมินคำพูดของเพื่อนฉันจะดูที่เหตุผลที่ยกมาไม่ใช่ใครเป็นคนพูด';
$string['attls10'] = 'มันสำคัญมากที่ฉันจะวางตัวเป็นกลางเมื่อทำการวิเคราะห์อะไรก็ตาม';
$string['attls10short'] = 'เป็นกลาง';
$string['attls11'] = 'ฉันพยามคิดตามผู้อื่นมากกว่าโต้แย้งเขา';
$string['attls11short'] = 'คิดตามผู้อื่น';
$string['attls12'] = 'ฉันมีเกณฑ์ที่แน่นอนในการประเมินข้อโต้แย้ง';
$string['attls12short'] = 'ใช้เกณฑ์';
$string['attls13'] = 'ฉันพยายามที่จะเข้าใจเหตุผลของผู้อื่นมากกว่าที่จะประเมินมัน';
$string['attls13short'] = 'พยายามเข้าใจ';
$string['attls14'] = 'ฉันพยายามชี้ให้ผู้ตอบเห็นถึงจุดบกพร่องในสิ่งที่ตนเองคิด เพื่อช่วยให้ผู้ตอบมองภาพสิ่งที่ตนเองได้ตอบไปชัดเจนขึ้น';
$string['attls14short'] = 'ชี้จุดบกพร่อง';
$string['attls15'] = 'ฉันจะหาเหตุผลว่าทำไมผู้อื่นถึงคิดและทำอย่างนั้นในการถกประเด็นต่าง ๆ โดยการสมมุติว่าตนเองเป็นเขา';
$string['attls15short'] = 'สมมุติตัวเอง';
$string['attls16'] = 'ฉันจะพิจารณาองค์ประกอบทุกอย่างอย่างระมัดระวังก่อนที่จะทำการสรุป';
$string['attls16short'] = 'หลักฐาน';
$string['attls17'] = 'ฉันให้ความสำคัญการใช้ตรรกะและเหตุผลมากกว่าความคิดของตนเองในการแก้ปัญหา';
$string['attls17short'] = 'ตรรกะ';
$string['attls18'] = 'ฉันใช้ดุลพินิจเมื่อความคิดเห็นของผู้อื่นนั้นต่างจากของตนอย่างลึกซึ้ง';
$string['attls18short'] = 'เข้าใจลึกซึ้ง';
$string['attls19'] = 'เมื่อฉันต้องเผชิญกับผู้ที่มีความเห็นที่แตกต่างจากตัวเอง ฉันตรองและพยายามเข้าถึงเพื่อศึกษาว่าทำไมเขาจึงคิดอย่างนั้น';
$string['attls19short'] = 'ทำความเข้าใจ';
$string['attls1short'] = 'โต้แย้ง';
$string['attls2'] = 'ฉันจะตีรวนในทุกถ้อยคำของผู้อื่น';
$string['attls20'] = 'ฉันไตร่ตรองว่ามีอะไรผิดพลาดบ้าง เช่น ฉันคงต้องหาเอกสารมายันว่าข้อโต้แย้งนั้นยังไม่ดีพอ';
$string['attls20short'] = 'ไตร่ตรอง';
$string['attls2short'] = 'คู่แข่ง';
$string['attls3'] = 'ฉันพยายามทำความเข้าใจว่าคนอื่นมาจากไหน หรือมีประสบการณ์อะไรจึงทำให้เขารู้สึกเช่นนั้น';
$string['attls3short'] = 'พื้นฐาน';
$string['attls4'] = 'สิ่งที่สำคัญที่สุดในการศึกษาคือการเรียนรู้ที่จะเข้าใจผู้คนที่แตกต่าง';
$string['attls4short'] = 'เข้าใจความแตกต่าง';
$string['attls5'] = 'ฉันรู้สึกว่าทางที่ดีที่สุดที่จะบรรลุความเป็นเอกลักษณ์ของตัวเองคือ การปฎิสัมพันธ์กับผู้คนที่หลากหลาย';
$string['attls5short'] = 'ปฏิสัมพันธ์';
$string['attls6'] = 'ฉันรู้สึกมีความสุขที่จะได้รับฟังความคิดเห็นจากผู้คนที่มีพื้นฐานที่แตกต่างเพราะจะทำให้เข้าใจเรื่องมุมมองที่แตกต่าง';
$string['attls6short'] = 'รับฟัง';
$string['attls7'] = 'ฉันพบว่าตนเองเข้มแข็งขึ้นจากการถกเถียงกับบางคนที่ไม่เห็นด้วย';
$string['attls7short'] = 'เข้มแข็ง';
$string['attls8'] = 'ฉันรู้สึกสนใจในสาเหตุที่ผู้คนพูดและเชื่อในสิ่งที่เขาทำ';
$string['attls8short'] = 'รู้สาเหตุ';
$string['attls9'] = 'ฉันชอบถกเถียงกับผู้เขียนหนังสือเพื่อชี้ให้เห็นสาเหตุของข้อผิดพลาด';
$string['attls9short'] = 'ถกเถียง';
$string['attlsintro'] = 'แบบสอบถามนี้มีจุดประสงค์เพื่อช่วยให้เข้าใจว่าการเรียนออนไลน์นี้ช่วยให้นักเรียนเรียนรู้ได้มากน้อยเพียงใด

ไม่มีคำตอบใด“ถูก” หรือ “ผิด” แต่ถามเพียงเพื่อจะได้ทราบถึงความคิดเห็นของนักเรียนและคำตอบที่นักเรียนตอบมาจะเป็นความลับและไม่มีผลใด ๆ กับการประเมินผลการเรียน 

คำตอบของนักเรียนจะมีส่วนช่วยในการพัฒนาบทเรียนออนไลน์ให้ดียิ่งขึ้นไปในอนาคต

ขอบคุณค่ะ';
$string['attlsm1'] = 'ทัศนคติต่อการคิดและการเรียน';
$string['attlsm2'] = 'การเรียนที่เชื่อมโยง';
$string['attlsm3'] = 'การเรียนที่แยกส่วน';
$string['attlsmintro'] = '<b>ในการถกประเด็น...</b>';
$string['attlsname'] = 'ATTLS (เวอร์ชัน 20 คำถาม)';
$string['ciq1'] = 'คุณรู้สึกว่าตนเองเป็นนักเรียนมากที่สุดในตอนไหนในห้องเรียน';
$string['ciq1short'] = 'เกี่ยวข้องที่สุด';
$string['ciq2'] = 'คุณรู้สึกว่าตนเองไกลจากความเป็นนักเรียนมากที่สุดตอนไหน';
$string['ciq2short'] = 'ไม่เกี่ยวที่สุด';
$string['ciq3'] = 'การกระทำใดของบุคคลในกระดานเสวนาที่คุณพบว่าเป็นประโยชน์และช่วยเหลือคุณได้มากที่สุด?';
$string['ciq3short'] = 'เวลาที่เป็นประโยชน์';
$string['ciq4'] = 'การกระทำใดของบุคคลในกระดานเสวนา ที่คุณพบว่าทำให้คุณสับสนและไขว้เขวที่สุด';
$string['ciq4short'] = 'สับสน';
$string['ciq5'] = 'เหตุการณ์ใดทำให้คุณประหลาดใจได้มากที่สุด';
$string['ciq5short'] = 'ประหลาดใจ';
$string['ciqintro'] = 'ให้นักเรียนนึกถึงเหตุการณ์ต่าง ๆ ที่เกิดขึ้นภายในห้องเรียนจากนั้นให้ตอบคำถามต่อไปนี้';
$string['ciqname'] = 'เหตุการณ์วิกฤต';
$string['clicktocontinue'] = 'คลิกเพื่อทำต่อ';
$string['clicktocontinuecheck'] = 'คลิกที่นี่เพื่อตรวจและทำต่อ';
$string['colles1'] = 'การเรียนจะเน้นประเด็นที่สนใจเป็นการส่วนตัว';
$string['colles10'] = 'ฉันจะขอให้เพื่อนขยายแนวคิด';
$string['colles10short'] = 'ขอคำอธิบาย';
$string['colles11'] = 'เพื่อน ๆ ขอให้ฉันอธิบายแนวคิด';
$string['colles11short'] = 'ฉันอธิบาย';
$string['colles12'] = 'เพื่อน ๆ ตอบรับความคิดเห็นของฉัน';
$string['colles12short'] = 'เพื่อนตอบรับ';
$string['colles13'] = 'อาจารย์ช่วยกระตุ้นความคิดของฉัน';
$string['colles13short'] = 'อาจารย์กระตุ้น';
$string['colles14'] = 'อาจารย์ชักจูงให้ฉันมีส่วนร่วม';
$string['colles14short'] = 'อาจารย์ชักจูง';
$string['colles15'] = 'อาจารย์ออกแบบบทสนทนาได้ดี';
$string['colles15short'] = 'บทสนทนา';
$string['colles16'] = 'อาจารย์ออกแบบการสะท้อนตนเอง';
$string['colles16short'] = 'สะท้อนตนเอง';
$string['colles17'] = 'เพื่อนร่วมชั้นชักจูงให้ฉันมีส่วนร่วม';
$string['colles17short'] = 'เพื่อนชักจูง';
$string['colles18'] = 'เพื่อนร่วมชั้นยกย่องผลงานที่ฉันมีส่วนร่วมสร้าง';
$string['colles18short'] = 'เพื่อนยกย่อง';
$string['colles19'] = 'เพื่อนเห็นคุณค่าในสิ่งที่ฉันมีส่วนร่วมสร้าง';
$string['colles19short'] = 'เพื่อนเห็นคุณค่า';
$string['colles1short'] = 'ประเด็นน่าสนใจ';
$string['colles2'] = 'สิ่งที่ฉันเรียนมีความสำคัญต่อการฝึกฝนในวิชาชีพ';
$string['colles20'] = 'เพื่อนให้ความความห้นใจเมื่อฉันมีปัญหาในการเรียน';
$string['colles20short'] = 'เพื่อนเห็นใจ';
$string['colles21'] = 'ฉันเข้าใจข้อความที่เพื่อน ๆ พยายามสื่อ';
$string['colles21short'] = 'เข้าใจเพื่อน';
$string['colles22'] = 'เพื่อนเข้าใจข้อความที่ฉันสื่อออกไป';
$string['colles22short'] = 'เพื่อนเข้าใจฉัน';
$string['colles23'] = 'ฉันเข้าใจสื่อที่อาจารย์นำเสนอ';
$string['colles23short'] = 'เข้าใจอาจารย์';
$string['colles24'] = 'อาจารย์เข้าใจสื่อที่นำเสนอ';
$string['colles24short'] = 'อาจารย์เข้าใจ';
$string['colles2short'] = 'สำคัญต่อการฝึกหัดของฉัน';
$string['colles3'] = 'ฉันเรียนรู้วิธีการพัฒนาวิชาชีพของฉัน';
$string['colles3short'] = 'พัฒนาวิชาชีพ';
$string['colles4'] = 'สิ่งที่เรียนนั้นมีส่วนเกี่ยวข้องกับการฝึกฝนในวิชาชีพ';
$string['colles4short'] = 'เกี่ยวในวิชาชีพ';
$string['colles5'] = 'ฉันตระหนักเกี่ยวกับวิธีการเรียนของฉัน';
$string['colles5short'] = 'ตระหนักวิธีเรียน';
$string['colles6'] = 'ฉันตระหนักถึงความคิดเห็นส่วนตัว';
$string['colles6short'] = 'ความเห็นส่วนตัว';
$string['colles7'] = 'ฉันตระหนักถึงความคิดเห็นของเพื่อน';
$string['colles7short'] = 'ความคิดเห็นผู้อื่น';
$string['colles8'] = 'ฉันตระหนักเกี่ยวกับความคิดที่ได้จากการอ่าน';
$string['colles8short'] = 'สิ่งที่ได้อ่าน';
$string['colles9'] = 'ฉันอธิบายสิ่งที่เข้าใจให้เพื่อนรู้';
$string['colles9short'] = 'อธิบายความเข้าใจ';
$string['collesaintro'] = 'แบบสอบถามนี้มีจุดประสงค์เพื่อช่วยให้เข้าใจว่าการเรียนออนไลน์นี้ช่วยให้นักเรียนเรียนรู้ได้มากน้อยเพียงใด

คำถามทั้ง 24 ข้อต่อไปนี้จะถามเรื่องประสบการณ์ที่ได้จากการทดลองใช้งานดังกล่าว

ไม่มีคำตอบใด“ถูก” หรือ “ผิด” แต่ถามเพียงเพื่อจะได้ทราบถึงความคิดเห็นของนักเรียนและคำตอบที่นักเรียนตอบมาจะเป็นความลับและไม่มีผลใด ๆ กับการประเมินผลการเรียน 

คำตอบของนักเรียนจะมีส่วนช่วยในการพัฒนาบทเรียนออนไลน์ให้ดียิ่งขึ้นไปในอนาคต

ขอบคุณค่ะ';
$string['collesaname'] = 'COLLES (สภาพจริง)';
$string['collesapintro'] = 'แบบสอบถามนี้มีจุดประสงค์เพื่อช่วยให้เข้าใจว่าการเรียนออนไลน์นี้ช่วยให้นักเรียนเรียนรู้ได้มากน้อยเพียงใด

คำถามทั้ง 24 ข้อต่อไปนี้จะขอให้คุณเปรียบเทียบ <b>ประสบการณ์ที่ต้องการ</b>และ <b>ประสบการณ์ที่ได้รับจริง</b>จากห้องเรียนออนไลน์นี้

ไม่มีคำตอบใด“ถูก” หรือ “ผิด” แต่ถามเพียงเพื่อจะได้ทราบถึงความคิดเห็นของนักเรียนและคำตอบที่นักเรียนตอบมาจะเป็นความลับและไม่มีผลใด ๆ กับการประเมินผลการเรียน 

คำตอบของนักเรียนจะมีส่วนช่วยในการพัฒนาบทเรียนออนไลน์ให้ดียิ่งขึ้นไปในอนาคต

ขอบคุณค่ะ';
$string['collesapname'] = 'COLLES (อุดมคติและสภาพจริง)';
$string['collesm1'] = 'ความเกี่ยวข้อง';
$string['collesm1short'] = 'ความเกี่ยวข้อง';
$string['collesm2'] = 'การสะท้อน';
$string['collesm2short'] = 'การสะท้อน';
$string['collesm3'] = 'การมีปฎิสัมพันธ์';
$string['collesm3short'] = 'การมีปฎิสัมพันธ์';
$string['collesm4'] = 'ความช่วยเหลือจากผู้สอน';
$string['collesm4short'] = 'ความช่วยเหลือจากผู้สอน';
$string['collesm5'] = 'ความช่วยเหลือจากเพื่อน';
$string['collesm5short'] = 'ความช่วยเหลือจากเพื่อน';
$string['collesm6'] = 'การตีความ';
$string['collesm6short'] = 'การตีความ';
$string['collesmintro'] = 'ในบทเรียนออนไลน์นี้';
$string['collespintro'] = 'แบบสอบถามนี้มีจุดประสงค์เพื่อช่วยให้เข้าใจว่าการเรียนออนไลน์นี้ช่วยให้นักเรียนเรียนรู้ได้มากน้อยเพียงใด

คำถามทั้ง 24 ข้อต่อไปนี้จะถามถึงความต้องการของนักเรียนว่าต้องการให้ห้องเรียนออนไลน์นี้เป็นอย่างไร

ไม่มีคำตอบใด“ถูก” หรือ “ผิด” แต่ถามเพียงเพื่อจะได้ทราบถึงความคิดเห็นของนักเรียนและคำตอบที่นักเรียนตอบมาจะเป็นความลับและไม่มีผลใด ๆ กับการประเมินผลการเรียน 

คำตอบของนักเรียนจะมีส่วนช่วยในการพัฒนาบทเรียนออนไลน์ให้ดียิ่งขึ้นไปในอนาคต

ขอบคุณค่ะ';
$string['collespname'] = 'COLLES (อุดมคติ)';
$string['done'] = 'เสร็จแล้ว';
$string['download'] = 'ดาวน์โหลด';
$string['downloadexcel'] = 'ดาวน์โหลดข้อมูลในรูป ตาราง Excel';
$string['downloadinfo'] = 'ท่านสามารถดาวน์โหลดข้อมูลดิบทั้งหมดจากแบบสอบถามนี้เพื่อการวิเคราะห์ในรูปของ Excel, SPSS หรือโปรแกรมอื่น';
$string['downloadtext'] = 'ดาวน์โหลดข้อมูลในรูปของไฟล์ plain text';
$string['editingasurvey'] = 'แก้ไขแบบสอบถาม';
$string['guestsnotallowed'] = 'เฉพาะสมาชิกเท่านั้น';
$string['helpsurveys'] = 'ความช่วยเหลือเกี่ยวกับแบบสอบถามอื่นๆ';
$string['howlong'] = 'ท่านใช้เวลานานเท่าไรในการทำแบบสอบถาม';
$string['howlongoptions'] = 'น้อยกว่า 1 นาที, 1-2 นาที, 2-3 นาที, 3-4 นาที, 4-5 นาที, 5-10 นาที, มากกว่า 10 นาที';
$string['ifoundthat'] = '<b>ฉันพบว่า</b>';
$string['introtext'] = 'ข้อความแสดงข้อมูลเบื้องต้น';
$string['ipreferthat'] = '<b>ฉันชอบมากกว่าที่ </b>';
$string['modulename'] = 'แบบสอบถาม';
$string['modulenameplural'] = 'แบบสอบถาม';
$string['name'] = 'ชื่อ';
$string['newsurveyresponses'] = 'ผลการตอบแบบสอบถามมาใหม่';
$string['nobodyyet'] = 'ไม่มีผู้ใดทำแบบสอบถามนี้เสร็จ';
$string['notdone'] = 'ยังไม่เสร็จ';
$string['notes'] = 'การวิเคราะห์และบันทึกของท่าน';
$string['othercomments'] = 'ความคิดเห็นเพิ่มเติม';
$string['peoplecompleted'] = 'มี $a  คน  ที่ได้ทำแบบสอบถามนี้';
$string['preferred'] = 'ค่าที่ต้องการ';
$string['preferredclass'] = 'ระดับที่ต้องการ';
$string['preferredstudent'] = 'ระดับที่$a ต้องการ';
$string['question'] = 'คำถาม';
$string['questions'] = 'คำถาม';
$string['questionsnotanswered'] = 'คำถามบางข้อยังไม่ได้ตอบ';
$string['report'] = 'ผลการตอบแบบสอบถาม';
$string['savednotes'] = 'ข้อมูลของท่านได้ถูกบันทึกไว้แล้ว';
$string['scaleagree5'] = 'ไม่เห็นด้วยอย่างยิ่ง, ไม่เห็นด้วย, ไม่มีความเห็น, เห็นด้วย, เห็นด้วยอย่างยิ่ง';
$string['scales'] = 'สเกล';
$string['scaletimes5'] = 'เกือบจะไม่เคย, น้อยมาก, บางครั้ง, บ่อยๆ, เกือบตลอดเวลา ';
$string['seemoredetail'] = 'คลิกเพื่อดูรายละเอียด';
$string['selectedquestions'] = 'คำถามที่ถูกเลือกจากสเกล  ,นักเรียนทั้งหมด';
$string['summary'] = 'บทคัดย่อ';
$string['surveycompleted'] = 'คุณทำแบบสอบถามเสร็จแล้วกราฟข้างล่างนี้แสดงผลเปรียบเทียบกับค่าเฉลี่ยของชั้นเรียน';
$string['surveyname'] = 'ชื่อแบบสอบถาม';
$string['surveysaved'] = 'บันทึกแบบสอบถามแล้ว';
$string['surveytype'] = 'ประเภท';
$string['thanksforanswers'] = 'ขอบคุณสำหรับการตอบแบบสอบถาม, $a';
$string['time'] = 'เวลา';
$string['viewsurveyresponses'] = 'ดู $a ผลการสำรวจ';

?>
