

<p align="center"><b>Crear una pregunta nova</b></p>



<p>Podeu afegir una gran varietat de tipus de pregunta a una categoria:</p>



<p><b>Elecci&oacute; m&uacute;ltiple</b></p>

<ul>

  <p>En resposta a una pregunta, que pot contenir una imatge, l'estudiant tria 

    entre diferents respostes. Hi ha dos tipus de preguntes d'elecci&oacute; m&uacute;ltiple: 

    de resposta senzilla i de resposta m&uacute;ltiple.</p>

  <p align="right"><a href="help.php?file=multichoice.html&module=quiz">Més informació sobre preguntes d'elecció múltiple</a></p>

</ul>



<p><b>Resposta curta</b></p>

<ul>

  <p>En resposta a una pregunta, que pot contenir una imatge, l'estudiant escriu 

    una paraula o frase. Hi poden haver diferents respostes correctes amb qualificacions 

    diferents. El text de les respostes pot ser o no sensible a les maj&uacute;scules</P>

  <p align="right"><a href="help.php?file=shortanswer.html&module=quiz">Més informació sobre les preguntes de resposta curta</a></p>

</ul>



<p><b>Num&egrave;riques</b></p>

<ul>

  <p>Des de la perspectiva de l'estudiant una pregunta num&egrave;rica t&eacute; 

    la mateixa aparen&ccedil;a que una pregunta de resposta curta. La difer&egrave;ncia, 

    per&ograve;, &eacute;s que les respostes num&egrave;riques que admet permeten 

    acceptar un marge d'error. De manera que s'haur&agrave; d'establir un rang 

    de possibles respostes correctes.</p>

  <p></p>

  <p align="right"><a href="help.php?file=numerical.html&module=quiz">Més informació sobre preguntes numèriques</a></p>

</ul>



<p><b>Vertader/Fals</b></p>

<ul>

  <p><b></b></p>

  <ul>

    <p>En resposta a una pregunta, que pot contenir una imatge, l'estudiant tria 

      entre dues opcions: Vertader o Fals. </p>

  </ul>

  <p align="right"><a href="help.php?file=truefalse.html&module=quiz">Més informació sobre preguntes Vertader/Fals</a></p>

</ul>



<p><b>De relaci&oacute;</b></p>

<ul>

  <p>Es proporciona una llista de subpreguntes juntament amb una llista de respostes. 

    L'estudiant ha de relacionar la resposta correcta amb cada pregunta</P>

  <p align="right"><a href="help.php?file=match.html&module=quiz">Més informació sobre preguntes de relació</a></p>

</ul>



<p><b>Respostes incrustades (format Cloze)</b></p>

<ul>

  <p>Les preguntes consisteixen en un passatge d'un text, en format de Moodle, 

    que t&eacute; diferents respostes incrustades, incloent-ne dels tipus elecci&oacute; 

    m&uacute;ltiple, resposta curta o resposta num&egrave;rica. </p>

  <p align="right"><a href="help.php?file=multianswer.html&module=quiz">Més informació sobre preguntes de respostes incrustades</a></p>

</ul>



<p><b>Aleat&ograve;ries de relaci&oacute; amb resposta curta</b></p>

<ul>

  <p>Des de la perspectiva de l'estudiant s'assemblen a les preguntes de relaci&oacute;. 

    La difer&egrave;ncia, tanmateix, rau en el fet que les subpreguntes es treuen 

    aleat&ograve;riament del conjunt de preguntes de resposta curta de la mateixa 

    categoria.</p>

  <p align="right"><a href="help.php?file=randomsamatch.html&module=quiz">Més informació sobre les preguntes de relació</a></p>

</ul>



<p><b>Aleat&ograve;ries</b></p>

<ul>

  <p>Una pregunta aleat&ograve;ria d'un q&uuml;estionari &eacute;s reempla&ccedil;ada 

    per una altra escollida a l'atzar dins la mateixa categoria.</p>

  <p align="right"><a href="help.php?file=random.html&module=quiz">Més informació sobre preguntes aleatòries</a></p>

</ul>



<p><b>Descripci&oacute;</b></p>

<ul>

  <p>Aquest tipus de pregunta no &eacute;s en realitat una pregunta. El que fa 

    &eacute;s escriure un text sense demanar cap resposta. Pot ser utilitzat per 

    mostrar un text descriptiu que utilitzar&agrave; el seg&uuml;ent grup de q&uuml;estions.<br />

  </p>

  <p align="right"><a href="help.php?file=description.html&module=quiz">Més informació sobre les preguntes de descripció</a></p>

</ul>



