<p align="center"><b>Comparaci&oacute;n de Evaluaciones</b></p>

<p>En un taller es habitual que el mismo trabajo sea evaluado por el profesor 
  y por los estudiantes. Si se utilizan ejemplos entonces el profesor los eval&uacute;a 
  primero antes de que los estudiantes eval&uacute;en una selecci&oacute;n de 
  ellos. El trabajo de los alumnos puede ser evaluado por el profesor, al menos 
  en parte, y muy posiblemente por un n&uacute;mero de alumnos. Un taller permite 
  al profesor otorgar una parte de la calificaci&oacute;n a las evaluaciones realizadas 
  por los alumnos, el resto de la calificaci&oacute;n es asignada a las calificaciones 
  del propio trabajo. (Las proporciones de la calificaci&oacute;n otorgadas a 
  estas dos &aacute;reas son establecidas hacia el final del taller.) Una evaluaci&oacute;n 
  de un alumno da una calificaci&oacute;n basada en como de bien realizan la correspondiente 
  evaluaci&oacute;n realizada por el profesor. (En ausencia de una evaluaci&oacute;n 
  del profesor se usa la media de las evaluaciones del sujeto).</p>

<p>El grado de acuerdo entre la valoraci&oacute;n de los alumnos y del profesor 
  se basa en las diferencias entre las puntuaciones en elementos individuales 
  (en la actualidad se utilizan las diferencias elevadas al cuadrado). El significado 
  de estas diferencias debe convertirse en una calificaci&oacute;n significativa. 
  La opci&oacute;n &quot;Comparaci&oacute;n de Calificaciones&quot; permite al 
  profesor un grado de control sobre la forma en que estas comparaciones son convertidas 
  en calificaciones.</p>

<p>Para hacerse una idea del efecto que tiene esta opci&oacute;n, tome el (muy 
  simple) caso de una evaluaci&oacute;n que tiene diez preguntas de S&iacute;/No. 
  Por ejemplo la evaluaci&oacute;n deber&iacute;a usar preguntas como "&iquest;Est&aacute; 
  el gr&aacute;fico formateado correctamente?", "&iquest;Es el beneficio calculado 
  de $100,66?", etc. Asuma que hay diez preguntas como &eacute;stas. Cuando se 
  escoge la opci&oacute;n &quot;Muy Laxo&quot;, el acuerdo perfecto entre las 
  valoraciones del alumno y del profesor da una calificaci&oacute;n del 100%, 
  si hay solo una pregunta que no coincide la calificaci&oacute;n es el 90%, dos 
  desacuerdos otorga una calificaci&oacute;n del 80%, tres desacuerdos 70%, etc.. 
  Eso deber&iacute;a parecer muy razonable y usted debe estar pensando por qu&eacute; 
  esta opci&oacute;n se llama comparaci&oacute;n &quot;Muy Laxo&quot;. Bien, considere 
  el caso de un estudiante haciendo una evaluaci&oacute;n de forma completamente 
  aleatoria donde las respuestas de las diez cuestiones son simplemente adivinadas. 
  De media esto deber&iacute;a resultar en cinco de las diez respuestas acertadas. 
  As&iacute; esta evaluaci&oacute;n otorgar&iacute;a una calificaci&oacute;n de 
  alrededor del 50%. La situaci&oacute;n pasa a ser un poco m&aacute;s sensible 
  con la opci&oacute;n &quot;Laxo&quot;, cuando la evaluaci&oacute;n aleatoria 
  consigue alrededor del 20%. Cuando se escoge la opci&oacute;n &quot;Aceptable&quot;, 
  la elecci&oacute;n al azar conseguir&aacute; una calificaci&oacute;n de cero 
  en la mayor&iacute;a de las ocasiones. En este punto, se consigue una calificaci&oacute;n 
  del 50% cuando las dos evaluaciones coinciden en ocho de las diez preguntas. 
  Si tres preguntas est&aacute;n en desacuerdo la calificaci&oacute;n otorgada 
  es del 25%. Cuando la opci&oacute;n es establecida en &quot;Estricto&quot; tener 
  dos cuestiones mal da una calificaci&oacute;n del 40%. Moverse en el territorio 
  del &quot;Muy Estricto&quot; supone que un desacuerdo en solo dos preguntas 
  baja la calificaci&oacute;n al 35% y tener una &uacute;nica pregunta mal da 
  una calificaci&oacute;n del 65%.</p>

<p>Este ejemplo es un poco artificial ya que la mayor&iacute;a de las evaluaciones 
  normalmente tienen elementos con un rango de valores en lugar de s&oacute;lo 
  S&iacute; o No. En estos casos la comparaci&oacute;n dar&aacute; como resultado 
  valores algo superiores a los indicados anteriormente. Los diferentes niveles 
  (Muy Laxo, Laxo, Aceptable...) se facilitan para que el profesor pueda afinar 
  las comparaciones. Si considera que las calificaciones dadas para las evaluaciones 
  son demasiado bajas esta opci&oacute;n deber&iacute;a cambiarse a &quot;Laxo&quot; 
  o incluso &quot;Muy Laxo&quot;. Y alternativamente, si las calificaciones a 
  las evaluaciones de los alumnos son, en general, consideradas como demasiado 
  altas esta opci&oacute;n deber&iacute;a cambiarse a &quot;Estricto&quot; o&quot;Muy 
  estricto&quot;. Realmente es una cuesti&oacute;n de prueba y error siendo el 
  mejor punto para empezar la opci&oacute;n &quot;Aceptable&quot;.</p>

<p>Durante el curso del taller el profesor puede considerar que las calificaciones 
  dadas a las evaluaciones de los alumnos son o bien demasiado altas o demasiado 
  bajas. Estas calificaciones son mostradas en la P&aacute;gina de Administraci&oacute;n 
  de ejercicios. En este caso, el profesor puede cambiar esta opci&oacute;n y 
  re-calcular la calificaci&oacute;n de la evaluaci&oacute;n del alumno. Esto 
  se hace haciendo click en el enlace &quot;Re-calificar la Evaluaci&oacute;n 
  del Estudiante&quot; que se encuentra en la p&aacute;gina de administraci&oacute;n 
  del taller. Esto se puede realizar de forma segura en cualquier momento durante 
  el taller.</p>

