<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
    
<title>Moodle Docs: Futuro</title>
	
<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS" />
    
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
</head>

<body>

<h1>Futuro</h1>
<blockquote> 
  <p>Com o Moodle ganhando maturidade, seus caminhos s&atilde;o influenciados 
    fortemente pela comunidade de colaboradores e usu&aacute;rios. Uma base de 
    dados din&acirc;mica de caracter&iacute;sticas propostas e seu status podem 
    ser encontrados em <a href="http://moodle.org/bugs/">moodle.org/bugs</a>. 
    Suas <a href="?file=credits.html"> contribui&ccedil;&otilde;es</a> em forma das id&eacute;ias, 
    de c&oacute;digo, de avalia&ccedil;&atilde;o e de promo&ccedil;&atilde;o s&atilde;o 
    todas muito bem vindas - veja o <a href="?file=developer.html">Manual para Desenvolvedores</a> e 
    os <a href="http://moodle.org/help" target="_top">f&oacute;runs da comunidade</a> para mais detalhes. Voc&ecirc; 
    pode tamb&eacute;m, pagar para ter determinadas caracter&iacute;sticas desenvolvidas 
    rapidamente - veja em <a href="http://moodle.com/development/" target="_top"> moodle.com/development</a> 
    para informa&ccedil;&otilde;es.
  <p>Segue o plano atual para o futuro, tenha sempre em mente que este planejamento 
    depende de <a href="http://moodle.org/donations/" target="_blank">doadores</a> e <a href="?file=credits.html">desenvolvedores</a>. 
  </p>
  <h3>Versão 1.6</h3>
  <blockquote> 
    <p>Blogs como principal ferramenta para atividades reflexivas, com alimentadore RSS a nível de 
      usu&aacute;rio, curso e site.</p>
    <p>M&oacute;dulo Base de dados, ferramenta de uso geral para entra de dados 
      colaborativa, procura e navega&ccedil;&atilde;o.</p>
    <p>Integra&ccedil;&atilde;o com LAMS (Leaning Activity Management System) 
      <a href="http://www.lamsfoundation.org/">http://www.lamsfoundation.org/ 
      </a> como uma atividade ou formato curso.</p>
    <p>Melhores estat&iacute;sticas.</p>
    <p>Gestão de entrada de mensagens de correio-eletr&ocirc;nico.</p>
    <p>Servi&ccedil;os Web API b&aacute;sicos.</p>
  </blockquote>
  <h3>Versão 1.7</h3>
  <blockquote> 
    <p>P&aacute;gina &quot;Meu Moodle&quot; provendo uma vis&atilde;o customiz&aacute;vel 
      de todos os cursos, acrescidos de leitores de RSS feeds. </p>
    <p>P&aacute;gina Perfil do Usu&aacute melhorada, integrando 
      Blogs, Alimentadores, etc em uma p&aacute;gina web semi-p&uacute;bica.</p>
    <p>Suporte preliminar para IMS LD n&iacute;vel A, permitindo importa&ccedil;&atilde;o 
      e exporta&ccedil;&atilde;o.</p>
    <p>Suporte completo ao SCORM 2004.</p>
    <p>Servi&ccedil;os Web API melhorados.</p>
    <p>Integra&ccedil;&atilde;o com alguns reposit&oacute;rios.</p>
    <p>&nbsp;</p>
  </blockquote>
  <h3>Versão 2.0</h3>
  <blockquote> 
    <p>Atividades condicionais, permitindo condições e caminhos for&ccedil;ados.</p>
    <p>Suporte completo para IMS LD padr&atilde;o.</p>
    <p>Grupos aprimorados, permitindo que grupos sejam definidos no site
      e a n&iacute;vel de atividade.</p>
    <p>Implementa&ccedil;&atilde;o melhorada de perfis de usuários, permitindo perfis 
      customizados a n&iacute;vel de site, curso e atividade.</p>
    <p>Muitas das p&aacute;ginas principais customizáveis usando padr&otilde;es 
      HTML (templates).</p>
    <p>Implementações orientadas a viabilizar o Moodle como sistema de colaboração distribuida em rede 
       como uma evolu&ccedil;&atilde;o natural 
      do foco de Moodle na colabora&ccedil;&atilde;o. Aguardem as novidades.</p>
  </blockquote>
</blockquote>

<p align="center">&nbsp;</p>
<p align="center"><font size="1"><a href="." target="_top">Documentação de Moodle </a></font></p>
<p align="center"><font size="1">Versão: $Id$</font></p>
</body>
