<p align="center"><b>Typ av resurs</b></p>
<p>
Resurser &auml;r former f&ouml;r allt inneh&aring;ll som Du kan t&auml;nkas dr&ouml;mma om.
De kan vara av ett antal olika typer som mestadels anger hur man ska f&aring; 
tillg&aring;ng till inneh&aring;llet:</p>
<p><b>Ren text</b> - den enklaste typen.
Du kan bara skriva in (redigera) sidan i ett formul&auml;r p&aring; den f&ouml;ljande sidan.
En del saker kommer att formateras automatiskt, precis som inl&auml;ggen i ett forum.
<br />  
<a href="help.php?file=text.html">Mer info om autoformaterad text</a></p>

<p><b>HTML text</b> - f&ouml;r mer avancerade anv&auml;ndare.  Ingen automatisk formatering, 
ist&auml;llet m&aring;ste Du g&ouml;ra det manuellt med (X)HTML-koder.
<br />
<a href="help.php?file=html.html">Mer info om HTML text</a></p>

<p><b>Referens</b> - en akademisk referens till en tidning eller bok.

<p><b>Uppladdad fil</b> - 
visar valfri fil som Du har laddat upp till kursen. Se sektionen f&ouml;r kursens 'Filer'.

<p><b>Webbl&auml;nk</b> - En URL till n&aring;gon resurs p&aring; webben.
N&auml;r n&aring;gon klickar p&aring; denna resurs s&aring; 
kopplas denne vidare till n&aring;got som fyller hela det aktuella webbl&auml;sarf&ouml;nstret
eller, om Du anger det, till ett nytt f&ouml;nster.

<p><b>Webbsida</b> - En URL till n&aring;gon resurs p&aring; webben.  
Liksom den tidigare kommer den att visa en webbsida.
Till skillnad fr&aring;n den tidigare kommer den nya sidan att visas
inom en ram, som om den var integrerad i kursen.

<p><b>Program</b> -
ett externt program som beh&ouml;ver information som f&ouml;rs &ouml;ver till den ang&aring;ende
den aktuelle anv&auml;ndaren av Moodle och kursen.  Detta g&ouml;r det m&ouml;jligt 
f&ouml;r externa webbapplikationer att samarbeta med Moodle.<br />
<a href="help.php?file=program.html&module=resource">Mer info om programresurser</a></p>

<p><b>Wiki-text</b> - till&aring;ter fler alternativ f&ouml;r formatering  
&auml;n 'Ren Text' utan att Du beh&ouml;ver l&auml;ra Dig (X)HTML. Du
skriver in ren text men Du kan v&auml;lja ett stort antal egenskaper f&ouml;r (l&auml;ttanv&auml;nd) formatering
(t ex 'det h&auml;r kommer att bli fet stil/ det h&auml;r kommer att uttryckas med emfas).
<br />
<a href="help.php?file=wiki.html">Mer info om Wiki-text</a></p>

