<p align="center"><b>Inst&auml;llningar f&ouml;r f&ouml;nster</b></p>

<p>Med de h&auml;r inst&auml;llningarna kan Du visa eller d&ouml;lja inst&auml;llningar genom att klicka p&aring; knappen som heter "D&ouml;lj inst&auml;llningar" eller "Visa inst&auml;llningar".
</p>

<p>I normalfallet s&aring; visas resurser i ett vanligt f&ouml;nster i en ram med Moodles navigationsrad i den &ouml;versta ramen.
Om Du s&aring; &ouml;nskar s&aring; kan Du ta bort den &ouml;vre ramen och visa resursen i ett f&ouml;nster som ser ut som en vanlig webbsida.
</p>

<p>Om Du d&auml;remot vill visa resursen i ett popup-f&ouml;nster s&aring; f&aring;r Du g&ouml;ra f&ouml;ljande:</p>

<ol>
  <li>I sektionen f&ouml;r <b>F&ouml;nster:</b> markerar Du 'Nytt f&ouml;nster'.</li>
  <li>Avmarkera de alternativ som Du inte vill anv&auml;nda Dig av.<br />

<blockquote>
  <b>L&aring;t anv&auml;ndarna &auml;ndra f&ouml;nstrets storlek</b>
  <p>
  Genom att markera det h&auml;r alternativet s&aring; l&aring;ter Du anv&auml;ndarna &auml;ndra f&ouml;nstrets storlek. Det b&ouml;r Du i regel g&ouml;ra.
  Ibland &auml;r inneh&aring;llet emellertid i en viss best&auml;md storlek och d&aring; kan det finnas en mening med att l&aring;sa storleken p&aring; f&ouml;nstret. </p>

  <b>L&aring;t anv&auml;ndarna 'skrolla' f&ouml;nstret</b>
  <p>
  Genom att markera det h&auml;r alternativet s&aring; l&aring;ter Du anv&auml;ndarna 'skrolla' f&ouml;nstret upp och ner och i sidled 
  f&ouml;r att kunna se hela Din resurs.
  Om det h&auml;r alternativet inte &auml;r markerat s&aring; kommer anv&auml;ndarna bara att se det som passar in i den p&aring; f&ouml;rhand best&auml;mda
  storleken p&aring; f&ouml;nstret och d&aring; kan de heller inte 'skrolla' f&ouml;r att se det som inte f&aring;r plats i f&ouml;nstret.</p>

  <b>Visa l&auml;nkarna till biblioteket</b>
  <p>Genom att markera det h&auml;r alternativet s&aring; l&aring;ter Du anv&auml;ndarna se l&auml;nkarna till sina 
  mappar i det h&auml;r f&ouml;nstret. Det varierar mellan webbl&auml;sare hur det h&auml;r fungerar: det kan vara l&auml;nkraden (i IE),
  Favoritraden eller raden f&ouml;r bokm&auml;rken (i Mozilla/Firefox).</p>

  <b>Visa placeringen</b>
  <p>Vill Du att anv&auml;ndarna ska se adressen till resursen?
  Is&aring;fall ska Du l&aring;ta det h&auml;r alternativet vara markerat. Annars kommer adressen att 
  vara dold.</p>

  <b>Visa menyraden</b>
  <p>
  Genom att markera det h&auml;r alternativet s&aring; l&aring;ter Du anv&auml;ndarna f&aring; tillg&aring;ng till menyraden i det h&auml;r f&ouml;nstret.
  I normalfallet s&aring; &auml;r det det b&auml;sta alternativet men det kan finnas grafiska presentationer som ser b&auml;ttre ut
  utan menyrad.</p>

  <b>Visa verktygsraden</b>
  <p>Genom att markera det h&auml;r alternativet s&aring; l&aring;ter Du anv&auml;ndarna se verktygsraden vilket g&ouml;r det l&auml;ttare f&ouml;r Dina anv&auml;ndare
  navigera eftersom det d&aring; finns knappar f&ouml;r att g&aring; fram&aring;t, bak&aring;t, hem och f&ouml;r att uppdatera sidan..</p>

  <b>Visa statusraden</b>
  <p>Genom att markera det h&auml;r alternativet s&aring; l&aring;ter Du anv&auml;ndarna se statusraden
  s&aring; att de kan f&ouml;lja det som webbl&auml;saren h&aring;ller p&aring; med som t ex 
  visa hur mycket av en resurs som har laddats ner eller s&auml;kerhetsinformation.</p>

</blockquote>

  <li>F&ouml;nstrets aktuella vidd (i pixlar) <br />

<blockquote>
  <p>M&aring;nga anv&auml;nder fortfarande en genomsnittslig sk&auml;rmuppl&ouml;sning p&aring; 800x600. Oftast &auml;r det b&auml;st om Du till att b&ouml;rja med 
  anger en storlek f&ouml;r Ditt f&ouml;nster som &auml;r lite mindre &auml;n det, som t ex 600 h&ouml;gt och 480 brett.</p>

  <p>Om Du inte skriver in n&aring;gra v&auml;rden i dessa textrutor s&aring; kommer det nya popup-f&ouml;nstret att 
  f&aring; exakt samma storlek som det f&ouml;nster som anv&auml;ndaren klickade p&aring; f&ouml;r att 
  komma till Ditt popup-f&ouml;nster. </p>

</blockquote>
</li>
</ol>
