<?PHP // $Id$ 
      // admin.php - created with Moodle 1.4.1+ (2004083101)


$string['cachetext'] = 'Период на достъпност на кешираните текстове';
$string['filteruploadedfiles'] = 'Филтриране на качените файлове';
$string['upgradelogs'] = 'За постигане на пълна функционалност, е необходимо обновяване на старите регистри.  <a href=\"$a\">Информация по темата</a>';
$string['upgradelogsinfo'] = 'Наскоро бяха направени промени в начина на съхраняване на регистрите. За да можете да разглеждате старите регистри, е нужно те да бъдат обновени. В зависимост от сайта ви, това може да отнеме много време (например няколко часа) и може да е доста натоварващо за базите данни, обслужващи големи сайтове. Започнете ли веднъж този процес, трябва да го оставите да завърши (т.е. да не затваряте прозореца на браузъра). Не се безпокойте - сайтът ви ще е достъпен за потребителите по време на този процес.<br /><br />Искате ли да обновите регистрите сега?';
$string['upgradesure'] = 'Файловете на Moodle са обновени и вие сте на път автоматично да обновите вашия сървър до версия:
<p><b>$a</b></p>
<p>Веднъж направите ли го, връщане назад няма.</p>
<p>Сигурни ли сте, че искате да обновите сървъра до указаната версия?</p>';
$string['upgradinglogs'] = 'Обновяване на регистрите';

?>
