<?PHP // $Id$ 
      // auth.php - created with Moodle 1.4.1+ (2004083101)


$string['auth_dbdescription'] = 'При този метод се използва външна база данни за проверка на потребителските имена и пароли. Ако профилът е нов, информацията от другите полета също може да бъде копирана в Moodle.';
$string['auth_dbextrafields'] = 'Тези полета не са задължителни. Можете да попълните някои от полетата на Moodle, съдържащи детайли за потребителя, с информация от <B>външната база данни</B>, която настройвате тук. <P>Ако не попълните нищо, ще бъдат използвани настройките по подразбиране.<P>И в двата случая, потребителите могат да редактират тези полета, след като влезнат в системата.';
$string['auth_dbfieldpass'] = 'Име на полето, съдъжащо паролите';
$string['auth_dbfielduser'] = 'Име на полето, съдържащо потребителските имена';
$string['auth_dbhost'] = 'Име на компютъра, съхраняващ базата данни';
$string['auth_dbname'] = 'Име на базата данни';
$string['auth_dbpass'] = 'Парола, съответстваща на горното име';
$string['auth_dbpasstype'] = 'Формат за полето, съдържащо паролата. Шифърът MD5 е полезен при свързване с други чсто срещани web приложения, като PostNuke.';
$string['auth_dbtable'] = 'Име на таблицата в базата данни';
$string['auth_dbtitle'] = 'Използване на външна база данни';
$string['auth_dbtype'] = 'Тип на базата данни. (За повече информация, вижте <a href=\"../lib/adodb/readme.htm#drivers\">документацията на ADOdb</a>.)';
$string['auth_dbuser'] = 'Потребителско име за достъп за четене до базата данни';
$string['auth_emaildescription'] = 'Потвърждението по електронна поща е метода за идентифициране по подразбиране. Когато потребителя се регистрира, избирайки свое име и парола, до електронния му адрес се изпраща писмо за потвърждение. В писмото се съдържа защитена възка към страница, на която потребителя може да потвърди своя профил. При следващи влизания в системата, потребителското име и паролата се сравняват със стойностите, съхранени в базата данни на Moodle.';
$string['auth_emailtitle'] = 'Идентификация по е-поща';
$string['auth_fccreators'] = 'Списък на групите, чиито членове могат да създават нови курсове. Отделние имена в списъка се разделят с \';\'. Имената трябва да са изписани точно както на FirstClass сървъра. Системата е чувствителна към малки/големи букви.';
$string['auth_fcdescription'] = 'Този метод използва FirstClass сървър за проверка на потребителските имена и пароли.';
$string['auth_fcfppport'] = 'Порт (най-често е 3333)';
$string['auth_fchost'] = 'Адресът на FirstClass сървъра. Използвайте IP адрес  или DNS име.';
$string['auth_fcpasswd'] = 'Парола за горния профил.';
$string['auth_fctitle'] = 'Използване на FirstClass съръвр';
$string['auth_fcuserid'] = 'Идентификатор на потребител на FirstClass сървъра, имащ \'Subadministrator\' привилегията.';
$string['auth_imapdescription'] = 'Този метод използва IMAP сървър за проверка на потребителските имена и пароли.';
$string['auth_imaphost'] = 'Адрес на IMAP сървъра. Използвайте IP адрес или DNS име.';
$string['auth_imapport'] = 'Порт на IMAP сървъра. (Обикновенно 143 или 993.)';
$string['auth_imaptitle'] = 'Използване на IMAP сървър';
$string['auth_imaptype'] = 'Тип на IMAP сървъра. IMAP сървърите могат да имат различни методи за оторизация и комуникация.';
$string['auth_ldap_bind_dn'] = 'Ако искате да използвате bind-user, за да търсите потребители, укажете го тук. Нещо от рода на \'cn=ldapuser,ou=public,o=org\'';
$string['auth_ldap_bind_pw'] = 'Парола за bind-user.';
$string['auth_ldap_contexts'] = 'Списък на местата (contexts), където се намират потребителските списъци. Разделителят е \';\'. Пример: \'ou=users,o=org; ou=others,o=org\'';
$string['auth_ldap_create_context'] = 'Ако разрешите създаването на потребители на база потвърждение по е-поща, укажете мястото (context), където да се създават потребителите. От гледна точка на сигурността е по-добре тези потребители да са отделени от останалите. Забележете, че не е нужно да указвате това място в променливата ldap_context. тъй като Moodle автоматично ще го използва.';
$string['auth_ldap_creators'] = 'Списък на групите, чиито членове могат да създават нови курсове. Разделителят е \';\'. Пример: \'cn=teachers,ou=staff,o=myorg\'';
$string['auth_ldap_host_url'] = 'Укажете URL адреса на LDAP сървъра. Например: \'ldap://ldap.myorg.com/\' или \'ldaps://ldap.myorg.com/\'';
$string['auth_ldap_version'] = 'Версията на протокола LDAP, използвана от сървъра.';
$string['auth_ldapdescription'] = 'Този метод осигурява идентификация на базата на външен LDAP сървър. Ако указаното име и парола се потвърдят от LDAP сървъра, Moodle създава нов потребител в своята база данни. Този модул може да изчете определени атрибути от LDAP сървъра и автоматично да попълни съответноте полета от базата данни на Moodle. Процедурата за идентификация от LDAP се изпълнява само веднъж, като след това се използва базата данни на Moodle.';
$string['auth_ldapextrafields'] = 'Тези полета не са задължителни. Можете да укажете прехвърлянето на информация за някои от полетата в базата данни на Moodle от <B>LDAP източника</B>. Ако не укажете нищо, ще бъдат използвани подразбиращите се стойности на Moodle.<P>И в двата случая, потребителите имат възможност да редактират полетата, след като влезнат в системата.';
$string['auth_ldaptitle'] = 'Използване на LDAP сървър';
$string['auth_manualdescription'] = 'Този метод изключва създаването на нови профили от самите потребители. Всички профили трябва да бъдат създадени на ръка от администратор.';
$string['auth_manualtitle'] = 'Ръчно създаване на всички профили';
$string['auth_multiplehosts'] = 'Могат да бъдат указани множество хостове ИЛИ адреси (напр.:host1.com;host2.com;host3.com ИЛИ xxx.xxx.xxx.xxx;xxx.xxx.xxx.xxx)';
$string['auth_nntpdescription'] = 'При този метод се използва NNTP сървър, за потвърждаване на заявените потребителски имена и пароли.';
$string['auth_nntphost'] = 'Адрес на NNTP сървъра. Можете да използвате IP адрес или DNS име.';
$string['auth_nntpport'] = 'Порт (най-често 119)';
$string['auth_nntptitle'] = 'Използване на NNTP сървър';
$string['auth_nonedescription'] = 'Потребителите могат да създават нови профили незабавно, без да е необходима оторизация от външен сървър или потвърждение по е-поща. Внимавайте с тази опция. Преди да я активирате си помислете за проблемите със сигурността и при администрирането, които може да предизвика.';
$string['auth_nonetitle'] = 'Без оторизация';
$string['auth_pop3description'] = 'Този метод използва POP3 сървър за проверка валидността на потребителските имена и пароли.';
$string['auth_pop3host'] = 'Адрес на POP3 сървъра. Можете да използвате IP адрес или DNS име.';
$string['auth_pop3mailbox'] = 'Име на пощенската кутия, с която да бъде установена връзка (обикновенно INBOX).';
$string['auth_pop3port'] = 'Порт (най-често 110 или 995 ако се ползва SSL)';
$string['auth_pop3title'] = 'Използване на POP3 сървър';
$string['auth_pop3type'] = 'Тип на сървъра (ако вашият сървър използва цифрови сертификати, изберете pop2cert)';
$string['auth_user_create'] = 'Възможност за създаване на потребители';
$string['auth_usernameexists'] = 'Избраното потребителско име вече е регистрирано! Моля, изберете си друго.';
$string['authenticationoptions'] = 'Настройки на идентификацията';
$string['authinstructions'] = 'Тък можете да запишете инструкциите си към потребителите относно потребителските имена и пароли. Този текст ще се появява на страницата за влизане в системата. Ако не попълните нищо, няма да бъдат показвани инструкции.';
$string['changepassword'] = 'Адрес за промяна на парола';
$string['changepasswordhelp'] = 'Тук можете да укажете място, където потребителите могат да възстановят или променят потребителскотео си име и парола, в случай че са ги забравили. Ако укажете адрес, той ще е достъпен под формата на бутон на страницата за влизане в системата. Ако оставите полето празно, бутонът няма да бъде показван.';
$string['chooseauthmethod'] = 'Метод за оторизация:';
$string['guestloginbutton'] = 'Бутон за вход като гост';
$string['instructions'] = 'Инструкции';
$string['md5'] = 'MD5 шифроване';
$string['plaintext'] = 'Опикновен текст';
$string['showguestlogin'] = 'Можете да включите/изключите показването на бутона за вход като гост.';

?>
