<?PHP // $Id$ 
      // enrol_paypal.php - created with Moodle 1.4.1+ (2004083101)


$string['business'] = 'Електронния адрес (e-mail) за бизнес-профила ви в Paypal';
$string['description'] = 'Paypal модулът ви позволява да създавате платни курсове. Ако цената за определен курс е нула, от студентите не се изисква да заплащат за него. Съществува цена по подразбиране за всички курсове на сайта (която задавате тук), както и настройка за всеки отделен курс. Имайте в предвид, че указаната за курса цена анулира цената по подразбиране. ';
$string['enrolname'] = 'Paypal';
$string['sendpaymentbutton'] = 'Плащане през Paypal';

?>
