<?PHP // $Id$ 
      // enrol_database.php - created with Moodle 1.4.1+ (2004083101)


$string['dbhost'] = 'Име на сървъра';
$string['dbname'] = 'Име на базата данни';
$string['dbpass'] = 'Парола за достъп';
$string['dbtable'] = 'Таблица в базата данни';
$string['dbtype'] = 'Тип на сървъра';
$string['dbuser'] = 'Потребителско име';
$string['description'] = 'Можете да използвате външна база данни (почти всяка), за да контролирате записванията. При това се предполага, че във външната маза данни се съдържа поле, съдържащо идентификатор на курса и поле, съдържащо идентификатор на потребителя. Те се сравняват с полетата за курса и таблиците с потребителите.';
$string['enrolname'] = 'Въбшна база данни';
$string['localcoursefield'] = 'Името на полето от таблицата с курсовете, което трябва да се сравнява с външната база данни (напр.: idnumber)';
$string['localuserfield'] = 'Името на полето във таблицата на локалните потребители, което трябва да се сравнява с външната база данни (напр.: idnumber)';
$string['remotecoursefield'] = 'Полето от външната база данни, в което трябва да е идентификатора на курса';
$string['remoteuserfield'] = 'Полето от външната база данни, в което трябва да е идентификатора на потребителя';

?>
