<?PHP // $Id$ 
      // survey.php - created with Moodle 1.4.1+ (2004083101)


$string['alreadysubmitted'] = 'Вече сте изпратили това проучване';
$string['analysisof'] = 'Анализ на $a';
$string['answers'] = 'Отговори';
$string['attls1'] = 'При оценката на изказванията, аз съсредоточавам вниманието си върху аргументацията, а не върху личността.';
$string['attls10'] = 'за мен е важно да запазя обективността си при анализа.';
$string['attls10short'] = 'запазване на обективността';
$string['attls11'] = 'опитвам се да мисля заедно с останалите, а не срещу тях.';
$string['attls11short'] = 'мислене ЗАЕДНО с останалите';
$string['attls12'] = 'имам определени критерии, които използвам при оценка на аргументацията.';
$string['attls12short'] = 'критерии при оценяването';
$string['attls13'] = 'по вероятно е да се опитам да разбера чуждото мнение, отколкото да го оценявам.';
$string['attls13short'] = 'разбиране на чуждото мнение';
$string['attls14'] = 'опитвам се да изложа слабите страни в позициите на другите, за да им помогна да изяснят аргументацията си.';
$string['attls14short'] = 'показване на слабостите';
$string['attls15'] = 'се опитвам да разбера другите; да разбера защо мислят по този начин. Особено при спорни въпроси.';
$string['attls15short'] = 'разбиране на чуждата гледна точка';
$string['attls16'] = 'моят метод на анализ може да бъде наречен \'внимателно изпитване на аргументите\'.';
$string['attls16short'] = 'изпитване на аргументите';
$string['attls17'] = 'ценя логиката и причинно-следствените връзки повече от собствените си опасения и пердчувствия.';
$string['attls17short'] = '\'ценя логиката\'';
$string['attls18'] = 'мога да добия отлична представа за мненията, различни от моето, чрез емпатия.';
$string['attls18short'] = 'емпатия';
$string['attls19'] = 'когато срещна хора, чиитео мнения са ми чужди, аз се опитвам да надмогна себе си и да разбера причините за тези мнния.';
$string['attls19short'] = 'надмогване на себе си';
$string['attls20'] = 'отделям известно време, за да разбера какво \'не е на ред\'. Например, ще потърся нещо, което не е обсъдено или аргументирано добре.';
$string['attls20short'] = 'какво не е наред?';
$string['attlsintro'] = 'Целта на този въпросник е да ни помогне да оценим вашето отношение към мисленето и ученето.

Тук няма \'верни\' и \'грешни\' отговори - ние просто се интересуваме от вашето мнение. Бъдете сигурни, че вашите отговори ще бъдат запазени в тайна и няма да се отразят на башата оценка.';
$string['attlsmintro'] = 'В дискусия...';
$string['ciq5'] = 'Кое събитие ви изненада най-силно?';
$string['ciq5short'] = 'Изненадващо събитие';
$string['clicktocontinue'] = 'Щранете тук, за да продължите';
$string['scaleagree5'] = 'Пълно несъгласие,Несъгласие,Без мнение,Съгласие, Пълно съгласие';
$string['time'] = 'Време';

?>
