<?PHP // $Id$ 
      // admin.php - created with Moodle 1.5.2 (2005060220)


$string['adminseesallevents'] = 'ადმინისტრატორი ხედავს ყველა მოვლენას';
$string['adminseesownevents'] = 'ადმინისტრატორები ისეთივე მომხმარებლები არიან, როგორც სხვები';
$string['blockinstances'] = 'შემთხვევა';
$string['blockmultiple'] = 'მრავლობითი';
$string['cachetext'] = 'ტექსტის ქეშირების ხანგრძლივობა';
$string['calendarsettings'] = 'კალენდარი';
$string['change'] = 'ცვლილება';
$string['configsectioninterface'] = 'ინტერფეისი';
$string['configsectionmail'] = 'ფოსტა';
$string['configsectionmaintenance'] = 'მომსახურება';
$string['configsectionmisc'] = 'სხვადასხვა';
$string['configsectionoperatingsystem'] = 'ოპერაციული სისტემა';
$string['configsectionpermissions'] = 'უფლებები';
$string['configsectionsecurity'] = 'უსაფრთხოება';
$string['configsectionuser'] = 'მომხმარებელი';
$string['configvariables'] = 'ცვლადები';
$string['confirmation'] = 'დადასტურება';
$string['cronwarning'] = '<a href=\"cron.php\">cron.php-ის მომსახურების სკრიპტი </a> არ ყოფილა გაშვებული უკანასკნელი 24 საათის განმავლობაში. <br /><a href=\"../doc/?frame=install.html⊂=cron\">ინსტალაციის დოკუმენტაცია</a> განმარტავს როგორ შეიძლება ამის ავტომატიზება.';
$string['edithelpdocs'] = 'help დოკუმენტების თარგმნა';
$string['editstrings'] = 'შეტყობინებების რედაქტირება';
$string['filteruploadedfiles'] = 'ატვირთული ფაილიების გაფილტვრა';
$string['helpadminseesall'] = 'ადმინისტრატორი უნდა ხედავდეს ყველა კალენდარულ ღონისძიებებს, თუ მხოლოდ იმას, რაც მას ეხება?';
$string['helpcalendarsettings'] = 'კალენდარულ თარიღებთან და დროსთან დაკავშირებული Moodle-ის ასპექტების კონფიგურირება ';
$string['helpstartofweek'] = 'რომელი დღით იწყება კალენდარული კვირა?';
$string['helpupcominglookahead'] = 'რამდენი დღის განმავლობაში უნდა აჩვენებდეს კალენდარი (ნაგულისხმევად) მოახლოებულ ღონისძიებას?';
$string['helpupcomingmaxevents'] = 'მაქსიმალურად რამდენ მოახლოებულ ღონისძიებას უნდა აჩვენებდეს კალენდარი (ნაგულისხმევად)?';
$string['helpweekenddays'] = 'კვირის რომელი დღე არის გაიგივებული ”გამოსასვლელ დღესთან” და რა განსხვავებული ფერით უნდა გამოისახებოდეს?';
$string['sitemaintenance'] = 'საიტი ამჟამად მომსახურების რეჟიმშია და იგი დროებით მიუწვდომელია';
$string['sitemaintenancemode'] = 'მომსახურების რეჟიმი';
$string['sitemaintenanceoff'] = 'მომსახურების რეჟიმი გამოირთო და საიტი აგრძელებს მუშაობას ჩვეულ რეჟიმში';
$string['sitemaintenanceon'] = 'საიტი ამჟამად იმყოფება მომსახურების რეჟიმში და იგი დროებით მიუწვდომელია (მხოლოდ ადმინისტრატორებს შეუძლიათ შესვლა)';
$string['sitemaintenancewarning'] = 'საიტი არის მომსახურების რეჟიმში (მხოლოდ ადმინისტრატორებს შეუძლიათ შესვლა). სამუშაო მდგომარეობაში დასაბრუნებლად <a href=\"maintenance.php\">გამორთეთ მომსახურების რეჟიმი</a>.';
$string['therewereerrors'] = 'თქვენს მონაცემებში შეცდომაა ';
$string['upgradelogs'] = 'სრული ფუნქციონირებისთვის თქვენი ძველი ლოგები საჭიროებენ განახლებას.<a href=\"$a\">მეტი ინფორმაცია</a>';
$string['upgradelogsinfo'] = 'ახლახანს იქნა შესრულებული გარკვეული ცვლილებები, რომელთა ლოგები შენახულია. წინა აქტიურობის ლოგების დათვალიერებისათვის თქვენი ძველი ლოგები საჭიროებს განახლებას. თქვენს საიტზე დამოკიდებულებით ამას შეიძლება რამდენიმე საათი დასჭირდეს. თუ დაიწყებთ ამ პროცესს (ამავდროულად ბრაუზერის ფანჯარა მუდმივად უნდა იყოს დატოვებული გახსნილად), ის აუცილებლად უნდა დაასრულოთ. ნუ წუხართ! სანამ თქვენ ანახლებთ ლოგებს, სხვებისათვის ამ დროს თქვენი საიტი ჩვეულებრივად იმუშავებს.<br /><br />გსურს ახლა თქვენი ლოგების განახლება? ';
$string['upgradesure'] = 'თქვენი Moodle-ის ფაილები იქნა შეცვლილი, და თქვენ მოგიწევთ თქვენი სერვერის ავტომატური განახლება <p><b>$a</b></p> ვერსიით.
<p>თუ ამას შეასრულებთ, შემდგომში ძველ ვერსიას ვეღარ დააბრუნებთ.</p>
<p>დარწმუნებული ხართ, რომ გინდათ თქვენს სერვერზე ამ ვერსიის დაყენება ?</p> ';
$string['upgradingdata'] = 'განახლების ინფორმაცია';
$string['upgradinglogs'] = 'განახლების ლოგები';

?>
