<?PHP // $Id$ 
      // block_quiz_results.php - created with Moodle 1.4.4 (2004083140)


$string['bestgrade'] = 'უმაღლესი ქულა;';
$string['bestgrades'] = '$a -ს უმარლესი ქულა';
$string['bestgroupgrade'] = 'ჯგუფი უმაღლესი გასაშუალებულით:';
$string['bestgroupgrades'] = '$a ჯგუფები უმაღლესი გასაშუალებულით:';
$string['config_format_absolute'] = 'აბსოლუტური რაოდენობა';
$string['config_format_fraction'] = 'ნაწილები';
$string['config_format_percentage'] = 'პროცენტები';
$string['config_grade_format'] = 'აჩვენე ქულები როგორც:';
$string['config_no_quizzes_in_course'] = 'ეს კურსი არ შეიცავს წინასწარ (საშუალედო)შეფასებას. დაუმატე თუნდაც ერთი ამ ბლოკის სწორი გამოყენებისათვის.';
$string['config_select_quiz'] = 'საიდან გამომდინარე წინასწარი შეფასება უნდა აჩვენოს ამ ბლოკმა?';
$string['config_show_best'] = 'უმაღლესი შეფასებებიდან რამდენი უნდა იქნას ნაჩვენები? (0 თუ გსურთ აკრძალოთ ჩვენება)';
$string['config_show_worst'] = 'უდაბლესი შეფასებებიდან რამდენი უნდა იქნას ნაჩვენები? (0 თუ გსურთ აკრძალოთ ჩვენება)';
$string['config_use_groups'] = 'ვაჩვენოთ ჯგუფები სტუდენტების ნაცვლად? (იმ შემთხვევაში მხოლოდ, თუ კურსებზე გათვალისწინებულია წინასწარი (საშუალედო) გამოკითხვა)';
$string['configuredtoshownothing'] = 'ამ ბლოკის მიმდინარე კონფიგურაცია არ იძლევა არავითარი შედეგების გამოხატვის საშუალებას. თქვენ დაგჭირდებათ მისი კონფიგურირება ან დამალვა';
$string['error_emptyquizid'] = 'სწორედ ახლა ამ ბლოკში წარმოიქმნა რაღაც შეცდომა: უნდა აირჩიო საიდან გამომდინარე საშუალედო შემოწმების შედეგი უნდა გამოისახოს.';
$string['error_emptyquizrecord'] = 'სწორედ ახლა ამ ბლოკში წარმოიქმნა რაღაც შეცდომა: არჩეული საშუალედო შემოწმების შედეგი როგორც ჩანს არ არის მონაცემთა ბაზაში.';
$string['error_nogroupsexist'] = ' სწორედ ახლა ამ ბლოკში წარმოიქმნა რაღაც შეცდომა: ის მომართულია ჯგუფური ქულების საჩვენებლად, მაშინ როდესაც ამ კურში ჯგუფები განსაზღვრული არ არის.';
$string['formaltitle'] = 'წინასწარი(საშუალედო)გამოკითხვის შედეგები';
$string['worstgrade'] = 'უდაბლესი შეფასება:';
$string['worstgrades'] = '$a უდაბლესი შეფასება:';
$string['worstgroupgrade'] = 'ჯგუფი უდაბლესი გასაშუალებული შეფასებით:';
$string['worstgroupgrades'] = '$a ჯგუფი უდაბლესი გასაშუალებული შეფასებით:';

?>
