<?PHP // $Id$ 
      // chat.php - created with Moodle 1.4.4 (2004083140)


$string['beep'] = 'ზუმერი';
$string['chatintro'] = 'შესავალი ტექსტი';
$string['chatname'] = 'ამ სასაუბრო ოთახის სახელწოდება';
$string['chatreport'] = 'საუბრის სესიები';
$string['chattime'] = 'შემდეგი საუბრის დრო';
$string['configmethod'] = 'ნორმალური საუბრის მეთოდი აერთიანებს კლიენტებს რომლებიც რეგულარულად მამართავენ სერვერს, განახლებების სანახავად. ეს არ საჭიროებს კონფიგურირებას, ყოველი ახალი შემოსვლისათვის და მუშაობს ყველგან, მაგრამ ამან შეიძლება გამოიწვიოს სერვერის მეტად დატვირთვა თუ ერთდროულად ბევრი  საუბრები იმართება. სერვერის ‘დომენის’ გამოყენება მოითხოვს Unix-ის ოპერაციულ სისტემაზე მიწვდომას, მაგრამ ეს მოქმედებს  სასაუბრო გარემოს მაშტაბირების სისწრაფეზე.';
$string['configoldping'] = 'რა მაქსიმალურმა დრომ (წამებში) შეიძლება გაიაროს, სანამ ჩვენ შევამჩნევთ მომხმარებლის დათიშვას. ეს არის მხოლოდ ზედა ზღვარი, რადგან ჩვეულებრივად გათიშვებს ძალიან სწრაფად ვამჩნევთ. დაბალი მნიშვნელობები უფრო დიდ მოთხოვნებს უყენებენ სერვერს. თუ თქვენ იყენებთ ნორმალურ მეთოდს, მაშინ <strong>ნურასდროს</strong> ნუ დააყენებთ ამას 2-ზე ნაკლებზე* chat_refresh_room.';
$string['configrefreshroom'] = 'რამდენად ხშირად უნდა განახლდეს თავისთავად სასაუბრო ოთახი (წამებში)? ამის დაყენება დაბალ მნიშვნელობაზე სასაუბრო ოთახს უფრო სწრაფს გახდის.მაგრამ ის დატვირთავს თქვენ ვებ სერვერს, თუ ერთდროულად ბევრი მომხმარებელი საუბრობს.';
$string['configrefreshuserlist'] = 'როგორი სიხშირით უნდა განახლდეს მომხმარებელთა სია (წამებში).';
$string['configserverhost'] = '”მასპინძელი” კომპიუტერის სახელი, რომელზეც სერვერის დომენია განთავსებული.';
$string['configserverip'] = 'IP ციფრობრივი მისამართი, შესაბამისი ”მასპინძელი” კომპიუტერის ზემოთ ნაჩვენებ სახელთან.';
$string['configservermax'] = 'კლიენტების ნებადართული მაქსიმალური რაოდენობა. ';
$string['configserverport'] = 'დომენისათვის გამოსაყენებელი სერვერის პორტი.';
$string['currentchats'] = 'აქტიური საუბრის სესია.';
$string['currentusers'] = 'მიმდინარე მომხმარებლები.';
$string['deletesession'] = 'წაშალეთ ეს სესია.';
$string['deletesessionsure'] = 'დარწმუნებული ხართ გსურთ ამ სესიის წაშლა?';
$string['donotusechattime'] = 'ნუ გამოაქვეყნებთ საუბრების დროს.';
$string['enterchat'] = 'ახლა აქ დააწკაპუნეთ საუბარის დასაწყებად.';
$string['errornousers'] = 'ვერცერთი მომხმარებელი ვერ ვიპოვეთ! ';
$string['explaingeneralconfig'] = 'ეს სეთინგები
<strong>ყოველთვის </strong> მოქმედებაშია.';
$string['explainmethoddaemon'] = 'ეს სეთინგი მოქმედებს <strong>მხოლოდ</strong> მაშინ როდესაც სასაუბრო მეთოდად არჩეულია “სერვერის სასაუბრო დომენი”';
$string['explainmethodnormal'] = 'ეს სეთინგი მოქმედებს<strong>მხოლოდ</strong> მაშინ, როდესაც სასაუბრო მეთოდად არჩეულია “ნორმალური მეთოდი”';
$string['generalconfig'] = 'ზოგადი კონფიგურაცია.';
$string['helpchatting'] = 'საუბარში დახმარება.';
$string['idle'] = 'გაზარმაცებული.';
$string['messagebeepseveryone'] = '$a უხმობს ყველას!';
$string['messagebeepsyou'] = '$aმ ახლახან მოგიხმოთ!';
$string['messageenter'] = '$a ახლახანს შემოვიდა ამ საუბარში';
$string['messageexit'] = '$aმ დატოვა ეს საუბარი';
$string['messages'] = 'წერილები';
$string['methoddaemon'] = 'სასაუბრო სერვერის დომენი.';
$string['methodnormal'] = 'ნორმალური მეთოდი.';
$string['modulename'] = 'ჩატი-საუბარი';
$string['modulenameplural'] = 'საუბრები';
$string['neverdeletemessages'] = 'წერილებს ნურასდროს ნუ წაშლით';
$string['nextsession'] = 'შემდეგი დაგეგმილი სესია.';
$string['noguests'] = 'სასაუბარი არ არის ღია სტუმრებისთვის.';
$string['nomessages'] = 'წერილები ჯერ-ჯერობით არ არის.';
$string['repeatdaily'] = 'ყოველ დღე ამავე დროს.';
$string['repeatnone'] = 'გამეორებების გარეშე –აჩვენეთ მხოლოდ მინიშნებული დრო.';
$string['repeattimes'] = 'სესიის გამეორება.';
$string['repeatweekly'] = 'ყოველ კვირა ამავე დროს.';
$string['savemessages'] = 'შეინახეთ ბოლო სესია.';
$string['seesession'] = 'იხილეთ ეს სესია.';
$string['sessions'] = 'საუბრის სესია.';
$string['strftimemessage'] = '%%H:%%M';
$string['studentseereports'] = 'ბოლო სესიის ნახვა ყველას შეუძლია.';
$string['viewreport'] = 'იხილეთ ბოლო საუბრის სესია.';

?>
