<?PHP // $Id$ 
      // enrol_flatfile.php - created with Moodle 1.4.4 (2004083140)


$string['description'] = 'ეს მეთოდი განმეორებით გასინჯავს და შეასრულებს სპეციალურად ფორმატირებული ტექსტის დამუშავებას მისამართზე, <pre>
დაუმატეთ, სტუდენტი, 5, CF101
დაუმატეთ, მასწავლებელი, 6, CF101
დაუმატეთ, მასწ.რედაქტორი, 7, CF101
წაშალეთ, სტუდენტი, 8, CF101
წაშალეთ, სტუდენტი, 17, CF101
დაუმატეთ, სტუდენტი, 21, CF101, 1091115000, 1091215000
</pre>
რომელსაც მიუთითებთ. ასეთი ფაილები მსგავსია შემდეგის:
';
$string['enrolname'] = 'მარტივი ფაილი';
$string['filelockedmail'] = 'ფაილზე დაფუძვნებული გარემოსათვის გამოყენებული ტექსტური ფაილის ($a) წაშლა არ შეიძლება cron პროცესით. ჩვეულებრივად ეს მიანიშნებს რომ ამაზე ნებართვა არასწორია! დააფიქსირეთ ნებართვა ისე, რომ Moodle-მა შეძლოს მისი წაშლა, წინააღმდეგ შემთხვევაში ეს პროცესი შეიძლება მრავალჯერ განმეორდეს.';
$string['filelockedmailsubject'] = 'მნიშვნელოვანი შეცდომა: გაწევრიანების ფაილი';
$string['location'] = 'ფაილის მდებარეობა';
$string['mailadmin'] = 'ადმინისტრატორის შეტყობინება ელ-ფოსტით';
$string['mailusers'] = 'მშეტყობინება ელ-ფოსტითომხმარებლის ';

?>
