<?PHP // $Id$ 
      // enrol_internal.php - created with Moodle 1.4.4 (2004083140)


$string['description'] = 'ეს არის ჩარიცხვის ნაგულისხმევი მეთოდი. არსებობს სტუდენტის კონკრეტულ კურსში ჩარიცხვის ორი ძირითადი გზა. <ul>
<li>სტუდენტის ჩარიცხვა შეუძლია მასწავლებელს ან ადმინისტრატორს კურსის ადმინისტრირების მენიუში ბმულის გამოყენებით.</li>

<li> კურსს შეიძლება ჰქონდეს განსაზღვრული პაროლი, ცნობილი როგორც  ”გასაწევრიანებელი სიტყვა”. ყველას, ვინც იცის ეს სიტყვა შეუძლია ჩარიცხოს საკუთარი თავი შესაბამის კურსში.</li>
</ul>

';
$string['enrolname'] = 'ჩარიცხვის მეთოდები';

?>
