<?PHP // $Id$ 
      // enrol_ldap.php - created with Moodle 1.4.4 (2004083140)


$string['description'] = '<p>თქვენ შეგიძლიათ LDAP სერვერის გამოყენება თქვენს მიერ განხორციელებული გაწევრიანებების საკონტროლოდ.
იგულისხმება, რომ თქვენი LDAP სერვერის განშტოებები შეიცავს ჯგუფებს, რომლებიც განეკუთვნება კურსებს და თითოეული ამ კურსებიდან/ჯგუფებიდან შეიცავს გაწევრიანებების ჩანაწერებს, რომლებიც მოიცავს სტუდენტებს.</p>
<p>იგულისხმევა, რომ კურსები განსაზღვრულია როგორც ჯგუფები LDAP-ში, თითოეული ჯგუფისათვის მრავლობითი წევრობის არეებით (<em>წევრი</em> ან <em>წევრის UID</em>), რომელიც შეიცავსმომხმარებლის უნიკალურიდენტიფიკაციას.</p>
<p> LDAP გაწევრიანების გამოსაყენებლად, თქვენს მომხმარებელს <strong>უნდა</strong>
ჰქონდეს სწორი IDნომრის არე. კურსში გაწევრიანებისთვის LDAP ჯგუფებს უნდა ჰქონდეთ მითითებული ეს IDნომერი.
როგორც წესი ეს კარგად მუშაობს, თუ თქვენ უკვე იყენებდით LDAP-ის აუტენტიფიკაციას.</p>
<p>გაწევრიანება განახლდება მომხმარებლის შემოსვლისას.აგრეთვე თქვენ შეგიძლიათ გაუშვათ სკრიპტი გაწევრიანებების სინქრონიზაციისათვის. ნახეთ  <em>enrol/ldap/enrol_ldap_sync.php</em>.</p>
<p> ეს პლაგინი შეიძლება აგრეთვე იქნას გამოყენებული ახალი კურსების ავტომატური შექმნისათვის, როცა LDAP-ში გამოჩნდება ახალი ჯგუფები.</p>';
$string['enrol_ldap_autocreate'] = 'კურსი ავტომატურად შეიქმნება, თუ უკვე არის იმ კურსში გაწევრიანებულები, რომელსაც ჯერ კიდევ არ შეიცავს Moodle.';
$string['enrol_ldap_autocreation_settings'] = 'კურსი ავტომატურად შექმნის სეთინგი';
$string['enrol_ldap_bind_dn'] = 'თუ გსურთ გამოიყენოთ ”შეზღუდული მომხმარებლები”მიუთითეთ აქ, ამის მსგავსად: \'cn=ldapuser,ou=public,o=org\'';
$string['enrol_ldap_bind_pw'] = '”შეზღუდული მომხმარებლის” პაროლი ';
$string['enrol_ldap_category'] = 'ავტომატურად შექმნილი კურსების კატეგორია';
$string['enrol_ldap_course_fullname'] = 'არჩევითი: LDAP -ის არე სრული სახელის ფორმის მისარებად.';
$string['enrol_ldap_course_idnumber'] = 'LDAP-ში  ცალსახა განმსაზღვრელის რუქა, ჩვეულებრივად  <em>CN</em> ან <em>UID</em>. თუ იყენებთ კურსის ავტომატურ ჩამოყალიბებას, რეკომენდირებულია მნიშვნელობის ნახვა.';
$string['enrol_ldap_course_settings'] = 'კურსში გაწევრიანების სეთინგი';
$string['enrol_ldap_course_shortname'] = 'არჩევითი: LDAP -ის არე მოკლე სახელის ფორმის მისარებად.';
$string['enrol_ldap_course_summary'] = 'არჩევითი: LDAP -ის არე რეზიუმეს ფორმის მისარებად.';
$string['enrol_ldap_editlock'] = 'დაფიქსირებული მნიშვნელობა';
$string['enrol_ldap_host_url'] = 'მიუთითეთ LDAP ჰოსტი URL ფორმაში, მაგავსად:\'ldap://ldap.myorg.com/\'
ან \'ldaps://ldap.myorg.com/\'';
$string['enrol_ldap_objectclass'] = 'objectClass გამოყენებული კურსების საძიებლად. ჩვეულებრივად \'posixGroup\'.';
$string['enrol_ldap_server_settings'] = 'LDAP სერვერის სეთინგი';
$string['enrol_ldap_student_contexts'] = 'იმ კონტექსტების სია, სადაც განთავსებულია ჯგუფები გაწევრიანებული სტუდენტებით. განაცალკავეთ სხვადასხვა კონტექსტი \';\'-ით. მაგალითად: \'ou=courses,o=org; ou=others,o=org\'';
$string['enrol_ldap_student_memberattribute'] = 'წევრის ატრიბუტი,როცა მომხმარებელი განეკუთვნება ჯგუფს. ჩვეულებრივად ’წევრი’ ან ’წევრის UID’.';
$string['enrol_ldap_student_settings'] = 'სტუდენტის გაწევრიანების სეთინგი';
$string['enrol_ldap_teacher_contexts'] = 'იმ კონტექსტების სია, სადაც განთავსებულია ჯგუფები გაწევრიანებული მასწავლებლით. განაცალკავეთ სხვადასხვა კონტექსტი \';\'-ით. მაგალითად: \'ou=courses,o=org; ou=others,o=org\'';
$string['enrol_ldap_teacher_memberattribute'] = 'წევრის ატრიბუტი,როცა მომხმარებელი განეკუთვნება ჯგუფს. ჩვეულებრივად ’წევრი’ ან ’წევრის UID’.';
$string['enrol_ldap_teacher_settings'] = 'მასწავლებლის ჩართვის სეთინგი';
$string['enrol_ldap_template'] = 'არჩევითი: ავტომატურად შექმნილ კურსებს შეუძლიათ მათი სეთინგების კოპირება კურსის შაბლონიდან.';
$string['enrol_ldap_updatelocal'] = 'ლოკალური მონაცემის განახლება';
$string['enrol_ldap_version'] = 'LDAP-ის პროტოკოლის ვერსია, რომელსაც იყენებს თქვენი სერვერი';
$string['enrolname'] = 'LDAP';

?>
