<?PHP // $Id$ 
      // enrol_paypal.php - created with Moodle 1.4.4 (2004083140)


$string['business'] = 'თქვენი საქმიანი Paypal ანგარიშის ელ-ფოსტის მისამართი';
$string['description'] = 'Paypal მოდულის საშუალებით შესაძლებელია ფასიანი კურსების სეთაპი. თუ კურსის ფასად მითითებულია ”0”, სტუდენტისგან გაწევრიანებისათვის არ მოითხოვება გადახდა.  საიტის თქვენ მიერ განსაზღვრული ფასი ნაგულისხმავად იქნება მთელი საიტისთვის, ხოლო თითეული კურსის ფასი უნდა განისაზღვროს ინდივიდუალურად. კურსის ფასი უგულებყოფს საიტის ფასს.';
$string['enrolname'] = 'Paypal';
$string['sendpaymentbutton'] = 'გადაგზავნეთ გადასახადი თანხა  Paypal-ის მეშეობით';

?>
