<?PHP // $Id$ 
      // enrol_database.php - created with Moodle 1.4.4 (2004083140)


$string['dbhost'] = 'მონაცემთა ბაზის სერვერის ”ჰოსტის სახელი”';
$string['dbname'] = 'გამოსაყენებელი სპეციფიკური მონაცემთა ბაზა';
$string['dbpass'] = 'პაროლი სერვერისადმი მისაწვდომად';
$string['dbtable'] = 'ცხრილი შესაბამის მონაცემთა ბაზაში';
$string['dbtype'] = 'მონაცემტა ბაზის სერვერის ტიპი';
$string['dbuser'] = 'მომხმარებლი სახელი სერვერისადმი მისაწვდომად';
$string['description'] = 'თქვენი გაწევრიანებების საკონტროლოდ შესაძლოა გარე მონაცემთა ბაზის გამოყენება (თითქმის ნებისმიერი სახის). იგულისხმება, რომ გარე მონაცემთა ბაზა შეიცავს კურსის  ID-ს და არეს, რომელიც შეიცავს მომხმარებლის ID-ს. ისინი შედარებული იქნება არეებთან,რომლებსაც აირჩევთ ლოკალურ კურსში ან მომხმარებელთა ცხრილში.';
$string['enrolname'] = 'გარე მონაცემთა ბაზა';
$string['localcoursefield'] = 'არის სახელი ლოკალური კურსის ცხრილში,რომლებასც ვიყენებთ შესადარებლად გარე მონაცემთა ბაზაში არსებულთან (მაგ. ID რიცხვი)';
$string['localuserfield'] = 'არის სახელი ლოკალური მომხმარებლის ცხრილში,რომლებასც ვიყენებთ შესადარებლად გარე მონაცემთა ბაზაში ჩანაწერთან (მაგ. ID რიცხვი)';
$string['remotecoursefield'] = 'არე გარე მონაცემთა ბაზაში, რომელშიც  ვიმედოვნებთ  კურსის ID-ს მიგნებას  ';
$string['remoteuserfield'] = 'არე გარე მონაცემთა ბაზაში, რომელშიც  ვიმედოვნებთ  მომხმარებლის ID-ს მიგნებას  ';

?>
