<?PHP // $Id$ 
      // error.php - created with Moodle 1.5.2 (2005060220)


$string['confirmsesskeybad'] = 'საწყენია, მაგრამ ამ სესიის თქვენი გასაღები არ შეიძლება დაკმაყოფილდეს ამ აქციის შესასრულებლად ! ეს კეთდება თქვენი სახელით შემთხვევითი ან წინასწარგანზრახული  მნიშვნელოვანი ქმედებების განხორციელებისგან თავის დასაცავად.გთხოვთ მოიფიქროთ ნამდვილად გჭირდებათ ამ ქმედების განხორციელება?';
$string['coursegroupunknown'] = 'არ არის მითითებული კურსი, განკუთვნილი $a ჯგუფისათვის ';
$string['erroronline'] = 'შეცდომაა $a ხაზზე';
$string['fieldrequired'] = '$a აუცილებელი არეა';
$string['filenotfound'] = 'სამწუხაროა, მაგრამ მოთხოვნილი ფაილი ვერ იქნა ნაპოვნი';
$string['groupalready'] = 'მომხმარებელი უკვე განეკუთვნება $a ჯგუფს';
$string['groupunknown'] = '$a ჯგუფი არ შეესაბამება მითითებულ კურსს';
$string['invalidfieldname'] = '\"$a\" არ არის  ფაილის სწორი სახელი';
$string['missingfield'] = '\"$a\" ფაილი დაკარგულია';
$string['modulerequirementsnotmet'] = 'მოდული \"$a->modulename\" ($a->moduleversion) არ შეიძლებ იქნას ინსტალირებული. ის საჭიროებს Moodle-ს ახალ ვერსიას (ამჟამად თქვენ იყენებთ $a->currentmoodle, თქვენ გესაჭიროებათ $a->requiremoodle).';
$string['notavailable'] = 'ამჟამად ეს მიუწვდომელია';
$string['processingstops'] = 'აქ შეწყდა პროცესი. დარჩენილი ჩასაწერები იგნორირებულია';
$string['restricteduser'] = 'საწყენია,მაგრამ შენი მიმდინარე  \"$a\" აქაუნთისთვის ამის გაკეთება აკრძალულია.';
$string['sessionerroruser'] = 'სესიის დრო ამოიწურა. გთხოვთ შეხვიდეთ განმეორებით.';
$string['sessionipnomatch'] = 'საწყენია, მაგრამ თქვენი IP ნომერი როგორც ჩანს შეცვლილია თქვენი პირველი შემოსვლის შემდეგ. ეს უსაფრთხოების ის თავისებურებაა, რაც გამტეხავს ხელს უშლის ამ საიტზე შემოსვლისას თქვენი იდენტფიკაციის მოპარვაში. ჩვეულებრივი მომხმარებელი ამ შეტყობინებას არ უნდა ღებულობდეს -მიმართეთ ადმინისტრატორს!';
$string['unknowncourse'] = 'უცნობი კურსი  \"$a\" სახელწოდებით ';
$string['usernotaddederror'] = '\"$a\" მომხმარებელი არ დამატებულა -მიზეზი უცნობია';
$string['usernotaddedregistered'] = '\"$a\" მომხმარებელი არ დამატებულა -უკვე რეგისტრირებულია';
$string['usernotavailable'] = 'დეტალები ამ მომხმარებლის შესახებ თქვენთვის მიუწვდომელია.';

?>
