<?PHP // $Id$ 
      // survey.php - created with Moodle 1.4.4 (2004083140)


$string['actual'] = 'ფაქტიური';
$string['actualclass'] = 'აქტუალური კლასი';
$string['actualstudent'] = 'აქტუალური $a';
$string['allquestions'] = 'შეკითხვები ყველა სუდენტისათვის';
$string['allscales'] = 'ყველა შკალა, ყველს სტუდენტისათვის';
$string['alreadysubmitted'] = 'ეს გამოკითხვა თქვენ უკვე წარმოადგინეთ';
$string['analysisof'] = '$aს გაანალიზება';
$string['answers'] = 'პასუხები';
$string['attls1'] = 'როგორც ზოგს მიაჩნია, შეფასებისას მე ყურადრებას ვაქცევ მათი არგუმენტაციის ხარისხს, და არა იმას, თუ ვისი წარმოდგენილია ის.';
$string['attls10'] = 'როდესაც რაიმეს ვაანალიზებ, ჩემთვის მნიშვნელოვანია ვიყო შესაძლებლად ობიექტური.';
$string['attls10short'] = 'ობიექტურად დარჩენა';
$string['attls11'] = 'მე ვცდილობ განვსაჯო ადამიანთან თანხმობისათის, და არა მის საწინააღმდეგოდ.';
$string['attls11short'] = 'განვსაჯო ადამიანურად';
$string['attls12'] = 'მაქვს გარკვეული კრიტერიუმები, რომელასც ვიყენებ არგუმენტების შეფასებისას.';
$string['attls12short'] = 'შეფასებისათვის კრიტერიუმის გამოყენება';
$string['attls13'] = 'მე უფრო ვცდილობ გავერკვე სხვის მოსაზრებაში, ვიდრე შევაფასო ის.';
$string['attls13short'] = 'გაგების მცდელობა';
$string['attls14'] = 'მე ვცდილობ გამოვააშკარავო სხვისი აზროვნების სისუსტე, რათა დავეხმარო მათ ნათელი გახადონ თავიანთი არგუმენტები.';
$string['attls14short'] = 'სისუსტის გამოაშკარავება';
$string['attls15'] = 'როდესაც საწინაარმდეგო გამოვლინებებს განვიხილავ, მე განწყობილი ვარ წარმოვიდგინო ჩემი თავი სხვის ადგილას, რათა მივხვდე, რატომ ამართლებენ ისინი თავიანთ ნამოქმედარს.';
$string['attls15short'] = 'საკუთარი თავის წარმოდგენა სხვის ადგილას';
$string['attls16'] = 'ვინმემ შეიძლება მოსაზრებების ანალიზის ჩემებური გზა ჩათვალოს  ”გამომცდელად”, რადგან ვბრთხილობ არ გამომრჩეს რაიმეს გათვალისწინება.';
$string['attls16short'] = 'ჩაშვება გამოძიებაში';
$string['attls17'] = 'მე ვაფასებ ლოგიკის და მიზეზობრიობის გამოყენებას უფრო მეტად, ვიდრე გადასჭრელ პრობლემასთან ჩემი საკუთარი დამოკიდებულების გათვალისწინებას .';
$string['attls17short'] = 'მეტად ვაფასებ ლოგიკას';
$string['attls18'] = 'მე ვცდილობ ვიპოვო იმ მოსაზრების გაგება, რომლებიც ჩემი მოსაზრებისგან განსხვავდება  და  ვეთანხმები მხოლოდ თანაგრძნობით.';
$string['attls18short'] = 'გაგება თანაგრძნობით';
$string['attls19'] = 'როცა ვაწყდები ადამიანს, რომლის მოსაზრებები  უცხოდ მეჩვენება , მე ჩემს თავს ძალას ვატან ჩემი თავი წარმოვიდგინო მის ადგილას, რათა მივხვდე საიდან აქვთ მათ ასეთი აზრები.';
$string['attls19short'] = 'თავის წარმოდგენა სხვად ';
$string['attls1short'] = 'ყურადრების გამახვილება არგუმენტის ხარისხზე';
$string['attls2'] = 'მიყვარს იმ არგუმენტების დამცველად თავის მოჩვენება, რომლისაც არ მწამს, მაგრამ ეწინაარმდეგება სხვის აზრს.';
$string['attls20'] = 'დროს ვხარჯავ იმის ჩამოყალიბებაში,რა არის ”არასწორი”. მაგალითად  ვეძებ ლიტერატურულ წყაროებს იმის შესახებ, რაც არ არის სათანადოდ არგუმენტირებული. ';
$string['attls20short'] = 'რა არის არასწორი?';
$string['attls2short'] = 'დაიცვა, ის რისიც არ გჯერა';
$string['attls3'] = 'მაინტერესებს საიდან მოაქვთ ზოგიერთებს თავიანთი არგუმენტები. რა გამოცდილება მიუძღვით იმ გზისკენ,რომელსაც ადგანან.';
$string['attls3short'] = 'საიდან მოაქვთ';
$string['attls4'] = 'ჩემი განსწავლის ყველაზე მნიშვნელოვანი ნაწილი იყო მესწავლა მათი გაგება, რომლებიც ჩემგან ძალიან განსხვავდებიან.';
$string['attls4short'] = 'ჩემგან განსხვავებული ხალხი';
$string['attls5'] = ' ჩემი პიროვნული ჩამოყალიბებისათვის საუკეთესო გზა იყო სხვადასხვა ხალხებთან ურთიერთობა.';
$string['attls5short'] = 'სხვადასხვა ხალხებთან ურთიერთობა';
$string['attls6'] = 'ვერთობი იმათი მოსაზრებების მოსმენით, რომლებიც მოდიან ჩემგან განსხვავებული გზით. ეს მეხმარება ერთი და იგივე ამბავი სხვათა თვალთახედვით შევაფასო.';
$string['attls6short'] = 'ვერთობი  მოსაზრებების მოსმენით';
$string['attls7'] = 'აღმოვაჩინე, რომ შესაძლებელია ჩემი საკუთარი პოზიციის გამყარება იმათთან დათანხმებით , ვინც მე არ მეთანხმება.';
$string['attls7short'] = 'პოზიციის გამყარება დათანხმებით';
$string['attls8'] = 'ყოველთვის მაინტერესებს გავიგო რატომ ამბობენ და სწამთ იმისა, რასაც აკეთებენ.';
$string['attls8short'] = 'გავიგო რატომ აკეთებენ';
$string['attls9'] = 'ხშირად ვამჩნევ რომ ვეთანხმები იმ წიგნების ავტორებს, რომელასც ვკითხულობ, მაშინ როცა ლოგიკურად მინდა ჩამოვაყალიბო ის, რაშიც ისინი ჩემი აზრით ცდებიან.';
$string['attls9short'] = 'ვეთანხმები ავტორებს';
$string['attlsintro'] = 'კითხვარის მიზანია გავიგოთ თქვენი დამოკიდებულება სწავლისა და აზროვნებისადმი.
ამ პასუხებში არაფერია ”მართალი” ან ”ტყუილი” ; ჩვენ მხოლოდ თქვენი აზრი გვაინტერესებს. იყავით დარწმუნებული,რომ თქვენი პასუხები დაცული იქნება საიდუმლოდ და არ იმოქმედებს თქვენს შეფასებაზე.';
$string['attlsm1'] = 'დამოკიდებულება სწავლისა და აზროვნებისადმი';
$string['attlsm2'] = 'დაკავშირებული სწავლა';
$string['attlsm3'] = 'განცალკავებული სწავლა';
$string['attlsmintro'] = 'დისკუსიაში...';
$string['attlsname'] = 'ATTLS (20 საგნიანი ვარიანტი)';
$string['ciq1'] = 'როდის იყავით კლასში ყველაზე მეტად ჩართული, როგორც რაიმეს შემსწავლელი?';
$string['ciq1short'] = 'ყველაზე მეტად ჩართული';
$string['ciq2'] = 'როდის იყავით კლასში ყველაზე მეტად გამოთიშული, როგორც რაიმეს შემსწავლელი?';
$string['ciq2short'] = 'ყველაზე მეტად გამოთიშული';
$string['ciq3'] = 'ფორუმში მონაწილეთაგან ვისი ქმედება აღმოაჩინეთ თქვენთვის როგორც ყველაზე სასარგებლო და დასათანხმებელი?';
$string['ciq3short'] = 'სასარგებლო მომენტი';
$string['ciq4'] = 'ვისი მოქმედება იყო ფორუმში თქვენთვის ყველაზე უცნაური და დამაბნეველი?';
$string['ciq4short'] = 'დამაბნეველი მომენტი';
$string['ciq5'] = 'რამ გაგაოცათ ყველაზე მეტად?';
$string['ciq5short'] = 'გასაოცარი მომენტი';
$string['ciqintro'] = 'ამ კლასში მომხდარ უკანასკნელ მოვლენებზე ფიქრისას, უპასუხეთ შემდეგ კითხვებს: ';
$string['ciqname'] = 'კრიტიკული ინციდენტები';
$string['clicktocontinue'] = 'აქ დააწკაპუნეთ გასაგრძელებლად';
$string['clicktocontinuecheck'] = 'აქ დააწკაპუნეთ გასასინჯად და გასაგრძელებლად';
$string['colles1'] = 'მე კონცენტრირებული ვარ იმის შესასწავლად, რაც მაინტერესებს.';
$string['colles10'] = 'ვეკითხები სხვა სტუდენტებს ამიხსნან მათი მოსაზრებები';
$string['colles10short'] = 'ახსნის თხოვნა';
$string['colles11'] = 'სხვა სტუდენტები მთხოვენ ავუხსნა ჩემი მოსაზრებები.';
$string['colles11short'] = 'ვთხოვ ამიხსნსნ';
$string['colles12'] = 'სხვა სტუდენტები ეხმაურებიან ჩემს მოსაზრებებს.';
$string['colles12short'] = 'სხვა სტუდენტები მეხმაურებიან';
$string['colles13'] = 'მასწავლებელი მიბიძგებს ვიაზროვნო';
$string['colles13short'] = 'მასწავლებელი უბიძგებს აზროვნებას';
$string['colles14'] = 'მასწავლებელი მაგულიანებს ვიმონაწილეო';
$string['colles14short'] = 'მასწავლებელი მე მაგულიანებს ';
$string['colles15'] = 'მასწავლებელი მართავს კარგ დისკუსიას';
$string['colles15short'] = 'მასწავლებელი მართავს  დისკუსიას';
$string['colles16'] = 'მასწავლებელი წარმართავს კრიტიკულ თვითგამოვლენას';
$string['colles16short'] = 'მასწავლებელი წარმართავს  თვითგამოვლენას';
$string['colles17'] = 'სხვა სტუდენტი მაგულიანებს ვიმონაწილეო';
$string['colles17short'] = 'სტუდენტი მაგულიანებს ';
$string['colles18'] = 'სხვა სტუდენტები აქებენ ჩემს მონაწილეობას';
$string['colles18short'] = 'სტუდენტები მაქებენ';
$string['colles19'] = 'სხვა სტუდენტები აფასებენ ჩემს მონაწილეობას';
$string['colles19short'] = 'სტუდენტები მაფასებენ';
$string['colles1short'] = 'კონცენტრირება საინტერესოზე';
$string['colles2'] = 'რაც ვისწავლე გამომადგება პროფესიულ საქმიანობაში';
$string['colles20'] = 'სხვა სტუდენტები თანამიგრძნობენ ჩემს ბრძოლაში სწავლისათვის';
$string['colles20short'] = 'სტუდენტების თანგრძნობა';
$string['colles21'] = 'მე  საღი აზრი შევძინე სხვა სტუდენტების წერილებს.';
$string['colles21short'] = 'გავუგე სხვა სტუდენტებს';
$string['colles22'] = 'სხვა სტუდენტებმა შესძინეს საღი აზრი ჩემს წერილებს.';
$string['colles22short'] = 'სტუდენტები მიგებენ';
$string['colles23'] = 'მე შევძინე საღი აზრი მასწავლებლის წერილებს.';
$string['colles23short'] = 'გავუგე მასწავლებელს';
$string['colles24'] = 'მასწავლებელმა შესძინა საღი აზრი ჩემს წერილებს';
$string['colles24short'] = 'მასწავლებელმა გამიგო';
$string['colles2short'] = 'მნიშვნელოვანი ჩემი პრაქტიკული საქმიანობისათვის';
$string['colles3'] = 'ვისწავლე როგორ გავაუმჯობესო ჩემი პროფესიული საქმიანობა.';
$string['colles3short'] = 'ჩემი პროფესიული საქმიანობის გაუმჯობესება';
$string['colles4'] = 'რაც ვისწავლე კარგად ავსებს ჩემს პროფესიულ გამოცდილებას.';
$string['colles4short'] = 'ავსებს ჩემს გამოცდილებას';
$string['colles5'] = 'კრიტიკული ვარ იმის მიმართ, როგორც ვსწავლობ';
$string['colles5short'] = 'კრიტიკული ვარ სწავლისადმი';
$string['colles6'] = 'კრიტიკულად ვაფასებ ჩემს მოსაზრებებს';
$string['colles6short'] = 'კრიტიკული ვარ ჩემი მოსაზრებებისადმი';
$string['colles7'] = 'კრიტიკულად ვაფასებ სხვა სტუდენტების მოსაზრებებს';
$string['colles7short'] = 'კრიტიკული ვარ სხვა სტუდენტებისადმი';
$string['colles8'] = 'კრიტიკულად ვაფასებ იდეებს წაკითხულში';
$string['colles8short'] = 'კრიტიკული ვარ იდეებისადმი წაკითხულში';
$string['colles9'] = 'ვუხსნი სხვა სტუდენტებს ჩემს აზრს';
$string['colles9short'] = 'ვუხსნი  ჩემს აზრს';
$string['collesaintro'] = 'ამ გამოკითხვის მიზანია გავიგოთ რამდენად გეხმარებათ სწავლაში ამ ნაწილის ქსელური მიწოდება. 

თითოეული ამ 24 მტკიცებულობიდან არკვევს თქვენს გამოცდილებას ამ საკითხებში.

ამ პასუხებში არაფერია ”მართალი” ან ”ტყუილი” ; ჩვენ მხოლოდ თქვენი აზრი გვაინტერესებს. იყავით დარწმუნებული,რომ თქვენი პასუხები დაცული იქნება საიდუმლოდ და არ იმოქმედებს თქვენს შეფასებაზე.

თქვენი გულდასმით განხილული გამოხმაურება მოგვეხმარება მომავალში ამ ნაწილის მოწოდების გაუმჯობესებაში

დიდი მადლობა!';
$string['collesaname'] = 'COLLES ';
$string['collesapintro'] = 'ამ გამოკითხვის მიზანია გავიგოთ რამდენად გეხმარებათ სწავლაში ამ ნაწილის ქსელური მიწოდება. 

თითოეული ამ 24 მტკიცებულობიდან მოითხოვს თქვენგან შეადაროთ  თქვენი  <b>ნამჯობინები</b> (იდეალური) და  <b>რეალური</b>გამოცდილება ამ საკითხებში.

ამ პასუხებში არაფერია ”მართალი” ან ”ტყუილი” ; ჩვენ მხოლოდ თქვენი აზრი გვაინტერესებს. იყავით დარწმუნებული,რომ თქვენი პასუხები დაცული იქნება საიდუმლოდ და არ იმოქმედებს თქვენს შეფასებაზე.

თქვენი გულდასმით განხილული გამოხმაურება მოგვეხმარება მომავალში ამ ნაწილის მოწოდების გაუმჯობესებაში

დიდი მადლობა';
$string['collesapname'] = 'COLLES (ფაქტიური)';
$string['collesm1'] = 'გამოსადეგი';
$string['collesm1short'] = 'გამოსადეგი';
$string['collesm2'] = 'რეფლექტორული აზროვნება';
$string['collesm2short'] = 'რეფლექტორული აზროვნება';
$string['collesm3'] = 'ინტერაქტიურობა';
$string['collesm3short'] = 'ინტერაქტიურობა';
$string['collesm4'] = 'მასწავლების მხარდაჭერა';
$string['collesm4short'] = 'მასწავლების მხარდაჭერა';
$string['collesm5'] = 'თანასწორის  მხარდაჭერა';
$string['collesm5short'] = 'თანასწორის  მხარდაჭერა';
$string['collesm6'] = 'ინტერპრეტაცია';
$string['collesm6short'] = 'ინტერპრეტაცია';
$string['collesmintro'] = 'ამ ”ონლაინ ” ერთეულზე';
$string['collespintro'] = 'ამ გამოკითხვის მიზანია გავიგოთ რამდენად გეხმარებათ სწავლაში ამ ნაწილის ქსელური მიწოდება. 

თითოეული ამ 24 მტკიცებულობიდან მოითხოვს თქვენგან შეადაროთ  თქვენი  <b>ნამჯობინები</b> (იდეალური) გამოცდილება ამ საკითხებში.

ამ პასუხებში არაფერია ”მართალი” ან ”ტყუილი” ; ჩვენ მხოლოდ თქვენი აზრი გვაინტერესებს. იყავით დარწმუნებული,რომ თქვენი პასუხები დაცული იქნება საიდუმლოდ და არ იმოქმედებს თქვენს შეფასებაზე.

თქვენი გულდასმით განხილული გამოხმაურება მოგვეხმარება მომავალში ამ ნაწილის მოწოდების გაუმჯობესებაში

დიდი მადლობა';
$string['collespname'] = 'COLLES ( უმჯობესი)';
$string['done'] = 'შესრულდა';
$string['download'] = 'გადმოტვირთვა';
$string['downloadexcel'] = 'ჩატვირთეთ მონაცემები როგორც ექსელის დავთარი';
$string['downloadinfo'] = 'თქვენ შეგიძლიათ გაანალიზებისათვის გადმოტვირთვოთ ამ გამოკითხვის სრული ”ნედლი” მონაცემები Excel, SPSS ან სხვა სახით.';
$string['downloadtext'] = 'მონაცემთა გადმოტვირთვა როგორც მარტივი ტექსტი';
$string['editingasurvey'] = 'გამოკითხვის რედაქტირება';
$string['guestsnotallowed'] = 'სტუმრებს არ აქვთ გამოკითხვაში მონაწილეობის უფლება';
$string['helpsurveys'] = 'სხვადასხვა სახის გამოკითხვებში დახმარება';
$string['howlong'] = 'რამდენი ხანი დაგჭირდებათ ამ გამოკითხვის დასასრულებლად?';
$string['howlongoptions'] = 'ნაკლები, ვიდრე 1 წთ, 1-2 წთ, 2-3 წთ, 3-4 წთ, 4-5 წთ,5-10 წთ, მეტი ვიდრე 10 წთ';
$string['ifoundthat'] = 'აღმოვაჩინე, რომ';
$string['introtext'] = 'შესავალი ტექსტი';
$string['ipreferthat'] = 'ვამჯობინებ, რომ';
$string['modulename'] = 'გამოკვლევა';
$string['modulenameplural'] = 'გამოკითხვები';
$string['name'] = 'სახელი';
$string['newsurveyresponses'] = 'პასუხები ახალ გამოკითხვაზე';
$string['nobodyyet'] = 'ჯერ ეს გამოკითხვა არავის დაუსრულებია';
$string['notdone'] = 'ჯერ არ გაკეთებულა';
$string['notes'] = 'შენი კერძო ანალიზი და შენიშვნები';
$string['othercomments'] = 'გაქვს რაიმე სხვა კომენტარები?';
$string['peoplecompleted'] = 'ჯერ-ჯერობით ეს გამოკითხვა დაასრულა $a პიროვნებამ';
$string['preferred'] = 'ნამჯობინები';
$string['preferredclass'] = 'ნამჯობინები კლასი';
$string['preferredstudent'] = 'ნამჯობინები $a';
$string['question'] = 'შეკითხვა';
$string['questions'] = 'შეკითხვები';
$string['questionsnotanswered'] = 'ზოგიერთზე მრავლობითი ასარჩევი კითხვებიდან პასუხი არ არის გაცემული.';
$string['report'] = 'გამოკითხვის ანგარიში';
$string['savednotes'] = 'თქვენი შენიშვნები შენახულია';
$string['scaleagree5'] = 'მკაცრად უარყოფილია,ნაწილობრივ უარყოფილია, არც ეთანხმება არც უარყოფს, ზოგიერთ რამეში ეთანხმება, სრულად ეთანხმება.';
$string['scales'] = 'შკალები';
$string['scaletimes5'] = 'თითქმის არასოდეს, იშვიათად, ზოგჯერ, ხშირად, თითქმის ყოველთვის';
$string['seemoredetail'] = 'დააწკაპუნეთ აქ უფრო დეტალურად სანახავად';
$string['selectedquestions'] = 'შკალიდან შერჩეული შეკითხვები, ყველა სტუდენტი';
$string['summary'] = 'რეზიუმე';
$string['surveycompleted'] = 'თქვენ დაასრულეთ ეს გამოკითხვა, ქვედა ცხრილში შეგიძლიათ ნახოთ თქვენი გამოკითხვის შედეგები, შედარებული გასაშუალებულ საკლასო შედეგთან.';
$string['surveyname'] = 'გამოკითხვის სახელი';
$string['surveysaved'] = 'გამოკითხვა შენახულია';
$string['surveytype'] = 'გამოკითხვის სახე ';
$string['thanksforanswers'] = 'გმადლობთ ამ გამოკითხვაში მოცემულ კითხვებზე პასუხისათვის,$a';
$string['time'] = 'დრო';
$string['viewsurveyresponses'] = 'ნახეთ $a გამოკითხვის პასუხები';

?>
