<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<!-- Traducci&oacute;n al espa&ntilde;ol: Emmanuelle Guti&eacute;rrez y Restrepo (emmanuelle@sidar.org) y Claudio Tavares (claudio@enlaceacademico.com-->
</head>
<body>
<h2>Caracter&iacute;sticas</h2>
<p>Moodle es un producto activo y en evoluci&oacute;n. Esta
p&aacute;gina enumera algunas de sus muchas caracter&iacute;sticas:</p>
<h3>Dise&ntilde;o general</h3>
<ul>
  <li>Promueve una pegadog&iacute;a de construccionismo social
(colaboraci&oacute;n, actividades, reflexi&oacute;n cr&iacute;tica,
etc.).</li>
  <li>Apropiada para el 100% de las clases en l&iacute;nea, as&iacute;
como tambi&eacute;n para complementar el aprendizaje tradicional.</li>
  <li>Tiene una interfaz de navegador de baja tecnolog&iacute;a,
sencilla, ligera, eficaz, y compatible.</li>
  <li>Es f&aacute;cil de instalar en casi cualquier plataforma que
soporte PHP. S&oacute;lo requiere que exista una base de datos.</li>
  <li>Con su completa sustracci&oacute;n de bases de datos, soporta las
principales marcas de bases de datos (excepto para la definici&oacute;n
inicial de las tablas).</li>
  <li>La lista de cursos muestra descripciones de cada uno de los
cursos que hay en el servidor, incluyendo la posibilidad de acceder
como invitado.</li>
  <li>Se ha puesto &eacute;nfasis en una seguridad s&oacute;lida en
toda la plataforma. Todos los formularios son revisados, las <em
 lang="en">cookies</em> encriptadas, etc.</li>
</ul>
<h3>Gesti&oacute;n del sitio</h3>
<ul>
  <li>El sitio es gestionado por un usuario administrador, definido
durante la instalaci&oacute;n</li>
  <li>El <em lang="en">Plug-in</em> "<em lang="en">themes</em>" permite
al administrador personalizar los colores del sitio, las fuentes, la
maquetaci&oacute;n o dispoci&oacute;n de los elementos, etc., para
ajustarse a sus necesidades locales.</li>
  <li>Pueden a&ntilde;adirse <em lang="en">Plug-in</em> de
m&oacute;dulos de actividad a los ya instalados en Moodle.</li>
  <li>El <em lang="en">Plug-in</em> de paquetes de idioma permite una
localizaci&oacute;n completa de cualquier idioma. Estos paquetes pueden
editarse usando un editor con base en la Web. Actualmente hay paquetes
de idiomas para m&aacute;s de <a
 href="http://moodle.com/download/lang/" target="_top">19 idiomas</a>.</li>
  <li>El c&oacute;digo est&aacute; escrito de forma clara en PHP bajo
la licencia <abbr title="General Public License" lang="en">GPL</abbr>,
f&aacute;cil de modificar para llenar sus necesidades.</li>
</ul>
<h3>Gesti&oacute;n de usuarios</h3>
<ul>
  <li>El objetivo es reducir al m&iacute;nimo la necesidad de que el
administrador est&eacute; involucrado, a la vez que se mantiene una
alta seguridad.</li>
  <li>Soporta un rango de mecanismos de autenticaci&oacute;n a
trav&eacute;s de m&oacute;dulos de autenticaci&oacute;n, que permiten
una integraci&oacute;n sencilla con los sistemas existentes.</li>
  <li>M&eacute;todo est&aacute;ndar de alta por correo
electr&oacute;nico: Los alumnos pueden crear sus propias cuentas de
acceso. La direcci&oacute;n de correo electr&oacute;nico se verifica
para solicitar la confirmaci&oacute;n.</li>
  <li>M&eacute;todo <abbr title="Lightweight Directory Access Protocol"
 lang="en">LDAP</abbr>: las cuentas de acceso pueden verificarse contra
un servidor <abbr title="Lightweight Directory Access Protocol"
 lang="en">LDAP</abbr>. El administrador puede especificar qu&eacute;
campos usar.</li>
  <li><abbr title="Internet Message Access Protocol" lang="en">IMAP</abbr>,<abbr
 title="Post Office Protocol 3" lang="en">POP3</abbr>, <abbr
 title="Network News Transfer Protocol" lang="en">NNTP</abbr>: las
cuentas de acceso se verifican contra un servidor de correo o de
noticias. Soporta los certificados <abbr title="Secure Sockets Layer"
 lang="en">SSL</abbr> y <abbr title="Transport Layer Security" lang="en">TLS</abbr>.</li>
  <li>Base de datos externa: Cualquier base de datos que contenga al
menos dos campos puede usarse como fuente externa de
autenticaci&oacute;n.</li>
  <li>Cada persona necesita s&oacute;lo una cuenta para todo el
servidor. Por otra parte, cada cuenta puede tener un tipo de acceso
diferente.</li>
  <li>Una cuenta de administrador controla la creaci&oacute;n de cursos
y determina profesores, asignando usuarios a los cursos.</li>
  <li>Seguridad -los profesores pueden a&ntilde;adir una "clave de
acceso" para sus cursos, con el fin de impedir el acceso de quienes no
sean sus alumnos. Pueden transmitir esta clave personalmente o a
trav&eacute;s del correo electr&oacute;nico personal, etc.</li>
  <li>Los profesores pueden cancelar la inscripci&oacute;n de los
alumnos manualmente si lo desean, aunque tambi&eacute;n existe una
forma autom&aacute;tia de dar de baja a los alumnos que est&aacute;n
inactivos durante un determinado per&iacute;odo de tiempo (establecido
por el administrador).</li>
  <li>Se alienta a los alumnos a crear una presentaci&oacute;n en
l&iacute;nea de s&iacute; mismos, incluyendo fotos, descripci&oacute;n,
etc. Si se requiere, pueden esconderse las direcciones de correo
electr&oacute;nico.</li>
  <li>Cada usuario puede especificar su propia zona horaria, y todas
las fechas marcadas en Moodle se traducir&aacute;n a esa zona horaria
(las fechas de escritura de mensajes, de entrega de tareas, etc.)</li>
  <li>Cada usuario puede elegir el lenguaje que se usar&aacute; en la
interfaz de Moodle (Ingl&eacute;s, Franc&eacute;s, Alem&aacute;n,
Espa&ntilde;ol, Portugu&eacute;s, etc.)</li>
</ul>
<h3>Gesti&oacute;n de cursos</h3>
<ul>
  <li>El profesor tiene control total sobre todas las opciones de sus
cursos.</li>
  <li>Se puede elegir entre varios formatos de curso tales como
semanal, por tema o el formato social, centrado en un foro.</li>
  <li>Ofrece una flexible serie de actividades para los cursos: foros,
diarios, cuestionarios, recursos, consultas, encuestas, tareas.</li>
  <li>En la p&aacute;gina principal del curso se puede presentar los
cambios ocurridos desde la &uacute;ltima vez que la persona
entr&oacute; en el curso, lo que ayuda a crear una sensaci&oacute;n de
comunidad.</li>
  <li>La mayor&iacute;a de las &aacute;reas para introducir texto
(recursos, env&iacute;o de mensajes a un foro, entradas en el diario,
etc.) pueden editarse usando un editor HTML incrustado de tipo <acronym
 title="What You See Is What You Get" lang="en">WYSIWYG</acronym>.</li>
  <li>Todas las calificaciones para los foros, diarios, cuestionarios y
tareas pueden verse en una &uacute;nica p&aacute;gina (y descargarse
como un archivo con formato de hoja de c&aacute;lculo).</li>
  <li>Registro completo de los accesos del usuario y su recorrido. Se
dispone de informes de actividad de cada alumno, con gr&aacute;ficos y
detalles sobre su paso por cada m&oacute;dulo (&uacute;ltimo acceso,
n&uacute;mero de veces que lo ha le&iacute;do) as&iacute; como
tambi&eacute;n de una detallada "historia" de la participaci&oacute;n
de cada estudiante, inlcuyendo mensajes enviados, entradas en el
diario, etc. en una sola p&aacute;gina.</li>
  <li>Integraci&oacute;n de correo. Pueden enviarse por correo
electr&oacute;nicos copias de los mensajes enviados a un foro, los
comentarios de los profesores, etc. en formato HTML o de texto.</li>
</ul>
<h3>M&oacute;dulo de Tareas</h3>
<ul>
  <li>Puede especificarse la fecha final de entrega de una tarea y la
calificaci&oacute;n m&aacute;xima que se le podr&aacute; asignar.</li>
  <li>Los alumnos pueden subir sus tareas (en cualquier formato de
archivo) al servidor. Se registra la fecha en que se han subido.</li>
  <li>Se permite enviar tareas fuera de tiempo, pero el profesor puede
ver claramente el tiempo de retraso.</li>
  <li>Para cada tarea en particular, puede evaluarse a la clase entera 
(calificaciones y comentarios) en una &uacute;nica p&aacute;gina en un
formulario.</li>
  <li>Las observaciones del profesor se adjuntan a la p&aacute;gina de
la tarea de cada estudiante y se le env&iacute;a un mensaje de
notificaci&oacute;n.</li>
  <li>El profesor tiene la posibilidad de permitir el reenv&iacute;o de
una tarea tras su calificaci&oacute;n (para volver a calificarla)</li>
</ul>
<h3>M&oacute;dulo Consulta</h3>
<ul>
  <li>Es como una votaci&oacute;n. Puede usarse para crear una
votaci&oacute;n sobre algo o para recibir una respuesta de cada alumno
(por ejemplo, para pedir su consentimiento para algo).</li>
  <li>Los profesores pueden ver una tabla que presenta de forma
intuitiva la informaci&oacute;n sobre qui&eacute;n ha elegido
qu&eacute;.</li>
</ul>
<h3>M&oacute;dulo Foro</h3>
<ul>
  <li>Hay diferentes tipos de foros disponibles: exclusivos para los
acad&eacute;micos, que emiten noticias a todos los participantes y
abiertos a todos.</li>
  <li>Todos los env&iacute;os llevan adjunta la foto del autor.</li>
  <li>Las discusiones pueden verse anidadas, linealmente, o presentar
los mensajes m&aacute;s antiguos o los m&aacute;s nuevos primero.</li>
  <li>El profesor puede obligar la suscripci&oacute;n de todos a un
foro o permitir que cada persona elija a qu&eacute; foros suscribirse
de manera que se le env&iacute;e una copia de los mensajes por correo
electr&oacute;nico.</li>
  <li>El profesor puede elegir que no se permitan respuestas en un foro
(por ejemplo, para crear un foro dedicado a anuncios).</li>
</ul>
<h3>M&oacute;dulo Diario</h3>
<ul>
  <li>Los diarios constituyen informaci&oacute;n privada entre el
alumno y el profesor.</li>
  <li>Cada entrada en el diario puede estar motivada por una pregunta
abierta.</li>
  <li>La clase entera puede ser calificada en una p&aacute;gina
mediante un formulario, por cada entrada particular en el diario.</li>
  <li>Las observaciones o comentarios del profesor se adjuntan a la
p&aacute;gina de entradas del diario y se env&iacute;an por correo a
cada alumno la suya.</li>
</ul>
<h3>M&oacute;dulo Cuestionario</h3>
<ul>
  <li>Los profesores pueden definir una base de datos de preguntas que
podr&aacute;n ser reutilizadas en diferentes cuestionarios.</li>
  <li>Los cuestionarios se califican autom&aacute;ticamente, y pueden
ser recalificados si se modifican las preguntas.</li>
  <li>Los cuestionarios pueden tener un l&iacute;mite de tiempo a
partir del cual no estar&aacute;n disponibles.</li>
  <li>El profesor puede determinar si los cuestionarios pueden ser
resueltos varias veces y si se mostrar&aacute;n o no las respuestas
correctas.</li>
  <li>Las preguntas pueden crearse en HTML y con im&aacute;genes.</li>
  <li>Las preguntas de m&uacute;ltiple opci&oacute;n pueden definirse
con una &uacute;nica o con m&uacute;ltiples respuestas correctas.</li>
  <li>Pueden crearse cuestionarios de respuestas cortas (palabras o
frases).</li>
  <li>Pueden crearse cuestionarios de falso-verdadero.</li>
</ul>
<h3>M&oacute;dulo Recursos</h3>
<ul>
  <li>Admite la presentaci&oacute;n de cualquier contenido digital</li>
  <li>Los archivos pueden subirse y manejarse en el servidor o puden
ser creados en directo usando formularios web para tal efecto (de texto
o HTML).</li>
  <li>Pueden enlazarse otros contenidos web o icluirse directamente
dentro de la interfaz del curso.</li>
</ul>
<h3>M&oacute;dulo Encuesta</h3>
<ul>
  <li>Se proporcionan encuestas ya preparadas (COLLES, ATTLS) como
instrumentos para el an&aacute;lisis de las clases en l&iacute;nea.</li>
  <li>Los informes de las encuestas est&aacute;n siempre disponibles,
incluyendo muchos gr&aacute;ficos. Los datos pueden descargarse con
formato de hoja de c&aacute;lculo o como archivo de texto CVS.</li>
  <li>La interfaz de las encuestas impide la posibilidad de sean
respondidas s&oacute;lo parcialmente.</li>
  <li>A cada alumno se le informa sobre sus resultados comparados con
la media de la clase.</li>
</ul>
<p>&nbsp;</p>
<p style="text-align: center; font-size: 0.7em;"><a href="."
 target="_top">Documentaci&oacute;n de Moodle</a></p>
<p style="text-align: center; font-size: 0.7em;">Version: $Id:
features.html,v 1.2 2001/12/09   10:34:19 martin Exp $</p>
</body>
</html>
