<IMG VALIGN=absmiddle SRC="<?php echo $CFG->wwwroot?>/mod/exercise/icon.gif">&nbsp;<B>Ejercicio</B>

<P>Un ejercicio es una tarea a la vez simple y potente. En un ejercicio, el profesor
   pide a los estudiantes una tarea pr&aacute;ctica. Esta tarea puede ser escribir un ensayo o
   un informe, preparar una presentaci&oacute;n, configurar una hoja de c&aacute;lculo, etc. Cuando el
   estudiante ha conclu&iacute;do la tarea debe autoevaluar su trabajo antes de envi&aacute;rselo al
   profesor. Una vez enviado el profesor puede evaluar tanto la autoevaluaci&oacute;n del alumno
   como el trabajo en si. El profesor puede enviar sus impresiones al alumno y formularle
   preguntas para mejorar el trabajo y reenviarlo o no si es el caso.</p>

<p>Antes de comenzar el ejercicio el profesor configura el ejercicio:
<ol> <li>Creando un documento Word o un archivo HTML que constituye una introducción al ejercicio
	e indica a los estudiantes cuál es la tarea que deben realizar. Este archivo
	es cargado en el ejercicio por el profesor.
	
<li>A&ntilde;adiendo los elementos textuales y eligiendo las opciones en el formulario de evaluaci&oacute;n.
	Este formulario es utilizado tanto por los estudiantes como por el profesor para
	evaluar el trabajo realizado en el ejercicio. Existen varios tipos de evaluaciones que
	pueden ser usadas (vea la ayuda en &quot;Estrategia de Calificaci&oacute;n&quot;)
</ol></p>

<p>En clases grandes, el profesor puede encontrar de ayuda el crear más de una versi&oacute;n del
	ejercicio. Estas versiones a&ntilde;aden un grado de variedad al ejercicio y asegura que
	los estudiantes realizan diferentes tareas en el mismo. Estas versiones son asignadas
	a los estudiantes de una forma aleatoria pero equilibrada. Cada estudiante recibe solamente
	un ejercicio, pero el n&uacute;mero de veces que se asigna cada ejercicio es aproximadamente la misma.
	Vea que las variantes no deben ser demasiado diferentes ya que el mismo formulario de
	calificaci&oacute;n se usa para todas las variantes del ejercicio.</p>

<p>Una vez que se han colocado en su lugar la(s) descripci&oacute;n(es) del ejercicio y el formulario de 
	evaluaci&oacute;n, la asignaci&oacute;n se abre a los estudiantes. Se les muestra una descripci&oacute;n
	del ejercicio o tarea. Cuando han realizado el ejercicio deben evaluar su propio trabajo
	(usando el formulario de evaluaci&oacute;n antes preparado) antes de enviar el trabajo al
	profesor. El formulario de evaluaci&oacute;n puede ser usado como &quot;gu&iacute;a&quot; por los
	estudiantes. Ellos pueden, si lo desean, revisar su trabajo y la calificaci&oacute;n antes de enviar 
	su trabajo, y probablemente ser&aacute;n animados a ello.</p>
	
<p>Una vez que el estudiante ha enviado su trabajo y su evaluaci&oacute;n &eacute;stos aparecen disponibles para el 
	profesor. Las evaluaciones pueden ser calificadas y existe un recuadro para los comentarios.
	El profesor puede además acceder al trabajo (usando la evaluaci&oacute;n del alumno como punto
	de partida) y decidir si pregunta al estudiante para que env&iacute;e una nueva versi&oacute;n mejorada 
	del trabajo o no.</p>

<p>Si el profesor cree que el trabajo del estudiante puede ser mejorado se puede dar la oportunidad al 
	estudiante de reenviarlo. Si esto se produce el profesor vuelve a evaluar el trabajo usando el 
	formulario de evaluaci&oacute;n que le asign&oacute; al estudiante la vez anterior. 
	De este modo, la reevaluaci&oacute;n no tiene el problema derivado de la actualizaci&oacute;n del
	formulario de evaluaci&oacute;n, y &eacute;ste reeval&uacute;a a la luz del trabajo revisado 
	por el alumno, que es mejor que la evaluaci&oacute;n desde cero.</p>
	
<p>Cuando se cumple el plazo de entrega del ejercicio los estudiantes pueden continuar enviando trabajos. Sin embargo,
   estos envíos son calificados como &quot;retrasados&quot;. El profesor puede, si lo desea, calificar el trabajo y proporcionar retroalimentación al estudiante. Las calificaciones del trabajo retrasado se mantienen en segundo plano y <b>no</b> se usan en el cálculo de las calificaciones finales. Si, por la razón que fuere,el profesor desea aceptar un trabajo retrasado como si hubiera sido enviado dentro de plazo, la señal de retraso puede eliminarse en la página de Administración, encontrando el envío y haciendo clic en el enlace apropiado. A partir de ese momento la calificación de ese trabajo se usará en el cálculo de la calificación final.
		
<p>Con todos los ev&iacute;os calificados, el ejercicio entra en la fase final. Los estudiantes pueden ahora 
	ver su calificaci&oacute;n final y las calificaciones asignadas a sus env&iacute;os. La calificaci&oacute;n de un 
	ejercicio de un estudiante es una combinaci&oacute;n ponderada de la calificaci&oacute;n que hace el profesor de la 
	autoevaluaci&oacute;n y de la calificaci&oacute;n que hace el profesor del trabajo. (La calificaci&oacute;n asignada por el 
	estudiante <b>no</b> se usa.) La calificaci&oacute;n de los env&iacute;os es trabajo del profesor. La 
	ponderaci&oacute;n usada para las dos calificaciones (el nivel de calificaci&oacute;n y la calificaci&oacute;n actual) 
	puede ser asignada y cambiada en cualquier momento durante el ejercicio (los pesos se establecen en la página de administración).</p>
	
<p>Cuando el profesor permite a los estudiantes reenviar su trabajo, el profesor debe considerar c&oacute;mo 
	asignar la opci&oacute;n que controla c&oacute;mo se calcula la calificaci&oacute;n final del estudiante cuando usa 
	m&uacute;ltiples env&iacute;os. Esta opci&oacute;n permite al profesor elegir entre usar la media de los env&iacute;os o 
	la mejor nota de los mismos. Esta opci&oacute;n puede ser cambiada en cualquier momento y tiene efecto 
	inmediato en la pantalla de niveles.</p>

<p>En la fase final del ejercicio los estudiantes pueden tambi&eacute;n ver una &quot;tabla de clasificaciones&quot; 
	de los env&iacute;os. Esta es una lista ordenada de env&iacute;os, mostrando el que ha obtenido mejor calificacion 
	en la parte superior. Cuando existen m&uacute;ltiples env&iacute;os solamente se muestra el mejor de cada alumno.</p>
	