<p align="center"><b>Kopioinnin k&auml;ytt&auml;j&auml;t </b></p>

<p>Ensinn&auml;kin, huomaa, ett&auml; <strong>yleens&auml; ei ole tarpeellista tuoda k&auml;ytt&auml;ji&auml; massoina</strong>- pit&auml;&auml;ksesi oman yll&auml;pito ty&ouml;si alhaisena, sinun pit&auml;isi ensin tutkia niit&auml; todennuksen muotoja, jotka eiv&auml;t vaadi manuaalista yll&auml;pitoa, esimerkiksi yhteydenottoa olemassa oleviin ulkoisiin tietokantoihin tai voidaan antaa k&auml;ytt&auml;jien luoda omat k&auml;ytt&auml;j&auml;tilins&auml;. Katso Yll&auml;pito osasto p&auml;&auml;k&auml;ytt&auml;j&auml; valikossa. </p>
<p>Jos olet varma, ett&auml; haluat tuoda useita k&auml;ytt&auml;j&auml;tilej&auml; tekstitiedostosta, silloin sinun t&auml;ytyy muotoilla tekstitiedostosi seuraavasti:</p>
<ul>
  <li>Tiedoston jokainen rivi sis&auml;lt&auml;&auml; yhden tallenteen</li>
  <li>Jokainen tallenne on sarja tietoja pilkuilla eroteltuna</li>
  <li>Tiedoston ensimm&auml;inen tallenne on erityinen, ja sis&auml;lt&auml;&auml; listan kentt&auml;nimi&auml;. T&auml;m&auml; m&auml;&auml;ritt&auml;&auml; lopputiedoston muodon.
    <blockquote>
      <p><strong>Vaaditut kentt&auml;nimet :</strong> n&auml;m&auml; kent&auml;t t&auml;ytyy olla mukana ensimm&auml;isess&auml; tallenteessa, ja m&auml;&auml;ritelty jokaiselle k&auml;ytt&auml;j&auml;lle.</p>
      <p></p>
      <font color="#990000" face="Courier New, Courier, mono">k&auml;ytt&auml;j&auml;nimi, salasana, etunimi, sukunimi, s&auml;hk&ouml;posti </font></p>
</p>
      <p><strong>Oletus kentt&auml;nimet:</strong> n&auml;m&auml; ovat valinnaisia- jos niit&auml; ei liitet&auml; , silloin arvot otetaan aiemmalta yll&auml;pit&auml;j&auml;lt&auml;</p>
      <p><font color="#990000" face="Courier New, Courier, mono">yhteis&ouml;, osasto, kaupunki, maa, kieli, aikavy&ouml;hyke </font> </p>
      <p><strong>Valinnaiset  kentt&auml;nimet: </strong>kaikki n&auml;m&auml; ovat t&auml;ysin valinnaisia. Kurssinimet ovat kurssien &quot;lyhytnimi&auml;&quot;- jos ne s&auml;ilytet&auml;&auml;n nykyisell&auml;&auml;n, k&auml;ytt&auml;j&auml; merkit&auml;&auml;n kursseille opiskelijana. Ryhm&auml;nimien t&auml;ytyy yhdisty&auml; vastaaviin kursseihin, esim. ryhm&auml; 1 kurssi 1:een, jne. </p>
      <p> <font color="#990000" face="Courier New, Courier, mono">tunnistenumero, icq, puhelin1, puhelin2, osoite, url, kuvaus, postimuotoilu, postin&auml;ytt&ouml;, htmleditori, autoalaindeksi, kurssi1, kurssi2, kurssi3, kurssi4, kurssi5, ryhm&auml;1, ryhm&auml;2, ryhm&auml;3, ryhm&auml;4, ryhm&auml;5</font></p>
    </blockquote>
  </li>
  <li>Pilkut aineiston sis&auml;ss&auml; pit&auml;isi olla koodattu &amp;#44:n&auml; - juonto tulkitsee automaattisesti n&auml;m&auml; takaisin pilkuiksi.</li>
  <li>Boolen kentille, k&auml;yt&auml; 0 v&auml;&auml;r&auml;lle ja 1 oikealle.</li>
  <li>Huomaa: jos k&auml;ytt&auml;j&auml; on jo rekister&ouml;itynyt Moodlen k&auml;ytt&auml;j&auml;tietokantaan, juonto palauttaa automaattisesti k&auml;ytt&auml;j&auml;tunnus numeron (tietokanta hakemisto) sille k&auml;ytt&auml;j&auml;lle, ja ilmoittaa k&auml;ytt&auml;j&auml;n opiskelijana mille tahansa m&auml;&auml;ritellylle kurssille ILMAN ett&auml; p&auml;ivitt&auml;isi toista m&auml;&auml;ritelty&auml; tietoa. </li>
</ul>
  
  
<p>T&auml;ss&auml; esimerkki kelpaavasta tuontitiedostosta:</p>
<p><font size="-1" face="Courier New, Courier, mono">username, password, firstname, lastname, email, lang, idnumber, maildisplay, course1, group1<br />
jonest, verysecret, Tom, Jones, jonest@someplace.edu, en, 3663737, 1, Intro101, Section 1<br />
reznort, somesecret, Trent, Reznor, reznort@someplace.edu, en_us, 6736733, 0, Advanced202, Section 3</font></p>

