<?PHP // $Id$ 
      // admin.php - created with Moodle 1.3 (2004052500)


$string['cachetext'] = 'Вријеме трајања скривене меморије текста';
$string['filteruploadedfiles'] = 'Филтер очитаних датотека';
$string['upgradelogs'] = 'Због потпуне фукционалности, Ваш стари приступ мора бити надограђен.  <a href=\"$a\">Више информација</a>';
$string['upgradelogsinfo'] = 'Недавно су направљене одређене промјене у погледу чувања записа о посјетама. Да би могли видјети све Ваше старе записе на бази активности, требате их ажурирати. Зависно од сајта, таква акција може трајати дуго (и по неколико сати) и може оптеретити базу података на великим сајтовима.
Ако започнете овај процес, онда га требате пустити да се заврши тако што ћете прозор претраживача оставити отворен.
Не брините - Ваш сајт ће и даље добро радити за кориснике у моменту док се записи ажурирају.

Да ли желите ажурирати записе о посјетама?
';
$string['upgradinglogs'] = 'Ажурирање посјета';

?>
