<?PHP // $Id$ 
      // moodle.php - created with Moodle 1.3.1 (2004052501)


$string['action'] = 'Акција';
$string['active'] = 'Активан';
$string['activities'] = 'Активности';
$string['activity'] = 'Активност';
$string['activityclipboard'] = 'Премјештање активности: <b>$a</b>';
$string['activityiscurrentlyhidden'] = 'Нажалост, ова активност тренутно није доступна';
$string['activitymodule'] = 'Додатак активности';
$string['activityreport'] = 'Извјештај активности';
$string['activityselect'] = 'Изабери активност која ће бити премјештена';
$string['activitysince'] = 'Активности за дан: $a';
$string['add'] = 'Додавање';
$string['addadmin'] = 'Додавање администратора';
$string['addcreator'] = 'Додавање креатора курса';
$string['added'] = 'Додано $a';
$string['addedtogroup'] = 'Додано групи $a';
$string['addedtogroupnot'] = 'Није додано групи $a';
$string['addedtogroupnotenrolled'] = 'Није додано групи $a, јер курс није пријављен';
$string['addinganew'] = 'Додавање новог $a';
$string['addinganewto'] = 'Додавање новог $a->what to $a->to';
$string['addingdatatoexisting'] = 'Додавање података у већ постојеће';
$string['addnewcategory'] = 'Додавање нове категорије';
$string['addnewcourse'] = 'Додавање новог курса';
$string['addnewuser'] = 'Додавање новог корисника';
$string['address'] = 'Адреса';
$string['addstudent'] = 'Додавање студента';
$string['addteacher'] = 'Додавање предавача';
$string['admin'] = 'Администратор';
$string['adminhelpaddnewuser'] = 'Прављење новог корисничког налога';
$string['adminhelpassignadmins'] = 'Избор администратора који има потпуна овлаштења на овом сајту';
$string['adminhelpassigncreators'] = 'Избор креатора који могу правити нове курсеве и унутар њих држати наставу';
$string['adminhelpassignstudents'] = 'Идите на курс и додајте нове студенте из администраторског менија';
$string['adminhelpassignteachers'] = 'Нађите курс, а затим притисните на икону за додавање наставника';
$string['adminhelpauthentication'] = 'Могуће је користити корисничке налоге или вањску базу података';
$string['adminhelpbackup'] = 'Подешавање резервних копија података';
$string['adminhelpconfiguration'] = 'Подешавање изгледа сајта';
$string['adminhelpconfigvariables'] = 'Подешавање генералних операција на сајту';
$string['adminhelpcourses'] = 'Приступ курсевима и категоријама и њихово подешавање ';
$string['adminhelpedituser'] = 'Приказ листе корисничких налога и њихово уређивање';
$string['adminhelplanguage'] = 'Провјера и уређивање важећег језичког пакета';
$string['adminhelplogs'] = 'Приказ и подаци о посјетиоцима сајта';
$string['adminhelpmanageblocks'] = 'Управљање инсталираним секцијама и њихово подешавање';
$string['adminhelpmanagedatabase'] = 'Приступите бази података директно (опрез!)';
$string['adminhelpmanagefilters'] = 'Избор текстуалних филтера и њихово подешавање';
$string['adminhelpmanagemodules'] = 'Управљање инсталираним модулима и њихово подешавање';
$string['adminhelpsitefiles'] = 'Приказ и подешавање датотека на сајту';
$string['adminhelpsitesettings'] = 'Подешавање изгледа предње стране сајта';
$string['adminhelpthemes'] = 'Подешавање изгледа сајта (боје, Фонтови, итд.)';
$string['adminhelpuploadusers'] = 'Уношење налога из текстуалне датотеке';
$string['adminhelpusers'] = 'Дефинишите своје кориснике и подесите валидност података';
$string['administration'] = 'Администрација';
$string['administrator'] = 'Администратор';
$string['administrators'] = 'Администратори';
$string['advancedfilter'] = 'Напредно претраживање';
$string['again'] = 'поново';
$string['all'] = 'Све';
$string['allactivities'] = 'Све активности';
$string['alldays'] = 'Сви дани';
$string['allfieldsrequired'] = 'Сва поља се захтијевају';
$string['allgroups'] = 'Све групе';
$string['alllogs'] = 'Сви записи';
$string['allow'] = 'Дозвола';
$string['allowguests'] = 'Приступ курсу је дозвољен гостима';
$string['allownot'] = 'Није дозвољено';
$string['allparticipants'] = 'Сви корисници';
$string['alphabet'] = 'А,Б,В,Г,Д,Ђ,Е,Ж,З,И,J,K,Л,Љ,М,Н,O,П,Р,С,Т,Ћ,У,Ф,Х,Ц,Ч,Џ,Ш';
$string['alphanumerical'] = 'Може само садржавати слова азбуке и бројеве';
$string['alreadyconfirmed'] = 'Регистрација је већ потврђена';
$string['always'] = 'Увијек';
$string['answer'] = 'Одговор';
$string['areyousuretorestorethis'] = 'Да ли желите наставити?';
$string['areyousuretorestorethisinfo'] = 'Касније, у овом процесу имаћете избор за додавање ове подршке на већ постојећи курс, или на новокреирани курс.';
$string['assessment'] = 'Оцјењивање';
$string['assignadmins'] = 'Избор администратора';
$string['assigncreators'] = 'Избор креатора';
$string['assignstudents'] = 'Упис студената';
$string['assignstudentsnote'] = 'Напомена: Није нужно користити ову страну, јер се студенти могу сами пријавити на овај курс.';
$string['assignstudentspass'] = 'Све што можете урадити је да обавијестите студенте за приступ овом квизу, који је тренутно подешен на: \'$a\'';
$string['assignteachers'] = 'Избор предавача';
$string['authentication'] = 'Провјера исправности података';
$string['autosubscribe'] = 'Аутоматска пријава на форум';
$string['autosubscribeno'] = 'Не желим аутоматску пријаву на форуме';
$string['autosubscribeyes'] = 'Да, кад шаљем поруку, упишите ме у тај форум';
$string['availability'] = 'Доступност';
$string['availablecourses'] = 'Доступни курсеви';
$string['backup'] = 'Резервна копија података';
$string['backupcoursefileshelp'] = 'Ако је омогућено, датотеке курса ће бити укључене у аутоматске резервне копије података';
$string['backupdate'] = 'Датум резервне копије података';
$string['backupdetails'] = 'Детаљи резервне копије података';
$string['backupfilename'] = 'резервна копија података';
$string['backupfinished'] = 'Копирање резервних података је успјешно завршено';
$string['backupincludemoduleshelp'] = 'Изаберите да ли желите уључити модуле за курсеве у аутоматску резервну копију, са или без корисничких података';
$string['backupkeephelp'] = 'Колико скоријих резервних копија података за сваки курс желите да задржите? (Старије копије ће бити аутоматски обрисане.)';
$string['backuplogdetailed'] = 'Брисање извршених логова';
$string['backuploglaststatus'] = 'Задњи извршени лог';
$string['backuplogshelp'] = 'Ако се омогући, записи са курса ће бити укључени у аутоматску резервну копију података';
$string['backupnameformat'] = '%%Y%%m%%d-%%H%%M';
$string['backupnoneusersinfo'] = 'Напомена: \"Ниједан\" корисника је изабрано за резервну подршку података, тако да ће начин рада свих метода за резервну подршку бити промијењен у модел \"без корисничких података\". Молимо Вас да имате на уму да методи \"вјежба\" и \"радионица\" нису у складу са овом врстом подржавања података, тако да су у потпуности искључени.';
$string['backuporiginalname'] = 'Назив резервне копије података';
$string['backupsavetohelp'] = 'Читава путања до директоријума гдје желите да сачувате датотеке за резервну копију података
<br>(Оставите празно ако желите да сачувате у подразумијевани директоријум курса)';
$string['backupuserfileshelp'] = 'Изаберите да ли ће корисничке датотеке (нпр. слике) бити укључене у аутоматску резервну копију података';
$string['backupusershelp'] = 'Изаберите да ли желите укључити све кориснике на сервер или само потребне кориснике за сваки курс';
$string['backupversion'] = 'Верзија резервне копије података';
$string['blockdeleteconfirm'] = 'Одлучили сте да комплетно обришете секцију \'$a\'.
Читава база података која је повезана са овом секцијом биће обрисана. Да ли сте сигурни да желите да наставите? ';
$string['blockdeletefiles'] = 'Сви подаци повезани са секцијом \'$a->block\' су обрисани из базе података. Да завршите са брисањем (и спријечите поновну инсталацију секције), требате одмах обрисати директоријум са Вашег сервера: $a->directory';
$string['blocks'] = 'Секције';
$string['blocksetup'] = 'Подешавање секција табела';
$string['blocksuccess'] = '$a табеле су исправно подешене';
$string['bycourseorder'] = 'Поредак по курсевима';
$string['byname'] = 'од $a';
$string['cancel'] = 'Одустани';
$string['categories'] = 'Категорије курсева';
$string['category'] = 'Категорија';
$string['categoryadded'] = 'Категорија \'$a\' је додана';
$string['categorydeleted'] = 'Категорија \'$a\' је обрисана';
$string['categoryduplicate'] = 'Категорија под именом \'$a\' већ постоји!';
$string['changedpassword'] = 'Промијењена лозинка';
$string['changepassword'] = 'Промјена лозинке';
$string['changessaved'] = 'Промјене су сачуване';
$string['checkingbackup'] = 'Провјера резервне копије података';
$string['checkingcourse'] = 'Провјера курса';
$string['checkinginstances'] = 'Провјера ставки';
$string['checkingsections'] = 'Провјера одјељака';
$string['checklanguage'] = 'Провјера језика';
$string['choose'] = 'Избор';
$string['choosecourse'] = 'Избор курсева';
$string['chooselivelogs'] = 'Или погледајте тренутну активност';
$string['chooselogs'] = 'Избор записа које желите да видите';
$string['choosereportfilter'] = 'Избор филтера за извјештај';
$string['choosetheme'] = 'Избор шаблона';
$string['chooseuser'] = 'Избор корисника';
$string['city'] = 'Насеље/Град';
$string['cleaningtempdata'] = 'Брисање привремених података';
$string['clicktochange'] = 'Притисните за промјену';
$string['closewindow'] = 'Затворите прозор';
$string['comparelanguage'] = 'Упоредите и уредите важећи језик';
$string['complete'] = 'Завршетак';
$string['configallowunenroll'] = 'Ако је подешено на \"Да\", онда је студентима омогућено да се сами испишу са курсева кад год желе. У другим случајевима, то им није допуштено, и тај процес је контролисан од стране наставног особља и администратора.';
$string['configcachetext'] = 'За веће сајтове, или сајтове који користе филтере за текст, ова подешавања могу значајно убрзати ствари. Копије текстова ће бити сачуване у њиховој оригиналној форми за вријеме које је овдје одређено. Подешавање овога на сувише низак ниво може битно успорити ствари, али и подешавање на сувише висок ниво може проузроковати да тексту треба пуно времена да се освјежи (нпр. са новим линковима).';
$string['configcountry'] = 'Ако подесите државу, онда ће та држава бити изабрана као подразумијевана на новим корисничким налозима. Да би корисници слободно изабрали државу, ову опцију немојте уређивати.';
$string['configdebug'] = 'Ако ову опцију укључите, онда ће извјештај о PHP грешкама бити повећан, тако да упозорења могу бити
и сачувана као штампани материјал. Ово је корисно само за стручњаке који су развили овај програм.';
$string['configdeleteunconfirmed'] = 'Ако користите доказ о истинитости за е-пошту корисника, ово је период у којем корисник треба одговорити да би био прихваћен на овом сајту.';
$string['configenablerssfeeds'] = 'Овај прекидач ће омогућити RSS довод до сајта. 
Да бисте видјели било какве промјене, требате такође омогућити довођење RSS у појединачне модуле (секција Модули, у администраторским подешавањима)';
$string['configenablerssfeedsdisabled'] = 'Није доступно. RSS напајања су онемогућена на читавом сајту. Да бисте их омогућили, требате отићи у секцију Варијабле која је смјештена у оквиру администраторских подешавања.';
$string['configerrorlevel'] = 'Изаберите број PHP упозорења за приказ. Опција \"Нормално\" је углавном најбољи избор. ';
$string['configextendedusernamechars'] = 'Ово подешавање омогућује студентима да користе и слова и бројеве у својим корисничким именима (не одражава се на њихова стварна имена). Подразумијевана опција је \"Не\" која забрањује слова и бројеве у корисничким именима.';
$string['configfilteruploadedfiles'] = 'Омогућавање ове опције ће узроковати да програм помоћу филтера обради све додате HTML и текстуалне датотеке прије њиховог приказивања.';
$string['configforcelogin'] = 'Насловну страну сајта и листу курсева углавном могу видјети сви корисници, и то без пријављивања.
Ако желите да сви корисници буду уписани прије него што виде било какав садржај, онда требате омогућити ово подешавање.';
$string['configforceloginforprofiles'] = 'Ово подешавање наводи присутне да се пријаве са правим налогом (не као гост) прије него што им се дозволи да виде странице осталих корисника.
Подразумијевана опција је онемогућена - \"Не\", тако да напреднији студенти могу читати о предавачима сваког курса, али и да их Интернет претраживачи могу видјети.';
$string['configframename'] = 'Ако постављате Moodle у оквире мреже, онда име тог оквира поставите овдје. У другим случајевима, ова вриједност би требала остати као \'_top\'';
$string['configfullnamedisplay'] = 'Дефинишите како су имена приказана у пуној форми.
За већину једнојезичких сајтова најефикаснији начин је подразумијевани \"Име + Презиме\".
Такође, можете изабрати да сакријете презимена, или да пустите да одређени језик сам одлучи (неки језици имају другачији обичај).';
$string['configgdversion'] = 'Наведите инсталирану верзију GD. 
Приказана је подразумијевана верзија и она је аутоматски препозната.
Немојте мијењати ову опцију уколико стварно нисте сигурни шта ћете промијенити.';
$string['confightmleditor'] = 'Изаберите да ли ћете дозволити употребу HTML текстуалног уредника или не. 
Чак и ако дозволите употребу, овај уредник ће се појавити само ако корисник користи одговарајући претраживач. Корисници такође могу изабрати опцију да не користе HTML уредника.';
$string['configidnumber'] = 'Ова опција одређује:
(а)Корисници уопште не требају дати број личног документа;
(б) Корисници би могли дати број личног документа, али није обавезно;
(в) Корисници су обавезни да дају број личног документа, и не могу оставити празно поље. 
У овом случају, број документа корисника ће бити приказан у њиховом профилу.';
$string['configintro'] = 'На овој страници можете одредити број варијабли за конфигурацију који омогућава Moodle програму да исправно функционише на вашем серверу.
Немојте се пуно бринути око овога - подразумијевана подешавања углавном функционишу добро. Ако је потребно, увијек можете доћи на ову страницу и промијенити подешавања.';
$string['configintroadmin'] = 'На овој страници требали бисте конфигурисати ваш главни администраторски налог који има комплетну контролу над сајтом. 
Побрините се да Вам корисничко име и лозинка буду сигурни, а исто тако да је адреса електронске поште исправна. Касније можете направити више администаторских налога.';
$string['configintrosite'] = 'Ова страница Вам омогућава да подесите предњу страницу заједно са њеним именом.
Касније можете промијенити подешавања користећи опцију \"Подешавање сајта\" на првој страници.';
$string['configlang'] = 'Изаберите подразумијевани језик за читав сајт. Корисници касније могу да пониште ово подешавање.';
$string['configlangdir'] = 'У већини језика се пише са лијеве на десну страну, али неки, попут Арапског или Хебрејског, се пишу са десне на лијеву страну.';
$string['configlanglist'] = 'Приликом инсталације Moodle програма ово поље оставите празно да бисте омогућили корисницима да изаберу језик који желе.
У менију за језик можете користити скраћена имена језика тако што ћете их раздвојити зарезом, нпр: ср,хр,ен,ит,фр...';
$string['configlangmenu'] = 'Изаберите да ли желите приказати језички мени за општу намјену на насловној страници, пријавној страници итд. Ова опција не утиче на корисника да подеси жељени језик у свом профилу.';
$string['configlocale'] = 'Изаберите формат и језик датума на сајту. Требате имати инсталиране ове податке на Вашем оперативном систему. Ако нисте сигурни у вези овог подешавања, немојте ништа мијењати.';
$string['configloglifetime'] = 'Одредите колико дуго желите да сачувате записе о активностима корисника. Записи старији од ... се аутоматски бришу. Најбоље је да се записи чувају што дуже, у случају да Вам затребају. Ипак, ако Вам је сервер веома заузет и суочавате се са проблемима, онда можете да промијените дужину трајања записа.';
$string['configlongtimenosee'] = 'Ако се студенти нису одавно уписали на неки од курсева, биће аутоматски исписани. Овај параметар одређује такво временско ограничење.';
$string['configmaxbytes'] = 'Одређује максималну величину додатих датотека на читавом сајту. Подешавање је ограничено са PHP
подешавањем upload_max_filesize и Apache подешавањем LimitRequestBody.
Као резултат, maxbytes ограничава величине које могу бити изабране на нивоу курса или нивоу модула.';
$string['configmaxeditingtime'] = 'Одређује количину потребног времена за поновно уређивање слања порука у форум, повратне информације итд. Обично је 30 минута довољно.';
$string['configopentogoogle'] = 'Ако омогућите ово подешавање, онда ће Google претраживачу бити омогућено да уђе на сајт као гост. Осим тога, посјетиоци који долазе на сајт користећи Google биће аутоматски логовани као \"Гост\". Имајте на уму да ова опција даје приступ само курсевима који омогућавају приступ гостима.';
$string['configproxyhost'] = 'Ако овај <B>server</B> захтијева употребу proxy-ја на Вашем рачунару (нпр. firewall) за приступ Интернету, онда овдје упишите proxy hostname и port. У супротном, ову опцију немојте подешавати.';
$string['configsecureforms'] = 'Moodle може користити додатни ниво безбједности приликом прихватања података са web форми.
Ако је опција омогућена, онда се HTTP_REFERER варијабла одређеног претраживача провјерава са тренутне адресе web форме.
У неким случајевима, може доћи до проблема ако корисник користи firewall (нпр. Zonealarm), подешен да повуче HTTP_REFERER са њиховог промета.
Симптоми су да форма може \"заглавити\". Ако Ваши корисници имају проблеме нпр., са страницом за пријаву, онда можете онемогућити ово подешавање, мада би то могло да остави Ваш сајт отвореним за нападе и крађу лозинки и осталих података.
Ако нисте сигурни шта да учините, онда оставите ово подешавање на \"Да\".';
$string['configsessioncookie'] = 'Ово подешавање уређује име cookie-ја који се користи за употребу Moodle програма. Ова опција није обавезна, али је корисна у случају забуне, кад постоји више копија програма на истом сајту који су у употреби.';
$string['configsessiontimeout'] = 'Корисници који су на сајту неактивни дуже вријеме се аутоматски исписују (њихова активност је завршена). Ова варијабла одређује дужину тог времена.';
$string['configslasharguments'] = 'Датотеке (слике, текстови, итд.) су омогућени путем скрипте која користи \"slash аргументе\" (друга опција). Ова метода омогућује датотекама да буду лакше привремено смјештене у претраживаче, proxy сервере итд. Нажалост, неки  
PHP сервери не дозвољавају ову методу. Уколико имате проблема приликом гледања доданих датотека, онда подесите ову варијаблу на прву опцију.';
$string['configsmtphosts'] = 'Даје пуно име једног или више SMTP сервера који би Moodle требао користити за слање електронске поште (нпр. \'mail.a.com\' или \'mail.a.com; mail.b.com\'). Ако оставите празно поље, Moodle ће користити подразумијевану PHP методу слања електронске поште.';
$string['configsmtpuser'] = 'Ако сте изнад одредили SMTP сервер, и сервер захтијева провјеру, онда овдје унесите своје корисничко име и лозинку.';
$string['configteacherassignteachers'] = 'Да ли осталим предавачима треба дозволити да додају своје предаваче на својим курсевима?
Ако је одговор \"Не\", онда само креатори курсева и администратори могу додавати предаваче.';
$string['configtimezone'] = 'Овдје можете подесити жељену временску зону, али
сваки корисник може да у свом профилу постави своју жељену зону.';
$string['configunzip'] = 'Наведите локацију Вашег програма за распакивање (само за Unix, (није обавезно)).
Ако се назначи, онда ће ова опција бити кориштена за распакивање спакованих архива на серверу. 
Ако оставите празно поље, Moodle ће користити интерне шаблоне.';
$string['configuration'] = 'Подешавање';
$string['configvariables'] = 'Промјенљиве';
$string['configwarning'] = 'Будите опрезни приликом промјене ових подешавања - недефинисане вриједности могу проузроковати проблеме.';
$string['configzip'] = 'Задајте локацију вашег програма за архивирање (zip); (само за Unix, (није обавезно)). Ако је задана, она ће бити кориштена за креирање zip архива на серверу. Ако ово поље остане празно тада ће Moodle програм користити своју подразумјевану локацију.';
$string['confirm'] = 'Потврда';
$string['confirmed'] = 'Ваша регистрација је потврђена';
$string['confirmednot'] = 'Ваша регистрација још није потврђена!';
$string['continue'] = 'Наставак';
$string['cookiesenabled'] = '\"Cookies\" морају бити укључени на вашем претраживачу';
$string['copy'] = 'Копирање';
$string['copyingcoursefiles'] = 'Копирање датотека курса';
$string['copyinguserfiles'] = 'Копирање корисничких датотека';
$string['copyingzipfile'] = 'Копирање архивираних фајлова';
$string['copyrightnotice'] = 'Напомена о заштити ауторских права';
$string['country'] = 'Република/Држава';
$string['course'] = 'Курс';
$string['courseavailable'] = 'Овај курс је доступан студентима';
$string['courseavailablenot'] = 'Овај курс није доступан студентима';
$string['coursebackup'] = 'Резервна копија података курса';
$string['coursecategories'] = 'Категорије курса';
$string['coursecategory'] = 'Категорија курса';
$string['coursecreators'] = 'Креатор курса';
$string['coursefiles'] = 'Датотеке курса';
$string['courseformats'] = 'Формати курса';
$string['coursegrades'] = 'Степени курса';
$string['courseinfo'] = 'Информације о курсу';
$string['courserestore'] = 'Поништите курс';
$string['courses'] = 'Курсеви';
$string['courseupdates'] = 'Ажурирања курса';
$string['courseuploadlimit'] = 'Ограничење допуне курса';
$string['create'] = 'Направи';
$string['createaccount'] = 'Направи ми нови налог';
$string['createfolder'] = 'Направи директоријум у $a';
$string['createuserandpass'] = 'Направите ново корисничко име и лозинку да би се уписали';
$string['createziparchive'] = 'Направите архиву';
$string['creatingcategoriesandquestions'] = 'Прављење категорија и упитника';
$string['creatingcoursemodules'] = 'Прављење модула курса';
$string['creatingevents'] = 'Прављење догађаја';
$string['creatinggroups'] = 'Прављење група';
$string['creatinglogentries'] = 'Прављење улазних записа';
$string['creatingnewcourse'] = 'Прављење новог курса';
$string['creatingscales'] = 'Прављење степена';
$string['creatingsections'] = 'Прављење секција';
$string['creatingtemporarystructures'] = 'Прављење привремене структуре';
$string['creatingusers'] = 'Прављење корисника';
$string['creatingxmlfile'] = 'Прављење XML фајла';
$string['currentcourseadding'] = 'Текући курс, додавање података на њега';
$string['currentcoursedeleting'] = 'Тренутни курс, брисање првог - deleting it first';
$string['currentlanguage'] = 'Тренутно важећи језик';
$string['currentlocaltime'] = 'Тренутно вријеме';
$string['currentpicture'] = 'Тренутна слика';
$string['currentrelease'] = 'Информације о овој верзији програма';
$string['currentversion'] = 'Тренутна верзија';
$string['databasechecking'] = 'Надоградња базе података са верзије $a->oldversion на $a->newversion...';
$string['databaseperformance'] = 'Карактеристике базе података';
$string['databasesetup'] = 'Постави базу података';
$string['databasesuccess'] = 'База података је успјешно надoграђена';
$string['databaseupgradebackups'] = 'Верзија резервне копије података је сада $a';
$string['databaseupgradeblocks'] = 'Верзија блокова је сада $a';
$string['databaseupgrades'] = 'Надоградња базе података';
$string['datemostrecentfirst'] = 'Датум - Најновији први';
$string['datemostrecentlast'] = 'Датум - Најновији задњи';
$string['day'] = 'дан';
$string['days'] = 'дана';
$string['decodinginternallinks'] = 'Декодирање унутрашњих линкова';
$string['defaultcoursefullname'] = 'Пуно име курса 101';
$string['defaultcourseshortname'] = 'CF101';
$string['defaultcoursestudent'] = 'Студент';
$string['defaultcoursestudents'] = 'Студенти';
$string['defaultcoursesummary'] = 'Ваше информације и објашњења о детаљима курса';
$string['defaultcourseteacher'] = 'Предавач';
$string['defaultcourseteachers'] = 'Предавачи';
$string['delete'] = 'Обришите';
$string['deleteall'] = 'Обришите све';
$string['deletecheck'] = 'Обришите $a ?';
$string['deletecheckfiles'] = 'Да ли сте сигурни да желите да обришете ове фајлове?';
$string['deletecheckfull'] = 'Да ли сте потпуно сигурни да желите комплетно обрисати $a ?';
$string['deletecheckwarning'] = 'Управо бришете ове фајлове';
$string['deletecompletely'] = 'Комплетно брисање';
$string['deletecourse'] = 'Обришите курс';
$string['deletecoursecheck'] = 'Да ли сте сигурни да желите потпуно обрисати овај курс и све податке које он посједује?';
$string['deleted'] = 'Обрисано';
$string['deletedactivity'] = 'Обрисано $a';
$string['deletedcourse'] = '$a је потуно обрисан';
$string['deletednot'] = 'Не може се обрисати $a !';
$string['deleteselected'] = 'Обришите изабрано';
$string['deletingcourse'] = 'Брисање $a';
$string['deletingexistingcoursedata'] = 'Брисање постојећих података курса';
$string['deletingolddata'] = 'Брисање старих података';
$string['department'] = 'Одјељење';
$string['description'] = 'Опис';
$string['disable'] = 'Искључите';
$string['displayingfirst'] = 'Само први $a->count $a->things су приказани';
$string['displayingrecords'] = 'Приказати $a записе';
$string['displayingusers'] = 'Приказати кориснике $a->start to $a->end';
$string['documentation'] = 'Moodle Документација';
$string['donotask'] = 'Не питајте';
$string['down'] = 'Доље';
$string['downloadexcel'] = 'Сачувајте у Excel формату';
$string['downloadtext'] = 'Сачувајте у текстуалном формату';
$string['doyouagree'] = 'Да ли сте прочитали и разумјели ове услове?';
$string['edit'] = 'Уредите $a';
$string['editcoursesettings'] = 'Уређивање подешавања курса';
$string['editfiles'] = 'Уређивање директорија';
$string['editgroupprofile'] = 'Уређивање профила групе';
$string['editinga'] = 'Уређивање $a';
$string['editmyprofile'] = 'Уређивање профил';
$string['editsummary'] = 'Уређивање садржаја';
$string['editthisactivity'] = 'Уређивање ове активности';
$string['editthiscategory'] = 'Уређивање ове категорије';
$string['edituser'] = 'Уређивање корисничких налога';
$string['email'] = 'Електронска aдреса';
$string['emailagain'] = 'Е-пошта (поново)';
$string['emailconfirm'] = 'Потврдите ваш налог';
$string['emailconfirmation'] = 'Здраво $a->firstname,

Ваша е-адреса је кориштена због захтјева за нови налог на сајту \'$a->sitename\'.

Да потврдите Ваш захтјев за нови налог, молимо Вас да идете на ову локацију:

$a->link

У већини програма за е-пошту, треба се појавити плави линк који требате притиснути.
Ако та функција не ради, онда само копирајте и пресликајте наведену адресу у линију за адресе
на врху Вашег Интернет претраживача.

Ако требате помоћ, молимо Вас да се обратите администратору,

$a->admin

';
$string['emailconfirmationsubject'] = '$a: Потврда налога';
$string['emailconfirmsent'] = '   <P>Информација је послана Е-поштом на Вашу адресу <B>$a</B>
   <P>Молимо Вас да слиједите једноставна упутства за комплетирање Ваше регистрације.
   <P>Ако будете имали потешкоћа приликом овог процеса, можете се обратити администратору.';
$string['emaildisable'] = 'Ова адреса електронске поште је онемогућена.';
$string['emaildisplay'] = 'Приказ електронске поште';
$string['emaildisplaycourse'] = 'Дозвола за остале чланове курса да виде моју адресу електронске поште';
$string['emaildisplayno'] = 'Сакривање моје адресе електронске поште од свих';
$string['emaildisplayyes'] = 'Дозволити свима доступну моју адресу електронске поште ';
$string['emailenable'] = 'Ова адреса електронске поште је омогућена.';
$string['emailexists'] = 'Ова адреса електронске поште је већ регистрована.';
$string['emailformat'] = 'Формат електронске поште';
$string['emailmustbereal'] = 'Напомена: Ваша електронска пошта мора бити стварна';
$string['emailpasswordconfirmation'] = 'Здраво $a->firstname,

Ваша е-адреса је кориштена због захтјева за нови налог на сајту \'$a->sitename\'.

Да потврдите Ваш захтјев за нови налог, молимо Вас да идете на ову локацију:

$a->link

У већини програма за е-пошту, треба се појавити плави линк који требате притиснути.
Ако та функција не ради, онда само копирајте и пресликајте наведену адресу у линију за адресе
на врху Вашег Интернет претраживача.

Ако требате помоћ, молимо Вас да се обратите администратору,

$a->admin

';
$string['emailpasswordconfirmationsubject'] = '$a: потврда промјене лозинке';
$string['emailpasswordconfirmsent'] = 'Информација је послана Е-поштом на Вашу адресу <b>$a</b>.
<p>Молимо Вас да слиједите једноставна упутства за потврђивање и комплетирање промјене Ваше лозинке.
Ако будете имали потешкоћа приликом овог процеса, можете се обратити администратору.';
$string['emailpasswordsent'] = 'Хвала Вам што сте потврдили промјену лозинке.
<p>Порука са Вашом новом лозинком је послана на Вашу електронску пошту <b>$a->email</b>.
<p>Нова лозинка је аутоматски направљена. Можда желите да <a href=$a->link>промијените лозинку</a> у неку другу, коју можете лакше запамтити.';
$string['enable'] = 'Омогућено';
$string['enrolledincourse'] = 'Уписан на курс ';
$string['enrolledincoursenot'] = 'Није уписан на курс ';
$string['enrolmentconfirmation'] = 'У процесу сте пријаве чланства за овај курс.<br /> Да ли сте сигурни да то желите?';
$string['enrolmentkey'] = 'Кључ за пријаву';
$string['enrolmentkeyfrom'] = 'Овај курс захтијева \'кључ за пријаву\' <BR>
лозинка коју требате добити од $a';
$string['enrolmentkeyhint'] = 'Кључ за пријаву је погрешан. Молимо Вас да покушате поново.<BR>
(Мала помоћ: почиње са \'$a\')';
$string['entercourse'] = 'Притисните да уђете на курс';
$string['enteremailaddress'] = 'Да бисте поништили тренутну лозинку и добили нову, требате унијети вашу важећу адресу електронске поште, на коју ће Вам бити послана нова лозинка. ';
$string['error'] = 'Грешка';
$string['errortoomanylogins'] = 'Нажалост, прекорачили сте број дозвољених покушаја за приступ. Поново покрените Ваш претраживач.';
$string['errorwhenconfirming'] = 'Регистрација корисничког налога због настале грешке још није одобрена.  Ако сте доспјели на ову локацију посјетивши линк који сте добили у е-пошти, провјерите да ли је линија у е-пошти која садржи линк, коректна, одн. да није дошло до преношења једног њеног дијела у сљедећи ред. Можда је потребно да је ручно унесете, у цијелости, у прегледач страница који користите.';
$string['executeat'] = 'Извршење на';
$string['existing'] = 'Постојећи';
$string['existingadmins'] = 'Постојећи администратори';
$string['existingcourse'] = 'Постојећи курс';
$string['existingcourseadding'] = 'Постојећи курс, додавање података';
$string['existingcoursedeleting'] = 'Постојећи курс, брисање';
$string['existingcreators'] = 'Креатори постојећег курса';
$string['existingstudents'] = 'Пријављени студенти';
$string['existingteachers'] = 'Присутно наставно особље';
$string['feedback'] = 'Повратне информације';
$string['filemissing'] = '$a недостаје';
$string['files'] = 'Датотеке';
$string['filesfolders'] = 'Датотеке/Директоријуми';
$string['filloutallfields'] = 'Попуните сва поља у овој форми';
$string['findmorecourses'] = 'Нађите још курсева...';
$string['firstdayofweek'] = '1';
$string['firstname'] = 'Ваше име';
$string['firsttime'] = 'Да ли сте овдје први пут?';
$string['followingoptional'] = 'Сљедећа поља су необавезна';
$string['followingrequired'] = 'Сљедећа поља су обавезна';
$string['force'] = 'Обавеза';
$string['forcedmode'] = 'обавезан образац';
$string['forcelanguage'] = 'Обавезан језик';
$string['forceno'] = 'Није обавезно';
$string['forgotten'] = 'Заборавили сте корисничко име или лозинку?';
$string['format'] = 'Формат';
$string['formathtml'] = 'HTML формат';
$string['formatplain'] = 'Текстуални формат';
$string['formatsocial'] = 'Друштвени формат';
$string['formattext'] = 'Moodle ауто-формат';
$string['formattexttype'] = 'Форматирање';
$string['formattopics'] = 'Формат за теме';
$string['formatweeks'] = 'Седмични формат';
$string['formatwiki'] = 'Вики формат';
$string['from'] = 'Од';
$string['frontpagecategorynames'] = 'Приказ списка категорија';
$string['frontpagecourselist'] = 'Приказ списка курсева';
$string['frontpagedescription'] = 'Опис насловне стране';
$string['frontpageformat'] = 'Формат насловне стране';
$string['frontpagenews'] = 'Приказ прегледа новости';
$string['fulllistofcourses'] = 'Сви курсеви';
$string['fullname'] = 'Пуно име и презиме';
$string['fullnamedisplay'] = '$a->име $a->презиме';
$string['fullprofile'] = 'Потпун профил';
$string['fullsitename'] = 'Пуно име сајта';
$string['gd1'] = 'GD 1.x је инсталиран';
$string['gd2'] = 'GD 2.x је инсталиран';
$string['gdneed'] = 'GD мора бити инсталиран да би видјели овај графикон';
$string['gdnot'] = 'GD није инсталиран';
$string['gpl'] = 'Copyright (C) 1999-2004  Martin Dougiamas  (http://dougiamas.com)

Овај програм је бесплатан софтвер. 
Можете вршити дистрибуцију и/или мијењати га само под условима GNU General Public License објављеног од Free Software Foundation; такође и верзију 2 Лиценце, као и (по вашем избору) било коју другу верзију.

Више детаља можете наћи на адреси GNU General Public License: http://www.gnu.org/copyleft/gpl.html';
$string['grade'] = 'Проценат';
$string['grades'] = 'Проценти';
$string['group'] = 'Група';
$string['groupadd'] = 'Додајте нову групу';
$string['groupaddusers'] = 'Додајте изабрано групи';
$string['groupfor'] = 'за групу';
$string['groupinfo'] = 'Информације о изабраној групи';
$string['groupinfomembers'] = 'Информације о изабраним члановима';
$string['groupinfopeople'] = 'Информације о изабраним људима';
$string['groupmemberssee'] = 'Погледајте чланове групе ';
$string['groupmembersselected'] = 'Чланови изабране групе';
$string['groupmode'] = 'Групни образац';
$string['groupmodeforce'] = 'Обавезни групни образац';
$string['groupmy'] = 'Моја група';
$string['groupnonmembers'] = 'Људи који нису у групи';
$string['groupnotamember'] = 'Жао нам је, нисте члан групе';
$string['grouprandomassign'] = 'Случајно додијељено свим групама';
$string['groupremove'] = 'Уклоните изабрану групу';
$string['groupremovemembers'] = 'Уклоните изабране чланове';
$string['groups'] = 'Групе';
$string['groupsnone'] = 'Нема група';
$string['groupsseparate'] = 'Одвојене групе';
$string['groupsvisible'] = 'Видљиве групе';
$string['guestskey'] = 'Дозволити улаз гостима који имају кључ';
$string['guestsno'] = 'Не дозволити улаз гостима ';
$string['guestsnotallowed'] = 'Нажалост, \'$a\' не дозвољава улаз гостима.';
$string['guestsyes'] = 'Дозволите гостима без кључа';
$string['guestuser'] = 'Гост корисник';
$string['guestuserinfo'] = 'Овај корисник је посебан и дозвољава ограничен приступ неким курсевима.';
$string['help'] = 'Помоћ';
$string['helpemoticons'] = 'Употријебите иконице';
$string['helpformatting'] = 'О форматирању текста';
$string['helphtml'] = 'Како да напишете html';
$string['helpindex'] = 'Листа свих датотека за помоћ';
$string['helppicture'] = 'Како додати слику';
$string['helpquestions'] = 'Поставите права питања';
$string['helpreading'] = 'Прочитајте пажљиво';
$string['helprichtext'] = 'О HTML уреднику';
$string['helpsummaries'] = 'О овим садржајима';
$string['helptext'] = 'Како да напишете текст';
$string['helpwiki'] = 'Како да напишете Вики текст';
$string['helpwriting'] = 'Пишите пажљиво';
$string['hiddensections'] = 'Сакривене секције';
$string['hiddensectionscollapsed'] = 'Скривене секције су приказане у збијеној форми';
$string['hiddensectionsinvisible'] = 'Скривене секције су потпуно невидљиве';
$string['hide'] = 'Сакриј';
$string['hidepicture'] = 'Сакриј слику';
$string['hits'] = 'Доласци';
$string['hitsoncourse'] = 'Доласци на $a->coursename од $a->username';
$string['hitsoncoursetoday'] = 'Данашњи доласци на $a->coursename од $a->username';
$string['home'] = 'Почетна страна';
$string['hour'] = 'Сат';
$string['hours'] = 'Сати';
$string['howtomakethemes'] = 'Како направити нови шаблон?';
$string['htmleditor'] = 'Употријебите HTML уредника (важи само за поједине претраживаче)';
$string['htmleditoravailable'] = 'HTML уредник је доступан';
$string['htmleditordisabled'] = 'Онемогућили сте приступ HTML уреднику у вашем корисничком профилу';
$string['htmleditordisabledadmin'] = 'Администратор је онемогућио приступ HTML уреднику на овом сајту';
$string['htmleditordisabledbrowser'] = 'HTML уредник није доступан јер Ваш претраживач није одговарајући';
$string['htmlformat'] = 'Уредни HTML формат';
$string['icqnumber'] = 'ICQ број';
$string['idnumber'] = 'Идентификациони број (ID)';
$string['inactive'] = 'Неактиван';
$string['include'] = 'Укључујући';
$string['includeallusers'] = 'Укључујући све кориснике';
$string['includecoursefiles'] = 'Укључујучи све Фајлове курса';
$string['includecourseusers'] = 'Укључујучи све кориснике курса';
$string['included'] = 'Укључени';
$string['includelogentries'] = 'Укључујући листу посјета (логова)';
$string['includemodules'] = 'Укључујући модуле';
$string['includeneededusers'] = 'Укључујући потребне кориснике';
$string['includenoneusers'] = 'Немојте укључивати кориснике';
$string['includeuserfiles'] = 'Укључујући корисничке датотеке';
$string['institution'] = 'Институција';
$string['invalidemail'] = 'Погрешна електронска адреса';
$string['invalidlogin'] = 'Погрешна лозинка или корисничко име. Провјерите да ли сте исправно унијели тражене податке. Молимо Вас да покушате поново.';
$string['jumpto'] = 'Пређите на...';
$string['keep'] = 'Задржите';
$string['langltr'] = 'Уређење језика са лијева на десно';
$string['langrtl'] = 'Уређење језика са десна на лијево';
$string['language'] = 'Језик';
$string['languagegood'] = 'Овај језички пакет је у потпуности ажуриран! :-)';
$string['lastaccess'] = 'Задњи приступ';
$string['lastedited'] = 'Задње уређивање';
$string['lastlogin'] = 'Задњи упис';
$string['lastmodified'] = 'Задња измјена';
$string['lastname'] = 'Презиме';
$string['latestlanguagepack'] = 'Погледајте најновије језичке пакете на moodle.org';
$string['latestnews'] = 'Најновије вијести';
$string['leavetokeep'] = 'Оставите празно поље да задржите тренутну лозинку';
$string['license'] = 'GPL Лиценца';
$string['list'] = 'Списак';
$string['listfiles'] = 'Списак датотека у $a';
$string['listofallpeople'] = 'Списак свих корисника';
$string['livelogs'] = 'Извјештај о посјетама у задњих сат времена';
$string['locale'] = 'sr';
$string['location'] = 'Локација';
$string['loggedinas'] = 'Пријављени сте као $a ';
$string['loggedinnot'] = 'Нисте пријављени.';
$string['login'] = 'Пријава';
$string['loginas'] = 'Пријављен као';
$string['loginguest'] = 'Пријављен као корисник са налогом гост';
$string['loginsite'] = 'Пријава на сајт';
$string['loginsteps'] = 'ДОБРОДОШЛИ НА е-НАСТАВУ!
За упис у курс и пуни приступ свим сарджајима потребан вам је кориснички налог. Можете га одмах отворити испуњавањем обрасца за отварање новог налога. За поједине курсеве може постојати и обавезна \"ПРИСТУПНА ШИФРА\" коју ћете добити од предавача, а која ће вам требати касније при упису.
Посупак уписивања тече овако:
   <ol size=\"2\">
   <li>Испуните најприје формулар <a href=\"$a\">Нови налог</a> са својим личним подацима.</li>
   <li>Одмах ћете на своју електронску адресу добити наша даља упутства.</li>
   <li>Прочитајте своју е-пошту и притиском на послани линк и активирајте свој налог.</li>
   <li>Кориснички налог ће Вам бити потврђен и имаћете отворен приступ на сајт (бићете логовани).</li>
   <li>Сада, можете изабрати курс који желите похађати.</li>
   <li>Ако при уласку на курс буде затражена \"приступна шифра\" - упишите ону коју сте добили од предавача. Тиме сте и службено \"уписани\" на курс.</li>
   <li>Сада можете приступити свим садржајима курса. При поновном доласку упишите само Ваше корисничко име (username) и лозинку (password) у лијеви дио овог обрасца да би приступили свим курсевима које сте уписали.</li>
   </ol>';
$string['loginstepsnone'] = '<p>Поздрав!</p>
<p>За пуни приступ курсевима ви требате креирати ваш рачун.</p>
<p>Све што требате урадити је да одаберете корисничко име и лозинку коју ћете користити у овом обрасцу!</p>
<p>Ако је неко други већ одабрао то корисничко име пробајте поново бирајући друго корисничко име.</p>';
$string['loginto'] = 'Пријава на $a';
$string['loginusing'] = 'Пријавите се са Вашим корисничким именом и лозинком';
$string['logout'] = 'Одјава';
$string['logs'] = 'Извјештаји о посјетама';
$string['mainmenu'] = 'Главни мени';
$string['makeafolder'] = 'Направите директоријум';
$string['makeeditable'] = 'Ако подесите \'$a\' да се може уредити преко web сервера (нпр. Аpache), онда можете мијењати ову датотеку директно са ове странице';
$string['manageblocks'] = 'Секције';
$string['managedatabase'] = 'База података';
$string['managefilters'] = 'Филтери';
$string['managemodules'] = 'Модули';
$string['markedthistopic'] = 'Ова тема је означена као тренутна тема';
$string['markthistopic'] = 'Означите ову тему као тренутну тему';
$string['maximumchars'] = 'Максимално $a карактера';
$string['maximumgrade'] = 'Максимална оцјена';
$string['maximumshort'] = 'Макс';
$string['maximumupload'] = 'Максимална величина додавања';
$string['maxsize'] = 'Максимална величина: $a';
$string['min'] = 'минут';
$string['mins'] = 'минута';
$string['miscellaneous'] = 'Остало';
$string['missingcategory'] = 'Требате изабрати категорију';
$string['missingcity'] = 'Недостаје град/мјесто';
$string['missingcountry'] = 'Недостаје држава';
$string['missingdescription'] = 'Недостаје опис';
$string['missingemail'] = 'Недостаје адреса за е-пошту';
$string['missingfirstname'] = 'Недостаје дато име';
$string['missingfullname'] = 'Недостаје пуно име';
$string['missinglastname'] = 'Недостаје презиме';
$string['missingname'] = 'Недостаје име';
$string['missingnewpassword'] = 'Недостаје нова лозинка';
$string['missingpassword'] = 'Недостаје лозинка';
$string['missingshortname'] = 'Недостаје кратко име';
$string['missingshortsitename'] = 'Недостаје кратко име сајта';
$string['missingsitedescription'] = 'Недостаје кратки опис сајта';
$string['missingsitename'] = 'Недостаје име сајта';
$string['missingstrings'] = 'Провјера ријечи и знакова који недостају у изабраном језику';
$string['missingstudent'] = 'Нешто морате одабрати';
$string['missingsummary'] = 'Недостаје збирни преглед';
$string['missingteacher'] = 'Нешто морате одабрати';
$string['missingurl'] = 'Недостаје URL';
$string['missingusername'] = 'Недостаје корисничко име';
$string['modified'] = 'Модификовано';
$string['moduledeleteconfirm'] = 'Управо бришете модул \'$a\' у потпуности.  Из базе података ће се обрисати све што је повезано са активноти овог модула. Да ли желите наставити?';
$string['moduledeletefiles'] = 'Сви подаци повезани са модулом \'$a->module\' су обрисани из базе података. Да потврдите брисање (и спријечите поновно инсталирање модула), требате обрисати овај директоријум са Вашег сервера: $a->directory';
$string['modulesetup'] = 'Подешавање табела модула';
$string['modulesuccess'] = '$a табеле су исправно подешене';
$string['moodleversion'] = 'Moodle верзија';
$string['mostrecently'] = 'Најновије';
$string['move'] = 'Премјести';
$string['movecategoryto'] = 'Премјести категорију на:';
$string['movecourseto'] = 'Премјести курс на:';
$string['movedown'] = 'Премјести доле';
$string['movefilestohere'] = 'Премјести фајлове овдје';
$string['movefull'] = 'Премјести $a на ту локацију';
$string['movehere'] = 'Премјести овдје';
$string['moveleft'] = 'Премјести лијево';
$string['moveright'] = 'Премјести десно';
$string['moveselectedcoursesto'] = 'Премјести селектоване курсеве на...';
$string['movetoanotherfolder'] = 'Премјести у други директоријум';
$string['moveup'] = 'Премјести горе';
$string['mustconfirm'] = 'Требате потврдити пријаву';
$string['mycourses'] = 'Моји курсеви';
$string['name'] = 'Име';
$string['namesocial'] = 'секција';
$string['nametopics'] = 'тема';
$string['nameweeks'] = 'седмица';
$string['needed'] = 'Потребно';
$string['never'] = 'Никад';
$string['neverdeletelogs'] = 'Никад не брисати записе о посјетама';
$string['new'] = 'Ново';
$string['newaccount'] = 'Нови налог';
$string['newcourse'] = 'Нови курс';
$string['newpassword'] = 'Нова лозинка';
$string['newpasswordtext'] = 'Добродошли $a->firstname,

Лозинка за Ваш налог на \'$a->sitename\' је поништена и издана Вам је нова, привремена лозинка.

Ваши подаци за упис сада су:  
   Корисничко име: $a->username
   Нова лозинка: $a->newpassword

За промјену ваше лозинке, притисните овај линк:
   $a->link

Уколико ова опција не функционише, онда само копирајте ову адресу у линију за адресе при врху Вашег претраживача.
Пуно поздрава!
\'$a->sitename\' администратор,
$a->signoff
';
$string['newpicture'] = 'Нова слика';
$string['newsitem'] = 'тема';
$string['newsitems'] = 'тема';
$string['newsitemsnumber'] = 'Број најновијих вијести';
$string['newuser'] = 'Нови корисник';
$string['newusers'] = 'Нови корисници';
$string['next'] = 'Next';
$string['no'] = 'Не';
$string['nocoursesfound'] = 'Курсеви који садрже ријечи \'$a\' нису пронађени';
$string['nocoursesyet'] = 'Нема курсева у овој категорији';
$string['noexistingadmins'] = 'Нема постојећих администратора.
Ово је озбиљна грешка, и ову поруку не бисте требали никад видјети.';
$string['noexistingcreators'] = 'Тренутно нема креатора';
$string['noexistingstudents'] = 'Тренутно нема студената';
$string['noexistingteachers'] = 'Тренутно нема предавача';
$string['nofilesselected'] = 'Нема датотека одабраних за враћање';
$string['nofilesyet'] = 'Нема доданих датотека на Вашем курсу';
$string['nograde'] = 'Нема оцјене';
$string['noimagesyet'] = 'Нема доданих слика на Вашем курсу';
$string['nomorecourses'] = 'Нема више сличних курсева';
$string['none'] = 'Ништа';
$string['nopotentialadmins'] = 'Нема расположивих администратора';
$string['nopotentialcreators'] = 'Нема расположивих креатора курса';
$string['nopotentialstudents'] = 'Нема пасположивих студената';
$string['nopotentialteachers'] = 'Нема расположивих предавача';
$string['normal'] = 'Нормално';
$string['normalfilter'] = 'Нормална претрага';
$string['nostudentsfound'] = 'Нема $a нађених';
$string['nostudentsyet'] = 'Још нема уписаних студената на овај курс';
$string['nosuchemail'] = 'Нема сличних електронских адреса';
$string['notavailable'] = 'Није доступно';
$string['noteachersyet'] = 'На овом курсу за сада нема предавача';
$string['notenrolled'] = '$a није уписан на овај курс.';
$string['noteuserschangednonetocourse'] = 'Напомена: Корисници курса требају бити поново обновљени приликом обнављања корисничких података.';
$string['nothingnew'] = 'Нема новости од ваше задње посјете';
$string['notincluded'] = 'Није укључено';
$string['notingroup'] = 'Жао нам је, потребно је да будете члан групе да би видјели ову активност.';
$string['nousersmatching'] = 'Корисници који се подударају са \'$a\' нису нађени.';
$string['nousersyet'] = 'Овдје још нема корисника';
$string['now'] = 'сада';
$string['numberweeks'] = 'Број седмица/тема';
$string['numdays'] = '$a дани';
$string['numhours'] = '$a сати';
$string['numminutes'] = '$a минуте';
$string['numseconds'] = '$a секунде';
$string['numviews'] = '$a погледи';
$string['numweeks'] = '$a седмице';
$string['numwords'] = '$a ријечи';
$string['numyears'] = '$a године';
$string['ok'] = 'Све је у реду';
$string['opentoguests'] = 'Корисник пријављен као гост';
$string['optional'] = 'Није обавезно';
$string['order'] = 'Поредак';
$string['other'] = 'Остали';
$string['outline'] = 'Кратак преглед';
$string['page'] = 'Страница';
$string['parentlanguage'] = 'Српски';
$string['participants'] = 'Учесници';
$string['password'] = 'Лозинка';
$string['passwordchanged'] = 'Лозинка је промијењена';
$string['passwordconfirmchange'] = 'Потврдите промјену лозинке';
$string['passwordrecovery'] = 'Да, помозите ми да се упишем';
$string['passwordsdiffer'] = 'Лозинке се не подударају';
$string['passwordsent'] = 'Лозинка је послана';
$string['passwordsenttext'] = '   <P>Порука је послана путем електронске поште на $a->email.
   <P><B>Молимо Вас да провјерите Ваше сандуче ради нове лозинке</B>
   <P>Нова лозинка је аутоматски направљена. Можда је желите <A HREF=$a->link>промијенити у неку другу, коју можете лакше запамтити</A>.';
$string['people'] = 'Присутни корисници';
$string['personalprofile'] = 'Лични профил';
$string['phone'] = 'Телефон';
$string['phpinfo'] = 'Информације о PHP';
$string['popupwindow'] = 'Отворите датотеку у новом прозору';
$string['potentialadmins'] = 'Расположиви избор администратора';
$string['potentialcreators'] = 'Расположиви избор креатора курсева';
$string['potentialstudents'] = 'Листа потенцијалних студената';
$string['potentialteachers'] = 'Листа потенцијалних предавача';
$string['preferredlanguage'] = 'Изабрани језик';
$string['preview'] = 'Преглед';
$string['previeworchoose'] = 'Изаберите шаблон';
$string['previous'] = 'Претходни';
$string['publicdirectory'] = 'Јавни директоријум';
$string['publicdirectory0'] = 'Не објављујте овај сајт';
$string['publicdirectory1'] = 'Објавите само име сајта';
$string['publicdirectory2'] = 'Објавите име сајта са линком';
$string['publicsitefileswarning'] = 'Напомена: Свако може приступити датотекама које су овдје постављене. ';
$string['question'] = 'Питање';
$string['readinginfofrombackup'] = 'Читање информација о резервној копији података';
$string['readme'] = 'Прочитај ме';
$string['recentactivity'] = 'Недавне активности';
$string['recentactivityreport'] = 'Комплетан извјештај недавних активности...';
$string['refreshingevents'] = 'Освјежавање резултата';
$string['registration'] = 'Moodle регистрација';
$string['registrationemail'] = 'Обавјештења електронском поштом';
$string['registrationinfo'] = '<p>Ова страна Вам омогућује да региструјете Ваш Moodle сајт на moodle.org. Регистрација је бесплатна.
Главна корист регистрације је у том што ћете бити уврштени у листу за примање важних обавјештења путем електронске поште, као што су питања везана за сигурносне теме и нова остварења Мoodle програма.
<p>Подразумијева се да ће све информације које нам доставите бити приватне, и да неће бити прослијеђене даље, продане или на било који други начин злоупотребљене. 
Једини разлог прикупљања информација је у сврху подршке и помоћ у изградњи статистичке слике Мoodle заједнице у цјелини.
<p>Ако желите, име Вашег сајта, државу и URL можете додати на јавну листу Moodle сајтова.
<p>Све нове регистрације су ручно обрађене прије додавања у листу. 
Кад се једном нађете на листи, можете ажурирати Вашу регистрацију (и информације на јавној листи) у било које вријеме, тако што ћете нам послати ову форму.';
$string['registrationno'] = 'Не, не желим примати електронску пошту';
$string['registrationsend'] = 'Слање информација о регистрацији на moodle.org';
$string['registrationyes'] = 'Да, обавијестите ме о важним стварима';
$string['removeadmin'] = 'Уклањање администратора';
$string['removecreator'] = 'Уклањање креатора курса';
$string['removestudent'] = 'Уклањање студента';
$string['removeteacher'] = 'Уклањање предавача';
$string['rename'] = 'Преименовање';
$string['renamefileto'] = 'Преименовање <b>$a</b> у';
$string['required'] = 'Захтјеване';
$string['requireskey'] = 'Овај курс захтијева приступну шифру за упис';
$string['resortcoursesbyname'] = 'Пресортирај курсеве по имену';
$string['resources'] = 'Извори';
$string['restore'] = 'Вратите';
$string['restorecancelled'] = 'Вратите назад поништено';
$string['restorecoursenow'] = 'Обновите овај курс!';
$string['restorefinished'] = 'Обнављање је успјешно завршено';
$string['restoreto'] = 'Вратите назад у';
$string['returningtosite'] = 'Повратак на сајт?';
$string['revert'] = 'Вратите се назад';
$string['role'] = 'Улога';
$string['rssarticles'] = 'Број RSS нових чланака';
$string['rsstype'] = 'Намјештање RSS за ову активност';
$string['savechanges'] = 'Сачувајте промјене';
$string['saveto'] = 'Сачувајте у';
$string['scale'] = 'Оцјена';
$string['scales'] = 'Оцјене';
$string['scalescustom'] = 'Прилагођене оцјене';
$string['scalescustomcreate'] = 'Додавање нове оцјене';
$string['scalescustomno'] = 'Прилагођене оцјене још нису формиране';
$string['scalesstandard'] = 'Стандардне оцјене';
$string['scalestip'] = 'За формирање прилагођених оцјена користите линк \'Оцјене...\' у Вашем менију за администрацију курса.';
$string['schedule'] = 'Распоред';
$string['scheduledbackupstatus'] = 'Статус распореда резервне копије података';
$string['search'] = 'Претрага';
$string['searchagain'] = 'Поновна претрага';
$string['searchcourses'] = 'Претрага курсева';
$string['searchhelp'] = 'Можете тражити више ријечи одједном. <p>ријеч: нађите било какву сличност везану за ову ријеч у тексту.<br>+ријеч : само ријечи које се потуно слажу ће бити пронађене.<br>-ријеч : немојте укључивати резултате који садрже ову ријеч.';
$string['searchresults'] = 'Резултати претраге';
$string['sec'] = 'секунд';
$string['secs'] = 'секунде';
$string['section'] = 'Секција';
$string['sections'] = 'Секције';
$string['select'] = 'Изабери';
$string['selectacountry'] = 'Изабери државу';
$string['selectednowmove'] = '$a датотека изабраних за премјештање. Сад изаберите мјесто премјештања и притисните \'Премјести датотеке овдје\'';
$string['senddetails'] = 'Слање мојих детаља електронском поштом';
$string['separateandconnected'] = 'Одвојени и повезани начини знања';
$string['serverlocaltime'] = 'Локално вријеме сервера';
$string['settings'] = 'Подешавања';
$string['shortname'] = 'Скраћено име';
$string['shortnametaken'] = 'Скраћено име је већ употријебљено за други курс ($a)';
$string['shortsitename'] = 'Скраћено име сајта (нпр. једна ријеч)';
$string['show'] = 'Прикажи';
$string['showall'] = 'Прикажи све $a';
$string['showallcourses'] = 'Прикажи све курсеве';
$string['showalltopics'] = 'Прикажи све ';
$string['showallusers'] = 'Прикажи све кориснике';
$string['showallweeks'] = 'Прикажи све седмице';
$string['showgrades'] = 'Прикажи у процентима';
$string['showlistofcourses'] = 'Прикажи листу курсева';
$string['showonlytopic'] = 'Прикажи једино тему $a';
$string['showonlyweek'] = 'Прикажи само седмицу $a';
$string['showrecent'] = 'Прикажи новије активности';
$string['showreports'] = 'Прикажи извјештај о активностима';
$string['showtheselogs'] = 'Прикажи ове посјете';
$string['since'] = 'Од';
$string['site'] = 'Сајт';
$string['sitefiles'] = 'Датотеке сајта';
$string['sitelogs'] = 'Посјетиоци сајта';
$string['sitenews'] = 'Новости';
$string['sites'] = 'Сајтови';
$string['sitesettings'] = 'Подешавање сајта';
$string['size'] = 'Величина';
$string['sizeb'] = 'bytes';
$string['sizegb'] = 'Gb';
$string['sizekb'] = 'Kb';
$string['sizemb'] = 'Mb';
$string['socialheadline'] = 'Друштвени форум - најновије теме';
$string['someallowguest'] = 'Неки курсеви могу бити отворени за приступ гостима';
$string['someerrorswerefound'] = 'Поједине информације недостају или су нетачне. Погледајте детаље испод.';
$string['sortby'] = 'Сортирај по';
$string['startdate'] = 'Почетак курса';
$string['startsignup'] = 'Направите нови налог!';
$string['state'] = 'Држава/Република';
$string['status'] = 'Статус';
$string['strftimedate'] = '%%d %%B %%Y';
$string['strftimedateshort'] = '%%d %%B';
$string['strftimedatetime'] = '%%d %%B %%Y, %%I:%%M %%p';
$string['strftimedaydate'] = '%%A, %%d %%B %%Y';
$string['strftimedaydatetime'] = '%%A, %%d %%B %%Y, %%I:%%M %%p';
$string['strftimedayshort'] = '%%A, %%d %%B';
$string['strftimemonthyear'] = '%%B %%Y';
$string['strftimerecent'] = '%%d %%b, %%H:%%M';
$string['strftimerecentfull'] = '%%a, %%d %%b %%Y, %%I:%%M %%p';
$string['strftimetime'] = '%%I:%%M %%p';
$string['stringsnotset'] = 'Сљедећи string-ови нису дефинисани у $a';
$string['studentnotallowed'] = 'Нажалост, не можете приступити на овај курс као \'$a\'';
$string['students'] = 'Студенти';
$string['subcategories'] = 'Подкатегорије';
$string['success'] = 'Успјешно';
$string['summary'] = 'Преглед';
$string['summaryof'] = 'Преглед $a';
$string['supplyinfo'] = 'Молимо Вас да дате основне информације о себи';
$string['teacheronly'] = 'само за $a';
$string['teacherroles'] = 'улога $a';
$string['teachers'] = 'Предавачи';
$string['textediting'] = 'Кад се уређује текст';
$string['texteditor'] = 'Користите стандардне web форме';
$string['textformat'] = 'Обични текст формат';
$string['thanks'] = 'Хвала';
$string['theme'] = 'Шаблон';
$string['themes'] = 'Шаблони';
$string['themesaved'] = 'Нови шаблон је сачуван';
$string['thischarset'] = 'utf-8';
$string['thisdirection'] = 'ltr';
$string['thislanguage'] = '&#1057;&#1088;&#1087;&#1089;&#1082;&#1080;';
$string['time'] = 'Вријеме';
$string['timezone'] = 'Временска зона';
$string['to'] = 'За';
$string['today'] = 'Данас';
$string['todaylogs'] = 'Данашње посјете';
$string['toomanytoshow'] = 'Превише је корисника за приказ';
$string['top'] = 'Врх';
$string['topic'] = 'Тема';
$string['topichide'] = 'Сакриј овај дио расправе од $a';
$string['topicoutline'] = 'Опис теме';
$string['topicshow'] = 'Прикажи ову тему према $a';
$string['total'] = 'Укупно';
$string['turneditingoff'] = 'Искључи уређивање';
$string['turneditingon'] = 'Уређивање';
$string['undecided'] = 'Не могу одлучити';
$string['unenrol'] = 'Испис са курса';
$string['unenrolallstudents'] = 'Испишите све студенте са курса';
$string['unenrolallstudentssure'] = 'Да ли сте сигурни да желите потпуно исписати све студенте са овог курса?';
$string['unenrolme'] = 'Испишите ме из $a';
$string['unenrolsure'] = 'Да ли сте сигурни да желите исписати $a ѕа овог курса?';
$string['unknowncategory'] = 'Непозната категорија';
$string['unpacking'] = 'Отпакивање $a';
$string['unsafepassword'] = 'Несигурна лозинка! Нађите лозинку коју остали корисници не могу лако открити.';
$string['unusedaccounts'] = 'Налози који су неактивни више од $a дана ће бити аутоматски исписани са сајта';
$string['unzip'] = 'Отпакујте';
$string['unzippingbackup'] = 'Отпакивање резервне копије података';
$string['up'] = 'Горе';
$string['update'] = 'Ажурирање';
$string['updated'] = 'Ажурирано $a';
$string['updatemyprofile'] = 'Ажурирање профила';
$string['updatesevery'] = 'Ажурирање сваких $a секунди';
$string['updatethis'] = 'Ажурирај $a';
$string['updatethiscourse'] = 'Ажурирај овај курс';
$string['updatinga'] = 'Ажурирање: $a';
$string['updatingain'] = 'Ажурирање $a->what у $a->in';
$string['upload'] = 'Додајте';
$string['uploadafile'] = 'Додајте датотеку';
$string['uploadedfileto'] = 'Датотека $a->file је додана у $a->directory';
$string['uploadnofilefound'] = 'Датотека није пронађена. Јесте ли сигурни да сте изабрали нешто за додавање?';
$string['uploadnotallowed'] = 'Додавање датотека није дозвољено';
$string['uploadproblem'] = 'Појавио се непознат проблем приликом додавања датотеке \'$a\' (можда је датотека превелика!?)';
$string['uploadthisfile'] = 'Ажурирај ову датотеку';
$string['uploadusers'] = 'Додавање корисничких налога';
$string['usedinnplaces'] = 'кориштено је $a мјеста';
$string['user'] = 'Корисник';
$string['userconfirmed'] = 'Потврђен $a';
$string['userdata'] = 'Кориснички податак';
$string['userdeleted'] = 'Овај кориснички налог ће бити обрисан';
$string['userdescription'] = 'Опис';
$string['userfiles'] = 'Корисничке датотеке';
$string['username'] = 'Корисничко име';
$string['usernameexists'] = 'Ово корисничко име већ постоји, одабери друго';
$string['usernotconfirmed'] = 'Не могу провјерити $a';
$string['userprofilefor'] = 'Кориснички профил за $a';
$string['users'] = 'Корисници';
$string['usersnew'] = 'Нови корисници';
$string['userzones'] = 'Корисничке зоне';
$string['usingexistingcourse'] = 'Користећи постојећи курс';
$string['version'] = 'Верзија';
$string['view'] = 'Поглед';
$string['webpage'] = 'Web страница';
$string['week'] = 'Седмица';
$string['weekhide'] = 'Сакријте ову седмицу од $a';
$string['weeklyoutline'] = 'Седмични преглед дешавања';
$string['weekshow'] = 'Приказ седмице према $a';
$string['welcometocourse'] = 'Добродошли у $a';
$string['welcometocoursetext'] = 'Добродошли на $a->coursename!

Ако већ то нисте урадили, онда бисте на курсу требали уредити страницу са Вашим профилом, тако да нешто можемо научити о Вама:

  $a->profileurl';
$string['whattocallzip'] = 'Како желите назвати архивирану датотеку?';
$string['withchosenfiles'] = 'Са изабраним датотекама';
$string['withoutuserdata'] = 'без корисничких података';
$string['withuserdata'] = 'са корисничким подацима';
$string['wordforstudent'] = 'Ваша ријеч за студента';
$string['wordforstudenteg'] = 'нпр. Студент, Кандидат, Ученик итд.';
$string['wordforstudents'] = 'Ваша ријеч за студенте';
$string['wordforstudentseg'] = 'нпр. Студенти, Кандидати, Ученици итд.';
$string['wordforteacher'] = 'Ваша ријеч за предавача';
$string['wordforteachereg'] = 'нпр. Професор, Асистент, Наставник итд.';
$string['wordforteachers'] = 'Предавачи';
$string['wordforteacherseg'] = 'нпр. Професори, Асистенти, Наставници итд.';
$string['writingcategoriesandquestions'] = 'Записивање категорија и питања';
$string['writingcoursedata'] = 'Записивање података курса';
$string['writingeventsinfo'] = 'Записивање информација о догађајима';
$string['writinggeneralinfo'] = 'Записивање генералних информација';
$string['writinggroupsinfo'] = 'Записивање информација о групама';
$string['writingheader'] = 'Записивање заглавља';
$string['writingloginfo'] = 'Записивање информација о посјетама';
$string['writingmoduleinfo'] = 'Записивање информација о модулима';
$string['writingscalesinfo'] = 'Записивање информација о оцјенама';
$string['writinguserinfo'] = 'Записивање информацијама о корисницима';
$string['wrongpassword'] = 'Нетачна лозинка за ово корисничко име';
$string['yes'] = 'Да';
$string['youareabouttocreatezip'] = 'Правите архивирану датотеку која садржи';
$string['youaregoingtorestorefrom'] = 'На почетку сте обнове процеса за';
$string['yourlastlogin'] = 'Ваш задњи упис';
$string['yourself'] = 'себе';
$string['yourteacher'] = 'ваш $a';
$string['zippingbackup'] = 'Архивирање резервне копије података';

?>
