<p align="center"><b>Tipi Wiki</b></p>
<p>
Ci sono tre tipi wiki: docente, Gruppi, Studente. Inoltre, come per ogni altra attivit&agrave;, anche wiki ha le modalit&agrave; di gruppo di Moodle: &quot;Nessun Gruppo&quot; &quot;Gruppi Separati&quot; e &quot;Gruppi Visibili&quot;. 
Quanto detto determina la seguente matrice di nove possibilit&agrave;:</p>
<table border="1" width="100%"><tbody>
  <tr>
    <th valign="top" width="25%"></th>
    <th valign="top" width="25%">Nessun Gruppo</th>
    <th valign="top" width="25%">Gruppi Separati</th>
    <th valign="top" width="25%">Gruppi Visibili</th>
  </tr>
  <tr>
    <th valign="top" width="25%">docente</th>
    <td valign="top" width="25%">C'&egrave; un unico wiki che solo  docente pu&ograve; editare. Gli studenti possono visualizzare il contenuto del wiki.</td>
    <td valign="top" width="25%">C'&egrave; un wiki per ogni gruppo che solo  docente pu&ograve; editare. Gli studenti possono vedere solamente il wiki del proprio gruppo.</td>
    <td valign="top" width="25%">C'&egrave; un wiki per ogni gruppo che solo  docente pu&ograve; editare. Gli studenti possono vedere di tutti i gruppi.</td>
  </tr>
  <tr>
    <th valign="top" width="25%">Gruppi</th>
    <td valign="top" width="25%">C'&egrave; un unico wiki.  docente e tutti gli studenti possono vedere ed editare questo wiki.</td>
    <td valign="top" width="25%">C'&egrave; un wiki per gruppo. Gli studenti possono vedere ed editare solamente il wiki del proprio gruppo.</td>
    <td valign="top" width="25%">C'&egrave; un wiki per gruppo. Gli studenti possono modificare solamente il wiki del proprio gruppo. Possono vedere i wiki di tutti i gruppi.</td>
  </tr>
  <tr>
    <th valign="top" width="25%">Studente</th>
    <td valign="top" width="25%">Ogni studente ha il proprio wiki che solo lui e il suo docente pu&ograve; editare.</td>
    <td valign="top" width="25%">Ogni studente ha il proprio wiki che solo lui e il suo docente pu&ograve; editare. Gli studenti possono vedere i wiki degli altri studenti del proprio gruppo.</td>
    <td valign="top" width="25%">Ogni studente ha il proprio wiki che solo lui e il suo docente pu&ograve; editare. Gli studenti possono vedere i wiki di tutti gli altri studenti del corso.</td>
  </tr></tbody>
</table>
<p>Ammenoch&eacute; la modalit&agrave; di gruppo non sia stata forzata dalle impostazioni del corso, essa pu&ograve; essere impostata con le icone dei gruppi sulla home page del corso, dopo che il wiki &egrave; stato creato.</p>
<p>Un docente pu&ograve; sempre editare tutti i wiki del corso.</p>
