<!-- $Id$ -->

<p align="center"><b>Nombre minimal de questions dans une le&ccedil;on</b></p>

<p>Lorsqu'une le&ccedil;on contient une ou plusieurs tables de branchement, l'enseignant devrait en principe donner une valeur pour ce param&egrave;tre. Cette valeur d&eacute;termine une limite inf&eacute;rieure pour le nombre de questions &agrave; r&eacute;pondre avant qu'un &eacute;tudiant puisse obtenir la note maximale. Elle ne force pas les &eacute;tudiants &agrave; r&eacute;pondre &agrave; ce nombre de questions.</p>

<p>Par exemple, en fixant ce param&egrave;tre &agrave; 20, vous vous assurez que les notes sont calcul&eacute;es comme si les &eacute;tudiants avaient r&eacute;pondu &agrave; au moins 20 questions. Si un &eacute;tudiant ne visite qu'une branche de la le&ccedil;on, comprenant 5 pages, r&eacute;pond correctement aux 5 questions, et termine ensuite la le&ccedil;on (&agrave; supposer que cette possibilit&eacute; lui soit offerte, ce qui est raisonnable) et que ce param&egrave;tre n'est pas fix&eacute;, sa note sera de 5 sur 5, c'est-&agrave;-dire 100%&nbsp;! En revanche, avec une valeur de 20, ce m&ecirc;me &eacute;tudiant obtiendra 5 sur 20, c'est-&agrave;-dire 25%. Si un autre &eacute;tudiant visite 25 pages de la le&ccedil;on et r&eacute;pond correctement &agrave; toutes questions sauf 2, sa note sera de 23 sur 25, &agrave; savoir 92%.</p>

<p>Si vous utilisez ce param&egrave;tre, la premi&egrave;re page de la le&ccedil;on devrait mentionner un texte de cette teneur&nbsp;:</p>

<p><blockquote>Dans cette le&ccedil;on, on attend de vous que vous r&eacute;pondiez au moins &agrave; <i>n</i> questions. Vous pouvez r&eacute;pondre &agrave; plus de questions si vous le d&eacute;sirez. Cependant, si vous r&eacute;pondez &agrave; moins de <i>n</i> questions, votre note sera calcul&eacute;e comme si vous aviez r&eacute;pondu &agrave; <i>n</i>.</blockquote></p>

<p>Bien s&ucirc;r vous remplacerez <i>n</i> par la valeur de ce param&egrave;tre.</p>

<p>Lorsque ce param&egrave;tre est renseign&eacute;, un affichage indique aux &eacute;tudiants le nombre de questions auxquelles ils ont d&eacute;j&agrave; r&eacute;pondu et le nombre minimum auxquelles ils doivent r&eacute;pondre.</p>