<p align="center"><b>Vue d'ensemble</b></p>

<ol>

<li>Une le&ccedil;on se compose de plusieurs <b>pages</b> et
optionnellement de tables de branchement.</li>

<li>Une page comprend du <b>contenu</b> et se termine normalement par
une<b>question</b>. De l&agrave; provient le terme
<b>page-question</b>.</li>

<li>Chaque page offre un <b>choix de r&eacute;ponses</b>.</li>

<li>Chaque r&eacute;ponse peut offrir un <b>feedback</b> lorsqu'elle
est choisie.</li>

<li>Un  <b>lien</b> vers une autre page est &eacute;galement
associ&eacute; &agrave; chaque r&eacute;ponse. Ce lien peut &ecirc;tre
relatif (page actuelle, page suivante) ou absolu (n'importe quelle
page de la le&ccedil;on).</li>

<li>Par d&eacute;faut, la premi&egrave;re r&eacute;ponse m&egrave;ne
&agrave; la <b>page suivante</b> de la le&ccedil;on. La r&eacute;ponse
suivante m&egrave;ne sur la page actuelle (c'est-&agrave;-dire que
l'&eacute;tudiant voit la m&ecirc;me page).</li>

<li>La page qui est consid&eacute;r&eacute;e comme la page suivante
est la page suivante selon <b>l'ordre logique</b> des pages vu par
l'enseignant. Cet ordre peut &ecirc;tre modifi&eacute; en
d&eacute;pla&ccedil;ant les pages.</li>

<li>La le&ccedil;on suit un <b>parcours</b>. Ce parcours correspond
&agrave; l'ordre des pages vues par les &eacute;tudiants. L'ordre est
d&eacute;termin&eacute; par les sauts correspondants aux
diff&eacute;rentes r&eacute;ponses et cet ordre peut &ecirc;tre
tr&egrave;s diff&eacute;rent de l'ordre logique des pages.
L'enseignant peut &eacute;galement v&eacute;rifier ce parcours.</li>

<li>Les r&eacute;ponses sont toujours affich&eacute;es aux
&eacute;tudiants dans un ordre al&eacute;atoire. La premi&egrave;re
r&eacute;ponse de l'enseignant ne sera pas n&eacute;cessairement
affich&eacute;e en premier aux &eacute;tudiants. Chaque fois que les
r&eacute;ponses seront affich&eacute;es, elles le seront dans un ordre
diff&eacute;rent. Toutefois dans les questions d'appariement, les
r&eacute;ponses sont affich&eacute;es dans l'ordre
sp&eacute;cifi&eacute; par l'enseignant.</li>

<li>Le nombre de r&eacute;ponses peut varier d'une page &agrave;
l'autre. Par exemple, une page peut contenir une question vrai/faux,
une autre peut contenir une question &agrave; choix multiples avec une
seule bonne r&eacute;ponse et trois r&eacute;ponses fausses.</li>

<li>Une page peut ne pas contenir de question&nbsp;; l'&eacute;tudiant
voit alors un lien <b>Continuer</b>.</li>

<li>Aux fins de correction, les <b>bonnes r&eacute;ponses</b>
correspondent &agrave; celles qui provoquent un saut &agrave; une page
qui est plac&eacute;e <i>plus loin</i> dans la le&ccedil;on. Une
<b>mauvaise r&eacute;ponse</b> m&egrave;ne soit &agrave; la m&ecirc;me
page, soit &agrave; une page <i>pr&eacute;c&eacute;dente</i>. Donc, si
les sauts ne sont <i>pas</i> modifi&eacute;s, la premi&egrave;re
r&eacute;ponse est la bonne et les autres sont les mauvaises.</li>

<li>Les questions peuvent avoir plusieurs bonnes r&eacute;ponses. Par
exemple, lorsque deux r&eacute;ponses m&egrave;nent &agrave; la page
suivante, les deux r&eacute;ponses sont consid&eacute;r&eacute;es
comme &eacute;tant bonnes. M&ecirc;me si l'&eacute;tudiant aboutit
&agrave; la m&ecirc;me page en r&eacute;pondant l'une ou l'autre des
r&eacute;ponses, le feedback pour chacune de ces r&eacute;ponses peut
&ecirc;tre diff&eacute;rent.</li>

<li>Dans la vue de l'enseignant, les &eacute;tiquettes identifiant les
bonnes r&eacute;ponses sont soulign&eacute;es.</li>

<li>Les <b>tables de branchement</b> sont simplement des pages
contenant des liens vers d'autres pages de la le&ccedil;on. Une
le&ccedil;on pourra par exemple commencer par une table de branchement
faisant office de <b>Table des mati&egrave;res</b>.</li>

<li>Chaque lien d'une table de branchement se compose d'une
description et du titre de la page vers laquelle il m&egrave;ne.</li>

<li>Une table de branchement permet de diviser la le&ccedil;on en
diff&eacute;rentes <b>branches</b> ou sections. Chaque branche peut
contenir plusieurs page, en g&eacute;n&eacute;ral sur le m&ecirc;me
sujet. La fin d'une branche est indiqu&eacute;e habituellement par une
page <b>Fin de branche</b>. Il s'agit d'une page sp&eacute;ciale qui
par d&eacute;faut ram&egrave;ne l'&eacute;tudiant &agrave; la table de
branchement pr&eacute;c&eacute;dente. Ce comportement peut &ecirc;tre
modifi&eacute; si n&eacute;cessaire.</li>

<li>Il peut y avoir plus d'une table de branchement dans une
le&ccedil;on. Une le&ccedil;on peut par exemple &ecirc;tre
structur&eacute;e de fa&ccedil;on que les sections soient des
sous-branches des branches constituant les sujets principaux.</li>

<li>Il est essentiel d'offrir aux &eacute;tudiant un moyen de terminer
la le&ccedil;on. Cela peut &ecirc;tre fait en incluant un lien <b>Fin
de le&ccedil;on</b> dans la table de branchement pricipale. Ce lien
m&egrave;nera &agrave; une page (virtuelle) <b>Fin de la
le&ccedil;on</b>. On peut aussi faire en sorte que la derni&egrave;re
branche de la le&ccedil;on (dans l'ordre logique) m&egrave;ne
simplement &agrave; la fin de la le&ccedil;on, ce qui se fait en <i>ne
la terminant pas</i> par une page Fin de branche.</li>

<li>Si une le&ccedil;on contient une ou plusieurs tables de
branchement, il est conseill&eacute; de donner au param&egrave;tre
&laquo;&nbsp;Nombre minimal de questions&nbsp;&raquo; une valeur
raisonnable. On fixe ainsi une limite inf&eacute;rieure de pages
&agrave; voir avant que le calcul de la note soit effectu&eacute;.
Sans ce param&egrave;tre, un &eacute;tudiant pourrait visiter une
seule branche de la le&ccedil;on, r&eacute;pondre correctement
&agrave; toutes les questions de cette branche et quitter la
le&ccedil;on avec la note maximale.</li>

<li>En outre, un &eacute;tudiant a la possibilit&eacute; de re-visiter
une m&ecirc;me branche &agrave; plusieurs reprises. La note est
cependant calcul&eacute;e en utilisant le nombre de questions <i>une
seule fois</i> r&eacute;pondues. La note n'augmentera donc pas si un
&eacute;tudiant r&eacute;pond plusieurs fois aux m&ecirc;mes
questions. En revanche, elle pourra diminuer, puisque le
d&eacute;nominateur utilis&eacute; pour le calcul de la note est le
nombre de pages vues, qui augmente &agrave; chaque fois. Afin de
donner aux &eacute;tudiants une bonne id&eacute;e de leur progression
dans la le&ccedil;on, le nombre de questions r&eacute;pondues
correctement, le nombre de pages vues et leur note actuelle est
affich&eacute;e sur chaque table de branchement.</li>

<li>L'&eacute;tudiant atteint la <b>fin de la le&ccedil;on</b> soit en
sautant directement &agrave; la fin de la le&ccedil;on (lien absolu)
ou soit en passant &agrave; la page suivante (lien relatif).
L'&eacute;tudiant qui est arriv&eacute; &agrave; la fin de la
le&ccedil;on voit sa note et un message le f&eacute;licitant. La note
est calcul&eacute;e ainsi&nbsp;: (nombre de bonnes r&eacute;ponses /
nombre de pages vues) * la note maximale de la le&ccedil;on.</li>

<li>Lorsque l'&eacute;tudiant ne termine <i>pas</i> la le&ccedil;on et
quitte simplement la session, il pourra la reprendre &agrave; partir
de sa derni&egrave;re bonne r&eacute;ponse ou la recommencer depuis le
d&eacute;but.</li>

<li>Lorsque l'on permet &agrave; l'&eacute;tudiant de suivre la
le&ccedil;on &agrave; plusieurs reprises, l'enseignant peut choisir
comme note &laquo;&nbsp;finale&nbsp;&raquo; la note maximale ou la
moyenne des notes de toutes les tentatives de l'&eacute;tudiant. La
note est affich&eacute;e sur la page Notes.</li>

</ol>
