<p align="center"><b>Types de questions</b></p>

<h4>Ce fichier est en cours de traduction.</h4>

<p>Les types de questions actuellement disponibles dans le module <b>Le&ccedil;on</b> sont&nbsp; les suivants.<p>

<ol>

<li>
<p><b>Question &agrave; choix multiples.</b> C'est le type de question par d&eacute;faut. Une question &agrave; choix multiples offre &agrave; l'&eacute;tudiant un choix de r&eacute;ponses parmi lesquelles il devra en choisir une. La r&eacute;ponse correcte m&egrave;ne l'&eacute;tudiant plus loin dans la le&ccedil;on, les r&eacute;ponses fausses non. Souvent l'utilit&eacute; de telles questions d&eacute;pend plus de la qualit&eacute; des r&eacute;ponses fausses propos&eacute;es que de la question elle-m&ecirc;me ou de la bonne r&eacute;ponse.</p>

<p>Chaque question peut avoir optionnellement un feedback associ&eacute;. Si aucun feedback n'est donn&eacute;, l'&eacute;tudiant obtient le message par d&eacute;faut &laquo;&nbsp;C'est la r&eacute;ponse correcte&nbsp;&raquo; ou &laquo;&nbsp;C'est une mauvaise r&eacute;ponse&nbsp;&raquo; apr&egrave;s avoir r&eacute;pondu.</p>

<p>Il est possible d'avoir plus d'une r&eacute;ponse correcte &agrave; une telle question. Les diff&eacute;rentes r&eacute;ponses correctes peuvent avoir diff&eacute;rents feedbacks et mener &agrave; des pages diff&eacute;rentes de la le&ccedil;on. En revanche, elles impliquent toutes la m&ecirc;me note (c'est-&agrave;-dire qu'il n'y a pas de r&eacute;ponses correctes meilleures que d'autres, du moins en terme de note). Il est donc possible de faire suivre aux &eacute;tudiants des parties de le&ccedil;on diff&eacute;rentes, m&ecirc;me si toutes leurs r&eacute;ponses sont correctes.</p>

<p>Certaines questions &agrave; choix multiples sont appel&eacute;es &laquo;&nbsp;<b>Questions &agrave; choix multiples et &agrave; r&eacute;ponses multiples</b>&nbsp;&raquo;. Elles offrent &agrave; l'&eacute;tudiant un choix de r&eacute;ponses parmi lesquelles il devra choisir toutes les bonnes r&eacute;ponses. La question peut indiquer ou non le nombre de bonnes r&eacute;ponses. Par exemple &laquo;&nbsp;Choisir deux rois de France dans la liste des personnages suivants&nbsp;&raquo; dans le premier cas, et &laquo;&nbsp;Lesquels de ces personnages ont &eacute;t&eacute; des rois de France&nbsp;?&nbsp;&raquo; Le nombre des bonnes r&eacute;ponses peut varier de 1 au nombre de choix propos&eacute;s. Une telle question avec une seule bonne r&eacute;ponse est <b>diff&eacute;rente</b> d'une simple question &agrave; choix multiples, car contrairement &agrave; celle-ci, elle permet &agrave; l'&eacute;tudiant de choisir plusieurs r&eacute;ponses.</p>

<p>Pour ces questions, les r&eacute;ponses correctes m&egrave;nent  l'&eacute;tudiant plus loin dans la le&ccedil;on, les r&eacute;ponses fausses non. S'il y a plus d'une r&eacute;ponse correcte, toutes doivent mener &agrave; la m&ecirc;me page, tout comme les mauvaises r&eacute;ponses. Dans le cas contraire, un avertissement est affich&eacute; lorsque l'enseignant visualise la le&ccedil;on. Le feedback (optionnel) des bonnes r&eacute;ponses doit &ecirc;tre inscrit dans la premi&egrave;re bonne r&eacute;ponse. De m&ecirc;me, le feedback (optionnel) des mauvaises r&eacute;ponses doit &ecirc;tre inscrit dans la premi&egrave;re mauvaise r&eacute;ponse. Les autres feedbacks sont ignor&eacute;s (sans avertissement).</p>
</li>

<!-- &agrave; traduire -->

<li>
<p><b>Question &agrave; r&eacute;ponse courte</b> The student is prompted for a short piece of text. This is checked against one or more answers. Answers can be either correct or wrong. Each answer can optionally have a response. If no response is entered for an answer then the default reponse "That's the Correct Answer" or "That's the Wrong Answer" is shown to the student. If the text entered does not match any of the answers the question is wrong and the student is shown the default wrong response. </p>

<p>By default the comparisons ignore the case of the text. There is an option to make the comparisons case sensitive.</p></li>

<li>
<b>Question Vrai/Faux</b> The answer to this type of question only has two options, true or false. The student is prompted to choose which is the correct option. This type of question is basically a Multichoice question with just two choices.</p>
</li>

<li>
<p><b>Question d'appariement</b> These are quite powerful and flexible questions. They consist of a list of names or statements which must be correctly matched against other list of names or statements. For example "Match the Capital with the Country" with the two lists Japan, Canada, Italy and Tokyo, Ottawa, Rome. It is possible to have repeated entries in one of the lists but care should be taken to make the repeats identical. For example "Identify the type of these creatures" with the lists Sparrow, Cow, Ant, Dog and Bird, Animal, Insect, Animal. </p>

<p>When creating this type of question the items for the first list go into the Answer boxes and items for the second list go into the Response boxes. Once created a more sensible labelling scheme is shown. When the student successfully matches the items the jump on the first answer is used. An unsuccess answer jumps to the page on the second answer. The question does <b>not</b> support custom responses, the student is told how many matches are correct or if all the matches are correct.</p>

<p>Unlike the Multichoice question where the choices are shown in a random order, the first list of items is <b>not</b> shuffled but shown in the same order as entered. This allows for <b>"Ordered"</b> questions to be constructed. Consider the question " Put the following into the order they were born, the earliest first" with the lists 1., 2., 3., 4. and Longfellow, Lawrence, Lowell, Larkin. The second list is shuffed before being used in the question, of course.</p>
</li>

<li>
<p><b>Question num&eacute;rique</b> This type of question requires a number as the answer. In it's simplest form it requires just one answer to be specified. For example "What is 2 plus 2?" with the answer 4 given a forward jump. However, it is better to specify a range because the internal rounding of numerical values can make single numeric comparisons rather hit or miss. Thus, if the question were "What is 10 divided by 3" it would be necessary to give the answer as <b>"Minimum:Maximum"</b>, that is <b>two</b> values separated by a colon (:). Thus if 3.33:3.34 is given as the acceptible range for the answer, then the answers 3.33, 3.333, 3.3333... would all be taken as correct answers. "Wrong" answers would include 3.3 (less than the minimum) and 3.4 (greater than the maximum).</p>

<p>More than one correct answer is allowed and the answers can be either single or pair of values. Note that the order in which the answers are tested is Answer 1, Answer 2... so some care needs to taken if the desired response is to appear. For example the question "When was Larkin born?" could have the single value of 1922, the exact answer, and the pair of values 1920:1929, the 20's, as the less exact answer.The order in which these values should be tested is, obviously, 1922 then 1920:1929. The first answer might have the response "That's exactly right" while the other answer's response might be "That's close, you've got the right decade"</p>

<p>Wrong answers can be given but depending on their actual range, care should be taken to place them after the correct answers. For example in adding the wrong answer 3:4 to the "10 divided by 3" question it needs to come after the correct answer. That is the answers are ordered 3.33:3.34 (the "correct" answer) then 3:4 (the "wrong" answer, but not wildly wrong answer!).</p>

</li>

</ul>