<p align="center"><b>Types de questions</b></p>

<p>Les types de questions actuellement disponibles dans le module <b>Le&ccedil;on</b> sont&nbsp; les suivants.<p>

<ol>

<li>
<p><b>Question &agrave; choix multiples.</b> C'est le type de question par d&eacute;faut. Une question &agrave; choix multiples offre &agrave; l'&eacute;tudiant un choix de r&eacute;ponses parmi lesquelles il devra en choisir une. La r&eacute;ponse correcte m&egrave;ne l'&eacute;tudiant plus loin dans la le&ccedil;on, les r&eacute;ponses fausses non. Souvent l'utilit&eacute; de telles questions d&eacute;pend plus de la qualit&eacute; des r&eacute;ponses fausses propos&eacute;es que de la question elle-m&ecirc;me ou de la bonne r&eacute;ponse.</p>

<p>Chaque question peut avoir optionnellement un feedback associ&eacute;. Si aucun feedback n'est donn&eacute;, l'&eacute;tudiant obtient le message par d&eacute;faut &laquo;&nbsp;C'est la r&eacute;ponse correcte&nbsp;&raquo; ou &laquo;&nbsp;C'est une mauvaise r&eacute;ponse&nbsp;&raquo; apr&egrave;s avoir r&eacute;pondu.</p>

<p>Il est possible d'avoir plus d'une r&eacute;ponse correcte &agrave; une telle question. Les diff&eacute;rentes r&eacute;ponses correctes peuvent avoir diff&eacute;rents feedbacks et mener &agrave; des pages diff&eacute;rentes de la le&ccedil;on. En revanche, elles impliquent toutes la m&ecirc;me note (c'est-&agrave;-dire qu'il n'y a pas de r&eacute;ponses correctes meilleures que d'autres, du moins en terme de note). Il est donc possible de faire suivre aux &eacute;tudiants des parties de le&ccedil;on diff&eacute;rentes, m&ecirc;me si toutes leurs r&eacute;ponses sont correctes.</p>

<p>Certaines questions &agrave; choix multiples sont appel&eacute;es &laquo;&nbsp;<b>Questions &agrave; choix multiples et &agrave; r&eacute;ponses multiples</b>&nbsp;&raquo;. Elles offrent &agrave; l'&eacute;tudiant un choix de r&eacute;ponses parmi lesquelles il devra choisir toutes les bonnes r&eacute;ponses. La question peut indiquer ou non le nombre de bonnes r&eacute;ponses. Par exemple &laquo;&nbsp;Choisir deux rois de France dans la liste des personnages suivants&nbsp;&raquo; dans le premier cas, et &laquo;&nbsp;Lesquels de ces personnages ont &eacute;t&eacute; des rois de France&nbsp;?&nbsp;&raquo; Le nombre des bonnes r&eacute;ponses peut varier de 1 au nombre de choix propos&eacute;s. Une telle question avec une seule bonne r&eacute;ponse est <b>diff&eacute;rente</b> d'une simple question &agrave; choix multiples, car contrairement &agrave; celle-ci, elle permet &agrave; l'&eacute;tudiant de choisir plusieurs r&eacute;ponses.</p>

<p>Pour ces questions, les r&eacute;ponses correctes m&egrave;nent  l'&eacute;tudiant plus loin dans la le&ccedil;on, les r&eacute;ponses fausses non. S'il y a plus d'une r&eacute;ponse correcte, toutes doivent mener &agrave; la m&ecirc;me page, tout comme les mauvaises r&eacute;ponses. Dans le cas contraire, un avertissement est affich&eacute; lorsque l'enseignant visualise la le&ccedil;on. Le feedback (optionnel) des bonnes r&eacute;ponses doit &ecirc;tre inscrit dans la premi&egrave;re bonne r&eacute;ponse. De m&ecirc;me, le feedback (optionnel) des mauvaises r&eacute;ponses doit &ecirc;tre inscrit dans la premi&egrave;re mauvaise r&eacute;ponse. Les autres feedbacks sont ignor&eacute;s (sans avertissement).</p>
</li>

<li>
<p><b>Question &agrave; r&eacute;ponse courte.</b> L'&eacute;tudiant doit saisir la r&eacute;ponse sous forme de texte, et ce texte est compar&eacute; &agrave; une ou plusieurs r&eacute;ponses. La r&eacute;ponse donn&eacute;e par l'&eacute;tudiant est soit juste, soit fausse. &Agrave; chaque r&eacute;ponse peut &ecirc;tre associ&eacute; un feedback. Si aucun feedback n'est donn&eacute;, l'&eacute;tudiant obtient le message par d&eacute;faut &laquo;&nbsp;C'est la r&eacute;ponse correcte&nbsp;&raquo; ou &laquo;&nbsp;C'est une mauvaise r&eacute;ponse&nbsp;&raquo; apr&egrave;s avoir r&eacute;pondu. Lorsque le texte saisi par l'&eacute;tudiant ne correspond &agrave; aucune r&eacute;ponse, cela est consid&eacute;r&eacute; comme une r&eacute;ponse fausse et le feedback par d&eacute;faut est affich&eacute;.</p>

<p>Par d&eacute;faut, il n'est pas tenu compte de la casse des caract&egrave;res lors des comparaisons. On peut cependant r&eacute;gler une option s'il l'on d&eacute;sire le comportement inverse.</p>
</li>

<li>
<p><b>Question Vrai/Faux.</b> Pour r&eacute;pondre &agrave; une telle question, l'&eacute;tudiant choisit simplement l'une des deux options propos&eacute;es. Il s'agit en fait d'une question &agrave; choix multiples &agrave; deux options.</p>
</li>

<li>
<p><b>Question d'appariement.</b> Ce type de question est tr&egrave;s flexible et puissant. Une question d'appariement consiste en une liste de termes ou d'affirmations devant &ecirc;tre mis en correspondance avec une autre liste de termes ou d'affirmations. Par exemple, &laquo;&nbsp;Associer chaque pays avec sa capitale&nbsp;&raquo;, avec les deux listes Italie, France, Suisse, Canada et Berne, Ottawa, Rome, Paris. On peut r&eacute;p&eacute;ter des &eacute;l&eacute;ments dans une des listes, mais les r&eacute;p&eacute;titions doivent &ecirc;tre identiques. Par exemple &laquo;&nbsp;Identifier le type de ces cr&eacute;atures&nbsp;&raquo;, avec les listes moineau, vache, fourmi, chat et oiseau, animal, insecte, animal.</p>

<p>Lors de la cr&eacute;ation d'une telle question, il faut placer les &eacute;l&eacute;ments de la premi&egrave;re liste dans les champs &laquo;&nbsp;R&eacute;ponse&nbsp;&raquo; et ceux de la deuxi&egrave;me liste dans les champs &laquo; Feedback&nbsp;&raquo;. Une fois la question cr&eacute;&eacute;e, son affichage est un peu meilleur. Si l'&eacute;tudiant met correctement en correspondance les diff&eacute;rents &eacute;l&eacute;ments, il est envoy&eacute; &agrave; la page d&eacute;finie dans la premi&egrave;re r&eacute;ponse. Dans le cas contraire, il est envoy&eacute; &agrave; celle qui est d&eacute;finie dans la deuxi&egrave;me r&eacute;ponse. Ce type de question ne permet pas de d&eacute;finir vos propres feedbacks. Le message donn&eacute; &agrave; l'&eacute;tudiant indique le nombre de paires correctes ou si toutes les paires sont correctes.</p>

<p>Au contraire des questions &agrave; choix multiples, o&ugrave; les questions sont m&eacute;lang&eacute;es al&eacute;atoirement, la premi&egrave;re liste est toujours affich&eacute;e dans l'ordre donn&eacute;. Les &eacute;l&eacute;ments de la deuxi&egrave;me liste sont bien s&ucirc;r m&eacute;lang&eacute;s al&eacute;atoirement. Cela permet des questions dont l'objectif est de ranger des &eacute;l&eacute;ments. Par exemple, &laquo;&nbsp;Ranger les personnages suivants dans l'ordre o&ugrave; ils sont n&eacute;s, le plus ancien en premier&nbsp;&raquo;, avec les listes 1., 2., 3., 4. et Alexandre le Grand, Jules C&eacute;sar, Charlemagne, Napol&eacute;on.</p>
</li>

<li>
<p><b>Question num&eacute;rique.</b> Ce type de question requiert un nombre comme r&eacute;ponse. Dans sa forme la plus simple, une seule r&eacute;ponse (correcte) est sp&eacute;cifi&eacute;e par l'enseignant. Par exemple, &laquo;&nbsp;Que font 2 + 2&nbsp;?&nbsp;&raquo;, avec la r&eacute;ponse 4 qui m&egrave;ne &agrave; la page suivante. Il est cependant parfois mieux de sp&eacute;cifier un intervalle, pour le cas o&ugrave; des erreurs d'arrondi fausseraient la comparaison. Par exemple, &agrave; la question &laquo;&nbsp;Que vaut 10/3&nbsp;?&nbsp;&raquo;, il est n&eacute;cessaire de donner un intervalle de la forme <b>min:max</b>, c'est-&agrave;-dire deux valeurs s&eacute;par&eacute;es par un signe deux-points (:). On peut indiquer 3.33:3.34 comme r&eacute;ponse &agrave; cette question, et ainsi les r&eacute;ponses 3.33, 3.333, 3.3333, etc. seront accept&eacute;es. Parmi les r&eacute;ponses fausses, on aura par exemple 3.3 (inf&eacute;rieur au minimum) et 3.4 (sup&eacute;rieur au maximum).</p>

<p>L'enseignant peut sp&eacute;cifier plus d'une r&eacute;ponse correcte, et chacune des r&eacute;ponses peut &ecirc;tre un nombre ou un intervalle (voir ci-dessus). Les r&eacute;ponses sont test&eacute;es dans l'ordre normal&nbsp;: R&eacute;ponse 1, R&eacute;ponse 2, etc. Il faut donc pr&ecirc;ter attention &agrave; cet ordre lors de la sp&eacute;cification des r&eacute;ponses et des feedbacks. Par exemple la question &laquo;&nbsp;Quel est l'ann&eacute;e de naissance de Jean-S&eacute;bastien Bach&nbsp;?&nbsp;&raquo; pourrait avoir comme premi&egrave;re r&eacute;ponse 1685, la r&eacute;ponse exacte, et la d&eacute;cennie 1680:1689 comme deuxi&egrave;me r&eacute;ponse moins exacte. Le feedback de la premi&egrave;re serait &laquo;&nbsp;C'est exactement &ccedil;a&nbsp;!&nbsp;&raquo; et celui de la deuxi&egrave;me &laquo;&nbsp;Presque, vous &ecirc;tes dans la bonne d&eacute;cennie&nbsp;!&nbsp;&raquo;.</p>

<p>Des r&eacute;ponses moins exactes ou fausses peuvent &ecirc;tre indiqu&eacute;es par l'enseignant, mais il faut les placer apr&egrave;s les bonnes r&eacute;ponses. Par exemple, si l'on veut ajouter la r&eacute;ponse 3:4 &agrave; la question &laquo;&nbsp;Que vaut 10/3&nbsp;?&nbsp;&raquo;, il faudra sp&eacute;cifier les diff&eacute;rentes r&eacute;ponses dans l'ordre suivant&nbsp;: 3.33:3.34 (la r&eacute;ponse accept&eacute;e), puis 3:4 (la r&eacute;ponse fausse, mais pas trop quand m&ecirc;me&nbsp;!).</p>

</li>

</ul>