<p align="center"><b>(Tanul&oacute;i) Pr&oacute;b&aacute;lkoz&aacute;sok maxim&aacute;lis sz&aacute;ma</b></p>

<p>Ez az &eacute;rt&eacute;k hat&aacute;rozza meg, hogy egy tanul&oacute; legfeljebb h&aacute;nyszor pr&oacute;b&aacute;lkozhat a leck&eacute;hez tartoz&oacute; <b>b&aacute;rmely</b> k&eacute;rd&eacute;s megv&aacute;laszol&aacute;sa sor&aacute;n. Az olyan k&eacute;rd&eacute;sekn&eacute;l, amelyekhez nem tartozik v&aacute;lasz, p&eacute;ld&aacute;ul a kieg&eacute;sz&iacute;t&#337; &eacute;s a sz&aacute;mjegyes k&eacute;rd&eacute;sek eset&eacute;n, ez az &eacute;rt&eacute;k egy sz&uuml;ks&eacute;ges  <i>kil&eacute;p&eacute;si elj&aacute;r&aacute;st</i> tesz lehet&#337;v&eacute; a lecke k&ouml;vetkez&#337; oldal&aacute;ra val&oacute; ugr&aacute;shoz. </p>

<p>Alap&eacute;rtelmez&eacute;sben ez az &eacute;rt&eacute;k 5. A kisebb &eacute;rt&eacute;kek arra &ouml;szt&ouml;n&ouml;zhetik a tanul&oacute;t, hogy ne t&ouml;prengjen a k&eacute;rd&eacute;sen. A nagyobb &eacute;rt&eacute;kek ugyanakkor t&ouml;bb csal&oacute;d&aacute;s el&#337;tt nyitj&aacute;k meg az utat.</p>

<p>Ennek az &eacute;rt&eacute;knek 1-re &aacute;ll&iacute;t&aacute;sa eset&eacute;n a tanul&oacute; minden k&eacute;rd&eacute;st csakis egyszer v&aacute;laszolhat meg. Ez a tesztmodulhoz hasonl&oacute; t&iacute;pus&uacute; feladatot ad hozz&aacute;, azzal a k&uuml;l&ouml;nbs&eacute;ggel, hogy a k&eacute;rd&eacute;sek k&uuml;l&ouml;n oldalakon jelennek meg.</p>

<p>Ne feledj&uuml;k, hogy ez az &eacute;rt&eacute;k glob&aacute;lis param&eacute;ter &eacute;s minden k&eacute;rd&eacute;sre vonatkozik, f&uuml;ggetlen&uuml;l azok t&iacute;pus&aacute;t&oacute;l.</p>
    
<p>Ne feledj&uuml;k tov&aacute;bb&aacute;, hogy ez a param&eacute;ter <b>nem</b> &eacute;rv&eacute;nyes a k&eacute;rd&eacute;sek tan&aacute;r &aacute;ltali ellen&#337;rz&eacute;s&eacute;re vagy a leck&eacute;n val&oacute; v&eacute;gighalad&aacute;sra. A pr&oacute;b&aacute;lkoz&aacute;sok sz&aacute;m&aacute;nak az ellen&#337;rz&eacute;se azon &eacute;rt&eacute;keken alapszik, amelyek az adatb&aacute;zisban vannak t&aacute;rolva, ugyanakkor a tan&aacute;ri k&eacute;rd&eacute;spr&oacute;b&aacute;lkoz&aacute;sok nem t&aacute;rol&oacute;dnak. Elv&eacute;gre a tan&aacute;rnak ismernie kell az &ouml;sszes v&aacute;laszt!</p>
