<p align="center"><strong>Adott leck&eacute;hez tartoz&oacute; k&eacute;rd&eacute;sek minim&aacute;lis sz&aacute;ma</strong></p>

<p>Ha egy lecke egy vagy t&ouml;bb el&aacute;gaz&aacute;si t&aacute;bl&aacute;zatot tartalmaz, a tan&aacute;rnak &aacute;ltal&aacute;ban be 
kell &aacute;ll&iacute;tania azt a param&eacute;tert. Ennek az &eacute;rt&eacute;ke  a k&eacute;rd&eacute;sek sz&aacute;m&aacute;ra 
vonatkoz&oacute;an egy pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;hoz valamilyen als&oacute; hat&aacute;rt &aacute;ll&iacute;t be. 
Ugyanakkor <strong>nem</strong> k&eacute;nyszer&iacute;ti a tanul&oacute;kat arra, hogy a  leck&eacute;ben ennyi k&eacute;rd&eacute;st meg is 
v&aacute;laszoljanak.</p>

<p>Ha p&eacute;ld&aacute;ul ezt a param&eacute;tert 20-ra &aacute;ll&iacute;tja be, akkor azzal biztos&iacute;thatja, hogy a pontok 
meg&aacute;llap&iacute;t&aacute;sa &uacute;gy t&ouml;rt&eacute;nj&eacute;k, mint ha a tanul&oacute;k <strong>legal&aacute;bb</strong> ennyi 
k&eacute;rd&eacute;ssel foglalkoztak volna. Vegy&uuml;k alapul azt az esetet, amikor egy tanul&oacute; egy leck&eacute;nek csak egyetlen - 
mondjuk, 5 oldalt tartalmaz&oacute; - &aacute;g&aacute;val foglalkozik, &eacute;s minden ehhez kapcsol&oacute;d&oacute;  k&eacute;rd&eacute;st 
helyesen v&aacute;laszol meg. Ilyen esetben ezut&aacute;n &uacute;gy d&ouml;nt, hogy befejezi a leck&eacute;t (felt&eacute;telezve, hogy ez a 
lehet&#337;s&eacute;g rendelkez&eacute;s&eacute;re &aacute;ll a "fels&#337; szint&#369;" el&aacute;gaz&aacute;si t&aacute;bl&aacute;zatban, ami 
c&eacute;lszer&#369; felt&eacute;telez&eacute;snek mondhat&oacute;). Ha ez a param&eacute;ter nem lenne be&aacute;ll&iacute;tva, pontsz&aacute;ma 
5-b&#337;l 5, azaz 100% lenne. Mivel viszont a be&aacute;ll&iacute;t&aacute;s ez esetben 20, pontsz&aacute;ma 20-b&oacute;l 5-re, vagyis 25%-ra 
lenne cs&ouml;kkentve. Egy m&aacute;sik tanul&oacute; eset&eacute;n, aki az &ouml;sszes el&aacute;gaz&aacute;st bej&aacute;rja &eacute;s - 
mondjuk - 25 oldalra ell&aacute;togat -, &eacute;s kett&#337; kiv&eacute;tel&eacute;vel az &ouml;sszes k&eacute;rd&eacute;sre helyes 
v&aacute;laszt ad, a pontsz&aacute;ma 25-b&#337;l 23 lenne, teh&aacute;t 92%.</p>

<p>Ezen param&eacute;ter haszn&aacute;lata eset&eacute;n a lecke nyit&oacute; oldal&aacute;n valami al&aacute;bbihoz hasonl&oacute; sz&ouml;veg 
szerepelhet:<p>

<p><blockquote>Ebben a leck&eacute;ben legal&aacute;bb n k&eacute;rd&eacute;ssel meg kell pr&oacute;b&aacute;lkoznia. Ha k&iacute;v&aacute;nja, 
t&ouml;bbel is pr&oacute;b&aacute;lkozhat. Ha viszont n k&eacute;rd&eacute;sn&eacute;l kevesebbel pr&oacute;b&aacute;lkozik, 
pontsz&aacute;m&aacute;nak a kisz&aacute;m&iacute;t&aacute;sakor a rendszer abb&oacute;l indul ki, hogy &Ouml;n n 
pr&oacute;b&aacute;lkoz&aacute;st vett ig&eacute;nybe. </blockquote></p>

<p>Az "n" a param&eacute;ter t&eacute;nyleges &eacute;rt&eacute;k&eacute;t jelenti.</p>

<p>Ha ez a param&eacute;ter be van &aacute;ll&iacute;tva, a tanul&oacute;k &eacute;rtes&uuml;lnek arr&oacute;l, hogy h&aacute;ny 
k&eacute;rd&eacute;ssel pr&oacute;b&aacute;lkoztak &eacute;s h&aacute;nnyal kell m&eacute;g pr&oacute;b&aacute;lkozniuk. </p>