<p align="center"><b>&Aacute;ttekint&eacute;s</b></p>

<ol>
<li>Egy-egy lecke n&eacute;h&aacute;ny <b>oldalb&oacute;l</b> &eacute;s esetlegesen <b>el&aacute;gaz&aacute;si t&aacute;bl&aacute;zatb&oacute;l</b> &eacute;p&uuml;l f&ouml;l.
<li>Egy oldalon valamilyen <b>tartalom </b> jelenik meg, &eacute;s &aacute;ltal&aacute;ban egy <b>k&eacute;rd&eacute;ssel</b> v&eacute;gz&#337;dik. Innen sz&aacute;rmazik a <b>K&eacute;rd&eacute;soldal</b> elnevez&eacute;s.
<li>Az egyes oldalak &aacute;ltal&aacute;ban tartalmaznak egy sor <b>v&aacute;laszt</b>. 
<li>A v&aacute;laszokhoz hozz&aacute;tartozhat egy r&ouml;vid sz&ouml;veg, amely megjelenik, ha az adott v&aacute;laszra esik a v&aacute;laszt&aacute;s. Ennek a sz&ouml;vegnek a neve a <b>felelet </b>vagy viszontv&aacute;lasz.
<li>Emellett a v&aacute;laszokhoz hozz&aacute;tartozik egy <b>ugr&oacute;pont</b>. Az ugr&oacute;pont lehet relat&iacute;v - adott oldalhoz, k&ouml;vetkez&#337; oldalhoz val&oacute; ugr&aacute;s - vagy abszol&uacute;t - a lecke b&aacute;rmely oldal&aacute;t vagy a lecke v&eacute;g&eacute;t megjel&ouml;l&#337; ugr&aacute;s.
<li>Alaphelyzetben az els&#337; v&aacute;lasszal a lecke <b>k&ouml;vetkez&#337; oldal&aacute;ra</b> jutunk. A t&ouml;bbi v&aacute;lasszal ugyanarra az oldalra ugrunk. Vagyis a tanul&oacute; ism&eacute;t a lecke azonos oldal&aacute;t l&aacute;tja, ha nem az els&#337; v&aacute;laszt v&aacute;lasztotta.
<li>Azt, hogy melyik lesz a k&ouml;vetkez&#337; oldal, a lecke <b>logikai sorrendje</b> hat&aacute;rozza meg. Ez az oldalaknak az a sorrendje, amelyet a tan&aacute;r l&aacute;t. Ez a sorrend az oldalak leck&eacute;n bel&uuml;li &aacute;thelyez&eacute;s&eacute;vel m&oacute;dos&iacute;that&oacute;. <li>A lecke emellett rendelkezik <b>navig&aacute;l&aacute;si sorrenddel </b>is. Ez az oldalaknak azon sorrendje, amelyet a tanul&oacute; l&aacute;t. A navig&aacute;l&aacute;s sorrendj&eacute;t az egyes v&aacute;laszokhoz megadott ugr&oacute;pontok hat&aacute;rozz&aacute;k meg, &iacute;gy az sz&aacute;mottev&#337;en elt&eacute;rhet a logikai sorrendt&#337;l. (Noha az ugr&oacute;pontok alap&eacute;rt&eacute;kei <i>nem</i> m&oacute;dosulnak, a kett&#337; szorosan &ouml;sszef&uuml;gg egym&aacute;ssal.) A tan&aacute;rnak lehet&#337;s&eacute;ge van a  navig&aacute;l&aacute;si sorrend ellen&#337;rz&eacute;s&eacute;re.
<li>A tanul&oacute;k sz&aacute;m&aacute;ra val&oacute; megjelen&iacute;t&eacute;s sor&aacute;n a v&aacute;laszok rendszerint &ouml;sszekeverten l&aacute;that&oacute;k. Ennek megfelel&#337;en a tan&aacute;r szempontj&aacute;b&oacute;l els&#337;nek min&#337;s&uuml;l&#337; v&aacute;lasz nem felt&eacute;tlen&uuml;l l&aacute;tszik a tanul&oacute; &aacute;ltal l&aacute;tott list&aacute;n is az els&#337; helyen. (Tov&aacute;bbmenve, ugyanazon v&aacute;laszok megjelen&eacute;sekor ezek felt&eacute;telezhet&#337;en elt&eacute;r&#337; sorrendben jelennek majd meg.) Kiv&eacute;telt k&eacute;peznek a p&aacute;ros&iacute;t&oacute; k&eacute;rd&eacute;sekre adott v&aacute;laszok, melyek eset&eacute;n a v&aacute;laszok sorrendje megegyezik a tan&aacute;r &aacute;ltal megadott sorrenddel. 
<li>A v&aacute;laszok sz&aacute;ma oldalr&oacute;l oldalra v&aacute;ltozhat. P&eacute;ld&aacute;ul egyes oldalak v&eacute;gz&#337;dhetnek igaz-hamis k&eacute;rd&eacute;ssel, m&iacute;g m&aacute;s oldalak v&eacute;g&eacute;n egy helyes v&aacute;laszt &eacute;s, mondjuk, h&aacute;rom elt&eacute;r&iacute;t&#337;t tartalmaz&oacute; k&eacute;rd&eacute;s szerepelhet. <li>Olyan oldal is kialak&iacute;that&oacute;, amelyen egy&aacute;ltal&aacute;n nincsenek v&aacute;laszok. A tanul&oacute;k ilyenkor egy <b>Tov&aacute;bb</b> men&uuml;pontot l&aacute;tnak az &ouml;sszekevert v&aacute;laszok helyett.
<li>A lecke pontoz&aacute;sa &eacute;rdek&eacute;ben a <b>helyes</b> v&aacute;laszokkal olyan oldalra ugorhatunk, amely az adott oldalhoz viszony&iacute;tva a logikai sorrendben <i>lejjebb</i> tal&aacute;lhat&oacute;. A <b>hib&aacute;s</b> v&aacute;laszokkal vagy ugyanarra az oldalra ugorhatunk, vagy pedig olyanra, amely az adott oldalhoz viszony&iacute;tva a logikai sorrendben <i>feljebb</i> tal&aacute;lhat&oacute;. &Iacute;gy ha az ugr&oacute;pontok <i>nem </i> v&aacute;ltoznak, akkor az els&#337; v&aacute;lasz a helyes v&aacute;lasz, a t&ouml;bbi pedig hib&aacute;s v&aacute;lasz.
<li>Egy-egy k&eacute;rd&eacute;shez t&ouml;bb helyes v&aacute;lasz is tartozhat. Ha p&eacute;ld&aacute;ul a v&aacute;laszok k&ouml;z&uuml;l kett&#337;vel a k&ouml;vetkez&#337; oldalra jutunk, akkor mindk&eacute;t v&aacute;laszt helyes v&aacute;lasznak tekintj&uuml;k. (Hab&aacute;r a tanul&oacute;k ugyanazt a c&eacute;loldalt l&aacute;tj&aacute;k, az adott oldalhoz vezet&#337; kapcsol&oacute;d&oacute; v&aacute;laszok elt&eacute;r&#337;ek lehetnek a k&eacute;t v&aacute;lasz eset&eacute;n.)
<li>A lecke tan&aacute;ri megjelen&iacute;t&eacute;s&eacute;n&eacute;l a helyes v&aacute;laszokn&aacute;l al&aacute;h&uacute;zott v&aacute;laszc&iacute;mke szerepel. <li>Az <b>el&aacute;gaz&aacute;si t&aacute;bl&aacute;zatok</b> olyan egyszer&#369; oldalak, amelyeken a lecke m&aacute;s oldalaira vonatkoz&oacute; hivatkoz&aacute;sok jelennek meg. Jellemz&#337; esetben a lecke egy el&aacute;gaz&aacute;si t&aacute;bl&aacute;zattal indul, amely aff&eacute;le <b>tartalomjegyz&eacute;k</b> szerep&eacute;t t&ouml;lti be.
<li>Az el&aacute;gaz&aacute;si t&aacute;bl&aacute;zat minden hivatkoz&aacute;sa k&eacute;t &ouml;sszetev&#337;t tartalmaz, a le&iacute;r&aacute;st &eacute;s azon oldal c&iacute;m&eacute;t, ahov&aacute; a rendszer ugrani fog.
<li>Az el&aacute;gaz&aacute;si t&aacute;bl&aacute;zattal hat&eacute;konyan <b>el&aacute;gaz&aacute;sokra </b> (vagy szekci&oacute;kra) oszthatunk f&ouml;l egy leck&eacute;t. Egy-egy el&aacute;gaz&aacute;shoz egy sor oldal tartozhat (melyek mindegyike feltehet&#337;leg ugyanarra a t&eacute;m&aacute;ra vonatkozik). Az el&aacute;gaz&aacute;s v&eacute;g&eacute;t rendszerint egy <b>el&aacute;gaz&aacute;s v&eacute;ge </b> oldal jel&ouml;li. Ez egy k&uuml;l&ouml;nleges oldal, amely alaphelyzetben visszajuttatja a tanul&oacute;t az el&#337;z&#337; el&aacute;gaz&aacute;si t&aacute;bl&aacute;zathoz. (Az el&aacute;gaz&aacute;s v&eacute;g&eacute;t jel&ouml;l&#337; oldalon a "visszat&eacute;r&#337;" ugr&oacute;pontot sz&uuml;ks&eacute;g eset&eacute;n az oldal szerkeszt&eacute;s&eacute;vel megv&aacute;ltoztathatjuk.) 
<li>Egy lecke t&ouml;bb el&aacute;gaz&aacute;si t&aacute;bl&aacute;zatot is tartalmazhat. Egy lecke p&eacute;ld&aacute;ul szervezhet&#337; &uacute;gy, hogy a speci&aacute;lis k&eacute;rd&eacute;sek a t&eacute;ma f&#337; el&aacute;gaz&aacute;sain bel&uuml;l azok r&eacute;sz&aacute;gait jelents&eacute;k.
<li>Fontos, hogy a tanul&oacute;knak lehet&#337;s&eacute;g&uuml;k legyen a lecke befejez&eacute;s&eacute;re. Erre a c&eacute;lra beiktathatunk egy "Lecke befejez&eacute;se" elnevez&eacute;s&#369; pontot a f&#337; el&aacute;gaz&aacute;si t&aacute;bl&aacute;zatba. Ezzel a <b>Lecke v&eacute;ge</b> nev&#369; (k&eacute;pzeletbeli) oldalra ugorhatunk. M&aacute;sik lehet&#337;s&eacute;g, ha a lecke utols&oacute; el&aacute;gaz&aacute;s&aacute;t (az "utols&oacute;" ez esetben a logikai elrendez&eacute;s szerinti &eacute;rtelemben szerepel) a lecke v&eacute;g&eacute;ig folytatjuk, vagyis <i>nem</i> z&aacute;rjuk le egy El&aacute;gaz&aacute;s v&eacute;ge nev&#369; oldallal. <li>Ha a lecke egy vagy t&ouml;bb el&aacute;gaz&aacute;si t&aacute;bl&aacute;zatot tartalmaz, aj&aacute;nlatos a "minim&aacute;lis k&eacute;rd&eacute;ssz&aacute;m" param&eacute;tert valamilyen &eacute;sszer&#369; &eacute;rt&eacute;kre be&aacute;ll&iacute;tani. Ezzel alacsonyabb &eacute;rt&eacute;ket adunk meg a pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;sa alatt l&aacute;that&oacute; oldalak sz&aacute;m&aacute;t illet&#337;en. Ezen param&eacute;ter n&eacute;lk&uuml;l el&#337;fordulhat, hogy a tanul&oacute; megtekinti a lecke egyik el&aacute;gaz&aacute;s&aacute;t, annak minden k&eacute;rd&eacute;s&eacute;re helyesen v&aacute;laszol, majd maxim&aacute;lis pontsz&aacute;mmal kil&eacute;p a leck&eacute;b&#337;l.
<li>Emellett egy el&aacute;gaz&aacute;si t&aacute;bl&aacute;zat eset&eacute;n a tanul&oacute;nak m&oacute;dj&aacute;ban &aacute;ll ugyanazt az &aacute;gat t&ouml;bbsz&ouml;r is bej&aacute;rni. A pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;sa azonban a megv&aacute;laszolt <i>egyedi</i> k&eacute;rd&eacute;sek alapj&aacute;n t&ouml;rt&eacute;nik. Ennek megfelel&#337;en ugyanannak a k&eacute;rd&eacute;ssornak az ism&eacute;telt megv&aacute;laszol&aacute;s&aacute;val <i>nem</i> n&ouml;vekszik a pontsz&aacute;m. (&Eacute;ppen ellenkez&#337;leg: maga a pontsz&aacute;m cs&ouml;kkenni fog, mivel a l&aacute;tott oldalak sz&aacute;ma a nevez&#337;be ker&uuml;l, ha a pontok kisz&aacute;m&iacute;t&aacute;sa ism&eacute;tl&eacute;seket tartalmaz.) A tanul&oacute;k adott leck&eacute;ben val&oacute; t&eacute;nyleges halad&aacute;s&aacute;nak &aacute;br&aacute;zol&aacute;s&aacute;hoz  az egyes el&aacute;gaz&aacute;si t&aacute;bl&aacute;zatok oldal&aacute;n megjelenik, hogy h&aacute;ny k&eacute;rd&eacute;st v&aacute;laszoltak meg helyesen, h&aacute;ny oldalra l&aacute;togattak el, &eacute;s mennyi a pillanatnyi pontsz&aacute;muk. <li>A <b>lecke v&eacute;g&eacute;t</b> vagy az adott helyre val&oacute; konkr&eacute;t ugr&aacute;ssal, vagy a lecke utols&oacute; (logikai) oldal&aacute;r&oacute;l a k&ouml;vetkez&#337; oldalra val&oacute; ugr&aacute;ssal &eacute;rik el. A lecke v&eacute;g&eacute;nek el&eacute;r&eacute;sekor a tanul&oacute; kap egy gratul&aacute;ci&oacute;t tartalmaz&oacute; &uuml;zenetet, &eacute;s megjelenik el&#337;tte az el&eacute;rt pontsz&aacute;m. A pontsz&aacute;m a (helyesen megv&aacute;laszolt k&eacute;rd&eacute;sek sz&aacute;ma / megtekintett oldalak sz&aacute;ma) * a leck&eacute;re adhat&oacute; pontsz&aacute;m.
<li>Ha a tanul&oacute; <i>nem </i> &eacute;ri el a lecke v&eacute;g&eacute;t &eacute;s t&aacute;vozik, akkor a legk&ouml;zelebbi visszat&eacute;r&eacute;sekor lehet&#337;s&eacute;ge van a lecke elej&eacute;t&#337;l az &uacute;jrakezd&eacute;sre, vagy onnan folytathatja, ahol az utols&oacute; helyes v&aacute;laszt adta a lecke sor&aacute;n.
<li> Az ism&eacute;tl&eacute;st lehet&#337;v&eacute; tev&#337; lecke eset&eacute;n a tan&aacute;r a lecke "v&eacute;gs&#337;" pontsz&aacute;m&aacute;t illet&#337;en v&aacute;laszthat a legjobb pontsz&aacute;m haszn&aacute;lata &eacute;s a pontok &aacute;tlag&aacute;nak a figyelembev&eacute;tele  k&ouml;z&uuml;l. Ez a pontsz&aacute;m p&eacute;ld&aacute;ul a Pontok oldalon jelenik meg.
</ol>

