<p align="center"><strong>K&eacute;rd&eacute;sv&aacute;ltozat</strong></p>

<p>A k&eacute;rd&eacute;sfajt&aacute;k egy r&eacute;sz&eacute;hez v&aacute;ltozat tartozik, amelyet a jel&ouml;l&#337;n&eacute;gyzetre 
kattintva &eacute;rhet el. Ezeket a  k&eacute;rd&eacute;sfajt&aacute;kat &eacute;s a v&aacute;ltozatok jelent&eacute;s&eacute;t al&aacute;bb 
soroljuk f&ouml;l.</p>

<ol>
<li><p><strong>Feleletv&aacute;laszt&oacute;s</strong> A feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;seknek van egy 
<strong>"feleletv&aacute;laszt&oacute;s v&aacute;laszv&aacute;laszt&oacute;s"</strong> k&eacute;rd&eacute;sv&aacute;ltozata. A 
k&eacute;rd&eacute;sv&aacute;ltozat kiv&aacute;laszt&aacute;sa eset&eacute;n a tanul&oacute;nak a megadott v&aacute;laszok k&ouml;z&uuml;l 
az &ouml;sszes helyes v&aacute;laszt ki kell v&aacute;lasztania. A k&eacute;rd&eacute;s vagy jelzi a tanul&oacute; sz&aacute;m&aacute;ra, hogy 
<i>h&aacute;ny</i> helyes v&aacute;lasz adhat&oacute;, vagy nem. P&eacute;ld&aacute;ul egy "Az al&aacute;bbiak k&ouml;z&uuml;l kik voltak az 
USA eln&ouml;kei?" k&eacute;rd&eacute;s ezt nem jel&ouml;li, m&iacute;g a "V&aacute;lassza ki az al&aacute;bbi felsorol&aacute;sb&oacute;l a 
k&eacute;t USA-beli eln&ouml;k&ouml;t." igen. A helyes v&aacute;laszok sz&aacute;ma <strong>egyt&#337;l</strong> az &ouml;sszes lehets&eacute;ges 
v&aacute;lasz sz&aacute;m&aacute;ig terjedhet. (Az egy  helyes v&aacute;laszt tartalmaz&oacute; feleletv&aacute;laszt&oacute;s 
v&aacute;laszv&aacute;laszt&oacute;s k&eacute;rd&eacute;s <strong>elt&eacute;r</strong> a feleletv&aacute;laszt&oacute;s 
k&eacute;rd&eacute;st&#337;l, mivel az el&#337;bbi lehet&#337;v&eacute; teszi a tanul&oacute; sz&aacute;m&aacute;ra, hogy egyn&eacute;l t&ouml;bb 
v&aacute;laszt v&aacute;lasszon ki, m&iacute;g az ut&oacute;bbi erre nem ad lehet&#337;s&eacute;get.)</p></li>

<li><p><strong>Kieg&eacute;sz&iacute;t&#337;</strong> Alaphelyzetben az &ouml;sszehasonl&iacute;t&aacute;s figyelmen k&iacute;v&uuml;l hagyja a 
kis- &eacute;s nagybet&#369;k k&ouml;z&ouml;tti k&uuml;l&ouml;nbs&eacute;get. A k&eacute;rd&eacute;sv&aacute;ltozat kiv&aacute;laszt&aacute;sakor 
az &ouml;sszehasonl&iacute;t&aacute;s &eacute;rz&eacute;keny lesz a kis- &eacute;s nagybet&#369;k k&ouml;z&ouml;tti k&uuml;l&ouml;nbs&eacute;gre.</p></li>
</ol>
<p>A t&ouml;bbi k&eacute;rd&eacute;sfajta eset&eacute;n nincsenek k&eacute;rd&eacute;sv&aacute;ltozatok.</p>
