<p align="center"><b>K&eacute;rd&eacute;sfajt&aacute;k</b></p>

<p>A leckemodul jelenleg a k&ouml;vetkez&#337; k&eacute;rd&eacute;sfajt&aacute;kat t&aacute;mogatja:

<ol>
<li><p><b>Feleletv&aacute;laszt&oacute;s</b> Ez az alap&eacute;rtelmez&eacute;s szerinti k&eacute;rd&eacute;sfajta. A feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;s olyankor k&ouml;zkedvelt k&eacute;rd&eacute;sfajta, amikor a tanul&oacute;nak egy sor alternat&iacute;v megold&aacute;s k&ouml;z&uuml;l kell kiv&aacute;lasztania a megfelel&#337;t. Helyes v&aacute;lasz eset&eacute;n a tanul&oacute; tov&aacute;bbl&eacute;p a leck&eacute;ben, m&iacute;g rossz v&aacute;laszokkal nem l&eacute;phet tov&aacute;bb. A rossz v&aacute;laszokat gyakran h&iacute;vj&aacute;k "elt&eacute;r&iacute;t&#337;knek". Ezen k&eacute;rd&eacute;sek hasznoss&aacute;ga sokszor ink&aacute;bb az elt&eacute;r&iacute;t&#337;k min&#337;s&eacute;g&eacute;n m&uacute;lik, mint ak&aacute;r mag&aacute;n a k&eacute;rd&eacute;sen, vagy az arra adand&oacute; helyes v&aacute;laszon.</p>

<p> Az egyes v&aacute;laszokhoz opcion&aacute;lisan tartozhatnak viszontv&aacute;laszok. Ha valamely v&aacute;laszhoz nem adunk meg viszontv&aacute;laszt, akkor a rendszer alapesetben "Helyes a v&aacute;lasz" vagy "Helytelen a v&aacute;lasz" visszajelz&eacute;st ad a tanul&oacute;nak. </p>

<p>Egy feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;shez egyn&eacute;l t&ouml;bb helyes v&aacute;lasz is tartozhat. A k&uuml;l&ouml;nf&eacute;le helyes v&aacute;laszokhoz a tanul&oacute; m&aacute;s-m&aacute;s viszontv&aacute;laszt kaphat &eacute;s m&aacute;s-m&aacute;s (el&#337;re l&eacute;p&#337;) oldalra ugorhat a leck&eacute;n bel&uuml;l, de nincs elt&eacute;r&eacute;s a r&aacute;juk adott pontsz&aacute;mok tekintet&eacute;ben (vagyis nincsenek a m&aacute;sikn&aacute;l <b>helyesebb</b> v&aacute;laszok, legal&aacute;bbis pontsz&aacute;m tekintet&eacute;ben.) El&#337;fordulhat, hogy az &ouml;sszes v&aacute;lasz helyes, &eacute;s mindegyik&uuml;k a lecke m&aacute;s-m&aacute;s (el&#337;re l&eacute;p&#337;) r&eacute;sz&eacute;re juttathatja a tanul&oacute;t a kiv&aacute;lasztott v&aacute;laszt&oacute;l f&uuml;gg&#337;en.</p>

<p>A feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;snek l&eacute;tezik egy <b>"feleletv&aacute;laszt&oacute;s v&aacute;laszv&aacute;laszt&oacute;s"</b> k&eacute;rd&eacute;sfajt&aacute;ja is. Ez eset&eacute;n a tanul&oacute;nak a megadott v&aacute;laszok k&ouml;z&uuml;l az &ouml;sszes helyes v&aacute;laszt kell kiv&aacute;lasztania. A k&eacute;rd&eacute;s vagy el&aacute;rulja a tanul&oacute; sz&aacute;m&aacute;ra a helyes v&aacute;laszok sz&aacute;m&aacute;t, vagy nem. P&eacute;ld&aacute;ul  "Az al&aacute;bbiak k&ouml;z&uuml;l ki volt az USA eln&ouml;ke?" nem &aacute;rulkodik err&#337;l, m&iacute;g a "V&aacute;lassza ki az al&aacute;bbi felsorol&aacute;sb&oacute;l a k&eacute;t USA-beli eln&ouml;k&ouml;t." igen. A helyes v&aacute;laszok sz&aacute;ma <b>egyt&#337;l</b> a v&aacute;laszok &ouml;sszes sz&aacute;m&aacute;ig terjedhet. (Az egy helyes v&aacute;laszt tartalmaz&oacute; feleletv&aacute;laszt&oacute;s v&aacute;laszv&aacute;laszt&oacute;s k&eacute;rd&eacute;s <b>elt&eacute;r </b> a feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;st&#337;l, mivel az el&#337;bbi lehet&#337;v&eacute; teszi a tanul&oacute; sz&aacute;m&aacute;ra, hogy egyn&eacute;l t&ouml;bb v&aacute;laszt v&aacute;lasszon ki, m&iacute;g az ut&oacute;bbi erre nem ad lehet&#337;s&eacute;get.)</p>

<p>Itt a helyes v&aacute;laszt ism&eacute;t  egy el&#337;re mutat&oacute; ugr&oacute;pont jelzi, m&iacute;g a helytelen v&aacute;laszok egy ugyanazon oldalra vagy egy visszafel&eacute; mutat&oacute; ugr&oacute;pontot jelentenek. Egyn&eacute;l t&ouml;bb helyes v&aacute;lasz eset&eacute;n az ugr&oacute;pontok mindegyik&eacute;nek ugyanarra az oldalra kell mutatnia, hasonl&oacute;an a rossz v&aacute;laszokhoz. <b>Ellenkez&#337; </b> esetben a lecke tan&aacute;ri n&eacute;zet&eacute;ben figyelmeztet&eacute;s jelenik meg. A helyes viszontv&aacute;laszt - ha sz&uuml;ks&eacute;ges - az els&#337; helyes v&aacute;laszhoz kell megadni, m&iacute;g a helytelen v&aacute;laszokhoz tartoz&oacute; viszontv&aacute;laszt adott esetben az els&#337; rossz v&aacute;laszn&aacute;l kell megadni. A t&ouml;bbi v&aacute;laszra adott viszontv&aacute;laszt a rendszer (figyelmeztet&eacute;s n&eacute;lk&uuml;l) figyelmen k&iacute;v&uuml;l hagyja. </p></li>

<li><p><b>Kieg&eacute;sz&iacute;t&#337;</b> A tanul&oacute;nak egy r&ouml;vid sz&ouml;veget kell be&iacute;rnia. Ezt a sz&ouml;veget hasonl&iacute;tja a rendszer egy vagy t&ouml;bb v&aacute;laszhoz. A v&aacute;laszok helyesek vagy helytelenek lehetnek. Az egyes v&aacute;laszokhoz opcion&aacute;lisan tartozhatnak viszontv&aacute;laszok. Ha valamely v&aacute;laszhoz nem adunk meg viszontv&aacute;laszt, akkor a rendszer alapesetben "Helyes a v&aacute;lasz" vagy "Helytelen a v&aacute;lasz" visszajelz&eacute;st ad a tanul&oacute;nak. Ha a be&iacute;rt sz&ouml;veg egyik v&aacute;lasznak sem felel meg, akkor a k&eacute;rd&eacute;s rossz, &eacute;s a tanul&oacute; az alap&eacute;rtelmez&eacute;s szerinti rossz v&aacute;laszhoz tartoz&oacute; viszontv&aacute;laszt kapja. </p>

<p>Alaphelyzetben a hasonl&iacute;t&aacute;s nem tesz k&uuml;l&ouml;nbs&eacute;get kis- &eacute;s nagybet&#369;k k&ouml;z&ouml;tt. A bet&#369;&eacute;rz&eacute;kenys&eacute;g be&aacute;ll&iacute;t&aacute;s&aacute;ra k&uuml;l&ouml;n opci&oacute; &aacute;ll rendelkez&eacute;sre.</p>

<p>A csillag (*) karakter a v&aacute;laszokban "helyettes&iacute;t&#337;" karakterk&eacute;nt haszn&aacute;lhat&oacute;. Jelent&eacute;se tetsz&#337;leges sz&aacute;m&uacute; karakter (bele&eacute;rtve a karakter hi&aacute;ny&aacute;t is). Ha p&eacute;ld&aacute;ul a v&aacute;laszban a "hossz*" alak szerepel, akkor az megfelel mind a "hossz&uacute;", a "hosszabb", mind pedig a  "hossz" alaknak. Ha a v&aacute;laszok egyik&eacute;nek csak a "*" (egyetlen *) van megadva, akkor ez a v&aacute;lasz b&aacute;rmilyen v&aacute;lasznak megfelel, &iacute;gy &aacute;ltal&aacute;ban egy utols&oacute;, "mindent mag&aacute;ban foglal&oacute;" v&aacute;laszk&eacute;nt haszn&aacute;latos. (Amennyiben a v&aacute;laszban a csillagnak (*) t&eacute;nylegesen szerepelnie kell, akkor azt \* alakban, azaz visszaperjel csillag alakban kell megadni.)<p></li>

<li><b>Igaz/hamis</b>  A v&aacute;laszad&oacute; itt csak k&eacute;t lehets&eacute;ges v&aacute;lasz k&ouml;z&uuml;l v&aacute;laszthat: igaz vagy hamis. A tanul&oacute;nak a helyes v&aacute;ltozatot kell kiv&aacute;lasztania. Az effajta k&eacute;rd&eacute;sek alapvet&#337;en olyan feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;sek, amelyekhez csak k&eacute;t v&aacute;laszt&aacute;si lehet&#337;s&eacute;g kapcsol&oacute;dik.</p></li>

<li><p><b>P&aacute;ros&iacute;t&oacute;</b> Ezek igen hasznos &eacute;s sokoldal&uacute; k&eacute;rd&eacute;sek. Egy sor megnevez&eacute;sb&#337;l vagy &aacute;ll&iacute;t&aacute;sb&oacute;l &aacute;llnak, melyeket helyesen kell &ouml;sszep&aacute;ros&iacute;tani egy m&aacute;sik sor megnevez&eacute;ssel vagy &aacute;ll&iacute;t&aacute;ssal. P&eacute;ld&aacute;ul: "P&aacute;ros&iacute;tsa az orsz&aacute;got a f&#337;v&aacute;ros&aacute;val!", melyhez k&eacute;t felsorol&aacute;s p&aacute;rosul: Jap&aacute;n, Kanada, Olaszorsz&aacute;g, illetve Toki&oacute;, Ottawa, R&oacute;ma. Az egyik felsorol&aacute;sban szerepelhetnek ism&eacute;telt fogalmak, de &uuml;gyelni kell arra, hogy az ism&eacute;tl&#337;d&eacute;sek azonosak legyenek. P&eacute;ld&aacute;ul: "Azonos&iacute;tsa az al&aacute;bbi &eacute;l&#337;l&eacute;nyek t&iacute;pus&aacute;t!", &eacute;s a felsorol&aacute;sok: ver&eacute;b, teh&eacute;n, hangya, kutya &eacute;s mad&aacute;r, &aacute;llat, rovar, &aacute;llat. </p>

<p>Az effajta k&eacute;rd&eacute;s l&eacute;trehoz&aacute;sakor az els&#337; felsorol&aacute;s elemei a V&aacute;lasz n&eacute;gyzetekbe ker&uuml;lnek, m&iacute;g a m&aacute;sodik lista elemei a Viszontv&aacute;lasz n&eacute;gyzetekbe. L&eacute;trehoz&aacute;suk ut&aacute;n a c&iacute;mk&eacute;k egy&eacute;rtelm&#369;bben l&aacute;tszanak. Ha a tanul&oacute; sikeresen p&aacute;ros&iacute;tja az elemeket, akkor az els&#337; v&aacute;laszhoz megadott ugr&oacute;pont l&eacute;p m&#369;k&ouml;d&eacute;sbe. A sikertelen v&aacute;lasz a m&aacute;sodik v&aacute;lasz szerinti ugr&oacute;pontra viszi a tanul&oacute;t. A k&eacute;rd&eacute;s <b>nem</b> teszi lehet&#337;v&eacute; egy&eacute;ni viszontv&aacute;laszok kialak&iacute;t&aacute;s&aacute;t, a tanul&oacute; &eacute;rtes&uuml;l arr&oacute;l, hogy h&aacute;ny p&aacute;ros&iacute;t&aacute;sa volt helyes, vagy hogy az &ouml;sszes p&aacute;ros&iacute;t&aacute;s helyes volt-e.</p>

<p>A feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;st&#337;l elt&eacute;r&#337;en, ahol a v&aacute;laszt&aacute;si lehet&#337;s&eacute;gek v&eacute;letlenszer&#369;en jelennek meg, az elemek els&#337; list&aacute;ja <b>nincs</b> &ouml;sszekeverve, hanem a megadott sorrend szerint jelenik meg. Ennek k&ouml;sz&ouml;nhet&#337;en <b>"rendezett"</b> k&eacute;rd&eacute;sek megalkot&aacute;s&aacute;ra ny&iacute;lik lehet&#337;s&eacute;g. Vegy&uuml;k az al&aacute;bbi k&eacute;rd&eacute;st: "Rendezze az al&aacute;bbiakat sz&uuml;let&eacute;s&uuml;k szerint n&ouml;vekv&#337;  sorrendbe!", a lista pedig: 1., 2., 3., 4. &eacute;s Longfellow, Lawrence, Lowell, Larkin. Term&eacute;szetesen a m&aacute;sodik felsorol&aacute;s elemein a k&eacute;rd&eacute;sben val&oacute; felhaszn&aacute;l&aacute;sukat megel&#337;z&#337;en megt&ouml;rt&eacute;nik az &ouml;sszekever&eacute;s.</p></li>

<li><p><b>Sz&aacute;mjegyes:</b> Ezen k&eacute;rd&eacute;st&iacute;pus eset&eacute;n a v&aacute;lasz egy sz&aacute;m. Legegyszer&#369;bb alakj&aacute;ban mind&ouml;ssze egyetlen v&aacute;laszt kell meghat&aacute;roznunk. P&eacute;ld&aacute;ul: "Mennyi 2 meg 2?", melyhez ha a v&aacute;lasz 4, akkor m&#369;k&ouml;d&eacute;sbe l&eacute;p az el&#337;re mutat&oacute; ugr&oacute;pont. Szerencs&eacute;sebb ugyanakkor egy tartom&aacute;nyt megadni, mert a sz&aacute;m&eacute;rt&eacute;kek bels&#337; kerek&iacute;t&eacute;se a sz&aacute;mjegyes &ouml;sszehasonl&iacute;t&aacute;sok eset&eacute;n teret enged a vakszerencs&eacute;nek. Ennek megfelel&#337;en a "Mennyi 10 osztva 3-mal" k&eacute;rd&eacute;sre a v&aacute;lasz  <b>"minimum:maximum"</b> volna, azaz <b>k&eacute;t</b>, egym&aacute;st&oacute;l kett&#337;sponttal elv&aacute;lasztott &eacute;rt&eacute;k (:). &Iacute;gy ha 3,33:3,34 van megadva mint a v&aacute;laszok elfogadhat&oacute; tartom&aacute;nya, akkor a 3,33, 3,333, 3,3333... v&aacute;laszok mindegyik&eacute;t helyes v&aacute;laszk&eacute;nt kezeln&eacute;nk. A "rossz" v&aacute;laszok k&ouml;z&ouml;tt szerepelne mind a 3,3 (a minimumn&aacute;l kevesebb), mind a 3,4 (a maximumn&aacute;l nagyobb &eacute;rt&eacute;k).</p>

<p>Lehet&#337;s&eacute;g van egyn&eacute;l t&ouml;bb helyes v&aacute;lasz megad&aacute;s&aacute;ra, &eacute;s a v&aacute;laszok lehetnek egyedi vagy p&aacute;ros &eacute;rt&eacute;kek. Ne feledj&uuml;k, hogy a v&aacute;laszok ellen&#337;rz&eacute;se 1. v&aacute;lasz, 2. v&aacute;lasz sorrendben t&ouml;rt&eacute;nik, ez&eacute;rt figyelni kell, hogy adott esetben a megfelel&#337; viszontv&aacute;lasz jelenjen meg. P&eacute;ld&aacute;ul a "Mikor sz&uuml;letett Larkin?" k&eacute;rd&eacute;shez hozz&aacute;tartozhat az 1922 mint egyedi, pontos v&aacute;laszt ad&oacute; &eacute;rt&eacute;k, vagy az 1920:1929 &eacute;rt&eacute;kp&aacute;r mint az 1920-as &eacute;vek, azaz egy kev&eacute;sb&eacute; pontos &eacute;rt&eacute;k. Ezen &eacute;rt&eacute;kek &eacute;rt&eacute;kel&eacute;si sorrendje term&eacute;szetesen 1922, majd 1920:1929. Az els&#337; v&aacute;laszhoz esetleg adhat&oacute; ilyen viszontv&aacute;lasz: "Pontosan!",  a m&aacute;sik v&aacute;lasz viszontv&aacute;lasza lehetne a "&Uacute;gy van, eltal&aacute;lta az &eacute;vtizedet!".</p>
    
<p>Megadhatunk rossz v&aacute;laszokat is, de a tartom&aacute;nyt&oacute;l f&uuml;gg&#337;en &uuml;gyelni kell arra, hogy ezek a helyes v&aacute;laszok ut&aacute;n szerepeljenek. P&eacute;ld&aacute;ul ha a 3:4 rossz v&aacute;laszt adjuk meg a "Mennyi 10 osztva 3-mal" k&eacute;rd&eacute;shez, akkor annak a helyes v&aacute;lasz ut&aacute;n kell k&ouml;vetkeznie. Vagyis a v&aacute;laszok sorrendje: 3,33:3,34 (a "helyes" v&aacute;lasz), majd a 3:4 (a "rossz", de az&eacute;rt nem kiugr&oacute;an rossz v&aacute;lasz!).</p></li>
</ul>

