<p align="center"><strong>A HTML-szerkeszt&#337; haszn&aacute;lata</strong></p>

<p>Ez az opci&oacute; oldalak szerkeszt&eacute;se k&ouml;zben bekapcsolja a HTML-szerkeszt&#337; (a tov&aacute;bbiakban: szerkeszt&#337;) 
haszn&aacute;lat&aacute;t az egyszer&#369; sz&ouml;vegbeviteli mez&#337;k helyett. A szerkeszt&#337;vel egyszer&#369;en form&aacute;zhatja a 
sz&ouml;veget &eacute;s k&ouml;nnyen besz&uacute;rhat olyan "magasabb szint&#369;" elemeket, mint a hivatkoz&aacute;sok (ugr&oacute;pontok).</p>

<p>A szerkeszt&#337;t a <strong>Szerkeszt&#337; haszn&aacute;lata</strong> melletti n&eacute;gyzetre kattintva kapcsolhatja be. A szerkeszt&#337; az 
egyes &ouml;sszetev&#337;kh&ouml;z egyedi m&oacute;don kapcsol&oacute;dik. Ha p&eacute;ld&aacute;ul bekapcsolja a szerkeszt&#337;t az <strong>1. 
viszontv&aacute;lasz</strong>hoz, a szerkeszt&#337; csak ezzel az &ouml;sszetev&#337;vel lesz haszn&aacute;lhat&oacute;, &eacute;s <i>nem</i> 
az &ouml;sszes viszontv&aacute;lasszal.</p>

<p>Ha a szerkeszt&#337;t egy oldalon t&ouml;bb &ouml;sszetev&#337;vel k&iacute;v&aacute;nja haszn&aacute;lni, el&#337;sz&ouml;r kattintson
 a <strong>Szerkeszt&#337; haszn&aacute;lata</strong> n&eacute;gyzetekre (ezekben ilyenkor pip&aacute;nak kell megjelenni.) Ezut&aacute;n az oldal 
 ism&eacute;t megjelenik a szerkeszt&#337; haszn&aacute;lat&aacute;nak bekapcsol&aacute;s&aacute;hoz. Ehhez kattintson a lap alj&aacute;n 
 l&eacute;v&#337; <strong>Oldal &uacute;jb&oacute;li megjelen&iacute;t&eacute;se</strong> gombra.</p>

<p>Ne feledje, hogy a szerkeszt&#337; haszn&aacute;lat&aacute;hoz k&ouml;r&uuml;ltekint&eacute;sre van sz&uuml;ks&eacute;g. A legt&ouml;bb esetben 
ez nem okozhat gondot. Ugyanakkor <i>nem</i> aj&aacute;nlott a haszn&aacute;lata  <strong>kieg&eacute;sz&iacute;t&#337; &eacute;s sz&aacute;mjegyes 
k&eacute;rd&eacute;sekre adott v&aacute;laszok eset&eacute;n</strong>. A szerkeszt&#337; k&uuml;l&ouml;n "l&aacute;thatatlan" HTML-elemeket 
sz&uacute;rhat be, amelyek miatt az &ouml;sszehasonl&iacute;t&aacute;s <strong>nem a v&aacute;rt m&oacute;don</strong> m&#369;k&ouml;dhet. 
Ezen t&uacute;lmen&#337;en a <strong>le&iacute;r&aacute;sok</strong> az el&aacute;gaz&aacute;si t&aacute;bl&aacute;zatokban a gombokon 
haszn&aacute;latosak, &eacute;s ha ezekben HTML-k&oacute;d szerepel, az szint&eacute;n gondokat okozhat. Nincs ilyen gond azokkal a 
v&aacute;laszokkal, amelyek csak megjelen&iacute;t&eacute;sre haszn&aacute;latosak, mint amilyen a feleletv&aacute;laszt&oacute;s 
t&iacute;pus&uacute; k&eacute;rd&eacute;sek esete. A szerkeszt&#337; haszn&aacute;lata viszontv&aacute;laszok eset&eacute;n &uacute;gyszint&eacute;n 
nem jelenthet gondot.</p>

<p>Ha gondra gyanakszik b&aacute;rmely sz&ouml;veges elem eset&eacute;n, a biztons&aacute;gos megold&aacute;s, ha kikapcsolja a szerkeszt&#337;t 
(a <strong>Szerkeszt&#337; haszn&aacute;lata</strong> n&eacute;gyzetben l&eacute;v&#337; pipa elt&aacute;vol&iacute;t&aacute;s&aacute;val). 
Az oldal &uacute;jb&oacute;li megjelen&iacute;t&eacute;sekor a sz&ouml;vegbeviteli mez&#337;ben a "nyers" sz&ouml;veg l&aacute;that&oacute;. 
A sz&ouml;veget tetsz&eacute;s szerint szerkesztheti. Ha a szerkeszt&#337;t egy elem eset&eacute;n t&ouml;bbsz&ouml;r ki- &eacute;s bekapcsolja, 
az a sz&ouml;veget <i>nem</i>  m&oacute;dos&iacute;tja.</p>

<p>A <strong>Szerkeszt&#337; haszn&aacute;lata</strong> opci&oacute; "&aacute;llapot&aacute;t" a rendszer minden elemmel egy&uuml;tt elmenti. 
&Iacute;gy ha egy oldalt &uacute;jb&oacute;l szerkeszt, a szerkeszt&#337;t kor&aacute;bban haszn&aacute;l&oacute; elemek ism&eacute;t a 
szerkeszt&#337;ben jelennek meg.</p>

<p>V&eacute;gezet&uuml;l a szerkeszt&#337; meglehet&#337;sen "ig&eacute;nyes" a b&ouml;ng&eacute;sz&#337; er&#337;forr&aacute;saival szemben. 
Ha nincs sz&uuml;ks&eacute;g valamely t&eacute;tel eset&eacute;n a szerkeszt&#337; haszn&aacute;lat&aacute;ra, gyorsabb &eacute;s 
biztons&aacute;gosabb, ha csak a szok&aacute;sos sz&ouml;vegbeviteli mez&#337;ket haszn&aacute;lja.</p>

