<img alt="" src="<?php echo $CFG->wwwroot?>/mod/dialogue/icon.gif" />&nbsp;<b>Dial&oacute;ga</b></p>

<p>Sol&aacute;thra&iacute;onn an mod&uacute;l seo modh simpl&iacute; cumars&aacute;ide
idir p&eacute;ir&iacute; &uacute;s&aacute;ideoir&iacute;. F&eacute;adfaidh
m&uacute;inteoir dial&oacute;g a thos&uacute; le mac l&eacute;inn, is f&eacute;idir
lemac l&eacute;inn dial&oacute;g a thos&uacute; le m&uacute;inteoir, agus
(go roghnach) f&eacute;adfaidh mac l&eacute;inn dial&oacute;g a oscailt
le mac l&eacute;inn eile. F&eacute;adfaidh m&uacute;inteoir n&oacute; mac
l&eacute;inn a bheith p&aacute;irteach i l&iacute;on ar bith dial&oacute;ga
lean&uacute;nacha ag am ar bith.</p>

<p>N&iacute;l teorainn leis an l&iacute;on iontr&aacute;lacha i ndial&oacute;g,
agus de ghn&aacute;th tarla&iacute;onn an &quot;comhr&aacute;&quot; i riocht freagra&iacute;
idirdhuillithe. N&iacute; feidhm&iacute;tear an fhorm&aacute;id seo agus
f&eacute;adfaidh ceachtar p&aacute;irt&iacute; cur leis an dial&oacute;g
ag am ar bith.</p>

<p>F&eacute;adfaidh ceachtar p&aacute;irt&iacute; an dial&oacute;g a dh&uacute;nadh
am ar bith. N&iacute; f&eacute;idir dial&oacute;ga d&uacute;nta a athoscailt.
Ach is f&eacute;idir le ceachtar p&aacute;irt&iacute; breathn&uacute; ar
dhial&oacute;g dh&uacute;nta fhaid is gur ann di i gc&oacute;na&iacute;.</p>

<p>Scriosann an mod&uacute;l dial&oacute;ga d&uacute;nta agus na hiontr&aacute;lacha
ar fad iontu tar &eacute;is tr&eacute;imhse &aacute;irithe ama. Socra&iacute;tear
an tr&eacute;imhse sin anseo nuair a crutha&iacute;tear an Dial&oacute;g.</p>

<p>If the course has groups the following points apply.
<ul><li>When opening a new dialogue the teacher is shown the group mode of the
    dialogue and their current group. This information is displayed immediately
    below the Tab Bar.</li>
<li>A teacher can start dialogues with all the students in their current group
    by choosing the group name in the drop-down list of names. Once started
    the dialogues operate in the normal way, that is, they are one-to-one
    dialogues between the teacher and individual students.</li>
<li>If the dialogue is in SEPARATE GROUPS mode then students only see other
    students in their own group (assuming the dialogue allows student-to-student
    dialogues). In this mode students who are not in any group do not see any
    other students.</li>
</ul>
</p>


