<html>
<head>
<title>Documentation Moodle : Comment utiliser CVS ?</title>
    <link rel="stylesheet" href="docstyles.css" type="TEXT/CSS">
    <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
<body bgcolor="#ffffff">
<h1>Utiliser CVS pour acc&eacute;der au code de Moodle et le modifier</h1>
<blockquote> 
  <p>CVS est un acronyme pour &laquo;&nbsp;Concurrent Versioning System&nbsp;&raquo;.
  C'est une fa&ccedil;on pratique
  stoquer le code source, car elle permet de conserver les versions de
  tous les fichiers de sorte que rien n'est jamais perdu, et que les traces
  de l'utilisation par les diff&eacute;rentes personnes sont conserv&eacute;es. Le
  syst&egrave;me offre en outre la possibilit&eacute; de fusionner le code si deux  ou
  plusieurs personnes travaillent sur un m&ecirc;me fichier. Tout le code et
  toutes les versions sont enregistr&eacute;es sur un serveur central (dans le cas
  de Moodle, sur <a target="_top" href="http://www.sf.net/">Sourceforge</a>).</p>
  <p>Si vous d&eacute;sirez acc&eacute;der &agrave; la version actuelle de Moodle par CVS avec
  un acc&egrave;s en lecture seule, vous n'avez pas besoin de cette page. Il
  vous suffit de suivre les instructions (plus simples) pour CVS sur
  la page <a target="_top" href="http://moodle.org/download">T&eacute;l&eacute;chargement
  de Moodle</a>.</p>
  <p>Pour utiliser l'<a target="_top"
  href="http://cvs.sourceforge.net/cgi-bin/viewcvs.cgi/moodle/moodle/">archive CVS
  de Moodle</a> (en tant que <a target="_top"
  href="http://sourceforge.net/project/memberlist.php?group_id=30935">d&eacute;veloppeur 
  avec acc&egrave;s en &eacute;criture</a>), il vous faut avant tout un
  <a href="http://sourceforge.net/account/register.php">compte sur 
  Sourceforge</a>. Dans les exemples de ce fichier, nous admettrons que votre
  nom d'utilisateur est <strong><font color="#990000">myusername</font></strong>
  et que votre mot de passe est <strong><font color="#990000">mypassword</font></strong>.
  Lisez attentivement les instructions de Sourceforge (en anglais) <a target="_top"
  href="http://sourceforge.net/docman/display_doc.php?docid=768&amp;group_id=1#develhomedir">create
  your CVS home directory</a> - une proc&eacute;dure que vous devez faire pour chaque
  nouveau compte pour l'activer en vue de CVS. Il s'agit en gros de vous connecter
  en ssh &agrave; l'adresse cvs.sourceforge.net.</p>
  <p>D&egrave;s que vous avez un compte Sourceforge actif, contactez
  <a target="_top" href="http://moodle.org/user/view.php?id=1&amp;course=1">Martin Dougiamas</a>
  pour qu'il puisse vous donner les droits en &eacute;criture sur certains dossiers
  de Moodle.</p>
  <p>Pour &eacute;viter de devoir taper <strong><font color="#990000">mypassword</font></strong>
  chaque fois que vous lancez une commande CVS, suivez les 
  <a target="_top" href="http://sourceforge.net/account/editsshkeys.php">instructions de
  Sourceforge pour l'utilisation de clefs d'autorisation</a> (en anglais).
  Cette &eacute;tape n'est pas obligatoire, mais elle rend votre travail avec CVS bien
  plus agr&eacute;able et productive.</p>
  <p>Une fois cela fait, vous devriez avoir toutes les autorisations n&eacute;cessaires,
  et vous pouvez configurer votre machine et t&eacute;l&eacute;charger les sources actuelles
  poiur y travailler. Vous trouverez ci-dessous pour les syst&egrave;mes Unix et Windows.</p>
  <h2>1. Utilisation de CVS sur Unix</h2>
  <blockquote> 
    <p>Le CVS de Sourceforge utilise ssh comme couche de transport pour la s&eacute;curit&eacute;. Vous
    devrez donc configurer ainsi la variable d'environnement CVS_RSH dans votre &laquo;&nbsp;shell&nbsp;&raquo;&nbsp;:</p>
    <blockquote> 
      <pre><strong>setenv CVS_RSH ssh</strong> (pour csh, tcsh, etc.)</pre>
      <pre><strong>export CVS_RSH=ssh</strong> (pour sh, bash, etc.)</pre>
    </blockquote>
    <p>Une possibilit&eacute; est de placer cette commande dans votre .bashrc ou .cshrc
    afin que vous n'ayez pas &agrave; la retaper tout le temps. Ensuite, vous devrez effectuer
    un &laquo;&nbsp;check out&nbsp;&raquo; de Moodle avec la commande ci-dessous (sur une seule ligne)&nbsp;:</p>
    <blockquote> 
      <pre><strong>cvs -z3 -d:ext:myusername@cvs.sourceforge.net:/cvsroot/moodle co moodle</strong></pre>
    </blockquote>
    <p>Ne tentez pas de lancer cette première commande CVS depuis un dossier de Moodle
    préexistant. Commencez avec un nouveau dossier vide.</p>
    <p>Vous devrez taper <strong><font color="#990000">mypassword</font></strong> 
    pour chaque commande, &agrave; moins que vous ne mettiez en place des <a target="_top"
    href="http://sourceforge.net/account/editsshkeys.php">clefs autoris&eacute;es</a>.</p>
    <p>&Agrave; ce stade, vous devriez avoir un nouveau dossier &laquo;&nbsp;moodle&nbsp;&raquo;. Vous pouvez
    changer son nom et le d&eacute;placer, si vous le voulez. Placez-vous dans ce dossier&nbsp;:</p>
    <blockquote> 
      <pre><strong>cd moodle</strong></pre>
    </blockquote>
    <p>Les toutes derni&egrave;res versions des fichiers de Moodle devrait y &ecirc;tre.
    Vous pouvez modifier les fichiers de votre copie. Pour comparer vos fichiers
    avec ceux du serveur CVS, utilisez cvs diff, par exemple&nbsp;:</p>
    <blockquote> 
      <pre><strong>cvs diff -c config-dist.php
cvs diff -c lang</strong></pre>
    </blockquote>
    <p>Pour r&eacute;cup&eacute;rer les derni&egrave;res mises &agrave; jour de Moodle, tapez&nbsp;:</p>
    <blockquote> 
      <pre><strong>cvs update -dP</strong> </pre>
    </blockquote>
    <p>Pour transf&eacute;rer vos nouveaux fichiers sur le serveur, vous devrez taper
    quelque chose comme&nbsp;:</p>
    <blockquote> 
      <pre><strong>cd lang/fr 
cvs commit</strong> </pre>
    </blockquote>
    <p>Vous devrez taper un commentaire. Votre &eacute;diteur de texte s'ouvrira.
    &Eacute;crivez quelque chose qui ait un sens et fermer l'&eacute;diteur de texte. Les
    fichiers seront envoy&eacute;s chez Sourceforge et enregistr&eacute;s. C'est tout !</p>
    <p>Pour vous &eacute;conomiser du temps, vous pouvez placer les arguments
    par d&eacute;faut dans un fichier appel&eacute; .cvsrc dans votre r&eacute;pertoire de d&eacute;part.
    Par exemple, le mien contient&nbsp;:</p>
    <blockquote> 
      <pre><strong>diff -c 
update -dP</strong> </pre>
    </blockquote>
    <p>Taper &laquo;&nbsp;cvs help&nbsp;&raquo; pour plus de d&eacute;tails ... </p>
    <p>&nbsp;</p>
  </blockquote>
  <h2>2. Utilisation de CVS sous Windows</h2>
  <blockquote> 
    <p>Pour commencer, il vous faut t&eacute;l&eacute;charger une copie compl&egrave;te de Moodle avec
    votre compte d&eacute;veloppeur.</p>
    <blockquote> 
      <p>1. T&eacute;l&eacute;chargez TortoiseCVS depuis le site
      <a target="_top" href="http://www.tortoisecvs.org/">tortoisecvs.org</a> 
      et installez-le, puis red&eacute;marrez votre machine.<br /><br />
      2. Trouvez ou cr&eacute;ez un nouveau dossier dans lequel vous allez t&eacute;l&eacute;charger
      Moodle.<br /><br />
      3. Cliquez avec le bouton droit de la souris et s&eacute;lectionnez dans le menu l'option
      &laquo;&nbsp;<strong>CVS Checkout</strong>&nbsp;&raquo;. Une bo&icirc;te de dialogue s'affiche
      alors.<br /><br />
      4. Copiez le texte ci-dessous dans le champ CVSROOT (en y pla&ccedil;ant votre
      nom d'utilisateur&nbsp;!)&nbsp;:</p>
      <blockquote> 
        <pre>:ext:<font color="#990000">myusername</font>@cvs.sourceforge.net:/cvsroot/moodle</pre>
      </blockquote>
      <p>
      5. Cliquez sur le bouton &laquo;&nbsp;<strong>Fetch list...</strong>&nbsp;&raquo;.<br /><br />
      6. Une liste de modules est affich&eacute;e &agrave; droite du bouton&nbsp;: s&eacute;lectionnez-y
      &laquo;&nbsp;<strong>moodle</strong>&nbsp;&raquo;.<br /><br />
      7.  Cliquez sur le bouton &laquo;&nbsp;<strong>OK</strong>&nbsp;&raquo; tout sera alors
      t&eacute;l&eacute;charg&eacute;.</p>
    </blockquote>
    <p>Une bo&icirc;te de dialogue affichera tous les fichiers en cours de t&eacute;l&eacute;chargement,
    et apr&egrave;s quelques instants vous aurez votre copie compl&egrave;te de Moodle.
    Apr&egrave;s ce premier &laquo;&nbsp;check out&nbsp;&raquo;, vous pourrez r&eacute;cup&eacute;rer
    les derniers fichiers modifi&eacute;s sur le serveur CVS&nbsp;:</p>
    <blockquote> 
      <p>1.  Cliquez avec le bouton droit de la souris sur votre dossier Moodle (ou
      sur n'importe quel fichier) et s&eacute;lectionnez &laquo;&nbsp;<strong>CVS Update</strong>&nbsp;&raquo;.</p>
    </blockquote>
    <p>Apr&egrave;s une modification de fichier (vous remarquerez que la couleur
    change de vert &agrave; rouge), vous pouvez les d&eacute;poser sur le serveur CVS de
    la fa&ccedil;on suivante&nbsp;:</p>
    <blockquote> 
      <p>1.  Cliquez avec le bouton droit de la souris sur votre dossier Moodle (ou
      sur n'importe quel fichier) et s&eacute;lectionnez &laquo;&nbsp;<strong>CVS
      Commit...</strong>&nbsp;&raquo;.<br /><br />
      2. Dans la bo&icirc;te de dialogue, taper une description claire des changements
      que vous avez effectu&eacute;s.<br /><br />
      3. Cliquez &laquo;&nbsp;OK&nbsp;&raquo;. Vos modifications sont alors envoy&eacute;es vers
      le serveur CVS.</p>
    </blockquote>
  </blockquote>
  <p>&nbsp;</p>
  <p align="center">Bonne chance&nbsp;!</p>
  <p>&nbsp;</p>
</blockquote>
<p align="CENTER"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>
</body>
</html>
