<html>
<head>
<title>Documentation Moodle : Foire Aux Questions (FAQ)</title>
<link rel="stylesheet" href="docstyles.css" type="text/css">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#ffffff">
<h1>Foire Aux Questions (FAQ)</h1>
<p class="normaltext">Cette page propose les r&eacute;ponses &agrave; quelques-unes des questions
les plus fr&eacute;quemment pos&eacute;es par les personnes qui installent Moodle. Si vous avez
suivi les <a href="./?file=install.html">instructions d'installation</a> mais que
vous avez encore un probl&egrave;me, cette page est vraisemblablement le meilleur
endroit o&ugrave; trouver de l'aide.</p>

<p class="normaltext">Si vous ne trouvez pas votre r&eacute;ponse ici, essayez le cours
<a href="http://moodle.org/mod/forum/index.php?id=5" target="_top">Using 
Moodle</a> sur le site moodle.org. Commencez par chercher avec quelques mots
clefs dans les forums si votre probl&egrave;me a d&eacute;j&agrave; &eacute;t&eacute; discut&eacute;. Si vous ne trouvez
rien, essayez de poser votre question dans le forum appropri&eacute;. En principe, il y aura
quelqu'un qui saura vous aider.</p>

<p class="normaltext">Si vous avez assay&eacute; sans succ&egrave;s plusieurs solutions et que vous
vous trouvez derri&egrave;re un pare-feu (firewall), il peut &ecirc;tre judicieux de reconfigurer
votre pare-feu pour &ecirc;tre s&ucirc;r qu'il ne bloque pas une fonction requise ou une
communication n&eacute;cessaire. Les pare-feu ne causent que tr&egrave;s rarement des probl&egrave;mes avec
Moodle, mais ils sont parfois responsables de fonctionnalit&eacute; r&eacute;duite, en cas de
mauvaise configuration.</p>

<p class="normaltext">Utilisez la liste ci-dessous pour aller directement &agrave; la r&eacute;ponse
correspondante.</p>

<p class="questionlink"><a href="#filenotfound">Quand je veux acc&eacute;der &agrave; un fichier ou
faire afficher un fichier que j'ai d&eacute;pos&eacute; (t&eacute;l&eacute;charg&eacute;), une erreur &laquo;&nbsp;File not
found&nbsp;&raquo; survient.</a></p>

<p class="questionlink"><a href="#php">Est-ce que PHP est install&eacute; et si oui quelle
version ?</a></p>

<p class="questionlink"><a href="#blankpages">Pourquoi toutes mes pages sont vides ?</a></p>

<p class="questionlink"><a href="#errorgetstring">Mes pages affichent des erreurs
comme : &laquo;&nbsp;call to undefined function: get_string()&nbsp;&raquo;.</a></p>

<p class="questionlink"><a href="#headerssent">Pourquoi obtiens-je toujours des messages
mentionnant &laquo;&nbsp;headers already sent&nbsp;&raquo; ?</a></p>

<p class="questionlink"><a href="#failedopen">J'obtiens toujours cette erreur : &laquo;&nbsp;Failed
opening required '/web/moodle/lib/setup.php'&nbsp;&raquo;.</a></p>

<p class="questionlink"><a href="#quotes">Les textes que j'ajoute et qui contiennent un
apostrophe (') ou des guillemets droits (&quot;) causent des erreurs ou alors sont
transcrits avec une barre oblique.</a></p>

<p class="questionlink"><a href="#sessiontmp">J'obtiens continuellement des erreurs avec
&laquo;&nbsp;session_start&nbsp;&raquo;.</a></p>

<p class="questionlink"><a href="#fixdirroot">Quand je veux afficher la page d'administration,
on me dit de modifier &laquo;&nbsp;$CFG-&gt;dirroot&nbsp;&raquo;&nbsp;!</a></p>

<p class="questionlink"><a href="#loginsetting">Je me connecte, mais le lien pour se connecter
ne change pas, alors que suis effectivement dans Moodle et peux naviguer librement dans le site.</a></p>

<p class="questionlink"><a href="#resource1">Quand j'essaie d'ajouter une ressource, je re&ccedil;ois
des messages d'erreur.</a></p>

<p class="questionlink"><a href="#noadmin">Pendant le processus de mise en place initial de
Moodle, je n'ai pas eu besoin de cr&eacute;er un compte administrateur&nbsp;!</a></p>

<p class="questionlink"><a href="#nologin">Je ne peux pas me connecter &agrave; mon site Moodle -
je reste coinc&eacute; sur la page de connexion.</a></p>

<p class="questionlink"><a href="#backup">Comment faire une copie de sauvegarde de mon site
Moodle&nbsp;?</a></p>

<p class="questionlink"><a href="#locale">Pourquoi mon site Moodle n'affiche pas correctement
l'heure et la date&nbsp;?</a></p>

<p class="questionlink"><a href="#cron">Aucune copie de messages des forums n'est envoy&eacute;e
par courriel.</a></p>

<p class="questionlink">&nbsp;</p>

<h3><a name="filenotfound"></a>Quand je veux acc&eacute;der &agrave; un fichier ou faire afficher
un fichier que j'ai d&eacute;pos&eacute; (t&eacute;l&eacute;charg&eacute;), une erreur &laquo;&nbsp;File not
found&nbsp;&raquo; survient.</h3>

<p class="answer">Par exemple&nbsp;: Not Found: The requested URL /moodle/file.php/2/myfile.jpg 
was not found on this server.</p>

<p class="answer">Votre serveur web doit &ecirc;tre configur&eacute; de mani&egrave;re que la partie de l'URL
apr&egrave;s le nom du script soit pass&eacute;e directement au script. Ce r&eacute;glage est en g&eacute;n&eacute;ral
activ&eacute; par d&eacute;faut sur Apache 1, mais d&eacute;sactiv&eacute; sur Apache 2. Pour l'activer, ajoutez cette
ligne &agrave; votre fichier httpd.conf, ou &agrave; un fichier .htaccess dans votre dossier moodle (voir
pour plus de d&eacute;tails le <a href="./?file=install.html#webserver">Guide
d'installation</a>)&nbsp;:</p>

<p class="answercode"><b>AcceptPathInfo</b> on</p>

<p class="answer">Il est &agrave; noter que cela ne fonctionnera QUE pour Apache version 2.x.</p>

<p class="answer">Si vous avez ce probl&egrave;me et n'utilisez pas Apache 2 (c'est tr&egrave;s
improbable), vous pouvez indiquer &agrave; Moodle d'utiliser une autre m&eacute;thode. Les inconv&eacute;nients
sont une leg&egrave;re perte de performance pour vos utilisateurs et qu'il sera impossible
d'utiliser des liens relatifs dans vos ressources HTML.</p>

<p class="answer">Pour utiliser cette alternative, connectez-vous comme administrateur,
allez sur la page &laquo;&nbsp;Param&egrave;tres techniques&nbsp;&raquo; et modifiez le r&eacute;glage pour
&laquo;&nbsp;<b>slasharguments</b>&nbsp;&raquo;. Le probl&egrave;me devrait alors &ecirc;tre r&eacute;gl&eacute;.</p>

<p class="answer">&nbsp;</p>

<h3><a name="php"></a>Est-ce que PHP est install&eacute; et si oui quelle version ?</h3>

<p class="answer">Cr&eacute;ez dans votre site web un nouveau fichier appel&eacute; info.php,
contenant le texte suivant uniquement, et appelez-le depuis votre navigateur&nbsp;:</p>
  
<p class="answercode">&lt;?PHP phpinfo() ?&gt;</p>

<p class="answer">Si rien ne se passe (page blanche), PHP n'est pas install&eacute;. Voyez
le <a href="./?file=installamp.html">Guide d'installation</a> pour des
informations sur son installation.</p>

<p class="answer">&nbsp;</p>

<h3><a name="blankpages"></a>Pourquoi toutes mes pages sont vides ?</h3> 

<p class="answer">V&eacute;rifiez que la variable dirroot de votre fichier config.php
soit r&eacute;gl&eacute;e correctement. Vous devez utiliser un chemin absolu et complet, par
exemple&nbsp;:</p>

<p class="answercode"> $CFG-&gt;dirroot = "d:\inetpub\sites\www.yoursite.com\web\moodle";</p>

<p class="answer">Pour le syst&egrave;me d'exploitations Redhat Linux, veuillez consulter&nbsp;:
<a href="http://moodle.org/doc/?file=installamp.html">Redhat Linux</a></p>

<p>&nbsp; </p>

<h3><a name="errorgetstring"></a>Mes pages affichent des erreurs
comme : &laquo;&nbsp;call to undefined function: get_string()&nbsp;&raquo;.</h3>

<p class="answer">Si vous voyez des messages comme ceux-ci&nbsp;:</p>

<p class="answercode">Parse error: parse error, unexpected T_VARIABLE in c:\program 
files\easyphp\www\moodle\config.php on line 94 <br>
Fatal error: Call to undefined function: get_string() in c:\program files\easyphp\www\moodle\mod\resource\lib.php 
on line 11</p>

<p class="answer">il est probable que vous avez oubli&eacute; un point-virgule ou un guillemet
&agrave; la fin d'une ligne de votre fichier config.php (avant la ligne 94 dans cet exemple).</p>

<p class="answer">Une autre raison possible est la suivante&nbsp;: vous avez modifi&eacute;
config.php dans un programme de traitement de texte comme Word, et l'avez enregistr&eacute;
en format HTML au lieu du format texte.</p>

<p>&nbsp;</p>

<h3><a name="headerssent"></a>Pourquoi obtiens-je toujours des messages
mentionnant &laquo;&nbsp;headers already sent&nbsp;&raquo; ?</h3>

<p class="answer">Si vous voyez des messages comme celui-ci&nbsp;:</p>

<p class="answercode">Warning: Cannot add header information - headers already 
sent by (output started at /webs/moodle/config.php:87) in /webs/moodle/lib/moodlelib.php 
on line 1322 </p>

<p class="answercode">Warning: Cannot add header information - headers already 
sent by (output started at /webs/moodle/config.php:87) in /webs/moodle/lib/moodlelib.php 
on line 1323 </p>

<p class="answercode">Warning: Cannot add header information - headers already 
sent by (output started at /webs/moodle/config.php:87) in /webs/moodle/login/index.php 
on line 54 </p>

<p class="answer">Vous avez vraisemblablement des lignes ou des espaces vides
apr&egrave;s la balise ?&gt; finale de votre fichier config.php. Certains &eacute;diteurs de texte
(comme Notepad sous Windows) ajoutent de tels caract&egrave;res. Essayez de supprimer
totalement ces caract&egrave;res avec un autre programme.</p>

<p class="answer">&nbsp;</p>

<h3><a name="failedopen"></a>J'obtiens toujours cette erreur : &laquo;&nbsp;Failed
opening required '/web/moodle/lib/setup.php'&nbsp;&raquo;.</h3>

<p class="answer">Dans votre fichier config.php, le r&eacute;glage de la variable dirroot
doit &ecirc;tre le <strong>chemin complet du dossier du serveur web, depuis le sommet de
la hi&eacute;rarchie (la racine) du disque dur</strong>.</p>

<p class="answer">Parfois, certains utilisent le chemin de leur dossier personnel,
ou encore le chemin relatif du dossier du serveur web.</p>

<p class="answer">&nbsp;</p>

<h3><a name="quotes" id="quotes"></a>Les textes que j'ajoute et qui contiennent un
apostrophe (') ou des guillemets droits (&quot;) causent des erreurs ou alors sont
transcrits avec une barre oblique.</h3>

<p class="answer">Les probl&egrave;mes caus&eacute;s par des apostrophes sont dus &agrave; un r&eacute;glage
incorrect des &laquo;&nbsp;magic quotes&nbsp;&raquo;. Moodle n&eacute;cessite les r&eacute;glages suivants
(qui sont habituellement corrects par d&eacute;faut)&nbsp;:</p>

<p class="answercode">magic_quotes_gpc = On<br>
magic_quotes_runtime = Off</p>

<p class="answer">Pour plus de d&eacute;tails, r&eacute;f&eacute;rez-vous &agrave; la section du guide d'installation
sur la <a href="./?file=install.html#webserver">configuration du serveur web</a>.</p>

<p class="answer">&nbsp;</p>

<h3><a name="sessiontmp"></a>J'obtiens continuellement des erreurs avec
&laquo;&nbsp;session_start&nbsp;&raquo;.</h3>

<p class="answer">Si vous voyez des messages comme ceux-ci&nbsp;:</p>

<p class="answercode">Warning: session_start() [function.session-start]: open(/tmp\sess_d40f380d37d431fc1516e9a895ad9ce0, O_RDWR) failed: No such file or directory (2) in G:\web\moodle\lib\setup.php on line 123</p>

<p class="answercode">Warning: session_start() [function.session-start]: open(/tmp\sess_d40f380d37d431fc1516e9a895ad9ce0, O_RDWR) failed: No such file or directory (2) in G:\web\moodle\lib\setup.php on line 123</p>

<p class="answercode">Warning: session_start() [function.session-start]: Cannot send session cache limiter - headers already sent (output started at G:\web\moodle\lib\setup.php:1) in G:\web\moodle\lib\setup.php on line 123</p>


<p class="answer">Ces messages indiquent que PHP n'arrive pas &agrave; enregistrer des
fichiers de &laquo;&nbsp;session&nbsp;&raquo; sur votre disque dur (dans un dossier appel&eacute; /tmp).
Cela signifie habituellement que ce dossier /tmp N'EXISTE PAS sur votre serveur. C'est
en g&eacute;n&eacute;ral le cas sous Windows.</p>


<p class="answer">Pour corriger ce probl&egrave;me, il faut modifier ce r&eacute;glage de PHP en le faisant
pointer vers un dossier existant. Il suffit pour cela d'ajouter au fichier php.ini la
ligne&nbsp;:</p>

<p class="answercode">session.save_path = C:\temp</p>

<p class="answer">ou alors de taper dans un fichier .htaccess de votre dossier moodle
la ligne&nbsp;:</p>

<p class="answercode">php_value session.save_path "/home/moodle/sessions"</p>

<p class="answercode">&nbsp;</p>


<h3><a name="fixdirroot"></a>Quand je veux afficher la page d'administration,
on me dit de modifier &laquo;&nbsp;$CFG-&gt;dirroot&nbsp;&raquo;&nbsp;!</h3>

<p class="answer">Si vous voyez des messages comme ceux-ci dans Moodle 1.0.9&nbsp;:</p>

<table class="generalbox" cellspacing="0" cellpadding="5" align="center" border="0">
<tbody><tr><td bgcolor="#ffbbbb">Please fix your settings in config.php: 
<p>You have:</p>
<p>$CFG-&gt;dirroot = "/home/users/fred/public_html/moodle"; </p>
<p>but it should be: </p>
<p>$CFG-&gt;dirroot = "";</p>
</td></tr></tbody></table>

<p class="answer">c'est que vous &ecirc;tes victime d'un petit bogue survenant sur
certains serveurs. Le probl&egrave;me est d&ucirc; au m&eacute;canisme de v&eacute;rification des erreurs,
et non au chemin du fichier lui-m&ecirc;me. Pour corriger ce probl&egrave;me, localisez cette
ligne (la ligne 66) du fichier admin/index.php&nbsp;:</p>

<p class="answercode">if ($dirroot != $CFG-&gt;dirroot) {</p>

<p class="answer">et remplacez-la par celle-ci&nbsp;:</p>

<p class="answercode">if (!empty($dirroot) and $dirroot != $CFG-&gt;dirroot) {</p>

<p class="answercode">&nbsp;</p>

<h3><a name="loginsetting"></a>Je me connecte, mais le lien pour se connecter
ne change pas, alors que suis effectivement dans Moodle et peux naviguer librement
dans le site.</h3>

<p class="answer">V&eacute;rifiez que l'URL sp&eacute;cifi&eacute; dans le r&eacute;glage CFG-&gt;wwwroot est
exactement identique &agrave; celui que vous utilisez pour acc&eacute;der au site.</p>

<p class="answer">&nbsp;</p>

<h3><a name="resource1"></a>Quand j'essaie d'ajouter une ressource, je re&ccedil;ois
des messages d'erreur.</h3>

<p class="answer">En admettant que vous utilisez Apache, il est probable que
votre r&eacute;glage de $CFG-&gt;wwwroot dans le fichier config.php est diff&eacute;rent de l'URL
que vous utilisez pour acc&eacute;der au site. Essayez aussi de d&eacute;sactiver le r&eacute;glage
&laquo;&nbsp;<b>secureforms</b>&nbsp;&raquo; dans la configuration des param&egrave;tres du site.</p>

<p class="answer">&nbsp;</p>

<h3><a name="noadmin"></a>Pendant le processus de mise en place initial de
Moodle, je n'ai pas eu besoin de cr&eacute;er un compte administrateur&nbsp;!</h3>

<p class="answer">Ceci est un bogue connu de Moodle jusqu'&agrave; la version 1.0.9.
Le bogue est corrig&eacute; dans la version 1.1.</p>

<p class="answer">Ce bogue n'atteint pas tous le monde. Il ne survient que
si la personne qui installe Moodle a dans son navigateur un cookie d'un
autre site, dont le nom est &laquo;&nbsp;user&nbsp;&raquo;, &laquo;&nbsp;admin&nbsp;&raquo; ou
&laquo;&nbsp;teacher&nbsp;&raquo;.</p>

<p class="answer">Pour corriger rapidement ce probl&egrave;me, il suffit de supprimer
ces cookies de votre navigateur avant de proc&eacute;der &agrave; l'installation (peut-&ecirc;tre
avec un autre navigateur), ou de modifier le fichier moodle/admin/user.php en y
ins&eacute;rant ces lignes (au d&eacute;but du fichier)&nbsp;:</p>

<p class="answercode">unset($user);<br />unset($admin);<br />unset($teacher);</p>

<p class="answer">Une fois ces corrections effectu&eacute;es, il serait de judicieux
d'effacer toutes les tables de votre base de donn&eacute;es et de r&eacute;installer Moodle
depuis le d&eacute;but.</p>

<p class="answer">&nbsp;</p>

<h3><a name="nologin"></a>Je ne peux pas me connecter &agrave; mon site Moodle -
je reste coinc&eacute; sur la page de connexion.</h3>

<p class="answer">La cause principale de ce probl&egrave;me est que votre ordinateur
(et non le serveur sur lequel est install&eacute; Moodle) a une programme pare-feu
(firewall) actif, qui filtre des informations (referrer) de votre navigateur. Voici
quelques instructions (en anglais) pour corriger cela avec
<a href="http://service1.symantec.com/SUPPORT/nip.nsf/46f26a2d6dafb0a788256bc7005c3fa3/b9b47ad7eddd343b88256c6b006a85a8?OpenDocument&amp;src=bar_sch_nam">Norton firewall</a>.</p>

<p class="answer">L'administrateur du serveur Moodle peut aussi corriger cela
en r&eacute;glant sur la page de configuration des param&egrave;tres le r&eacute;glage &laquo;&nbsp;<b>secureforms</b>&nbsp;&raquo;
sur &laquo;&nbsp;Non&nbsp;&raquo;.</p>

<p class="answer">Une autre cause possible de ce probl&egrave;me est une mauvaise
configuration des sessions sur le serveur. Vous pouvez tester cela en appelant
le script http://yourserver/moodle/lib/session-test.php dans votre navigateur.</p>

<p class="answer">&nbsp;</p>

<h3><a name="backup"></a>Comment faire une copie de sauvegarde (backup) de mon site
Moodle&nbsp;?</h3>

<p class="answer">Il y a deux choses &agrave; copier pour faire une copie de sauvegarde
de votre site&nbsp;: la base de donn&eacute;es et les fichiers d&eacute;pos&eacute;s. Les fichiers de
Moodle sont moins importants, puisque vous pouvez toujours en t&eacute;l&eacute;charger une
copie au besoin.</p>

<p class="answer">Les copies peuvent se faire de multiples fa&ccedil;ons. Voici une proc&eacute;dure
d&eacute;taill&eacute;e que vous pouvez utiliser sous Unix pour copier la base de donn&eacute;es. Mettre en
place un script qui ferait cela automatiquement chaque jour &agrave; l'aide de cron
est une bonne id&eacute;e.</p>

<p class="answercode">cd /my/backup/directory</p>

<p class="answercode">mv moodle-database.sql.gz moodle-database-old.sql.gz</p>

<p class="answercode">mysqldump -h example.com -u myusername --password=mypassword -C
-Q -e -a mydatabasename &gt; moodle-database.sql</p>

<p class="answercode">gzip moodle-database.sql</p>

<p class="answer">Pour les fichiers d&eacute;pos&eacute;s, vous pouvez utiliser rsync, afin de copier
sur un autre ordinateur uniquement les fichiers ayant &eacute;t&eacute; modifi&eacute;s&nbsp;:</p>

<p class="answercode">rsync -auvtz --delete -e ssh mysshusername@example.com:/my/server/directory 
/my/backup/directory/</p>

<p class="answercode">&nbsp;</p>

<h3><a name="locale"></a>Pourquoi mon site Moodle n'affiche pas correctement
l'heure et la date&nbsp;?</h3>

<p class="answer">Chaque langue n&eacute;cessite un code de langue sp&eacute;cifique (appel&eacute; un
<strong>locale</strong>) qui permet d'afficher les heures et dates dans le
format ad&eacute;quat. Les fichiers de langue contiennent un certain nombres de codes
standard, mais ceux-ci ne fonctionnent pas toujours sur les serveurs Windows.</p>

<p class="answer">Vous trouverez le fichier locale correct pour Windows sur ces deux
pages&nbsp;: <a href="http://msdn.microsoft.com/library/default.asp?url=/library/en-us/vclib/html/_crt_language_strings.asp" target="_blank">Language 
codes</a> et <a href="http://msdn.microsoft.com/library/default.asp?url=/library/en-us/vclib/html/_crt_country_strings.asp" target="_blank">Country/region 
codes</a>.</p>

<p class="answer">Ces nouveaux fichiers locale peuvent &ecirc;tre entr&eacute;s sur la page de
configuration des param&egrave;tres de Moodle. Ils remplaceront ceux qui sont fournis dans les
fichiers de la langue choisie.</p>

<p class="answer">&nbsp;</p>

<h3><a name="cron"></a>Aucune copie de messages des forums n'est envoy&eacute;e
par courriel.</h3>

<p class="answer">Vous <strong>devez</strong> mettre en place un cron, si vous d&eacute;sirez
que Moodle envoie automatiquement des copies des messages des forums, journaux, devoirs,
etc. Ce m&ecirc;me processus effectue en outre certaines t&acirc;ches de nettoyage, comme supprimer
les utilisateurs non confirm&eacute;s, d&eacute;sinscrire les anciens &eacute;tudiants des cours, etc.</p>

<p class="answer">Le principe est de mettre en place un processus qui
appelle r&eacute;guli&egrave;rement le fichier http://yoursite/admin/cron.php. R&eacute;f&eacute;rez-vous &agrave; la
<a href="./?file=install.html#cron">section sur le cron du Guide d'installation</a>.</p>

<p class="answer">Un conseil&nbsp;: commencez avec les r&eacute;glages par d&eacute;faut des param&egrave;tres
de configuration de Moodle. Laissez vide l'h&ocirc;te SMTP (smtphost). Un tel r&eacute;glage fonctionne
pour la majorit&eacute; des utilisateurs.</p>

<p class="answer">&nbsp;</p>

<p class="answer">&nbsp;</p>
<hr>

<p align="center" class="normaltext"><a href="ma&amp;#105&amp;#108t&amp;#111:ma%72%74in@%6d%6fo%64%6c%65.o%72g" title="mar&amp;#116&amp;#105n@&amp;#109oo&amp;#100&amp;#108&amp;#101&amp;#46&amp;#111&amp;#114g">Proposer 
une nouvelle question</a> (merci d'inclure la r&eacute;ponse&nbsp;!)</p>
<hr>

<p align="right"><strong><em>Merci &agrave; John Eyre pour l'aide dans la maintenance de cette FAQ.</em></strong></p>

<p align="CENTER"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>

<p align="CENTER"><font size="1">Version: $Id: faq.html,v 1.6 2003/03/30 13:54:28 
moodler Exp $</font></p>

</body>
</html>
