<P ALIGN=CENTER><B>&Uuml;bereinstimmung &uuml;ber die Bewertung</B></P>

<P>Eine Workshopaufgabe kann jede der nachfolgenden Charakteriksen haben:

<OL>
<LI>In der Phase des Einreichens und der Bewertung gibt es keine R&uuml;ckmeldung von den Einreichern zu den Beurteilern unter den Teilnehmer/innen. Feedback von den Lehrern ist m&ouml;glich, wenn diese eine Bewertung der Arbeiten vorgesehen haben. Die Bewertung kann sichtbar gemacht werden f&uuml;r den Teilnehmer, dessen Arbeit bewertet wird und f&uuml;r die Teilnehmer, die diese Arbeit mitbewertet haben. Es gibt dabei diesen einen Weg der R&uuml;ckmeldung unter den Teilnehmer &uuml;ber die eingereichten Arbeiten.

<LI>In dieser Phase k&ouml;nnen aber auch Einstellungen so vorgenommen werden, dass die Teilnehmer/innen die Bewertungen sehen und kommentieren k&ouml;nnen. Sie k&ouml;nnen ihre Zustimmung oder auch ihre abweichende Meinung zu der Bewertung anderer Teilnehmer/innen &auml;u&szlig;ern.
        Wenn sie der Bewertung zustimmen, bleibt diese bestehen und flie&szlig;t in die Abschlu&szlig;note ein, sofern eine Auswetung der gegenseitigen Bewertungen als Bestandteil der Gesamtbeurteilung vorgenommen wird. Wenn die Bewertung keine Zustimmung findet, kann sie &uuml;berarbeitet werden. Dieser Prozess der &Uuml;berarbeitug kann solange fortgesetzt werden, bis alle der Bewertung zustimmen oder bis der vordefinierte Endzeitpunkt erreicht ist. Eine Bewertung, f&uuml;r die bis zum Schlu&szlig;zeitpunkt keine Zustimmung erzielt wurde, flie&szlig;t nicht in die Endbewertung ein. Hierbei ergibt sich die M&ouml;glichkeit zu einem Dialog &uuml;ber die Bewertung unter den Teilnehmer/innen f&uuml;r jede eingereichte Arbeit.
</OL>
<P>Wenn die zweite Methode gew&auml;hlt wird, gibt es die M&ouml;glichkeit, die Anzeige der Benotungen auszublenden.  Die Teilnehmer/innen sehen dann nur die Kommentare, die als Bewertung abgegeben wurden.
        Die Note werden erst angezeigt, wenn eine &Uuml;bereinstimmung &uuml;ber die Bewetung erzielt wurde. Diese Option ist jedoch nur dann sinnvoll wenn eine &Uuml;bereinstimmug &uuml;ber die Bewertungen von besonderer Bedeutung ist.

</P>