<P ALIGN=CENTER><B>Analyse der Bewertungen</B></P>

<P>Diese Analyse befasst sich gleicherma&szlig;en mit den Bewertungen der Beispielaufgaben, wie mit den Bewertungen w&auml;hrend der Selbstbewertungsphase durch die anderen Teilnehmer/innen. Es ber&uuml;cksichtigt die besseren Bewertungen aus den Bewertungen der Dozent/innen und der Teilnehmer/innen Diese  &quot;guten&quot; Bewertungen werden dann f&uuml;r die Berechnung der Gesamtnote verwandt.</p>

<p>Die Analyse wird am besten erst dann durchgef&uuml;hrt, wenn die Bewertungen der Dozent/innen vorliegen. Diese Bewertung kann als Ma&szlig;stab (Benchmark) f&uuml;r die Einsch&auml;tzungen der Bewertungen der Teilnehmer/innen genutzt werden. Der/die Dozent/in mu&szlig; <b>nicht</b> alle &Uuml;bungsaufgaben und alle eingereichten Arbeiten bewerten. Damit die Analyse nun aber aussagekr&auml;ftig ist, sollte  der/die Dozent/in mehr Arbeiten bewertet haben als die Teilnehmer/innen dies im Durchschnitt getan haben.  Je mehr Bewertungen des/der Dozent/in vorliegen, desto verl&auml;sslicher wird auch das Ergebnis dieser Analyse sein.  </p>

<p>Die Analyse wird sinnvollerweie mehrfach durchgef&uuml;hrt, jedesmal wenn eine oder mehrere der verf&uuml;gbaren Optionen ge&auml;ndert wurde. Die verschiedenen Optionen werden durch die Einstellungen oben auf der Seite gesteuert.   </p>

<ol><li>Auf der Ebene der Fehleranalyse wird beim Laden der Bewertungen der Dozent/innen die Gewichtung ihrer Bewertungen im Vergleich mit den Bewertungen anderer Teilnehmer/inen definiert. Wenn das Gewicht der Dozent/innen-Bewertung hoch sein soll,, dann sollte er/sie &uuml;ber den niedrigsten durchschnittlichen Fehler in der Tabelle verf&uuml;gen. Wenn er/die Dozent/in nicht als erstes in der Liste aufgef&uuml;hrt wird, sollte der Wert f&uuml;rt den/die Dozent/in erh&ouml;ht werden, bis er/sie die niedrigste Rate hat. Das f&uuml;hrt dazu, dass die Dozent/innen-Bewertungen dominieren und gleichlautende Bewertungen der Teilnehmer/innen ebenfalls an der Spitze der Tabelle aufgef&uuml;hrt werden. Bewertungen anderer Teilnehmer/innen, die sich am Ende der Tabelle befinden, verweisen darauf, dass sie Bewertungen abgegeben haben, die von der Bewertung des/der Dozent/in abweichen. Je mehr Bewertungen des/der Dozent/in vorhanden sind,  desto weniger ist es erforderlich die Gewichtung zu korrigieren. Diese Option nimmt keinen Einflu&szlig; auf die Berechnung der Schlu&szlig;note. In dieser Berechnung der Note wird ein Durchschnittswert aller vorhandenen Noten ermittelt, gleich ob sie von den Dozent/innen oder den Teilnehmer/innen stammen.
</li>

<li>Die Gewichtung f&uuml;r die Benotung der Aufgaben wird in der Berechnung der Schlu&szlig;note ber&uuml;cksichtigt. Ein einfaches Formular dient der Berechnung der Leistung der Teilnehmer/innen. Es ist das Verh&auml;ltbis guter Beurteilungen im Vergleich zur maximalen Zahl der m&ouml;glichen Einsch&auml;tzungen.  Wenn z.B. 3 Einsch&auml;tzunge zu den &Uuml;bungsaufgaben und 5 Einsch&auml;tzungen zu den  eingereichten Arbeiten abgegeben werden sollen und ein/e Teilnehmer/in hat  7 Beurteilungen vorgenommen und eine ist herausgenommen worden (siehe unten), dann wird ihre Bewertungsleistung mit (7-1)/8, also 75 % ermittelt. Die Gesamtnote wird nun aus der gewichteten Kombination der Bewertungsleistungen und den Bewertungen der eigenen Aufgabenstellung errechnet. Die Gewichtungen der ebiden Faktoren sind immer zun&auml;chst auf 1 gesetzt. Beide Teile werden danach gleich stark gewichtet. Wenn Sie nun die Gewichtung f&uuml;r die eigene L&ouml;sung der Aufgabe auf 0,5 setzen z&auml;hlt diese 33 % der Gesamtbewertung, da die Gewichtung f&uuml;r die  Bewertunegn an derer Arbeiten weiterhin bei 1 steht.  0,5 + 1 = 33% / 66 %  </li>
<li>Der Prozentsatz der Bewertungen, der bei der Berechnung der Gesamtnote nicht ber&uuml;cksichtigt wird, kann auf zwei verschiedene Arten festgelegt werden.
<ul><li>Wenn die Teilnehmer/innen alle Bewertungen vorgenommen haben, k&ouml;nnen sie die volle Punktzahl nur dann erreichen wenn keine Bewertungen bei der Berechnung herausfallen. Wenn diese Option auf 30 % eingestellt wird, wird erreicht, dass die durchschnittliche Bewertungsleistung aus 70% der Bewertungen errechnet wird (30 % fallen f&uuml;r die Bewertung weg)..</li>
<li>Alternativ kann die Zahl der nicht ber&uuml;cksichtigten Bewertungen in der vierten Spalte der Tabelle eingestellt werden.
</ul>
</ol>
<p>Zus&auml;tzlich zur Fehlertabelle listet die Analyse die Bewertungen aller Bewertungen und Noten auf. Diese Tabelle sollte durchgesehen werden, um festzustellen, ob die Noten nachvollziehbar sind. Wenn viele Bewertungen herausfallen, kann es sein, dass einige Arbeiten gar nicht bewertet werden und die Basis f&uuml;r die Errechnung der Schlu&szlig;note sehr niedrig ist. Die Analyse zeigt die Zahl der eingereichten Arbeiten am Anfang der Tabelle und kurz vor der Notentabelle an. Diese beiden Zahlen sollten identisch sein. Wenn eine oder mehrere Arbeiten unbewertet sind und der /die Dozent/in die Zhal der nicht ber&uuml;cksichtigten Arbeiten nicht ver&auml;ndern will, mu&szlig; er/sie die Arbeit selbst bewerten und  die Analyse wiederholen. Es ist unbedingt erforderlich, dass alle Arbeiten bewertet werden, bevor die Schlu&szlig;note ver&ouml;ffentlicht wird.
</p>
<p>Ber&uuml;cksichtigen Sie das Gleichgewicht zwischen der Zahl der herausfallenden Bewertungen und der Gesamtbenotung. Je mehr Bewertungen herausfallen, desto niedriger wird die Punktzahl der Gesamtnote bei der Addition ausfallen. Wenn schlechte Bewertungen nicht aus der Gesamtnote herausgenommen werden, werden die Teilnehmer/innen sich &uuml;ber Qualit&auml;t der Bewertungen beschweren. Vorausgesetzt, dass ausreichend Arbeiten von dem/der Dozent/in bewertet wurden, ist ein Wert von 15 % bis 30 % an herausfallenden Bewertungen begr&uuml;ndbar.

</p>
<p>Hinweis: Diese Analysen ben&ouml;tigen einige Zeit und erfordern einen iterativen Prozess. Mit Verz&ouml;gerungen mu&szlig; daher gerechnet werden.
</p>
