<P ALIGN=CENTER><B>Berechnung der Schlu&szlig;noten</B></P>

<P>Die Tabelle zeigt wie die Schlu&szlig;note berechnet wird. Die Note kann sich aus bis zu f&uuml;nf verschiedenen Teilen zusammensetzen.

<OL>
<LI>Die Lehrerbewertung f&uuml;r die eingereichte Aufgabe. Diese Option wird genutzt, wenn der Lehrer die Aufgabe bewerten soll. Wenn die/der Teilnehmer/in mehr als eine Arbeit einreicht, wird die &quot;beste&quot; Bewertung verwendet. Die beste Arbeit ist in diesem Zusammenhang, die Arbeit mit der besten Gesamtnote aus den verschiedenen Kriterien (z.B. Lehrernote, Teilnehmerbewertung)
<LI>Der Durschnitt aus den Bewertung durch die anderen Teilnehmer/innen. Auch hier wird, wenn mehr als eine Arbeit des/der Teilnehmers/in  eingereicht wurde, die &quot;best&quot;bewerteteste verwandt. Die Bewertung der andeen Teilnehmer/innen kann auch die Bewertung des Lehrers umfassen. Dies kann sinnvoll sein, wenn die Zhal der Bewertungen sehr gering ist oder Zweifel an der angemessenen Bewertung durch die Teilnehmer/innen besteht. Wenn die Note des Lehrers an dieser Stelle mit ber&uuml;cksichtigt wird, geht sie als einfache Bewertung mit in die Ermittlung der Durchschnittsbewertung ein.
<LI>Die Tendenz der Teilnehmerbewertung. Hier wird bewertet, ob die Teilnehmer/innen sich gegenseitig zu hoch oder zu niedrig bewertet haben. Die Messung ber&uuml;ht auf der Differenz zwischen der Teilnehmernote und dem Durchschnitt aus der Bewertung der anderen Teilnehmer/innen f&uuml;r jede Aufgaben stellung, die sie bewertet haben. Diese Komponente sollte bei der Zusammensetzung der Schlu&szlig;note nicht allzu hoch gewichtet werden.
<LI>Die Zuverl&auml;ssigkeit der Bewertung durch die Teilnehmer/innen. Dieser Ma&szlig;stab verdeutlicht wie gro&szlig; die 'Streuung' der Bewertung durch die Teilnehmer/innen ist. Theoretisch ausgedr&uuml;ckt: die Zuverl&auml;ssigkeit ist hoch, wenn gute Arbeiten gut und weniger gute Arbeiten schlechter bewertet werden. Wenn Zweifel daran bestehen, dass die Bewertung durch die Teilnehmer/innen angemessen ausf&auml;llt, sollte die Bewertung des Lehrers in die Durchschnittsnote der Teilnehmer/innen  einberechnet werden. Dadurch werden die angemessenen Bewertungen st&auml;rker bedeutungsvoller.
<LI>Die durchschnittliche Bewertung des Lehrers f&uuml;r die Teilnehmer/innen. Dieser Wert ber&uuml;cksichtigt sowohl die vorl&auml;ufigen Bewertungen durch die Teilnehmer/innen f&uuml;r die Beispielarbeiten und die Bewertungen des Lehrers w&auml;hrend der Beurteilung durch die Teilnehmer/innen f&uuml;r die eingereichte Arbeit.
 Grunds&auml;tzlich  sollte diese Komponente wichtiger sein als die Tendenz- und die Zuverl&auml;ssigkeitskomponente und sollte daher auch entsprechend h&ouml;her bei der Berechnung der Gesamtnote bewichtet werden.
</OL>

<P>Diese f&uuml;nf Komponenten k&ouml;nnen so gewichtet werden, wie es f&uuml;r die Aufgabenstellung f&uuml;r hilfreich gehalten wird. Z.B. sollte die Gewichtung der Lehrernote h&ouml;her sein, wenn der Bewertung der Teilnehmer/innen untereinander, eine geringere Bedeutung bei der Bearbeitung der Aufgabenstellung zugemessen wird.  Andererseits kann, wenn der der Lehrer nur einige Teile der Aufgabenstellung bewertet, diesem kein Gewicht beigemessen werden. Wenn die Aufgabenstellung jedoch die Bewertung der Teilnehmer/innen untereinander besonders betonen soll, kann die Gewichtung der ersten beiden o.g. Komponenten niedrig oder mit Null bei der Berechnung der Schlu&szlig;note festgelegt werden.

<P>Diese &Uuml;bersicht wird nach und nach angelegt. Die Abschlu&szlig;noten sind f&uuml;r die Teilnehmer/innen &uuml;blicherweise erst nach Abschlu&szlig; der Aufgaben und der Benotung sichtbar.N
</P>