<P ALIGN=CENTER><B>Eine Workshopaufgabe managen</B></P>

<P>Eine Workshopaufgabe ist weitaus komplexer als eine normale Aufgabenstellung. Sie umfasst eine ganze Reihe von Schritten und Phasen. Dies sind:
<OL>
<LI>Die Beurteilung der Aufgabe sollte mehrere Beurteilungselemente umfassen. Diese machen die Bewertung wesentlich weniger willk&uuml;rlich und geben den Teilnehmer/innen eine Grundlage f&uuml;r ihre Einsch&auml;tzungen.  Der Lehrer hat die Aufgabe, die Pr&uuml;fungselememte festzulegen und ein Bewertungsblatt bereitzustellen.

        <P>Mit der Festlegung der Pr&uuml;fungselememnte wird der Lehrer normalerweise eine Reihe von Beispielarbeiten zur Verf&uuml;gung stellen. Diese dienen den TeilnehmerInnen als &Uuml;bungsbeispiel zur Abgabe einer Einsch&auml;tzung (Bewertng), bevor sie ihre eigene Arbeit beginnen. Die Beispielarbeiten k&ouml;nnen aus fr&uuml;heren Pr&uuml;fungen stammen. Die Einsch&auml;tzungen werden vom Lehrer bewertet, bevor die Teilnehmer/innen ihre Pr&uuml;fungsaufgabe bearbeiten. Die Teilnehmer/innen sehen somit nicht nur Beispiell&ouml;sungen, sondern auch Beispielbewertungen und gewinnen mehr klarheit &uuml;ber die Anforderungen.
        <P>Die Beispielaufgaben sind eine Option. Es kann Pr&uuml;fungssituationen geben in denen dieser Schritt nicht geeignet ist. Er kann dann einfach ausgelassen werden.

<LI>Die Pr&uuml;fung hat nun f&uuml;r die Teilnehmer/innnen begonnen. Wenn der Lehrer eine Reihe von Beispielarbeiten bereitgestellt hat, werden die Teilnehmer/innen aufgefordert einige dieser Arbeit zu bewerten. Der Lehrer benotet diese Bewertungen. Die Teilnehmer/innen m&uuml;ssen bei ihrer Bewertung erst einen zufriedenstellenden Standard erreichen, bevor sie ihre eigenen Arbeit beginnen.
        Wenn als &quot;zufriedenstellender Standard&quot; 40% festgelegt wurde, kann ein/e Teilnehmer/in ihre eigene Arbeit beginnen, wnen diese Quote ereicht wurde.
        <P>Wenn der/die Teilnehmer/in eine eigenen Arbeit eingereicht hat, kann er Lehrer diese bewerten (falls vorgesehen). Diese Bewertung kann in die Endbewertung einbezogen werden. Die Bewertung kann noch w&auml;hrend der Bearbeitungszeit erstellt werden oder erst nach dem Abgabezeitpunkt f&uuml;r die Arbeiten.
        <P>Wenn eine Teilnehmerbewertung in der Pr&uuml;fung vorgesehen ist, erhalten Teilnehmer/innen ,die ihre eigene Arbeit abgeschlossen haben, die Arbeiten anderer Teilnemer/innen zur Bewertung einsehen. Nach ihrer Bewertung kann der bewertete Teilnehmer diese einsehen. Der Lehrer kann wenn gew&uuml;nscht auch diese Bewertung benoten und diese Note bei der Abschlu&szlig;note ber&uuml;cksichtigen.

<LI>Nachdem der Abgabetermin verstrichen ist, startet der Lehrer die n&auml;chste Phase. Die weitere Abgabe von Arbeiten oder von Kommentaren durch die Teilnehmer/innen ist nun nicht mehr m&ouml;glich. Der Lehrer kann nun die Teilnehmerbewertungen benoten. Dies ist jedoch nicht unbedingt erforderlich. Die &quot;Bewertungsleistung&quot; jeder/s Teilnehmers/in kann durch die vergebenen Punktewerte ermittelt werden.  Der Lehrer berechnet nun die Endnote f&uuml;r alle Teilnehmer/innen. Sie setzen sich normalerweise aus drei Teilen zusammen,
        die Bewertung des Lehrers f&uuml;r die Arbeit des/der Teilnehmers/in, die mittlere Bewertung durch die Teilnehmer/innen f&uuml;r die Arbeit und die Leistung des Teilnehmers/in bei der Bewertung anderer Arbeiten.
        Diese drei Brewertungskriterien k&ouml;nnen vom Lehrer unterschiedlich gewichtet werden, um die Gesamtnote zu ermitteln.

<LI>Die abschlie&szlig;ende Phase der Pr&uuml;fung besteht in der Freigabe der Noten zur Einsicht durch die Teilnehmer/innen. Der Lehrer kann auch jetzt noch Ver&auml;nderungen an den Bewertungen vornehmen und die Schlu&szlig;note neu berechnen.
</OL>

</P>