<p align="center"><b>Eine Workshopaufgabe managen</b></p>
<p>Eine Workshopaufgabe ist weitaus komplexer als eine normale
Aufgabenstellung. Sie umfasst eine ganze Reihe von Schritten und
Phasen. Dies sind:</p>
<ol>
<li>
<p><b>Beurteilung einrichten</b> Die Beurteilung der Aufgabe
sollte mehrere Beurteilungselemente umfassen. Diese machen die
Bewertung wesentlich weniger willk&uuml;rlich und geben den
Teilnehmer/innen eine Grundlage f&uuml;r ihre
Einsch&auml;tzungen. Der/die Trainer/in hat die Aufgabe, die
Pr&uuml;fungselememte festzulegen und ein Bewertungsblatt
bereitzustellen.</p>
<p>Mit der Festlegung der Pr&uuml;fungselemente wird der/die Trainer/in
normalerweise eine Reihe von Beispielarbeiten zur Verf&uuml;gung
stellen. Diese dienen den Teilnehmer/innen als &Uuml;bungsbeispiel
zur Abgabe einer Einsch&auml;tzung (Bewertung), bevor sie ihre
eigene Arbeit beginnen. Die Beispielarbeiten k&ouml;nnen aus
fr&uuml;heren Pr&uuml;fungen stammen. Die Einsch&auml;tzungen
werden von der/dem Trainer/in bewertet, bevor die Teilnehmer/innen ihre
Pr&uuml;fungsaufgabe bearbeiten. Die Teilnehmer/innen sehen somit
nicht nur Beispiell&ouml;sungen, sondern auch Beispielbewertungen
und gewinnen mehr Klarheit &uuml;ber die Anforderungen (in der
n&auml;chsten Phase).</p>
<p>ie Beispielaufgaben sind eine Option. Es kann
Pr&uuml;fungssituationen geben in denen dieser Schritt nicht
geeignet ist. Er kann dann einfach ausgelassen werden.</p>
</li>
<li>
<p><b>Einreichen erlauben</b> Die Pr&uuml;fung hat nun f&uuml;r
die Teilnehmer/innen begonnen. Wenn die/der Trainer/in eine Reihe von
Beispielarbeiten bereitgestellt hat, werden die Teilnehmer/innen
aufgefordert, einige dieser Arbeit zu bewerten. (Die Zahl der
Bewertungen wird beim Einrichten der Aufgabe festgelegt.) Wenn
ein/e Teilnehmer/in die vorgebene Zahl von Testaufgaben bewertet hat, kann
er/sie eine eigene Aufgabe bearbeiten und einreichen. Im Falle
eines Workshops ohne vorherige Einsch&auml;tzung von
Musterl&ouml;sungen kann der/die Teilnehmer/in die eigene Arbeit sofort
bearbeiten und einreichen.</p>
<p>Es ist vorteilhaft, das Einreichen von Arbeiten über einen längeren Zeitraum
zuzulassen. Dadurch kann die Arbeit kontinuierlich bearbeitet und
erg&auml;nzt werden. So kann st&uuml;ckweise (iterativ) an der Arbeit
gearbeitet werden. Wenn Sie die Einstellung direkt nach der
Einrichtung des Workshops auf "Einreichen und Bewerten erlaubt"
setzen, k&ouml;nnen schnell voranschreitende TN sofort durch die
verschiedenen Schritte gehen, w&auml;hrend TN, die erst
sp&auml;ter eine Arbeit abgeben, auch dann weiter arbeiten
k&ouml;nnen. Wenn erst alle TN ihre Arbeit abgegeben haben
m&uuml;ssen, bevor Sie die Bewertung durch TN zulassen, kommt es
zu Verz&ouml;gerungen, die f&uuml;r manche TN &auml;rgerlich
sind, weil sie nicht weiter arbeiten k&ouml;nnen.</p>
<p>Wenn der/die Teilnehmer/in eine eigenen Arbeit eingereicht
hat, kann der/die Trainer/in diese bewerten (falls vorgesehen). Diese
Bewertung kann in die Endbewertung einbezogen werden. Die
Bewertung kann noch w&auml;hrend der Bearbeitungszeit erstellt
werden oder erst nach dem Abgabezeitpunkt f&uuml;r die
Arbeiten.</p>
</li>
<li>
<p><b>Einreichen und Bewerten f&uuml;r TN erlaubt</b> Wenn eine
Teilnehmerbewertung in der Pr&uuml;fung vorgesehen ist, werden
Teilnehmer/innen, die ihre eigene Arbeit abgeschlossen haben, die
Arbeiten anderer Teilnehmer/innen zur Bewertung vorgelegt. Nach
ihrer Bewertung kann der/die bewertete Teilnehmer/in diese einsehen. Der
Trainer/in kann - wenn gew&uuml;nscht - auch diese Bewertung benoten und
diese Note bei der Abschlu&szlig;note ber&uuml;cksichtigen (z.B. Angemessenheit der Bewertung).</p>
<p>Wenn Sie diesen Schritt in zwei Phasen aufteilen wollen
("Aufgaben abgeben erlaubt" und "Bewertung durch TN erlaubt"),
wird die Phase "Einreichen und Bewerten f&uuml;r TN erlaubt"
nicht verwandt. Sie k&ouml;nnen dann einen Abgabeteremin
f&uuml;r die Abgabe von Arbeiten festlegen. Danach wird dann die
Phase "Bewerten durch TN erlaubt" automatisch freigegeben.</p>
<p>Wenn Sie die beiden Schritte (Abgabe und Bewertung) zugleich
durchf&uuml;hren, sollten Sie die Einstellung auf a (oder
evtl. 1) setzen, damut die Zuteilung nahtlos von zu
bewertenden Arbeiten erfolgt. Es kommt dann jedoch zu dem Effekt,
dass fr&uuml;her eingereichte Arbeiten h&auml;ufiger zur
Bewertung anderen Tn zur Verf&uuml;gung gestellt werden als
sp&auml;ter eingereichte Arbeiten.</p>
<p>Wenn ein/e Teilnehmer/in eine Bewertung vorgenommen hat, wird diese auch
dem bewerteten TN angezeigt. Dieser kann die Bewertung
kommentieren, wenn Sie diese Option aktivieren.</p>
</li>
<li>
<p><b>Bewertungen durch TN zulassen</b> In dieser Phase
k&ouml;nnen Bewertungen vorgenommen, aber keine Arbeiten mehr
abgegeben werden, einschlie&szlig;lich Neueinreichungen der
Arbeiten. TN, die bis zu diesem Zeitpunkt keinen Arbeiten
abgegeben haben, erhalten auch <b>keine</b> Arbeiten anderer TN
zur Bewertung.</p>
</li>
<li>
<p><b>Abschlu&szlig;bewertung anzeigen</b> Mit dieser Phase wird
den TN ihre Abschlu&szlig;bewertung detailliert angezeigt. Die
verschiedenen Bewertungen aus den einzelnen Teilschritten
k&ouml;nnen auch im Detail eingesehen werden.</p>
<p>Die TN und Trainer/innen k&ouml;nnen optional auch eine
Tabelle der Ergebnisse einsehen. Die Tabelle ist nach den
Bewertungen sortiert. Die beste Arbeit wird ganz oben
angezeigt.</p>
</li>
</ol>
<p>In jeder Phase des Workshops kann der Trainer, die
Administration/Verwaltung &ouml;ffnen. Hier wird der aktuelle
Stand der Bearbeitung angezeigt. Der Trainer kann die vorhandenen
Arbeiten einsehen, bewerten und die Bewertung korrigieren,
Arbeiten und Bewertungen l&ouml;schen und nat&uuml;rlich den
Fortschritt &uuml;berwachen.</p>