
<div style="margin-left: 40px;">"Beurteilungen sind der
einflu&szlig;reichste Hebel, mit dem Trainer/innen die Bearbeitungsweise
von Kursen und das Lernverhalten der Teilnehmer/innen
beeinflu&szlig;en k&ouml;nnen."<br /></div>
<br />
<div style="text-align: right; margin-left: 80px;"><small>von
Graham Gibbs, "Using Assessment Strategically to Change the Way
Students Learn" in "Asessment Matter in Higher Education,
herausgegeben von Sally Brown und Angela Glasner, OU Press,
1999</small><br /></div>
<br />
<h3>&Uuml;berblick</h3>
Dieses neue Modul erm&ouml;glicht es Trainer/innen, eine kontrollierte
Aufgabenstellung einzurichten, die die Teilnehmer/innen
ermuntert, kritisch mit ihren eigenen Arbeitsergebnissen und
denen der anderen Teilnehmer/innen umzugehen. In der
Standardanwendung dieses Moduls beginnt man mit der
Vorbereitungsphase und der Festlegung von Beurteilungskriterien.
Diese ergeben sich aus der Beurteilungsstrategie des/der Trainers/in.
Vier verschiedene Strategien k&ouml;nnen angewandt werden:<br />
<ol>
<li><b>Keine Bewertung:</b> Bei dieser Form der Aufgabenstellung
erfolgt keine quantitative Benotung durch die Teilnehmer/innen.
Sie kommentieren die vorgelegten Antworten der anderen
Teilnehmer/innen, vergeben jedoch keine Noten. Die/der Trainer/in kann -
sofern sie/er dies will - die Kommentare der Teilnehmer/innen
bewerten. Solche "bewerteten Kommentare" k&ouml;nnen eine
Grundlage f&uuml;r die Benotung der Teilnehmerleistungen sein.
Wenn der/die Trainer/in die bearbeiteten Aufgaben nicht benotet, kann auch
keine Gesamtnote erstellt werden.</li>
<li><b>Zusammengefasste Bewertung:</b> Dies ist die
Grundeinstellung des Moduls. Bei dieser Aufgabenstellung setzt
sich jede einzelne Bewertung aus einer Reihe von
"Beurteilungselementen" zusammen. Jedes Element sollte einen
Teilaspekt der Gesamtaufgabenstellung abdecken. Die meisten
Aufgabenstellungen werden zwischen 5 und 15 Einzelelmente
bewerten und kommentieren. Die genaue Zahl wird immer
abh&auml;ngig sein vom Umfang und der Komplexit&auml;t der
Aufgabenstellung. Eine Peer-Aufgabe mit nur einem Element ist
m&ouml;glich und verfolgt dann eine &auml;hnliche
Beurteilungsstrategie wie das Standard-Moodle-Modul
'Assignment'.</li>
<li><b>Zusammenfassende Fehlerbewertung:</b> Bei dieser
Bewertungsstrategie werden die Arbeiten auf der Grundlage einer
Reihe von Ja/Nein-Kriterien bewertet. Die Gesamtbeurteilung
ergibt sich aus einer "Notentabelle ", die die Relation zwischen
"Fehlern" und richtigen Antworten verdeutlicht. Bei einer
Aufgabenstellung bei der sechs Kriterien erf&uuml;llt sein
m&uuml;ssen, um eine optimale Note zu erzielen, zeigt die
Notentabelle, welche Note erzielt wird wenn alle Kriterien
erf&uuml;llt sind, wenn ein Kriterium fehlt, wenn zwei Kriterien
fehlen usw.</li>
<li><b>Kriterienbewertung:</b> Dies ist die einfachste Form, eine
Beurteilung vorzunehmen, aber nicht unbedingt einfach
einzurichten. Die eingereichten Arbeiten werden anhand einer
Reihe von Bewertungskategorien bewertet. Der Bewerter pr&uuml;ft,
welche dieser Aussagen am beste auf die Arbeit zutrifft. (z.B.
'entwickelt eigene Ideen' 'hat das Vorgehensprinzip verstanden'.
Die Note ergibt sich aus einer "Kriterientabelle" f&uuml;r jede
Note.</li>
</ol>
Zun&auml;chst nimmt der/die Trainer/in eine kleine Anzahl von Arbeiten.
(vielleicht 5 oder 10). Diese k&ouml;nenn von fr&uuml;heren
Gruppen genommen werden und sollten gute und schwache Arbeiten
umfassen.<br />
<br />
Dann beurteilt er/sie diese Arbeiten unter Verwendung des
"Notenformulars", das sie/er f&uuml;r diese Arbeit erstellt hat.
Seine/ihre Bewertung ist eine Orientierungshilfe f&uuml;r
die Teilnehmer/innen wenn sie mit ihrer Arbeit beginnen.<br />
<br />
Mit diesen drei Vorbereitungsschritten (Beurteilungselemente und
evtl. einer Notentabelle), den Beispiell&ouml;sungen und den
Musteraufgaben) kann die Beurteilung f&uuml;r die
Teilnehmer/innen gestartet werden. Die Teilnehmer/innen sollten
nun zuerst die Musteraufgaben einsch&auml;tzen. Wenn der/die Trainer/in
diese durchgesehen hat und mit den Resultaten zufrieden ist, kann
er/sie denn&auml;chsten Schritt frei geben. Er/sie kann nun die
Teilnehmer/innen bitten, diese Musterl&ouml;sungen
einzusch&auml;tzen. Dies sollte leicht fallen, wenn die
Teilnehmer/innen die Anforderungen der Aufgabenstellung begriffen
haben. Dieser Schritt dient insbesondere dazu, dass
schw&auml;chere Teilnehmer/innen die Aufgabenstellungen und
Herausforderungen besser verstehen und nachvollziehen
k&ouml;nnen.<br />
<br />
Am Ende dieser Phase sollten alle Teilnehmer/innen verstanden
haben, worum es bei der Aufgabenstellung geht und wie sie
gel&ouml;st werden kann. Dazu bedarf es keines einheitlichen
Zeitpunkts. Jeder kann diesen Punkt unabh&auml;ngig vom
Lernfortschritt anderer erreichen. Die/der Trainer/in kann sich nun
zur&uuml;cklehnen und die weiteren Aufgabenstellungen bis zum
definierten Endzeitpunkt ablaufen lassen.<br />
<br />
Das Modul, kann f&uuml;r eine einzelne Teilaufgabenstellung oder
ein ganzes B&uuml;ndel von Pr&uuml;fungsaufgaben eingesetzt
werden. Wenn die Teilnehmer/innen ihre Arbeit eingereicht haben,
werden sie aufgefordert, die Arbeiten anderer Teilnehmer/innen
einzusch&auml;tzen. Ihre eigene Arbeit steht auch anderen
Teilnehmer/innen zur Verf&uuml;gung. Erst wenn sie selber eine
Einsch&auml;tzung zu der Arbeit eines anderen Teilnehmers
abgegeben haben, werden sie f&uuml;r die anderen Teilnehmer/innen
sichtbar. Wenn die gew&auml;hlte Beurteilungsstrategie eine
Beurteilung durch die Teilnehmer/innen zul&auml;sst, k&ouml;nnen
die Autor/innen der jeweiligen Arbeit vor dem Hintergrund der
Beurteilung ihrer Arbeit, eine &Uuml;berarbeitung anfertigen und
erneut zu einer Bewertung bereitstellen. Diese Form der
gegenseitigen Einsch&auml;tzungen kann bis zu einem definierten
Endabgabezeitpunkt fortgesetzt werden.<br />
<br />
Die/der Trainer/in hat nun verschiedene M&ouml;glichkeiten. Das Modul
erm&ouml;glicht verschiedene Berechnungsformen der Endnote
f&uuml;r die Teilnehmer/innen. Der Lehrer kann eine Kombination
folgender Kriterien verwenden:<br />
<ol>
<li>Die Bewertung der/des Trainers/in f&uuml;r die am Ende abgegebene
Arbeit</li>
<li>Die durchschnittliche Bewertung der anderen Teilnehmer/innen
f&uuml;r diese Arbeit</li>
<li>Die Leistung des/der Teilnehmers/in beim Bewerten anderer
Arbeiten</li>
</ol>
Es ist klar, dass der/die Trainer/in nach dem Abgabeschlu&szlig; die
Arbeiten der Teilnehmer/innen bewerten mu&szlig;. Es ist nicht
unbedingt erforderlich, die Leistungen bei der gegenseitigen
Bewertung der Teilnehmer/innen bei der Notenbildung zu
ber&uuml;cksichtigen. Durch einen internen Vergleich kann dieses
Kriterium jedoch in der Berechnung der Endnote
ber&uuml;cksichtigt werden (Grad der realistischen
Einsch&auml;tzung der Arbeit). Die gegenseitige Bewertung sollte
jedoch nur dann ber&uuml;cksichtigt werden, wenn die Zahl der
bewertenden Teilnehmer/innen ausreichend hoch ist und eine
angemessene Einsch&auml;tzung erfolgt. Zu kleine Bewertungszahlen
k&ouml;nne zu Ergebnisverf&auml;lschungen f&uuml;hren. Die letzte
Phase in der Arbeit in diesem Modul besteht in der Bekanntgabe
der Abschlu&szlig;noten an die Teilnehmner/innen.<br />
<br />
Dieses Modul verwendet in der Regel folgende Ablaufschritte:<br />
<ol>
<li>Einrichtung der Grundeinstellungen</li>
<li>Bearbeitung von Musteraufgaben durch die Teilnehmer/innen,
Einsendung der eigenen Arbeiten und die gegenseitige
Bewertung</li>
<li>Ermittlung der Abschlu&szlig;note</li>
<li>Bekanntgabe der Noten</li>
</ol>
Bei der Bearbeitung mu&szlig; lediglich ein Endzeitpunkt zwischen
Phase 2 und 3 festgelegt werden. Die Teilnehmer/innen k&ouml;nnen
sich ihre Zeit frei einteilen..<br />
<br />
<h3>Varianten</h3>
Die vorhergehende Darstellung stellt lediglich den
Standardeinsatz des Moduls dar. Mit Hilfe des Moduls sind auch
ganz andere Einsatzm&ouml;glichkeiten realisierbar. Eine
Fallstudienarbeit kann z.B. durchgef&uuml;hrt werden indem der/die
Trainer/in eine Reihe von Szenarien bereitstellt, die von den
Teilnehmer/innen eingesch&auml;tzt werden sollen. Die
Teilnehmer/innen reichen dann keine eigenen Arbeiten ein. Der/die
Trainer/in beurteilt 'lediglich' die Kommentierungen der
Teilnehmer/innen zu den verschiedenen Szenarien und verwendet sie
zur Ermittlung der Abschlu&szlig;note.<br />
<br />
Eine andere Einsatzm&ouml;glichkeit besteht in der
Verk&uuml;rzung. Dabei werden keine Beispielaufgaben
bereitgestellt. Die Teilnehmer/innen geben ihre Arbeiten ab und
diese werden von anderen Teilnehmer/innen kommentiert.<br />
<br />
Es kann bei manchen Pr&uuml;fungen vorkommen, dass die Gefahr
besteht, dass Teilnehmer/innen einfach Musterl&ouml;sungen
f&uuml;r ihre eigene Arbeit kopieren. Dann sollten die
Musteraufgaben so gestaltet sein, dass sie das
L&ouml;sungsprinzip verdeutlichen, nicht aber direkt f&uuml;r die
L&ouml;sung der Pr&uuml;fungsaufgaben verwandt werden
k&ouml;nnen. Es ist sicher n&ouml;tig, den Arbeitsprozess
sorgf&auml;ltig zu beobachten, da es vorkommen kann, dass den
&Uuml;bungsaufgaben eine gr&ouml;&szlig;ere Aufmerksamkeit
gewidmet wird und die Pr&uuml;fungsaufgaben nicht mehr so genau
gelesen werden.<br />
<br />
Das Modul kann ebenfalls genutzt werden, damit die
Teilnehmer/innen ihre eigene Arbeit einsch&auml;tzen. An die
Stelle der Bewertung durch andere Teilnehmer/innen tritt dann die
Selbstbewertung. Der/die  Trainer/in kann in der zweiten Phase von Phase 2
eine Bewertung der (Selbst-)Bewertung vornehmen und diese auch bei
der abschlie&szlig;enden Bewertung ber&uuml;cksichtigen.<br />
<br />
<h3>Schlu&szlig;bemerkung</h3>
Dieses Modul ist sehr flexibel durch seine einfachen Einstell-
und Ablaufm&ouml;glichkeiten. W&auml;hrend der Bewertungsphase
k&ouml;nnen die Teilnehmer/innen nicht in den weiteren
Bewertungsprozess eingreifen. Wenn die Erfahrung der
Teilnehmer/innen genutzt/herausgefordert werden soll, kann
gezielt die Selbstbewertungsoption der Teilnehmner/innen genutzt
werden. Eine technische Beschr&auml;nkung besteht darin, dass die
Arbeiten als eine eizelne Datei eingereicht werden m&uuml;ssen.
Die Datei unterliegt einstellbaren
Gr&ouml;&szlig;enbeschr&auml;nkungen. Nicht unterst&uuml;tzt
werden Verlinkungen mit anderen externen Dateien.<br />
 <br />
Original von Ray Kingdon<br />
April 2003<br />
<br />
Die deutsche &Uuml;bersetzung erlaubt sich einige Freiheiten in
der Anpassung. [Ralf Hilgenstock]<br />