/*
YUI 3.4.1 (build 4118)
Copyright 2011 Yahoo! Inc. All rights reserved.
Licensed under the BSD License.
http://yuilibrary.com/license/
*/
YUI.add("lang/datatype-date-format_ar",function(a){a.Intl.add("datatype-date-format","ar",{"a":["أحد","إثنين","ثلاثاء","أربعاء","خميس","جمعة","سبت"],"A":["الأحد","الإثنين","الثلاثاء","الأربعاء","الخميس","الجمعة","السبت"],"b":["يناير","فبراير","مارس","أبريل","مايو","يونيو","يوليو","أغسطس","سبتمبر","أكتوبر","نوفمبر","ديسمبر"],"B":["يناير","فبراير","مارس","أبريل","مايو","يونيو","يوليو","أغسطس","سبتمبر","أكتوبر","نوفمبر","ديسمبر"],"c":"%a، %d %B %Y %Z %l:%M:%S %p","p":["ص","م"],"P":["ص","م"],"x":"%d\u200f/%m\u200f/%Y","X":"%l:%M:%S %p"});},"3.4.1");