/*
YUI 3.4.1 (build 4118)
Copyright 2011 Yahoo! Inc. All rights reserved.
Licensed under the BSD License.
http://yuilibrary.com/license/
*/
YUI.add("lang/datatype-date-format_el-GR",function(a){a.Intl.add("datatype-date-format","el-GR",{"a":["Κυρ","Δευ","Τρι","Τετ","Πεμ","Παρ","Σαβ"],"A":["Κυριακή","Δευτέρα","Τρίτη","Τετάρτη","Πέμπτη","Παρασκευή","Σάββατο"],"b":["Ιαν","Φεβ","Μαρ","Απρ","Μαϊ","Ιουν","Ιουλ","Αυγ","Σεπ","Οκτ","Νοε","Δεκ"],"B":["Ιανουαρίου","Φεβρουαρίου","Μαρτίου","Απριλίου","Μαΐου","Ιουνίου","Ιουλίου","Αυγούστου","Σεπτεμβρίου","Οκτωβρίου","Νοεμβρίου","Δεκεμβρίου"],"c":"%a, %d %b %Y %l:%M:%S %p %Z","p":["Π.Μ.","Μ.Μ."],"P":["π.μ.","μ.μ."],"x":"%d/%m/%Y","X":"%l:%M:%S %p"});},"3.4.1");