<p align="center"><b>&Eacute;valuation dans les forums</b></p>

<p>Chaque message peut &ecirc;tre &eacute;valu&eacute; &agrave; l'aide d'un bar&egrave;me bas&eacute; sur la th&eacute;orie de
<strong>separate and connected knowing</strong>.

<p>Cette th&eacute;orie peut vous aider &agrave; voir les interactions entre humains sous un nouveau point de vue. Elle d&eacute;crit deux fa&ccedil;ons diff&eacute;rentes d'appr&eacute;hender les choses que nous voyons et entendons.</p>

<p>Bien que chacun de nous utilise les deux m&eacute;thodes suivant les circonstances, il est utile d'imaginer &agrave; titre d'exemple deux personnes, l'une &eacute;tant d'esprit plut&ocirc;t &laquo;&nbsp;s&eacute;par&eacute;&nbsp;&raquo; (Pierre) et l'autre d'esprit plut&ocirc;t &laquo;&nbsp;connect&eacute;&nbsp;&raquo; (Jeanne).</p>
<ul>
  <li>Pierre aime rester aussi &laquo;&nbsp;objectif&nbsp;&raquo; que possible, excluant ses &eacute;motions et ses sensations. Dans une discussion avec des interlocuteurs d'avis diff&eacute;rents, il pr&eacute;f&egrave;re d&eacute;fendre ses propres id&eacute;es, cherchant &agrave; d&eacute;monter les id&eacute;es de son adversaire par la logique. Il est critique vis-&agrave;-vis de nouvelles id&eacute;es, &agrave; moins qu'elles ne soient prouv&eacute;es par des sources dignes de foi, telles que des livres, des enseignants respect&eacute;s ou sa propre exp&eacute;rience. Pierre a un esprit tr&egrave;s <strong>s&eacute;par&eacute;</strong>.</li>
  <li>Jeanne est plus sensible. Elle est empathique et tend &agrave; &eacute;couter et poser des questions aux gens jusqu'&agrave; ce qu'elle sente qu'elle peut &ecirc;tre en connexion avec eux et &laquo;&nbsp;comprendre les choses de leur point de vue&nbsp;&raquo;. Elle apprend en essayant de partager les exp&eacute;riences qui conduisent au savoir qu'elle trouve chez les autres. Quand elle discute avec d'autres personnes, elle &eacute;vite la confrontation et essaie souvent d'aider l'autre &agrave; l'aide de suggestions logiques. Jeanne a un esprit tr&egrave;s <strong>connect&eacute;</strong>.</li>
</ul>
	<p>Vous avez certainement remarqu&eacute; que dans cet exemple, la personne s&eacute;par&eacute;e est un homme et que la personne connect&eacute;e est une femme. Des &eacute;tudes montrent que statistiquement, cela tend &agrave; &ecirc;tre le cas en g&eacute;n&eacute;ral. Toutefois, les individus peuvent se situer n'inporte o&ugrave; entre ces deux extr&ecirc;mes.</p>
	<p>Un groupe sera efficace et collaboratif  si ses membres sont capable d'utiliser ces <b>deux</b> fa&ccedil;ons de voir.</p>
	<p>Dans des situations particuli&egrave;res, par exemple sur un forum, un message peut avoir l'une de ces caract&eacute;ristiques, ou m&ecirc;me les deux. Quelqu'un de tr&egrave;s connect&eacute; pourra par exemple poster un message ayant l'air tr&egrave;s s&eacute;par&eacute;, et vice-versa. L'objectif de l'&eacute;valuation des messages &agrave; l'aide de ce bar&egrave;me est&nbsp;:</p>
	<p>a) de vous aider &agrave; penser &agrave; cette probl&eacute;matique lors de la lecture d'autres messages ;<br />
       b) d'offrir un feedback &agrave; chaque auteur sur la fa&ccedil;on dont il est vu par les autres.</p>
	<p>Les r&eacute;sultats ne sont en aucune mani&egrave;re utilis&eacute;s pour donner des notes aux &eacute;tudiants. Ils ne servent qu'&agrave; am&eacute;liorer la communication et l'apprentissage.</p>
	<hr />
<p>Voici quelques r&eacute;f&eacute;rences bibliographiques d'auteurs ayant d&eacute;velopp&eacute; ces id&eacute;es :</p>
<ul>
  <li>Belenky, M.F., Clinchy, B.M., Goldberger, N.R., &amp; Tarule, J.M. (1986). 
    Women's ways of knowing: the development of self, voice, and mind. New York, 
    NY: Basic Books.</li>
  <li>Clinchy, B.M. (1989a). The development of thoughtfulness in college women: 
    Integrating reason and care. American Behavioural Scientist, 32(6), 647-657.</li>
  <li>Clinchy, B.M. (1989b). On critical thinking &amp; connected knowing. Liberal 
    education, 75(5), 14-19.</li>
  <li>Clinchy, B.M. (1996). Connected and separate knowing; Toward a marriage 
    of two minds. In N.R. Goldberger, Tarule, J.M., Clinchy, B.M. &amp;</li>
  <li>Belenky, M.F. (Eds.), Knowledge, Difference, and Power; Essays inspired 
    by "Women's Ways of Knowing" (pp. 205-247). New York, NY: 
    Basic Books.</li>
  <li>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., &amp; Mansfield, 
    A. F. (1999). A New Way of Assessing Ways of Knowing: The Attitudes Towards 
    Thinking and Learning Survey (ATTLS). Sex Roles, 40(9/10), 745-766.</li>
  <li>Galotti, K. M., Reimer, R. L., &amp; Drebus, D. W. (2001). Ways of knowing 
    as learning styles: Learning MAGIC with a partner. Sex Roles, 44(7/8), 419-436. 
  </li>
</ul>

