<p align="center"><b>&Eacute;valuation des attitudes objectives et
empathiques dans les messages des forums</b></p>

<p>Tout message peut &ecirc;tre &eacute;valu&eacute; &agrave; l'aide d'un
bar&egrave;me bas&eacute; sur une th&eacute;orie qui traite de la relation
que l'apprenant entretient avec son entourage et ce qu'il
doit apprendre&nbsp;: il peut adopter une attitude empathique ou
objective (<strong>Theory of separate and connected knowing</strong>).

<p>Cette th&eacute;orie peut vous aider &agrave; voir les interactions entre
humains sous un nouveau point de vue. Elle d&eacute;crit deux fa&ccedil;ons
diff&eacute;rentes d'appr&eacute;hender les choses que nous voyons et
entendons.</p>

<p>Chacun de nous peut employer alternativement ces deux attitudes ou
les employer toutes deux en m&ecirc;me temps, mais &agrave; des degr&eacute;s divers, selon
les situations.</p>

<p>D&eacute;crivons deux apprenants fictifs pour illustrer cette fa&ccedil;on
d'aborder les interactions humaines. Chacun adopte la plupart du temps
l'attitude qui les caract&eacute;rise : Pierre a un esprit plut&ocirc;t &laquo;&nbsp;d&eacute;tach&eacute;&nbsp;&raquo;,
alors que Jeanne a un esprit plut&ocirc;t &laquo;&nbsp;li&eacute;&nbsp;&raquo;.</p>
<ul>
  <li>Pierre aime rester aussi &laquo;&nbsp;<b>objectif</b>&nbsp;&raquo; que possible,
ne faisant pas intervenir ses &eacute;motions et ses sensations.
Dans une discussion avec des
interlocuteurs d'avis diff&eacute;rents, il pr&eacute;f&egrave;re
d&eacute;fendre ses propres id&eacute;es, cherchant les failles des arguments
de son adversaire &agrave; l'aide de la logique. Il est critique vis-&agrave;-vis
des nouvelles id&eacute;es, &agrave; moins qu'elles ne soient appuy&eacute;es par
des sources dignes de foi, telles que des livres, des enseignants
respect&eacute;s ou sa propre exp&eacute;rience. <strong>Pierre ne s'investit
pas &eacute;motionnellement dans ce qu'il apprend des autres&nbsp;;
il est tr&egrave;s d&eacute;tach&eacute;.</strong>.</li>
  <li>Jeanne est plus <b>empathique</b>. Elle est sensible et tend &agrave;
&eacute;couter et poser des questions aux gens jusqu'&agrave; ce qu'elle sente
qu'elle peut &ecirc;tre en connexion avec eux et &laquo;&nbsp;comprendre les
choses de leur point de vue&nbsp;&raquo;. Elle apprend en essayant de partager
les exp&eacute;riences qui conduisent au savoir qu'elle trouve chez les autres.
Quand elle discute avec d'autres personnes, elle &eacute;vite la confrontation
et essaie souvent d'aider l'autre en utilisant des suggestions logiques.
<strong>Jeanne est tr&egrave;s li&eacute;e au groupe et aux apprentissages</strong>.</li>
</ul>
	<p>Vous avez certainement remarqu&eacute; que dans cet exemple, la personne
d&eacute;tach&eacute;e est un homme et que la personne li&eacute;e est une
femme. Des &eacute;tudes montrent que statistiquement, cela tend &agrave;
&ecirc;tre le cas en g&eacute;n&eacute;ral. Toutefois, les individus peuvent se
situer n'importe o&ugrave; entre ces deux extr&ecirc;mes, en fonction des situations
et de leur cheminement personnel.</p>
	<p>Un groupe sera efficace et collaboratif si ses membres sont capables
d'utiliser ces <b>deux</b> fa&ccedil;ons de voir.</p>
	<p>Dans des situations particuli&egrave;res, par exemple sur un forum, un
message peut avoir l'une de ces caract&eacute;ristiques, ou m&ecirc;me les deux.
Quelqu'un de tr&egrave;s li&eacute; pourra par exemple poster un message
ayant l'air tr&egrave;s d&eacute;tach&eacute;, et vice-versa. L'objectif de
l'&eacute;valuation des messages &agrave; l'aide de ce bar&egrave;me
est&nbsp;:</p>
<ul>
  <li>de d&eacute;velopper la capacit&eacute; &agrave; d&eacute;tecter les attitudes de
      l'auteur du message ;</li>
  <li>d'offrir un retour &agrave; chaque auteur sur la fa&ccedil;on dont
      il est per&ccedil;u par les autres.</li>
</ul>
	<p>Les r&eacute;sultats ne sont en aucune mani&egrave;re utilis&eacute;s
pour donner des notes aux &eacute;tudiants. Ils ne servent qu'&agrave;
am&eacute;liorer la communication et l'apprentissage.</p>
	<hr />
<p>Voici quelques r&eacute;f&eacute;rences bibliographiques d'auteurs ayant
d&eacute;velopp&eacute; ces id&eacute;es :</p>
<ul>
  <li>Belenky, M.F., Clinchy, B.M., Goldberger, N.R., &amp; Tarule, J.M. (1986). 
    Women's ways of knowing: the development of self, voice, and mind. New York, 
    NY: Basic Books.</li>
  <li>Clinchy, B.M. (1989a). The development of thoughtfulness in college women: 
    Integrating reason and care. American Behavioural Scientist, 32(6),
647-657.</li>
  <li>Clinchy, B.M. (1989b). On critical thinking &amp; connected knowing.
Liberal 
    education, 75(5), 14-19.</li>
  <li>Clinchy, B.M. (1996). Connected and separate knowing; Toward a marriage 
    of two minds. In N.R. Goldberger, Tarule, J.M., Clinchy, B.M. &amp;</li>
  <li>Belenky, M.F. (Eds.), Knowledge, Difference, and Power; Essays inspired 
    by "Women's Ways of Knowing" (pp. 205-247). New York, NY: 
    Basic Books.</li>
  <li>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., &amp; Mansfield, 
    A. F. (1999). A New Way of Assessing Ways of Knowing: The Attitudes Towards 
    Thinking and Learning Survey (ATTLS). Sex Roles, 40(9/10), 745-766.</li>
  <li>Galotti, K. M., Reimer, R. L., &amp; Drebus, D. W. (2001). Ways of knowing 
    as learning styles: Learning MAGIC with a partner. Sex Roles, 44(7/8),
419-436. 
  </li>
</ul>

