<h2>A wiki haszn&aacute;lata</h2>
<p>
A Moodle wikije az 
<a href="http://erfurtwiki.sourceforge.net/?id=ErfurtWiki" target="_blank">ErfurtWiki</a>-re &eacute;p&uuml;l, amely a 
<a href="http://c2.com/cgi/wiki?WikiWikiWeb" target="_blank">WikiWikiWeb</a>
 hipertextes rendszer implement&aacute;ci&oacute;ja. A wiki weboldalak egyszer&#369; k&ouml;z&ouml;s szerkeszt&eacute;s&eacute;t &eacute;s l&eacute;trehoz&aacute;s&aacute;t teszi lehet&#337;v&eacute;.</p>
<p>
<ul>
<li><a href="#createpages">Lapszerkeszt&eacute;s</a> oldalak szerkeszt&eacute;s&eacute;nek elsaj&aacute;t&iacute;t&aacute;sa</li>
<li>Valamely oldal tartalm&aacute;nak a szerkeszt&eacute;s&eacute;hez kattintsunk a <img src="pix/t/edit.gif"> pontra vagy a leg&ouml;rd&uuml;l&#337; men&uuml;b&#337;l v&aacute;lasszuk az "Oldal szerkeszt&eacute;se" pontot.</li>
<li>Az oldalak form&aacute;z&aacute;sa  <a href="#wikimarkup">Wiki jel&ouml;l&#337;nyelvvel</a> vagy (ha a wiki rendelkezik ezzel az opci&oacute;val) HTML-lel t&ouml;rt&eacute;nik.</li>
<li>Oldalakat kereshet&uuml;nk vagy &aacute;tt&eacute;rhet&uuml;nk az &uacute;j oldalak list&aacute;j&aacute;ra.</li>
<li>Emellett l&eacute;teznek list&aacute;k a leggyakrabban l&aacute;togatott, a leggyakrabban m&oacute;dos&iacute;tott &eacute;s a legut&oacute;bb friss&iacute;tett oldalakr&oacute;l.</li>
</ul>
</p>
<p>
<a name="createpages"></a><b>Lapszerkeszt&eacute;s</b>:<br />
Egy-egy lapot &uacute;gy hozhatunk l&eacute;tre, hogy egy megl&eacute;v&#337; oldal sz&ouml;veg&eacute;ben megnevezz&uuml;k az &uacute;j lapot. &Aacute;ltal&aacute;ban wiki-oldalakat &uacute;n. 
<a href="#camelcase">CamelCase</a> form&aacute;tumban vagy sz&ouml;gletes z&aacute;r&oacute;jelek ( [] ) k&ouml;z&eacute; &iacute;rva nevezhet&uuml;nk meg.</p>
<p>
P&eacute;ld&aacute;ul:
<ul>
<li>MyWikiPage (Camel Case)</li>
<li>[My Wiki Page] (sz&ouml;gletes z&aacute;r&oacute;jelek k&ouml;z&ouml;tt)</li>
</ul></p>
<p>
Az a sz&ouml;veg, amely wiki-oldalas elnevez&eacute;st tartalmaz, '?'-lel v&eacute;gz&#337;dik. A '?'-re kattint&aacute;ssal kezdhet&uuml;nk neki az adott oldal szerkeszt&eacute;s&eacute;nek. A sz&ouml;veg meg&iacute;r&aacute;sa, elment&eacute;se ut&aacute;n m&aacute;ris k&eacute;sz az &uacute;j wiki-oldal.</p>
<p><a name="wikimarkup"></a><b>Wiki jel&ouml;l&#337;nyelv</b>:<br />
Egy-egy wikin bel&uuml;l az oldalak k&ouml;nnyen szerkeszthet&#337;k a wiki jel&ouml;l&#337;nyelv seg&iacute;ts&eacute;g&eacute;vel.
</p>
<h4> Bekezd&eacute;sek</h4>
  <ul type="circle">
  <li> ezzel v&aacute;laszthat&oacute;k el egym&aacute;st&oacute;l &uuml;res sorokkal a sz&ouml;vegen bel&uuml;li bekezd&eacute;sek </li>
  <li> sort&ouml;r&eacute;shez haszn&aacute;ljunk h&aacute;rom %%<em></em>% jelet</li>
  <li> ha a sz&ouml;veg el&eacute; sz&oacute;k&ouml;z&ouml;ket vagy tabul&aacute;torokat &iacute;runk, a sorok beh&uacute;z&aacute;ssal jelennek meg </li>
  </ul>

<h4> !! C&iacute;msorok</h4>
  <ul type="circle">
  <li> A sor elej&eacute;n egy ! seg&iacute;ts&eacute;g&eacute;vel hozhatunk l&eacute;tre egy kis c&iacute;msort</li>
  <li> !! jellel k&ouml;zepeset</li>
  <li> !!! jellel nagy c&iacute;msorokat </li>
  </ul>

<h4> sz&ouml;vegform&aacute;z&aacute;s</h4>
  <ul type="circle">
  <li> <em>sz&ouml;veg kiemel&eacute;se</em> k&eacute;t aposztr&oacute;f [''] seg&iacute;ts&eacute;g&eacute;vel t&ouml;rt&eacute;nik, a k&ouml;z&ouml;tte l&eacute;v&#337; sz&ouml;veg rendszerint d&#337;lten jelenik meg</li>
  <li> <strong>sz&ouml;veg vastag&iacute;t&aacute;sa</strong> k&eacute;t al&aacute;h&uacute;z&aacute;sjellel [__] t&ouml;rt&eacute;nik (vagy k&eacute;t csillag k&ouml;z&ouml;tt: **)</li>
  <li> <big>sz&ouml;vegm&eacute;ret n&ouml;vel&eacute;se</big> kett&#337;skeresztek k&ouml;z&eacute; [##] illeszt&eacute;ssel</li>
  <li> <small> sz&ouml;vegm&eacute;ret cs&ouml;kkent&eacute;se </small> k&eacute;t "55" jel k&ouml;z&eacute; illeszt&eacute;ssel</li>
  <li> azonos sz&eacute;less&eacute;g&#369; bet&#369;kkel <tt>&iacute;r&oacute;g&eacute;p &iacute;r&aacute;smint&aacute;j&aacute;ra</tt> hasonl&iacute;t&oacute; szerkeszt&eacute;ssel a sz&ouml;veget k&eacute;t egyenl&#337;s&eacute;gjel k&ouml;z&eacute; [==] illesztve szerkeszthet&uuml;nk </li>
  </ul>

<h4> List&aacute;k</h4>

  <ul type="circle">
  <li> lista kezd&eacute;se * jellel t&ouml;rt&eacute;nik</li>
  <li> sz&aacute;mozott lista elej&eacute;n #-t haszn&aacute;lunk <ol>
    <li> tov&aacute;bbi list&aacute;kat hozhatunk l&eacute;tre</li>
    <li> ehhez az alpontokat ugyan&uacute;gy a * &eacute;s a # jelek megfelel&#337; vari&aacute;l&aacute;s&aacute;val alak&iacute;thatjuk ki </li>
    </ol>
  </li>
  </ul>

<h4> HyperLinks</h4>

  <ul type="circle">
  <li> &uacute;j ugr&oacute;pont l&eacute;trehoz&aacute;s&aacute;hoz illessz&uuml;nk a sz&ouml;vegbe egy CamelCase form&aacute;tum&uacute; wikisz&oacute;t </li>
  <li> vagy vegy&uuml;k k&ouml;rbe az ugr&oacute;pontot k&eacute;t <b>sz&ouml;gletes z&aacute;r&oacute;jellel</b></li>
  <li> az &eacute;rv&eacute;nyes internetes  (<a href="http://">http://</a>-vel kezd&#337;d&#337;) c&iacute;mek, p&eacute;ld&aacute;ul a http://www.example.com/ webc&iacute;m sz&ouml;veg&eacute;t a rendszer automatikusan kattinthat&oacute;v&aacute; alak&iacute;tja</li>
  <li> ha a www-c&iacute;met vagy a wiki-ugr&oacute;pontot sz&ouml;gletes z&aacute;r&oacute;jelek k&ouml;z&eacute; tessz&uuml;k [<a href="http://www.moodle.org/">Moodle</a>], id&eacute;z&#337;jelekkel vagy a | jellel c&iacute;mk&eacute;t ragaszthatunk r&aacute; <ul type="circle">
    <li> [title | http://p&eacute;lda.com]</li>
    <li> [WikiWord "c&iacute;m"] vagy ["c&iacute;m" WikiLink] </li>
    </ul>

  </li>
  <li> ha egy wikisz&oacute;t, !http://www-c&iacute;met (vagy [b&aacute;rmit], ami sz&ouml;gletes z&aacute;r&oacute;jelben van) nem szeretn&eacute;nk ugr&oacute;pontt&aacute; alak&iacute;ttatni, mind&ouml;ssze egy felki&aacute;lt&oacute;jelet vagy egy hull&aacute;mvonalat kell el&eacute; &iacute;rnunk <ul type="circle">
    <li> !NemUgr&oacute;Pont, ~NemUgr&oacute;Pont</li>
    <li> ![NemUgr&oacute;Pont], !!http://nolink.org/ </li>
    </ul>
  </li>
  </ul>

<h4> T&aacute;bl&aacute;zatok a | jellel</h4>
<table cellpadding="2" border="1" cellspacing="0">
<tr>
<td> az egyes elemeket </td>
<td> fogjuk k&ouml;zre egy </td>
<td> | jellel, </td>
</tr><tr>
<td> &eacute;s k&eacute;sz is a </td>
<td> t&aacute;bl&aacute;zat szerkezete </td>
</tr><tr>
<td> a b&ouml;ng&eacute;sz&#337;k &aacute;ltal&aacute;ban </td>
<td> &uuml;resen hagyj&aacute;k a hi&aacute;nyz&oacute; </td>
<td> cell&aacute;kat </td>
</tr>
</table>


<p>
A t&aacute;bl&aacute;zat el&eacute; &eacute;s ut&aacute;n mindig sz&uacute;rjunk be egy &uuml;res sort, hogy a bekezd&eacute;sen bel&uuml;l elk&uuml;l&ouml;n&uuml;lj&ouml;n a t&ouml;bbi sz&ouml;vegt&#337;l.
</p>

<h4> &Aacute;br&aacute;k</h4>

  <ul type="circle">
  <li> k&eacute;p besz&uacute;r&aacute;s&aacute;hoz illessz&uuml;k annak teljes el&eacute;r&eacute;si &uacute;tvonal&aacute;t sz&ouml;gletes z&aacute;r&oacute;jelek k&ouml;z&eacute;, pl.: [http://www.p&eacute;lda.com/pics/image.png], </li>
  <li> m&aacute;sik megold&aacute;s a k&eacute;pfelt&ouml;lt&#337; funkci&oacute; haszn&aacute;lata.</li>
  </ul>

<h4>Tov&aacute;bbi olvasm&aacute;nyok</h4>
A Wiki jel&ouml;l&#337;nyelv egy sor egy&eacute;b lehet&#337;s&eacute;get tartalmaz. Tov&aacute;bbi inform&aacute;ci&oacute;k az <a href="http://erfurtwiki.sourceforge.net" target=_new>Erfurt Wiki honlapon</a>.

<p>
<a name="camelcase"></a><b>Camel Case</b>:<br />
A CamelCase a wikiszavak &iacute;r&aacute;sm&oacute;dja. A t&ouml;bb sz&oacute;b&oacute;l &aacute;ll&oacute; &ouml;sszet&eacute;tel sz&oacute;k&ouml;z n&eacute;lk&uuml;l, a sz&oacute;kezdetekn&eacute;l nagybet&#369;vel &iacute;rand&oacute;. A kis- &eacute;s nagybet&#369;k v&aacute;ltakoz&aacute;s&aacute;t&oacute;l a sz&ouml;veg megjelen&eacute;se hasonl&iacute;t a teve p&uacute;pj&aacute;ra.</p>
<p>
Ezt a sz&ouml;vegf&#369;z&eacute;si m&oacute;dot h&iacute;vj&aacute;k BumpyText-nek (g&ouml;r&ouml;ngy&ouml;s sz&ouml;vegnek) is.</p>
<p>
A nyelvle&iacute;r&oacute;k nem kedvelik a wiki ezen n&eacute;vad&aacute;si &iacute;r&aacute;sm&oacute;dj&aacute;t, a sz&aacute;m&iacute;t&oacute;g&eacute;pes vil&aacute;gban ez az &iacute;r&aacute;sm&oacute;d nagyon elterjedt &eacute;s a legt&ouml;bb programoz&oacute; ismeri.</p>


