<P ALIGN=CENTER><B>A wiki haszn&aacute;lata</B></P>
<p>
<br>

A wiki olyan platform, amely weboldalak k&ouml;z&ouml;s l&eacute;trehoz&aacute;s&aacute;ra szolg&aacute;l. Alapelvei egyszer&#369;ek.
<br><br>

<ul>
<li>A sz&ouml;veget meg&iacute;rjuk &eacute;s elmentj&uuml;k.</li>
<li>K&eacute;s&#337;bb egy m&aacute;sik szem&eacute;ly elolvassa &eacute;s bizonyos kieg&eacute;sz&iacute;t&eacute;seket vagy m&oacute;dos&iacute;t&aacute;sokat v&eacute;l elv&eacute;gezhet&#337;nek. Ez&eacute;rt kiv&aacute;lasztja az "Edit" [Szerkeszt&eacute;s] funkci&oacute;t &eacute;s elv&eacute;gzi a m&oacute;dos&iacute;t&aacute;sokat. </li>
<li>Az &uacute;j v&aacute;ltozat annak ment&eacute;se ut&aacute;n mindenki sz&aacute;m&aacute;ra hozz&aacute;f&eacute;rhet&#337;v&eacute; v&aacute;lik.</li><br>    <br>
</ul>

A wiki r&eacute;v&eacute;n oldalakat vagy ugr&oacute;pontokat sz&uacute;rhatunk be megl&eacute;v&#337; oldalakba.
<br><br>

<ul>
<li>Az ugr&oacute;pont (hivatkoz&aacute;s) egy wikisz&oacute;val hozhat&oacute; l&eacute;tre. Ez olyan sz&oacute;b&oacute;l &aacute;ll, amelyben legal&aacute;bb k&eacute;t nagy bet&#369; szerepel. Ha m&aacute;r l&eacute;tezik ilyen nev&#369; oldal, annak &ouml;sszekapcsol&aacute;sa automatikusan t&ouml;rt&eacute;nik, ha nem, a pont k&eacute;rd&#337;jellel jelenik meg.</li>
<li>A k&eacute;rd&#337;jelre kattintva az adott n&eacute;vvel egy &uacute;j oldalt nyitunk meg szerkeszt&eacute;sre.</li>
</ul>
<br><br>


<P ALIGN=CENTER><B><br>
A wiki form&aacute;z&aacute;si szab&aacute;lyai</B></P>
<p>


<h4> Bekezd&eacute;sek</h4>
  <ul>
  <li> ezzel v&aacute;laszthat&oacute;k el egym&aacute;st&oacute;l &uuml;res sorokkal a sz&ouml;vegen bel&uuml;li bekezd&eacute;sek </li>
  <li> sort&ouml;r&eacute;shez haszn&aacute;ljunk h&aacute;rom %%% jelet</li>
  <li> ha a sz&ouml;veg el&eacute; sz&oacute;k&ouml;z&ouml;ket vagy tabul&aacute;torokat &iacute;runk, a sorok beh&uacute;z&aacute;ssal jelennek meg </li>
  </ul>

<h4> !! C&iacute;msorok</h4>

  <ul type="circle">
  <li> A sor elej&eacute;n egy ! seg&iacute;ts&eacute;g&eacute;vel hozhatunk l&eacute;tre egy kis c&iacute;msort</li>

  <li> !! jellel k&ouml;zepeset</li>
  <li> !!! jellel nagy c&iacute;msorokat </li>
  </ul>

<h4>Sz&ouml;vegform&aacute;z&aacute;s</h4>

  <ul>

  <li> <em>sz&ouml;veg kiemel&eacute;se</em> k&eacute;t aposztr&oacute;f ('') seg&iacute;ts&eacute;g&eacute;vel t&ouml;rt&eacute;nik, a k&ouml;z&ouml;tte l&eacute;v&#337; sz&ouml;veg rendszerint d&#337;lten jelenik meg</li>
  <li> <strong>sz&ouml;veg vastag&iacute;t&aacute;sa</strong> k&eacute;t al&aacute;h&uacute;z&aacute;sjellel [__] t&ouml;rt&eacute;nik (vagy k&eacute;t csillag k&ouml;z&ouml;tt: **)</li>
  <li> <big>sz&ouml;vegm&eacute;ret n&ouml;vel&eacute;se</big> kett&#337;skeresztek k&ouml;z&eacute; [##] illeszt&eacute;ssel</li>

  <li> <small> sz&ouml;vegm&eacute;ret cs&ouml;kkent&eacute;se </small> k&eacute;t "55" jel k&ouml;z&eacute; illeszt&eacute;ssel</li>
  <li> egy <tt>&iacute;r&oacute;g&eacute;p &iacute;r&aacute;smint&aacute;j&aacute;ra</tt> hasonl&iacute;t&oacute; szerkeszt&eacute;ssel a sz&ouml;veget k&eacute;t egyenl&#337;s&eacute;gjel k&ouml;z&eacute; [==] illesztve szerkeszthet&uuml;nk </li>
  </ul>

<h4>List&aacute;k</h4>

  <ul>
  <li> lista kezd&eacute;se * jellel t&ouml;rt&eacute;nik</li>
  <li> sz&aacute;mozott lista elej&eacute;n #-t haszn&aacute;lunk <ol>
    <li> tov&aacute;bbi list&aacute;kat hozhatunk l&eacute;tre</li>

    <li> ehhez az alpontokat ugyan&uacute;gy a * &eacute;s a # jelek megfelel&#337; vari&aacute;l&aacute;s&aacute;val alak&iacute;thatjuk ki </li>
    </ol>
  </li>
  </ul>

<h4> HyperLinks</h4>

  <ul>

  <li> &uacute;j ugr&oacute;pont l&eacute;trehoz&aacute;s&aacute;hoz adjunk meg egy wikisz&oacute;t a sz&ouml;vegen bel&uuml;l</li>
  <li> bizonyos szavakat [sz&ouml;gletes z&aacute;r&oacute;jelben] megadva ugr&oacute;pontot hozhatunk l&eacute;tre a WikiWikiWeb belsej&eacute;ben, amely nem egy &eacute;rv&eacute;nyes wikisz&oacute;b&oacute;l &aacute;ll</li>

  <li> az &eacute;rv&eacute;nyes internetes  (http://-vel kezd&#337;d&#337;) c&iacute;mek, p&eacute;ld&aacute;ul a http://www.example.com/ webc&iacute;m sz&ouml;veg&eacute;t a rendszer automatikusan kattinthat&oacute;v&aacute; alak&iacute;tja</li>
  <li> egy www-c&iacute;met vagy egy WikiLink-et sz&ouml;gletes z&aacute;r&oacute;jelbe t&eacute;ve &eacute;s id&eacute;z&#337;jelek vagy a | karakterek k&ouml;z&eacute; helyezve megfelel&#337; c&iacute;met megadva: <ul>
    <li> [c&iacute;m | http://p&eacute;lda.com]</li>

    <li> [WikiWord "c&iacute;m"] vagy ["c&iacute;m" WikiLink] </li>
    </ul>
  </li>
  <li> ha egy wikisz&oacute;t, !http://www-c&iacute;met (vagy [b&aacute;rmit], ami sz&ouml;gletes z&aacute;r&oacute;jelben van) nem szeretn&eacute;nk ugr&oacute;pontt&aacute; alak&iacute;ttatni, mind&ouml;ssze egy felki&aacute;lt&oacute;jelet vagy egy hull&aacute;mvonalat kell el&eacute; &iacute;rnunk <ul>
    <li> !NoHyperLink, ~NoHyperLink</li>
    <li> ![Nem hiperkapcsolat], !http://nolink.org/ </li>

    </ul>
  </li>
  </ul>

<h4> T&aacute;bl&aacute;zatok a | jellel</h4>
| az egyes elemek | k&ouml;t&#337;jelesek | karakter | <br>
| fel&eacute;p&iacute;tett | t&aacute;bl&aacute;zati strukt&uacute;ra | <br>
| a b&ouml;ng&eacute;sz&#337;k rendszerint | kihagyj&aacute;k az &uuml;res | cell&aacute;kat | <br>


<p>
A t&aacute;bl&aacute;zat el&eacute; &eacute;s ut&aacute;n mindig sz&uacute;rjunk be egy &uuml;res sort, hogy bekezd&eacute;s&eacute;n bel&uuml;l elk&uuml;l&ouml;n&uuml;lj&ouml;n a t&ouml;bbi sz&ouml;vegt&#337;l.
</p>

<h4> &Aacute;br&aacute;k</h4>

  <ul>

  <li> k&eacute;p besz&uacute;r&aacute;s&aacute;hoz illessz&uuml;k annak teljes el&eacute;r&eacute;si &uacute;tvonal&aacute;t sz&ouml;gletes z&aacute;r&oacute;jelek k&ouml;z&eacute;, pl.: [http://www.p&eacute;lda.com/pics/image.png] </li>
  <li> m&aacute;sik megold&aacute;s a k&eacute;pfelt&ouml;lt&#337; funkci&oacute; haszn&aacute;lata.</li>
  </ul>

<h4>Tov&aacute;bbi olvasm&aacute;nyok</h4>
A Wiki jel&ouml;l&#337;nyelv egy sor egy&eacute;b lehet&#337;s&eacute;get tartalmaz. Tov&aacute;bbi inform&aacute;ci&oacute;k&eacute;rt l&aacute;sd az <a href="http://erfurtwiki.sourceforge.net" target=_new>Erfurt Wiki Homepage</a> oldalt. 