<P ALIGN=CENTER><B>Lehet&#337;v&eacute; teszi, hogy a tanul&oacute;k &iacute;rjanak a wikibe</B></P>
<P>
<UL>
  <li>A tan&aacute;r a kurzus&aacute;ban szerepl&#337; &ouml;sszes wikibe &iacute;rhat </li>
  <li>H&aacute;romf&eacute;le wiki l&eacute;tezik: tan&aacute;ri, kurzus-/csoport- &eacute;s tanul&oacute;i wiki</li>
  <li>A tev&eacute;kenys&eacute;g az al&aacute;bbi Moodle-csoporthoz tartoz&oacute; &aacute;llapotokkal rendelkezik: "Nincs csoport", "K&uuml;l&ouml;n csoportok" &eacute;s "L&aacute;that&oacute; csoportok"</li>
  <li>Minden csoport eset&eacute;n ugyanaz a kezd&#337; tartalom szerepel.</li>
</UL>

&Iacute;gy egy m&aacute;trixot kapunk:
<table border="1" width="100%"><tbody>
  <tr>
    <th valign="top" width="25%"></th>
    <th valign="top" width="25%">Nincs csoport</th>
    <th valign="top" width="25%">K&uuml;l&ouml;n csoportok</th>
    <th valign="top" width="25%">L&aacute;that&oacute; csoportok</th>
  </tr>
  <tr>
    <th valign="top" width="25%">Tan&aacute;r</th>
    <td valign="top" width="25%">A tan&aacute;r hozza l&eacute;tre &eacute;s m&oacute;dos&iacute;tja a wikit. A tanul&oacute; olvashatja a tartalmat.</td>
    <td valign="top" width="25%">Minden csoporthoz tartozik egy wiki, amelyet csak a tan&aacute;r m&oacute;dos&iacute;that. A tanul&oacute;k csak a saj&aacute;t csoportjukhoz tartoz&oacute; wikit l&aacute;tj&aacute;k.</td>
    <td valign="top" width="25%">Minden csoporthoz tartozik egy wiki, amelyet csak a tan&aacute;r m&oacute;dos&iacute;that. A tanul&oacute;k az &ouml;sszes olyan wikit l&aacute;tj&aacute;k, amely egy, az &ouml;sszes csoportot tartalmaz&oacute; leny&iacute;l&oacute; men&uuml;b&#337;l kiv&aacute;laszthat&oacute;.</td>
  </tr>
  <tr>
    <th valign="top" width="25%">Kurzus/csoport</th>
    <td valign="top" width="25%">A tan&aacute;r &eacute;s a felhaszn&aacute;l&oacute; hozhatja l&eacute;tre &eacute;s m&oacute;dos&iacute;thatja a wikit.</td>
    <td valign="top" width="25%">A tanul&oacute; a saj&aacute;t csoportj&aacute;hoz tartoz&oacute; wikit m&oacute;dos&iacute;thatja &eacute;s megtekintheti.</td>
    <td valign="top" width="25%">A tanul&oacute; a saj&aacute;t csoportj&aacute;hoz tartoz&oacute; wikit m&oacute;dos&iacute;thatja. A tanul&oacute;k az &ouml;sszes olyan wikit l&aacute;thatj&aacute;k, amelyek egy, az &ouml;sszes csoportot tartalmaz&oacute; leny&iacute;l&oacute; men&uuml;b&#337;l kiv&aacute;laszthat&oacute;k.</td>
  </tr>
  <tr>
    <th valign="top" width="25%">Tanul&oacute;</th>
    <td valign="top" width="25%">Minden tanul&oacute; a saj&aacute;t wikij&eacute;t l&aacute;thatja &eacute;s m&oacute;dos&iacute;thatja.</td>
    <td valign="top" width="25%">Minden tanul&oacute; a saj&aacute;t wikij&eacute;t m&oacute;dos&iacute;thatja, &eacute;s l&aacute;tja csoportja tanul&oacute;inak &ouml;sszes wikij&eacute;t, amelyek egy, a csoportja &ouml;sszes tanul&oacute;j&aacute;t tartalmaz&oacute; leny&iacute;l&oacute; men&uuml;b&#337;l v&aacute;laszthat&oacute;k ki.</td>
    <td valign="top" width="25%">Minden tanul&oacute; a saj&aacute;t wikij&eacute;t m&oacute;dos&iacute;thatja, &eacute;s l&aacute;tja az &ouml;sszes wikit, amely egy, az &ouml;sszes tanul&oacute;t tartalmaz&oacute; leny&iacute;l&oacute; men&uuml;b&#337;l v&aacute;laszthat&oacute; ki.</td>
  </tr></tbody>
</table>

</P>

