
<P ALIGN=CENTER><B>Acceptaci&oacute; de les avaluacions</B></P>

<P>La tasca d'un taller pot tenir aquestes caracter&iacute;stiques:
<OL>
  <LI>En les fases d'enviaments i d'avaluaci&oacute;, quan els estudiants veuen 
    les avaluacions fetes pels altres estudiants, no hi ha retroalimentaci&oacute; 
    dels que enviaren el treball cap als que fan les valoracions. Hi pot haver 
    retroalimentaci&oacute; per part del professorat si aquest decideix posar 
    una nota a les avaluacions de l'estudiant, perqu&egrave; aleshores les notes 
    i comentaris del professor es mostren tant a l'estudiant autor del treball 
    com a l'estudiant que va fer l'avaluaci&oacute;. Hi haur&agrave;, tanmateix, 
    nom&eacute;s una via de retroalimentaci&oacute; entre estudiants per a cada 
    treball.
  <LI>En les fases d'enviaments i d'avaluaci&oacute; els estudiants veuen les 
    avaluacions fetes pels altres estudiants i poden comentar-les. Poden estar 
    d'acord o en desacord amb l'avaluaci&oacute; dels companys. Si hi estan d'acord 
    aleshores l'avaluaci&oacute; roman tal com estava i serveix pels c&agrave;lculs 
    finals quan es determina la nota que els companys han donat a un determinat 
    treball. Per&ograve; si no estan d'acord amb l'avaluaci&oacute; rebuda, l'estudiant 
    que la va fer t&eacute; una oportunitat per revisar-la. El cicle de revisi&oacute; 
    i desacord pot continuar fins arribar a un consens o a la data l&iacute;mit 
    de presentaci&oacute;. Una avaluaci&oacute; que encara estigui discutint-se 
    en la data l&iacute;mit no s'utilitza pels c&agrave;lculs finals. Aix&ograve; 
    proporciona dues vies de retroalimentaci&oacute; entre companys en cada treball.
</OL>
Si s'escull el segon m&egrave;tode de treball hi ha l'opci&oacute; d'ocultar les 
notes. &Eacute;s a dir, si s'activa l'opci&oacute; &quot;amaga les notes&quot; 
nom&eacute;s es mostraran els comentaris de les avaluacionsa l'estudiant que va 
fer el treball que s'est&agrave; avaluant. Les notes nom&eacute;s es mostren despr&eacute;s 
d'assolir el consens. Observeu que aquesta opci&oacute; nom&eacute;s &eacute;s 
efectiva quan es necessita el consens en les avaluacions