
<P ALIGN=CENTER><B>El c&agrave;lcul de la nota final</B></P>

<P>La taula d'aquesta pantalla mostra com es calculen les notes finals dels estudiants. 
  Les notes finals s'obtenen fent una suma ponderada de fins a cinc components:
<OL>
  <LI>La nota del professorat sobre el treball enviat. &Eacute;s opcional per&ograve; 
    s'utilitzar&agrave; si el professorat avalua el treball dels estudiants. Si 
    l'estudiant envia m&eacute;s d'un treball es comptar&agrave; la millor nota. 
    I &quot;millor&quot; significa el treball amb la m&eacute;s alta combinaci&oacute; 
    ponderada de nota del professor i de la nota dels companys.
  <LI>La mitjana de les notes dels companys del treball enviat. Un altre cop, 
    si l'estudiant envia m&eacute;s d'un treball s'usa la &quot;millor&quot; nota. 
    La nota dels companys pot incloure ocasionalment la nota del professorat. 
    Aquesta nota es podria incloure al c&agrave;lcul si el nombre de notes de 
    companys &eacute;s molt petit o si es considera que les notes dels companys 
    estan esbiaixades (normalment cap a dalt) o mereixen poca confian&ccedil;a. 
    Si s'inclou la nota del professorat, aquesta es tracta de la mateixa manera 
    que les dels companys a l'hora de fer el c&agrave;lcul de la mitjana.
  <LI>L'esbiaxament de l'estudiant al puntuar el treball dels companys. Aix&ograve; 
    mesura si les notes de l'estudiant s&oacute;n o massa altes o massa baixes. 
    No &eacute;s una mesura absoluta i es basa en la difer&egrave;ncia entre les 
    notes de l'estudiant i les mitjanes dels companys per cada enviament que avaluen. 
    En general no se li hauria de donar massa &quot;pes&quot; a aquest component.
  <LI>El grau de confian&ccedil;a al puntuar els treballs dels companys. Aix&ograve; 
    mesura si les notes d'un estudiant sobre un treball segueixen la mitjana de 
    les notes dels companys . Aquesta mesura descompta L'esbiaixament de l'estudiant 
    i fa la mitjana de les difer&egrave;ncies absolutes entre les seves notes 
    i les notes mitjanes dels companys. En teoria, si un estudiant puntua alt 
    els treballs bons i puntua baix els no tan bons el seu grau de confian&ccedil;a 
    &eacute;s alt. Si se sospita que els estudiants en general s&oacute;n avaluadors 
    pobres aleshores es poden incloure les notes del professorat en la mitjana 
    de notes dels companys, cosa que que donar&agrave; m&eacute;s sentit al grau 
    de confian&ccedil;a.
  <LI>La nota mitjana donada pel professorat a les avaluacions de l'estudiant. 
    Aix&ograve; inclou tant les avaluacions preliminars fetes per l'estudiant 
    en els treballs d'exemple com qualsevol nota que posa el professorat a les 
    avaluacions fetes durant la fase d'avaluaci&oacute; de la tasca per part dels 
    companys.. En general aquest component &eacute;s, probablement, m&eacute;s 
    important que l'esbiaixament i el rau de confian&ccedil;a de manera que, si 
    &eacute;s possible, se li ha de donar un &quot;pes&quot; m&eacute;s gran.
</OL>

<P>Aquests cinc components es poden ponderar com es cregui m&eacute;s convenient 
  per a la tasca encomanada. Per exemple, se li pot donar un pes m&eacute;s gran 
  a la nota del professorat si es considera que la nota dels companys &eacute;s 
  nom&eacute;s una petita part del total de l'avaluaci&oacute;. Alternativament, 
  si el professorat nom&eacute;s puntua una petita part dels enviaments es poden 
  ignorar aquestes notes donant-les un pes de zero. Si la tasca deixa que siguin 
  els estudiants qui posin notes i proporcionin retroalimentaci&oacute; aleshores 
  els dos primers components es poden deixar a zero (o baixos) i qui determinar&agrave; 
  les notes finals ser&agrave; l'habilitat puntuadora dels estudiants.
<P>Observeu que aquesta pantalla s'utilitza diverses vegades i les notes finals 
  no es mostren als estudiants fins la fase final de l'avaluaci&oacute;. Un cop 
  el professorat est&agrave; satisfet amb les notes finals i llurs ponderacions 
  ja les pot fer accessibles als estudiants.
