
<P ALIGN=CENTER><b>Elements d'avaluaci&oacute;</b></P>

<P>Per facilitar la puntuaci&oacute; una Tasca de taller ha de tenir un nombre 
  raonable d'<b>elements d'avaluaci&oacute;.</b> Cada element hauria de cobrir 
  una aspecte particular de la tasca. T&iacute;picament una tasca tindr&agrave; 
  entre 5 i 15 elements per comentar i puntuar; depenent el nombre real de la 
  mida i la complexitat de la tasca. S'accepta una tasca en grup de nom&eacute;s 
  un element i t&eacute; una estrat&egrave;gia avaluadora similar a les Tasques 
  de Moodle.
<P>El tipus d'elements depenen de l'estrat&egrave;gia puntuadora de la tasca.
<P><B>No qualificat.</B> Els elements s&oacute;n purament descripcions d'aspectes 
  de la tasca. Se li demana a l'avaluador que comenti cadascun d'aquests aspectes. 
  De la mateixa manera que a totes les altres estrat&egrave;gies puntuadores aqu&iacute; 
  tamb&eacute; hi ha una &agrave;rea per a comentaris generals.
<P><B>Acumulatiu.</B> Els elements tenen aquestes tres caracter&iacute;stiques: 
<OL>
  <LI>La DESCRIPCI&Ouml; de l'element d'avaluaci&oacute;. Aqu&iacute; s'hauria 
    d'aclarir quin aspecte de la tasca &eacute;s el que s'avalua. Si l'avaluaci&oacute; 
    &eacute;s qualitativa val la pena donar detalls del que es considera Excel&middot;lent, 
    Correcte i Pobre.
  <LI>L'ESCALA de l'element d'avaluaci&oacute;. Hi ha un nombre d'escales predefinit 
    que van des de les senzilles escales de S&iacute;/No fins a escales percentuals 
    passant per escales multipunts. Cada element t&eacute; la seva pr&ograve;pia 
    escala que cal escollir per encaixar amb la quantitat possible de variacions 
    d'aquest element. Observeu que l'escala NO determina la import&agrave;ncia 
    de l'element quan es calcula la nota global; per exemple: una escala de dos 
    punts t&eacute; la mateixa &quot;influ&egrave;ncia&quot; que una altra de 
    100 punts si els elements respectius tenen el mateix &quot;pes&quot;
  <LI>El PES de l'element d'avaluaci&oacute;. Per defecte els elements tenen la 
    mateixa import&agrave;ncia quan es calcula la nota global de la tasca. Per&ograve; 
    es pot canviar si es d&oacute;na als elements m&eacute;s importants un pes 
    m&eacute;s gran que 1, i als menys importants un pes per sota d'1. Canviar 
    els pesos NO afecta a la nota m&agrave;xima perqu&egrave; aquest valor es 
    fixa a trav&eacute;s del par&agrave;metre Nota m&agrave;xima de l'avaluaci&oacute; 
    dels companys. Els pesos poden ser valors negatius tot i que aquest aspecte 
    &eacute;s experimental encara.
</OL>
<P><B>Marge d'error.</B> Els elements d'avaluaci&oacute; descriuran certs aspectes 
  que han de ser presents en la tasca. L'avaluaci&oacute; es fa per la pres&egrave;ncia 
  o abs&egrave;ncia d'aquests aspectes. El professorat ha de establir clarament 
  quina nota posar quan tots els aspectes estan presents, quan un &eacute;s absent, 
  quan en manquen dos, etc. Si alguns aspectes s&oacute;n m&eacute;s importants 
  que altres se'ls pot donar un pes m&eacute;s gran que 1. Aspectes menors poden 
  tenir un pes inferior a 1. El compte global d'errors &eacute;s la suma dels 
  aspectes que manques. L'avaluador sempre pot fer un petit ajustament a aquestes 
  notes suggerides.
<P><B>Criteris.</B> Els elements donaran un conjunt de valors de &quot;nivell&quot; 
  que s'utilitzaran per a puntuar la tasca. Els valors poden ser acumulatius o 
  no. L'avaluador haur&agrave; de decidir quin valor correspon millor a cada treball. 
  El professorat tamb&eacute; ha de relacionar cada valor del criteri amb una 
  nota suggerida que hauria de ser ordenada. L'avaluador sempre pot fer un petit 
  ajustament a aquestes notes suggerides.</P>
<P><B>R&uacute;brica.</B> Similar a l'anterior per&ograve; amb m&eacute;s d'un 
  criteri. El nombre de criteris es determina als par&agrave;metres de la tasca. 
  En cada criteri hi poden haver fins a cinc valors de &quot;nivell&quot;. En 
  una tasca determinada el nombre de nivells pot variar d'un criteri a un altre. 
  Quan es determina un criteri un valor de nivell en blanc assenyala el final 
  dels valors de nivell. Aix&iacute; algun criteri pot tenir dos nivells, un altre 
  tres o un m&agrave;xim de cinc. El criteri es pot ponderar. Els nivell es puntuen 
  0, 1, 2, fins a 4. La nota de l'avaluaci&oacute; &eacute;s una suma ponderada 
  d'aquestes puntuacions.</P>
