
<P ALIGN=CENTER><B>Puntuar l'estrat&egrave;gia</B></P>

<P>La tasca d'un Taller &eacute;s molt flexible en quant al tipus d'esquema de 
  puntuaci&oacute; que es pot arribar a utilitzar. Aix&iacute; tenim:
<OL>
  <LI><B>Sense puntuar:</B> En aquest tipus de tasca el professorat no s'interessa 
    en l'avaluaci&oacute; quantitativa dels estudiants. Els estudiants fan comentaris 
    sobre els treballs per&ograve; no els puntuen. El professorat, tanmateix, 
    pot puntuar els comentaris dels estudiants si ho desitja. Aquestes &quot;notes 
    de les notes&quot; formen part de la nota final de cada estudiant. Si el professorat 
    no puntua les avaluacions dels estudiants aleshores no hi haur&agrave; notes 
    finals de la tasca. 
  <LI><b>Puntuaci&oacute; acumulativa:</b> Aquesta &eacute;s la puntuaci&oacute; 
    per defecte. En aquest tipus de tasca la nota de cada avaluaci&oacute; s'obt&eacute; 
    a partir dels &quot;elements d'avaluaci&oacute;&quot;. Cada element hauria 
    de cobrir un aspecte particular de la tasca. Normalment una tasca tindr&agrave; 
    entre 5 i 15 elements d'avaluaci&oacute;per comentar i puntuar, i el nombre 
    real dependr&agrave; de la mida i la complexitat de la tasca. Es pot fer una 
    avaluaci&oacute; pels companys amb nom&eacute;s un element i t&eacute; una 
    estrat&egrave;gia avaluadora semblant a la de la Tasca est&agrave;ndard de 
    Moodle. 
    <P> Els elements tenen aquestes tres caracter&iacute;stiques: 
    <OL>
      <LI>La DESCRIPCI&Oacute; de l'element d'avaluaci&oacute; S'hauria d'establir 
        molt clarament quins aspectes de la tasca s'han d'avaluar Si l'avaluaci&oacute; 
        &eacute;s qualitativa pot ser molt &uacute;til detallar qu&egrave; es 
        considera excel&middot;lent, qu&egrave; correcte i qu&egrave; pobre. 
      <LI>L'ESCALA de l'element d'avaluaci&oacute;. Hi ha un cert nombre d'escales 
        predefinides que van des del simple S&iacute;/No fins a escales percentuals 
        passant per les multipunt.. Cada element t&eacute; la seva pr&ograve;pia 
        escala que cal triar per tal de cobrir totes les possibles variacions 
        de l'element. Observeu que l'escala NO determina la import&agrave;ncia 
        de l'element quan es calcula la nota global; per exemple: una escala de 
        dos punts t&eacute; la mateixa &quot;influ&egrave;ncia&quot; que una altra 
        de 100 punts si els elements respectius tenen el mateix &quot;pes&quot; 
        <br>
        El PES de l'element d'avaluaci&oacute;. Per defecte els elements tenen 
        la mateixa import&agrave;ncia quan es calcula la nota global de la tasca. 
        Per&ograve; es pot canviar si es d&oacute;na als elements m&eacute;s importants 
        un pes m&eacute;s gran que 1, i als menys importants un pes per sota d'1. 
        Canviar els pesos NO afecta a la nota m&agrave;xima perqu&egrave; aquest 
        valor es fixa a trav&eacute;s del par&agrave;metre Nota m&agrave;xima 
        de l'avaluaci&oacute; dels companys. Els pesos poden ser valors negatius 
        tot i que aquest aspecte &eacute;s experimental encara. <br>
        <br>
    </OL>
  <LI><B>Marge d'error:</B> En aquest tipus de tasca es puntuen els enviaments 
    amb una escala de tipus S&iacute;/No. La nota es determina per la &quot;Taula 
    de notes&quot; que ens dona la relaci&oacute; entre el nombre d'errors i la 
    nota suggerida. Per exemple, una tasca pot tenir sis items significatius que 
    han d'estar presents, la Taula de notes donar&agrave; les puntuacions suggerides 
    si tots 6 s&oacute;n presents, si un &eacute;s absent, si en manquen dos, 
    etc. Cada &iacute;tem, si es desitja, pot tenir factors ponderadors si &eacute;s 
    que n'hi ha uns de m&eacute;s importants que d'altres. El nombre d'<i>errors</i> 
    &eacute;s la suma ponderada dels &iacute;tems absents. Per defecte cada &iacute;tem 
    t&eacute; un pes de 1. La Taula de notes pot ser no lineal; per exemple, les 
    notes suggerides per a una tasca amb 10 &iacute;tems poden ser: 90%, 70%, 
    50%, 40%, 30%, 20%, 10%, 0%, 0%, 0%. La persona que avalua pot ajustar les 
    notes suggerides fins al 20% de la nota final de l'enviament. 
  <LI><b>Criteris:</b> El tipus d'avaluaci&oacute; m&eacute;s senzill tot i que 
    no necess&agrave;riament els m&eacute;s f&agrave;cil de plantejar. Els enviaments 
    es puntuen segons un joc de criteris. La persona avaluadora tria quin criteri 
    defineix millor el treball. La nota es determina per una &quot;Taula de criteris&quot; 
    que dona la nota suggerida per a cada criteri. Per exemple, podem establir 
    una tasca amb 5 criteris i els avaluadors hauran de triar un d'aquests cinc 
    criteris per cadascuna de les seves avaluacions De la mateixa manera que a 
    la tasca amb marge d'error l'avaluador pot ajustar la nota suggerida fins 
    al 20% per tal de donar la nota final.
</OL>

<p></P>
