 
<P ALIGN=CENTER><B>Gestionar la tasca d'un taller </B></P>

<P>La Tasca d'un Taller &eacute;s m&eacute;s complexa que una tasca ordin&agrave;ria 
  perqu&egrave; implica un determinat nombre de passos o fases, que s&oacute;n 
  aquests: 
<OL>
  <LI>L'avaluaci&oacute;de la tasca es descompon en diversos ELEMENTS d'avaluaci&oacute;. 
    Aix&ograve; fa que la puntuaci&oacute; d'una tasca sigui menys arbitr&agrave;ria 
    i d&oacute;na a l'estudiant un marc on fer les avaluacions. El professorat 
    t&eacute; la tasca d'establir els elements d'avaluaci&oacute;.a trav&eacute;s 
    del full de puntuacions. 
    <P> 
    <P>Un cop establerts els elements d'avaluaci&oacute; el professorat enviar&agrave; 
      un petit nombre de treballs d'exemple que serveixen per a qu&egrave; els 
      estudiants avalu&iuml;n abans de fer els seus propis treballs. Tanmateix, 
      abans de donar a con&egrave;ixer la tasca als estudiants el professorat 
      hauria d'avaluar aquests treballs. D'aquesta manera els professors tindran 
      en la seg&uuml;ent fase algunes respostes de mostra per quan revisin les 
      avaluacions d'aquests treballs per part dels estudiants. 
    <P>El fet que el professorat envi&iuml; treballs &eacute;s opcional i en alguns 
      casos fins i tot &eacute;s inapropiat.</P>
  <LI>Ara la tasca ja &eacute;s accessible als estudiants. Si el professorat ha 
    preparat treballs d'exemple els estudiants n'han d'avaluar alguns (El nombre 
    d'avaluacions es va fixar quan es cre&agrave; la tasca). Un cop un estudiant 
    ha fet les avaluacions. requerides ja pot enviar el seu propi treball. En 
    el cas d'una tasca sense exemples els estudiants poden enviar els seus treballs 
    immediatament. 
    <P>Quan un estudiant ha enviat el seu treball el professorat, si aix&iacute; 
      ho desitja, ja pot avaluar-lo. Aquesta avaluaci&oacute; s'incorpora a la 
      nota final de l'estudiant. Les avaluacions es poden fer b&eacute; durant 
      la fase d'enviament o b&eacute; un cop ha finalitzat el termini.</P>
    <P>Si la tasca incorpora avaluaci&oacute; pels companys els estudiants que 
      han enviat treballs poden avaluar els treballs d'altres estudiants. Quan 
      hagin avaluat als companys aquest podran llegir les avaluacions que els 
      han fet. L'estudiant que ha enviat el treball pot comentar l'avaluaci&oacute; 
      si s'ha triat aquesta opci&oacute; al crear la tasca. Si ho desitja, el 
      professorat pot puntuar aquestes avaluacions dels companys i les notes van 
      a afegir-se a les notes finals dels estudiants, tot i que en molts de casos 
      no &eacute;s necessari, tal com veureu a la fase seg&uuml;ent.</P>
  <LI>Un cop ha passat la data l&iacute;mit el professorat mou la tasca a la fase 
    seg&uuml;ent on ja no s&oacute;n permesos ni enviaments ni avaluacions. Ara 
    el professorat, si vol, pot completar la puntuaci&oacute; de les avaluacions 
    fetes sobre els exemples i sobre els enviaments dels estudiants. Tamb&eacute; 
    pot puntuar l'avaluaci&oacute; dels companys feta pels estudiants. Tanmateix 
    aix&ograve; no &eacute;s realment necessari perqu&egrave; la manera de puntuar 
    de cada estudiant es pot determinar a partir de les puntuacions relatives. 
    <P>Quan ha acabat de puntuar el professorat calcula la nota final dels estudiants. 
      Aquestes notes finals es calculen normalment a partir de tres components: 
      la nota que el professorat ha posat al treball de l'estudiant, la mitjana 
      de les notes que han posat els companys al treball i la manera de puntuar 
      de l'estudiants. Aquest darrer component inclou la mitjana de la &quot;nota 
      de les notes&quot; entrada pel professorat sobre els comentaris de l'estudiant. 
      Els tres components s&oacute;n ponderats pel professor abans del c&agrave;lcul 
      de la nota final.</p>
  <LI>La fase final de la tasca consisteix en que els estudiants vegin les seves 
    notes finals. Si ho desitja el professorat pot tornar a la tasca per permetre 
    alguns ajustaments de, per exemple, els pesos que s'utilitzaran per calcular 
    la nota final; aleshores les notes revisades es tornen a mostrar als estudiants. 
    <p>Tant estudiants com professorat poden veure la &quot;Taula comunit&agrave;ria&quot; 
      dels enviaments dels estudiants. Aqu&iacute; hi s&oacute;n llistats, per 
      ordre de nota, amb la m&eacute;s alta a dalt de tot. Aqu&iacute; la nota 
      de l'enviament &eacute;s una combinaci&oacute; de la nota del professorat 
      i de la mitjana de les notes dels companys( si aix&iacute; s'havia determinat). 
      La ponderaci&oacute; usada &eacute;s la que s'ha fixat en la fase anterior.</p>
</OL>
<P>En qualsevol fase de la tasca el professorat pot obrir la p&agrave;gina d'<b>Administraci&oacute;</b> 
  que mostra l'estat actual de la tasca. Mostra la llista d'enviaments del professorat, 
  si se n'han fet, les avaluacions dels estudiants (les del treball d'exemple 
  del professor, del seu propi treball i dels enviaments dels altres estudiants) 
  i els enviaments dels estudiants. El professorat pot fer servir aquesta p&agrave;gina 
  per avaluar i reavaluar els enviaments, puntuar i tornar a puntuar avaluacions, 
  esborrar enviaments i avaluacions i, en general, per mirar el progr&eacute;s 
  de la tasca.</P>
