<p align="center"><b>Ceisteanna</b></p>



<p>Bealach maith le cabhr&uacute; le daoine eile &aacute;bhar a mhachnamh
is ea ceist a chur orthu ina leith. Nuair a cuirtear ceist mhaith, cuid&iacute;onn
s&eacute; linn eolas a tharraingt le ch&eacute;ile, na smaointe at&aacute;
againn a mheas agus smaointe nua a chruth&uacute;.</p>



<p><i>Ceisti&uacute; S&oacute;craiteach</i> a tugtar air cheisteanna a
chur go sonrach le cuidi&uacute; le daoine foghlam, ainm a thagra&iacute;onn
do Sh&oacute;crait sa Gh&eacute;ig &Aacute;rsa.</p>



<p>N&iacute; m&oacute;r, le ciesteanna sh&oacute;craiteacha, &eacute;isteach
go han-ch&uacute;ramach leis an duine eile le cuidi&uacute; leat do cheist
a mheas agus a chur ar bhealach cuiditheach, inchiallaithe agus neamhionsaitheach.</p>



<p>Sampla&iacute; iad seo d&aacute; leith&eacute;id de cheisteanna:</p>



<!--Hidden comment: Someday I will include a great example dialogue here -->







<h3>
Ceisteanna l&eacute;iri&uacute;ch&aacute;in</h3>

<ul>
<li>
C&eacute;ard at&aacute; i gceist agat nuair a deir t&uacute; ______?</li>

<li>
C&eacute;n phr&iacute;omhphointe at&aacute; agat?</li>

<li>
C&eacute;n chaoi a mbaineann _____ le _____?</li>

<li>
An bhf&eacute;adf&aacute; &eacute; sin a r&aacute; ar shl&iacute; eile?</li>

<li>
Fan go bhfeicfidh m&eacute; an dtuigim i gceart th&uacute;; an &eacute;
_____ n&oacute; _____ at&aacute; i gceist agat?</li>

<li>
C&eacute;n chaoi a gceangla&iacute;onn s&eacute; seo leis an bhfadhb/&aacute;bhar
pl&eacute;/leis an gceist s'againne?</li>

<li>
Orla, an bhf&eacute;adf&aacute; achoimre a thabhairt i do chuid focail
f&eacute;in ar an m&eacute;id a d&uacute;irt Darach? ... Dharach, an &eacute;
sin a bh&iacute; i gceist agat?</li>

<li>
An bhf&eacute;adf&aacute; sampla a thabhairt dom?</li>

<li>
An sampla maith &eacute; _____ de sin?</li>
</ul>

<h3>
Ceisteanna a th&oacute;ra&iacute;onn foshu&iacute;omhanna</h3>

<ul>
<li>
C&eacute;ard lena bhfuil t&uacute; ag glacadh anseo?</li>

<li>
C&eacute;ard lena bhfuil Sin&eacute;ad ag glacadh?</li>

<li>
C&eacute;ard eile a bhf&eacute;adfaimis glacadh leis ina &aacute;it?</li>

<li>
Deabhra&iacute;onn s&eacute; go bhfuil t&uacute; ag glacadh leis go _____.
An dtuigim i gceart th&uacute;?</li>

<li>
T&aacute; do chuid r&eacute;as&uacute;na&iacute;ochta ar fad ag brath ar
an tuairim go _____. C&eacute;n f&aacute;th ar bhunaigh t&uacute; do r&eacute;as&uacute;na&iacute;ocht
ar _____ seachas _____?</li>

<li>
Deabhra&iacute;onn s&eacute; go nglacann t&uacute; leis _____. C&eacute;n
chaoi a bhf&iacute;rinn&iacute;onn t&uacute; glacadh leis sin?</li>

<li>
An mar sin a bh&iacute;onn i gc&oacute;na&iacute;? C&eacute;n f&aacute;th
a gceapann t&uacute; gur f&iacute;or an foshu&iacute;omh anseo?</li>

<li>
C&eacute;n f&aacute;th go nglacfadh duine leis gur f&iacute;or sin?</li>
</ul>

<h3>
Ceisteanna a th&oacute;ra&iacute;onn c&uacute;iseanna agus fianaise</h3>

<ul>
<li>
An bhf&eacute;adf&aacute; do chuid c&uacute;iseanna a mh&iacute;ni&uacute;
d&uacute;inn?</li>

<li>
C&eacute;n chaoi a mbaineann s&eacute; sin leis an gc&aacute;s seo?</li>

<li>
An bhfuil aon ch&uacute;is ann gan brath ar an bhfianaise sin?</li>

<li>
C&eacute; at&aacute; in ann fios a bheith acu gur f&iacute;or &eacute;
sin?</li>

<li>
Ceard a d&eacute;arf&aacute; le duine a d&uacute;irt go ____?</li>

<li>
An bhfuil fianaise ag &eacute;inne eile le tac&uacute; leis an dearacadh
sin?</li>

<li>
C&eacute;n r&eacute;as&uacute;na&iacute;ocht a bh&iacute; agat le teacht
ar an gconcl&uacute;id sin?</li>

<li>
C&aacute; bhfaigheadh muid amach an f&iacute;or &eacute; sin?</li>
</ul>

<h3>
Ceisteanna maidir le dearcadh n&oacute; le peirspict&iacute;ocht</h3>

<ul>
<li>
C&eacute; at&aacute; &aacute; impleacht&uacute; agat ansin?</li>

<li>
Nuair a deir t&uacute; _____, an bhfuil t&uacute; &aacute; chur i leith
go _____?</li>

<li>
Ach,d&aacute; dtarl&oacute;dh s&eacute; sin, c&eacute;n toradh a bheadh
air? C&eacute;n f&aacute;th?</li>

<li>
C&eacute;n tionchar a bheadh aige sin?</li>

<li>
An g&aacute; go dtarl&oacute;dh s&eacute; sin n&oacute; an &eacute; nach
bhfuil ann ach seans / d&oacute;ch&uacute;lacht go dtarl&oacute;dh s&eacute;?</li>

<li>
C&eacute;n mhalairt at&aacute; ann?</li>

<li>
M&aacute;s f&iacute;or _____ agus _____, c&eacute;ard eile a d'fh&eacute;adfadh
a bheith f&iacute;or?</li>

<li>
M&aacute; deirimid go bhfuil ____ eitici&uacute;il, c&eacute;ard faoi _____?</li>
</ul>

<h3>
Ceisteanna a th&oacute;ra&iacute;onn impleachta&iacute; agus iarmhairt&iacute;</h3>

<ul>
<li>
C&eacute;n chaoi a bhfaighidh muid amach?</li>

<li>
C&eacute;ard leis a nglacann an cheist seo?</li>

<li>
An gcuirfeadh _____ an cheist seo ar bhealach difri&uacute;il?</li>

<li>
An bhfuil r&eacute;iteach na ceiste seo ag &eacute;inne?</li>

<li>
An f&eacute;idir linn an cheist seo a bhriseadh s&iacute;os ar chor ar
bith?</li>

<li>
An bhfuil an cheist seo soil&eacute;ir? An dtuigeann muid &iacute;?</li>

<li>
An bhfuil s&eacute; &eacute;asca n&oacute; deacair an cheist seo a fhreagairt?
C&eacute;n f&aacute;th?</li>

<li>
An aonta&iacute;onn muid ar fad gurb &iacute; seo an cheist?</li>

<li>
Leis an gceist seo a fhreagairt, c&eacute; na ceisteanna eile is g&aacute;
d&uacute;inn a fhreagairt ar dt&uacute;s?</li>

<li>
C&eacute;n chaoi a gcuirfeadh _____ an saincheist in i&uacute;l?</li>

<li>
C&eacute; t&aacute;bhacht a bhaineann leis an saincheist seo?</li>

<li>
An &iacute; seo an cheist is t&aacute;bhachta&iacute;, n&oacute; an bhfuil
focheist ann?</li>

<li>
An bhfeiceann c&eacute; mar a cheangla&iacute;onn s&eacute; seo le ________?</li>
</ul>


<hr />

<font size="1"><i>Ceisteanna curtha in oiri&uacute;int &oacute; Paul,
R. (1993). Critical Thinking: How To Prepare Students for a Rapidly Changing
World: Foundation for Critical Thinking, Santa Rosa, CA. </i></font>



<p align="right"><a href="help.php?file=writing.html">Tuilleadh eolas maidir
le scr&iacute;obh</a></p>

<p align="right"><a href="help.php?file=reading.html">Tuilleadh eolais
maidir le l&eacute;amh</a></p>







