<p align="center"><b>Att importera nya fr&aring;gor</b></p>

<p>
Den h&auml;r funktionen l&aring;ter Dig importera fr&aring;gor fr&aring;n 
externa textfiler som har laddats upp via ett formul&auml;r.
</p>
<p>
Det finns ett antal olika filformat som Du kan anv&auml;nda:

<p><b>Utel&auml;mnade ord</b></p>
<ul>
<li>
Det h&auml;r formatet st&ouml;der bara flervalsfr&aring;gor.
Varje svar &auml;r &aring;tskiljt med tecknet tilde (~), 
och det korrekta svaret har ett prefix i form av ett likhetstecken (=).
H&auml;r &auml;r ett exempel:
 
<blockquote>
S&aring; snart vi som barn b&ouml;rjar att utforska v&aring;ra kroppsdelar 
s&aring; blir studenter/elever/l&auml;rande i &auml;mnena 
{=anatomi och fysiologi ~reflexologi 
~vetenskap ~experiment}, och p&aring; ett s&auml;tt f&ouml;rblir vi det livet ut.
</blockquote>
</li>
</ul>
<p align="right"><a href="help.php?file=formatmissingword.html&module=quiz">
Mer info om formatet "Utel&auml;mnade ord"</a></p>


<p><b>AON</b></p>
<ul>
<li>
Det h&auml;r &auml;r detsamma som formatet "Utel&auml;mnade ord" f&ouml;rutom det att
efter det att fr&aring;gorna har importerats s&aring; omvandlas alla kortsvarsfr&aring;gor 
, fyra &aring;t g&aring;ngen, till para-ihop-fr&aring;gor.
</li>
<li>
Dessutom blandas svaren p&aring; flervalsfr&aring;gor slumpm&auml;ssigt i samband
med att de importeras.
</li>
<li>
Formatet har d&ouml;pts efter en organisation som sponsrade utvecklingen 
av m&aring;nga egenskaper i testfunktioner av det h&auml;r slaget.
</li>
</ul>


<p><b>Blackboard</b></p>
<ul>
<li>
Den h&auml;r modulen kan importera fr&aring;gor som har sparats 
i Blackboards exportformat. Modulen &auml;r beroende av XML-funktioner
f&ouml;r att kunna kompileras in i Din PHP-applikation. 
</li>

</ul>
<p align="right"><a href="help.php?file=formatblackboard.html&module=quiz">
Mer info om 'Blackboard'-formatet</a></p>

<p><b>Egentillverkat</b></p>
<ul>
<li>
Om Du har ett eget format som Du beh&ouml;ver kunna importera s&aring; 
kan Du implementera det sj&auml;lv genom att redigera mod/quiz/format/custom.php
</li>
<p>
Det &auml;r inte s&aring; mycket ny kod som Du beh&ouml;ver, bara s&aring; mycket
som kr&auml;vs f&ouml;r att tolka (parse) en enskild fr&aring;ga ur en given text.
</li>
</ul>
<p align="right"><a href="help.php?file=formatcustom.html&module=quiz">
Mer info om "Egentillverkade" format</a></p>

<p>
Fler format kommer att finnas s&aring; sm&aring;ningom, WebCT, IMS QTI och vad som helst annat
som Moodle-anv&auml;ndare kan komma att bidra med!
</p>
