<!-- Traducci&oacute;n de Sergio Alfaro (sergio@alfaro.cl), revisada por Emmanuelle Guti&eacute;rrez y Restrepo (emmanuelle@sidar.org) -->

<h2>El acuerdo de evaluaciones</h2>




<p>Una tarea de taller puede tener cualquiera de estas caracter&iacute;sticas:</p>

<ol>
<li>En la fase de env&iacute;o y evaluaci&oacute;n, cuando los estudiantes ven las 
evaluaciones hechas por otros compa&ntilde;eros no hay ning&uacute;n 
comentario por parte de los que enviaron el trabajo a los estudiantes que hicieron la evaluaci&oacute;n. Puede haber comentarios del profesor si &eacute;ste elige calificar las evaluaciones de los estudiantes y entonces las 
calificaciones del profesor y sus comentarios estar&aacute;n disponibles para 
ambos; el estudiante cuyo trabajo es evaluado y para el estudiante que hizo la evaluaci&oacute;n. Habr&aacute;, sin embargo, aunque sea s&oacute;lo una v&iacute;a para comentarios entre compa&ntilde;eros en cualquiera de las partes del trabajo.</li> 

<li>En la fase de env&iacute;o y evaluaci&oacute;n los estudiantes ven las evaluaciones hechas por otros y les esta permitido comentar sobre esas evaluaciones. Pueden expresar su acuerdo o desacuerdo con la evaluaci&oacute;n. Si est&aacute;n de acuerdo con la valoraci&oacute;n entonces los datos de la evaluaci&oacute;n se utilizan en los c&aacute;lculos finales al determina la calificaci&oacute;n de los compa&ntilde;eros dada al trabajo. Sin embargo, si ellos no est&aacute;n de acuerdo con una evaluaci&oacute;n al estudiante que hizo la evaluaci&oacute;n se le da la oportunidad de revisarlo. La revisi&oacute;n del desacuerdo puede continuar hasta que se llegue a acuerdo o se termine el plazo de entrega. Una evaluaci&oacute;n que esta todav&iacute;a en &quot;discusi&oacute;n&quot; cuando finaliza el plazo (la fecha l&iacute;mite) no se usa en los c&aacute;lculos finales. Esto proporciona dos manera de comentar entre compa&ntilde;eros para cada trabajo.
</li>
</ol>


<p>Si se escoge el segundo m&eacute;todo de trabajo entonces puede deshabilitarse la presentaci&oacute;n de calificaciones. Esto es, si se ejerce la opci&oacute;n de &quot;Ocultar calificaciones&quot; al estudiante cuyo trabajo est&aacute; siendo evaluado s&oacute;lo se le muestran los comentarios. Las calificaciones s&oacute;lo se muestran una vez se ha conseguido un acuerdo (sobre los comentarios). Tenga en cuenta que esta opci&oacute;n s&oacute;lo es efectiva cuando se requiere acuerdo en las evaluaciones.</p>

