<!-- Traducci&oacute;n de Sergio Alfaro (sergio@alfaro.cl), revisada por Emmanuelle Guti&eacute;rrez y Restrepo (emmanuelle@sidar.org) -->
<h2>El C&aacute;lculo de las Calificaciones Finales</h2>

<p>La tabla en esta pantalla muestra c&oacute;mo se calcualn las calificaciones 
finales para los estudiantes. Las calificaciones finales son una suma ponderada 
de hasta cinco componentes:</p>
<ol>
<li>La calificaci&oacute;n del profesor a la tarea que ha enviado. Esto es opcional 
y ser&aacute; usado si el profesor en realidad eval&uacute;a el trabajo del estudiante. Si el estudiante env&iacute;a m&aacute;s de un trabajo se usa la &quot;la mejor&quot; calificaci&oacute;n. Aqu&iacute;, la mejor, significa el trabajo que tiene la combinaci&oacute;n ponderada m&aacute;s alta de la calificaci&oacute;n del profesor y la calificaci&oacute;n del compa&ntilde;ero... </li>
<li>El promedio de calificaciones de sus compa&ntilde;eros para la tarea que ha 
enviado. Una vez m&aacute;s si el estudiante envia m&aacute;s de un trabajo se usa &quot;la mejor&quot; calificaci&oacute;n. La calificaci&oacute;n por los compa&ntilde;eros opcionalmente puede incluir la calificaci&oacute;n del profesor. Esta calificaci&oacute;n ser&iacute;a incluida si el n&uacute;mero de calificaciones de compa&ntilde;eros es muy bajo o se piensa que las calificaciones de los compa&ntilde;eros son sospechosas de una calificaci&oacute;n sesgada (por lo general muy alta) o no son fiables. De ser incluida la calificaci&oacute;n del profesor, &eacute;sta es tratada de la misma manera que una calificaci&oacute;n de compa&ntilde;eros, en el c&aacute;lculo del promedio.</li> 
<li>El sesgo del estudiante en la calificaci&oacute;n del trabajo de 
compa&ntilde;eros. Esto pasa en la medida que el estudiante califica el trabajo 
demasiado alto o demasiado bajo. Esto no es una medida absoluta ya que 
est&aacute; basado en la diferencia entre la calificaci&oacute;n del estudiante y los 
promedios de los compa&ntilde;eros para cada uno de los env&iacute;os que ellos evaluaron. En general NO debe darrse a este componente una peso alto. </li>
<li>La fiabilidad del estudiante en la valoraci&oacute;n del trabajo de compa&ntilde;eros. Esto es una medida de c&oacute;mo califican los estudiantes siguiendo el promedio que obtuvieron los trabajos que ellos evaluaron. La medida rebaja (descuenta) el sesgo del estudiante y saca un promedio de las diferencias absolutas entre sus calificaciones y las calificaciones promedio de los compa&ntilde;eros. En teor&iacute;a, si los estudiantes dan calificaciones altas para trabajos buenos y bajas para los trabajos pobres, su fiabilidad ser&ntilde;a alta. Si se sospecha que los 
estudiantes en general asesoran pobremente entonces las 
calificaciones del profesor deber&iacute;an ser incluidas en los promedios de los 
compa&ntilde;eros, esto deber&iacute;a hacer m&aacute;s significativos los valores de fiabilidad.</li>
<li>La Calificaci&oacute;n promedio dada por el profesor para las evaluaciones del 
estudiante. Esto incluye tanto las evaluaciones preliminares hechas por el 
estudiante sobre los trabajos de ejemplo como cualquier 
calificaci&oacute;n hecha por el profesor sobre la evaluaci&oacute;n producida durante 
la fase de evaluaci&oacute;n por parte de los compa&ntilde;eros de la tarea. En general este componente es probablemente m&aacute;s importante que lso componentes de Sesgo y la Fiabilidad y por ello, de estar disponible, deber&iacute;a ser 
ponderado m&aacute;s alto que los dem&aacute;s (tener mayor peso).</li>
</ol>

<p>Estos cinco elementos pueden ser ponderados como se considere apropiado para la tarea. Por ejemplo, la calificaci&oacute;n del profesor podr&iacute;a tener una ponderaci&oacute;n (peso) mayor si la parte de la tarea calificada por los compa&ntilde;eros se considera como menor dentro del conjunto de la tarea. Alternativamente, si no hay calificaci&oacute;n por parte del profesor en absoluto entonces debe d&aacute;rsele un peso de cero a la calificaci&oacute;n del profesor. Si para toda la tarea act&uacute;an como jueces s&oacute;lo los estudiantes y son ellos los que proporcionan los comentarios, entonces los dos primeros componentes puede establecerse a cero (o bajos) y las habilidades de los estudiantes al calificar dominar&aacute;n las calificaciones finales.</p>

<p>Considere que esta pantalla es usada iterativamente y las calificaciones finales normalmente no estar&aacute;n disponible a los estudiantes hasta la fase final de la tarea. Una vez el profesor est&aacute; satisfecho con las calificaciones finales y su ponderac&iacute;n, entonces ellos puedr&aacute;n ponerse a disposici&oacute;n de los estudiantes.</p>
