<!-- Traducci&oacute;n de Sergio Alfaro (sergio@alfaro.cl)  -->
<h2>Elementos de las Tareas Calificadas por los Compa&ntilde;eros</h2>

<p>Para hacer m&aacute;s sencilla la calificaci&oacute;n de una Tarea Calificada por los Compa&ntilde;eros, &eacute;sta tiene una serie de &quot;Elementos de evaluaci&oacute;n&quot;. Cada elemento debe cubrir un particular aspecto de la tarea. Normalmente una tarea tendr&aacute; entre 5 y 15 elementos para ser comentados y calificados, cuyo n&uacute;mero real depende del tama&ntilde;o y complejidad de la tarea. Se permite que una tarea calificada por los compa&ntilde;eros tenga s&oacute;lo un elemento y que tenga una estrategia de valoraci&oacute;n similar a la de la tarea est&aacute;ndar del sistema.</p> 

<p>El tipo de elementos depende de la estrategia de calificaci&oacute;n de la tarea:</p>

<p><strong>No calificada</strong>.Los elementos son descripciones de aspectos de la tarea. Al asesor se le pide que comente cada uno de estos aspectos. Al igual que con todas las estrategias de calificaci&oacute;n, hay tambi&eacute;n un &aacute;rea para comentarios.</p>


<p><strong>Calificaci&oacute;n acumulativa</strong>. Los elementos tienen 3 caracter&iacute;sticas que son las siguientes:</p>
<ol>
  <li>La DESCRIPCI&Oacute;N del elemento de valoraci&oacute;n. Que debe establecer claramente qu&eacute; aspectos de la tarea est&aacute;n siendo valorados. Si la valoraci&oacute;n es cualitativa ser&aacute; &uacute;til dar detalles de qu&eacute; se considera excelente, en la media y pobre.</li>
  <li>La ESCALA del elemento de valoraci&oacute;n. Hay un n&uacute;mero predefinido de escalas. Las escalas se mueven en un rango que va del simple SI/NO pasando por escalas de valoraci&oacute;n m&uacute;ltiple hasta una escala de porcentaje total. Cada elemento tiene su propia escala que debe elegirse para completar el n&uacute;mero de posibles variantes para ese elemento. Advierta que la escala NO determina la importancia del elemento al calcular la calificaci&oacute;n final, una escala de 2 puntos tiene la misma &quot;influencia&quot; que una de 100 puntos si los respectivos elementos tienen el mismo peso.</li>
  <li>El PESO del elemento de valoraci&oacute;n. Por defecto a los elementos se les da la misma importancia en el c&aacute;lculo de la calificaci&oacute;n final de la tarea. Esto puede cambiarse d&aacute;ndole a los elementos m&aacute;s importantes un peso mayor y a los elementos menos importantes un peso menor. Cambiar los pesos NO afecta a la calificaci&oacute;n m&aacute;xima, ese valor se fija con el par&aacute;metro de Calificaci&oacute;n M&aacute;xima de la tarea calificada por los compa&ntilde;eros. </li>
</ol>
<p><strong>Error Escala de Calificaciones</strong>. Los elementos normalmente describir&aacute;n ciertas caracter&iacute;sticas o aspectos que deben estar presentes en la tarea. La evaluaci&oacute;n se hace bas&aacute;ndose en la presencia o la ausencia de estas caracter&iacute;sticas o aspectos. El profesor debe indicar todo en la Tabla de las Calificaciones y los comentarios que est&eacute;n presentes, cuando uno esta ausente, cuando dos estan ausentes, etc. Si ciertas partes son m&aacute;s importantes que otras entonces pueden dar a aquellas partes un suplemento de puntaje mayor que uno. Pueden dar a partes de menor importancia un suplemento de puntaje menor que uno. El total &quot; la escala de error &quot; es una suma ponderada de las partes que faltan. El asesor siempre puede hacer un ajuste menor a estas calificaciones sugeridas.</p>

<p><strong>Criterios de las Calificaciones</strong>: Los elementos dar&aacute;n un sistema de las declaraciones &quot;nivel&quot; que se pueden utilizar para alinear la tarea dentro de los distintos niveles. Las declaraciones pueden ser acumulativas o pueden ser aut&oacute;nomas. El asesor debe decidir qu&eacute; declaraci&oacute;n cabe lo mejor posible en cada parte del trabajo. El profesor debe tambi&eacute;n relacionar cada declaraci&oacute;n del criterio con una calificaci&oacute;n sugerida. &Eacute;stos deben normalmente estar en orden. El asesor puede hacer un ajuste de menor importancia a estas calificaciones sugeridas.</p>
