<?PHP // $Id$



$string['blockinstances'] = 'ตัวอย่าง';
$string['blockmultiple'] = 'หลายส่วน';
$string['cachetext'] = 'ระยะเวลาที่เก็บไว้ในความจำสำรอง';
$string['change'] = 'เปลี่ยนแปลง';
$string['filteruploadedfiles'] = 'ฟิลเตอร์ไฟล์อัพโหลด';
$string['parentlanguage'] = 'en';
$string['thischarset'] = 'TIS-620';
$string['thisdirection'] = 'ltr';
$string['thislanguage'] = 'Thai';
$string['upgradelogs'] = 'เพื่อให้เว็บไซต์ทำงานได้ตามปกติคุณควรจะทำการอัพเกรดบันทึกการใช้งานเว็บไซต์ <a href=\"$a\"> เพิ่มเติม </a>';
$string['upgradelogsinfo'] = 'มีการเปลี่ยนแปลงวิธีการเก็บไฟล์บันทึกการใช้งานเว็บไซต์เมื่อไม่นานนี้ ถ้าหากคุณต้องการดูบันทึกการใช้งานเก่าที่เก็บไว้คุณควรจะทำการอัพเกรดบันทึกนี้เสียก่อน ส่วนเวลาที่ใช้จะนานหรือไม่ขึ้นอยู่กับขนาดของเว็บไซต์ และขนาดของฐานข้อมูลที่มีอยู่ อาจจะใช้เวลาเป็นชั่วโมงก็ได้ ในการอัพเกรดเมื่อเริ่มอัพเกรดแล้วให้เปิดหน้าจอนี้ทิ้งไว้จนกว่าจะเสร็จสิ้นกระบวนการ สมาชิกอื่น ๆ ก็ยังสามารถใช้เว็บไซต์ได้ตามปกติในช่วงระยะเวลานี้  <b> คุณต้องการอัพเกรดบันทึกการใช้งานเว็บไซต์ตอนนี้เลยหรือเปล่าคะ ?</b>';
$string['upgradesure'] = 'มีการเปลี่ยนแปลงไฟล์ใน Moodle  โปรแกรมจะทำการอัพเกรดเซิร์ฟเวอร์ของคุณเป็นเวอร์ชั่น<p><b>$a</b> อัตโนมัติ</p>
<p>หลังจากอัพเกรดแล้วคุณไม่สามารถกลับไปใช้เวอร์ชั่นเดิมได้นะคะ</p> 
<p>แน่ใจหรือเปล่าคะว่าต้องการอัพเกรดเซิร์ฟเวอร์ด้วยเวอร์ชั่นใหม่ <p>';
$string['upgradinglogs'] = 'อัพเกรดบันทึกการใช้งานเว็บไซต์';
?>
