<?PHP // $Id$



$string['addafter'] = 'เพิ่มบทใหม่';
$string['chapterscount'] = 'บทที่';
$string['chaptertitle'] = 'ชื่อบท';
$string['confchapterdelete'] = 'แน่ใจนะคะว่าคุณต้องการลบบทนี้';
$string['confchapterdeleteall'] = 'แน่ใจนะคะว่าต้องการลบบทนี้และบทย่อยทั้งหมด';
$string['content'] = 'เนื้อหา';
$string['customtitles'] = 'หัวข้อ';
$string['disableprinting'] = 'ปิดการใช้งานปุ่มสั่งพิมพ์';
$string['doimport'] = 'นำเข้า';
$string['editingchapter'] = 'แก้ไขบทนี้';
$string['faq'] = 'คำถามถามบ่อย';
$string['fileordir'] = 'ไฟล์หรือไดเรกทอรี';
$string['import'] = 'นำเข้า';
$string['importinfo'] = 'นำเข้าไฟล์ html ที่เลือกไว้หรือไดเรกทอรี<br/> แต่ละบทมีการเรียงตามลำดับตัวอักษรโดยยึดชื่อไฟล์เป็นหลัก';
$string['importing'] = 'กำลังนำเข้า';
$string['importingchapters'] = 'กำลังนำเข้าบทนี้ลงในหนังสือ';
$string['maindirectory'] = 'ไดเรกทอรีหลัก';
$string['modulename'] = 'หนังสือ';
$string['modulenameplural'] = 'หนังสือ';
$string['navexit'] = 'ออกจากการสร้างหนังสือ';
$string['navnext'] = 'ต่อไป';
$string['navprev'] = 'ก่อนหน้า';
$string['numbering'] = 'เลขหน้า';
$string['numbering0'] = 'ไม่มี';
$string['numbering1'] = 'ตัวเลข';
$string['numbering2'] = 'บูลเล็ท';
$string['numbering3'] = 'ย่อหน้า';
$string['printbook'] = 'พิมพ์หนังสือทั้งเล่ม';
$string['printchapter'] = 'พิมพ์บทนี้';
$string['printdate'] = 'วันที่';
$string['printedby'] = 'พิมพ์โดย';
$string['relinking'] = 'ลิงก์ใหม่';
$string['subchapter'] = 'บทย่อย';�
$string['toc'] = 'สารบาญ';
$string['tocwidth'] = 'เลือกความกว้างของสารบาญสำหรับหนังสือ';
$string['top'] = 'ขึ้นข้างบน';
?>
