<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
  <TITLE>Moodle Docs: Eigenschaften</TITLE>
  <LINK REL="stylesheet" HREF="../theme/standard/styles.php" TYPE="TEXT/CSS">
  <meta HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
</HEAD>
<BODY BGCOLOR="#ffffff">

<H2>Eigenschaften</H2>
<p>Moodle ist ein aktives und sich weiterentwickelndes Produkt. Hier sehen
      Sie einen Auszug mit den wichtigsten Eigenschaften:</p>
<p><strong>Gesamtkonzept</strong></p>
<UL>
  <LI>unterst&uuml;tzt eine sozial konstruktive P&auml;dagogik (Zusammenarbeit, Aktivit&auml;ten, kritische Reflektion, etc)</LI>
  <LI>nutzbar f&uuml;r reines Online-Lernen genauso wie f&uuml;r das Lernen im Unterrichtsraum
  <LI>einfach zu bedienen und zu erlernen, effizient, kompatibel, mit jedem Browser nutzbar</LI>
  <LI>einfach zu installieren auf allen Plattformen, die PHP unterst&uuml;tzen. Erfordert nur eine Datenbank.</LI>
  <LI>unterst&uuml;tzt alle wichtigen Datenbanken</LI>
  <LI>Kurs&uuml;bersicht zeigt Kurzbeschreibungen f&uuml;r jeden Kurs, einschlie&szlig;lich der Zugangsm&ouml;glichkeit f&uuml;r G&auml;ste.</LI>
  <LI>Betonung wichtiger Sicherheitsaspekte. Alle Formulare wurden gepr&uuml;ft, Daten validiert,
    Cookies verschl&uuml;sselt etc.</LI>
</UL>
<p><strong>Seitenverwaltung</strong></p>
<UL>
  <LI>Die Seite wird durch einen Administrator verwaltet, der bei der Installation festgelegt wird.</LI>
  <LI>Plug-in-"themes" erlauben es dem Administrator Farben, Schriften, LayOut etc nach eigenen
  Vorstellunegn zu gestalten.</LI>
  <LI>Plug-in Module k&ouml;nnen erg&auml;nzt werden</LI>
  <LI>Plug-in Sprachpakte erlauben die Anpassung an jede Sprache. Die Bearbeitung kann mit dem mitgelieferten Editor komfortabel vorgenommen werden.  Derzeit liegen Sprachpakete f&uuml;r mehr als <A HREF="http://moodle.com/download/lang/" TARGET="_top">19 Sprachen</A> vor.</LI>
  <LI>Der Code ist durchg&auml;ngig in PHP unter der GPL-Lizenz geschrieben. Er kann leicht an Ihren Bedarf angepasst werden</LI>
</UL>
<p><strong>Nutzerverwaltung</strong></p>
<UL>
  <LI>Die Aufgaben des Adiministrators sollen bei gleichzeitig hohem Sicherheitsstandard minimiert werden.</LI>
  <LI>Unterst&uuml;tzt eine Reihe von Anmeldemechanismen durch Plug-Ins, die leicht in das bestehende System integriert werden k&ouml;nnen.</LI>
  <LI>Standard Email Verfahren: Teilnehmer/innen k&ouml;nnen selber Zug&auml;nge anlegen. Email
    Adressen k&ouml;nnen durch Best&auml;tigung &uuml;berpr&uuml;ft werden.</LI>
  <LI>LDAP Methode: Anmeldungen  k&ouml;nnen &uuml;ber einen LDAP Server gepr&uuml;ft werden. Administratoren
    k&ouml;nnen festlegen, welche Felder genutzt werden.</LI>
  <LI>IMAP, POP3, NNTP: Anmeldungen werden &uuml;ber Mail- oder News-Server gepr&uuml;ft.
    SSL, Zertifikate und TLS werden unterst&uuml;tzt.</LI>
  <LI>Externe Datenbanken: Jede Datenbank, die zumindest zwei Felder umfasst kann f&uuml;r einen externen Zugang verwandt werden.</LI>
  <LI>Jede/r Teilnehmer/in ben&ouml;tigt lediglich einen Zugang f&uuml;r alle Anwendungen und Kurse. Jeder Zugang hat gesonderte Rechte</LI>
  <LI>Der Administrator kontrolliert die Erstellung von Kursen und die Definition von Dozentenrollen durch die Teilnehmerverwaltung</li>
  <LI>Sicherheit - Dozenten k&ouml;nnen einen "Anmelde-Code" f&uuml;r Ihre Lehrg&auml;nge einrichten, um unberechtigte Personen auszuschlie&szlig;en, Diesen Code k&ouml;nenn sie pers&ouml;nlich oder durch EMail an die Teilnehmer/innen weitergeben.</LI>
  <LI>Dozent/innen k&ouml;nnen Teilnehmner/innen manuell aus dem Kurs austragen wenn dies gew&uuml;nscht ist. Sontsr werden Sie automatisch abgemeldet, wenn Sie f&uuml;r eine bestimmte Zeitdauer nicht aktiv waren. Diese Einstellung nimmt der Admin vor.</LI>
  <LI>Teilnehmer/innenwerden aufgefordert, ein Online-Profil zu gestalten. Es umfasst eine Textdarstellung und ein Bild.
    Email-Adressen k&ouml;nnen ausgeblendet werden wenn gew&uuml;nscht.</LI>
  <LI>Jeder Anwender kann die eigene Zeitzone festlegen. Jedes Datum wird in diese Zeitzone umgerechnet (z.B. bei Diskussionsbeitr&auml;gen oder Terminen f&uuml;r Pr&uuml;fungen, etc.)</LI>
  <LI>Jeder Anwender kann die Sprache des Interface von Moodle selber w&auml;hlen.</LI>
</UL>
<p><strong>Kursverwaltung</strong></p>
<UL>
  <LI>Trainer/innen haben die vollst&auml;ndige Kontrolle &uuml;ber alle Einstellungen in ihrem Kurs.</LI>
  <LI>Wahl des Kursformats wie w&ouml;chentlich, thematisch oder diskussionsorientiert</LI>
  <LI>Flexible Gestaltung der Kurse mit &Uuml;bungen, Foren, Journalen, Quiz, Materialien, Befragungen und Pr&uuml;fungen.</LI>
  <LI>Ver&auml;nderungen im Kurs seit dem letzten Besuch (Login) k&ouml;nnen angezeigt werden und verbessern die &Uuml;bersicht</LI>
  <LI>Die meisten Texteintr&auml;ge k&ouml;nnen mit Hilfe eines WYSIWYG HTML Editors vorgenommen werden</LI>
  <LI>Alle Bewertungen f&uuml;r Foren, Journale, Quizz und &Uuml;bungen k&ouml;nnen auf einer &Uuml;bersichtsseite angesehen und als Tabellenkalkulationsblatt gespeichert werden.</LI>
  <LI>Vollst&auml;ndige &Uuml;bersicht &uuml;ber Nutzungszeiten und Aktivit&auml;ten jedes Benutzers k&ouml;nnen mit Details und grafischer &Uuml;bersicht dargestellt werden. Forenbeitr&auml;ge und eingereichte Aufgaben jedes Teilnehmers k&ouml;nnen auf einer &Uuml;bersichtsseite abgerufen werden.</LI>
  <LI>Mail Integration - Kopien von Forumsbeitr&auml;gen, Dozentenfeedback k&ouml;nnen als HTML-Mail oder einfacher Text &uuml;bermittelt werden.</LI>
</UL>
<B>Das Aufgaben Modul</B>
<UL>
  <LI>Aufgaben k&ouml;nnen mit einem Abgabedatum und einer maximalen Punktzahl definiert werden.</LI>
  <LI>Teilnehmer/innen k&ouml;nnen ihre Arbeiten in einem beliebigen Dateiformat hochladen -
    der Abgabetermin f&uuml;r registriert.</LI>
  <LI>Sp&auml;tere Abgaben sind m&ouml;glich. Der/die Dozent/in wird &uuml;ber die Versp&auml;tung informiert.</LI>
  <LI>F&uuml;r jede einzelne Aufgabe, die gnaz Klasse erfolgt die Bewertung auf einer &Uuml;bersichtsseite durch den/die Dozent/in (Bewertung und Kommentar).</LI>
  <LI>Das Feedback des/der Dozent/in wird auf der Aufgabenseite des/der Teilnehmer/in dargestellt und eine Benachrichtigung per Email versandt.</LI>
  <LI>Der/die Dozent/in kann zulassen, dass die Arbeit wiederholt (ncah der Bewertung) eingereicht wird.</LI>
</UL>
<P><B>Das Wahlen Modul</B> </P>
<UL>
  <LI>Wie eine Wahl. Kann verwandt werden, um eine Bewertung durchzuf&uuml;hren oder Feedback einzuholen</LI>
  <LI>Dozent/innen k&ouml;nnen die Bewertungen den einzelnen Bewerter/innen zuordnen</LI>
</UL>
<P><B>Das Forem Modul</B> </P>
<UL>
  <LI>Verschiedene Foren-Typen k&ouml;nnen ausgew&auml;hlt werden (z.B. Themen nur durch Lehrer festgelegt, Kursneuigkeiten (ohne Kommentar), ein Thema je Teilnehmer, offen f&uuml;r alle).</LI>
  <LI>Alle Beitr&auml;gezeigen das hinterlegte Bild des Autors mit an.</LI>
  <LI>Diskussionen k&ouml;nnen in verschiedenen Ansichten gezeigt werden.</LI>
  <LI>Die Anmeldung zu einem Forum kann jede/r selber vornehmen. Einstellungne klnnen individuell vorgenommen werden, wie z.B. eine Email-Benachrichtung &uuml;ber neue Beitr&auml;ge. Der/die Trainer/in kann die automatische Eintragung aller Teilnehmer/innen vornehmen.</LI>
  <LI>Der/die Dozent/in kann festlegen, dass ein Forum geschlossen wird und keine neue Eintr&auml;ge mehr m&ouml;glich sind.</LI>
</UL>
<B>Das Journal Modul</B>
<UL>
  <LI>Journale k&ouml;nnen lediglich vom Teilnehmer/in und Dozent/in eingesehen werden.</LI>
  <LI>Jeder Journaleintrag kann &uuml;ber eine Fragestellung angeregt werden.</LI>
  <LI>Jeder einzelne Journaleintrag kann auf einer &Uuml;bersichtsseite f&uuml;r die ganze Gruppe bewertet werden.</LI>
  <LI>Das Feedback des/der Dozent/in wird auf der Journalseite des/der Teilnehmer/in dargestellt und eine Benachrichtigung per Email versandt.</LI>
</UL>
<P><B>Das Quiz Modul</B> </P>
<UL>
  <LI>Dozent/innen k&ouml;nnen eine Datenbank mit Fragestellungen einrichten, die f&uuml;r verschiedene Quizze genutzt werden k&ouml;nnen.</LI>
  <LI>Quizze werden automatisch bewertet. Sie k&ouml;nnen neu bewertet werden, wenn die Fragen ver&auml;ndert werden. </LI>
  <LI>Quizze k&ouml;nnen zeitgesteuert werden.</LI>
  <LI>Dozent/innen k&ouml;nnen festlegen, dass Quizze mehrfach wiederholt werden k&ouml;nnen. Ein Feedback auf eine Antwort oder die richtige Antwort k&ouml;nnen angezeigt werden.</LI>
  <LI>Fragen k&ouml;nnen in  HTML-Code und mit Bildern gestaltet werden.</LI>
  <LI>Multiple-Choice-Fragen unterst&uuml;tzen eine oder mehrere richtige Antworten</LI>
  <LI>L&uuml;ckentext-Fragen (Kurzantwort-Fragen) (Worte oder Phrasen)</LI>
  <LI>Richtig-Falsch Fragen </LI>
</UL>
<P><B>Das Ressourcen Modul</B> </P>
<UL>
  <LI>Unterst&uuml;tzt die Anzeige jeder Art elektronischer Inhalte</LI>
  <LI>Dateien k&ouml;nnen hochgeladen werden und auf dem Server verwaltet werden, oder direkt im System erstellt werden (Text oder HTML-Format)</LI>
  <LI>Externer Inhalt im Web kann verlinkt werden und nahtlos in die Kursoberfl&auml;che integriert werden.</LI>
</UL>
<B>Das Survey Modul</B>
<UL><LI>Eingebaute Befragungen (COLLES, ATTLS) haben sich als Instrument der Analyse von E-Learning-Kursen bew&auml;hrt</LI><LI>Online Befragungsauswertungen sind jederzeit verf&uuml;gbar und umfassen verschiedene grafische Darstellungsm&ouml;glichkeiten.  Daten k&ouml;nne als Excel-Datenblatt oder als CSV-Textdatei heruntergeladen werden.</LI><LI>Die Befragungsoberfl&auml;che bietet mehrere Befragungskonzepte als Muster an.</LI>
<LI>Die Teilnehmer/innen erhalten R&uuml;ckmeldungen &uuml;ber ihre Ergebnisse und in Relation zum Durchschnitt der ganzen Gruppe.</UL>

<P>&nbsp;</P>

<P ALIGN="CENTER"><FONT SIZE="1"><A HREF="." TARGET="_top">Moodle Dokumentation</A></FONT></P>
<P ALIGN="CENTER"><FONT SIZE="1">Version: $Id: features.html,v 1.2 2001/12/09
  10:34:19 martin Exp $</FONT></P>

</BODY>
</HTML>