<HEAD>
    <TITLE>Moodle Dokumentation: Installation</TITLE>
        <LINK REL="stylesheet" HREF="../theme/standard/styles.php" TYPE="TEXT/CSS">
    <meta HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
</HEAD>

<BODY BGCOLOR="#FFFFFF">
<H2>Moodle installieren</H2>
<P>Dieses Tutorial zeigt, wie Sie Moodle zum ersten Mal installieren. An
      manchen Stellen geht es recht weit ins Detail, um die Server-Einstellungen
      auch zu erkl&auml;ren. Das erscheint mitunter etwas kompliziert. Sie werden
      aber bald feststellen, dass alles sehr leicht ist. In der Regel ist MOODLE
      in ein paar Minuten installiert.<p>Nehmen Sie sich ein wenig Zeit, diese
      Anleitung sorgf&auml;ltig zu lesen - es spart Zeit sp&auml;ter!</P>
<P>Abschnitte in diesem Dokument:</P>
<OL>
  <LI><A HREF="#requirements">Systemanforderngen</A></LI>
  <LI><A HREF="#downloading">Download</A></LI>
  <LI><A HREF="#site">Verzeichnisstruktur</A></LI>
  <LI><A HREF="#data">Ein Datenverzeichnis erstellen</A></LI>
  <LI><A HREF="#database">Eine Datenbank erstellene</A></LI>
  <LI><A HREF="#webserver">Die Web-Server Einstellungen &uuml;berpr&uuml;fen</A></LI>
  <LI><A HREF="#config">Die config.php anpassen</A></LI>
  <LI><A HREF="#admin">Die Administrationsseite starten</A></LI>
  <LI><A HREF="#cron">Einen Cron-Job starten</A></LI>
  <LI><A HREF="#course">Einen neuen Kurs anlegen</A></LI>
</OL>
<H3><A NAME="requirements"></A>1. Systemanforderungen</H3>
<blockquote>
  <p>Moodle wurde in Linux entwickelt und nutzt PHP, Apache und MySQL. Es wurde getestet
    mit PostgreSQL unter Windows XP und Mac OS X Umgebungen.</p>
  <p>Alles was Sie brauchen ist:</p>
  <ol>
    <li>eine funktionierende Installation von <A HREF="http://www.php.net/">PHP</A> (Version
      4.1.0 oder j&uuml;nger), die die folgenden Features einschlie&szlig;t (bei den meisten PHP Installationen ist ads heutzutage der Fall)):
      <ul>
      <LI><A HREF="http://www.boutell.com/gd/">GD library</A> Mit Unterst&uuml;tzung der JPG und PNG Formate</li>
      <LI>Sessions support</LI>
      <LI>Datei uploading erlaubt</LI>
      </UL>
</LI>
    <li>einen funktionierenden Datenbankserver: <A HREF="http://www.mysql.com/">MySQL</A> oder <A HREF="http://www.postgresql.org/">PostgreSQL</A> sind ok. (MSSQL, Oracle, Interbase, Foxpro, Access, ADO, Sybase, DB2 oder ODBC werde  theretisch ebenfalls unterst&uuml;tzt. Sie m&uuml;ssen dann jedoch die Datenbanktabellen manuell einrichten).</li>
  </ol>
  <p>F&uuml;r Windows-Plattformen ist es am einfachsten
     <A HREF="http://www.foxserv.net/">FoxServ</A>,
    oder <A HREF="http://www.easyphp.org/">EasyPHP</A> herunterzuladen, die f&uuml;r Sie Apache,
    PHP, und MySQL installieren. &Uuml;berpr&uuml;fen Sie, ob das GD Modul aktiviert ist, damit oodle Bilder verarbeiten kann - evtl. m&uuml;ssen Sie die php.ini bearbeiten und die Kommentare (;) aus der Zeile: 'extension=php_gd.dll' entfernen. Legen Sie weiterhin das Verzeichnis f&uuml;r
    session.save_path - fest anstelle der Grundeinstellung "/tmp" nutzt Windows ein Verzeichnis wie "c:/temp".</p>

  <p>F&uuml;r Mac OS X empfehle ich das <a href="http://fink.sourceforge.net/">fink</a>
    Projekt um die entsprechenden Pakete herunterzuladen.  Wen Sie mit den erforderlichen Einstellungen nicht so vertraut sind, finden Sie einen einfachen Weg PHP f&uuml;r einen OS X Server zu installieren bei <A HREF="http://www.entropy.ch/software/macosx/php/">Marc Liyanage's PHP Apache Module</A>.</p>

  <p>Wenn Sie unter Linux oder Unix arbeiten, vermute ich, dass Sie all dies elber einrichten k&ouml;nnen! ;-) </p>

</blockquote>
<P>&nbsp;</P>
<H3><A NAME="downloading"></A>2. Download</H3>
<blockquote>
  <p>Moodle liegt als komprimiertes Paket oder &uuml;ber CVS f&uuml;r Sie bereit. Detailerkl&auml;rungen finden Sie auf der Downloadseite <A HREF="http://moodle.com/">http://moodle.com/</A></p>
  <p>Nach dem Download packen Sie das Archiv oder die CVS Dateien aus. Im neuen Verzeichnis quot;moodle&quot; finden Sie eine Reihe von Dateien und Ordnern.. </p>
  <p>Sie k&ouml;nnen den gesamten Ordner in ein Dokumentenverzeichnis ihres Webservers kopieren, dann finden Sie Moodle unter folgender Adresse <B>http://yourwebserver.com/moodle</B>,
    oder Sie kopieren alles direkt in das Hauptverzeichnis. Moodle finden Sie dann unter <B>http://yourwebserver.com</B>.</p>
</blockquote>
<P>&nbsp;</P>
<H3><A NAME="site"></A>3. Verzeichnisstruktur</H3>
<BLOCKQUOTE>
  <p>Verschaffen Sie sich ruhig einen &Uuml;berblick &uuml;ber die verschiedenen Verzeichnisse von Moodle und ihren Inhalt:</p>
  <blockquote>
    <p>config.php - Dies ist die einzige Datei, die Sie vor dem Start noch bearbeiten m&uuml;ssen<br>
      version.php - beschreibt die gerade installierte Version von Moodle<BR>
      index.php - die Startseite</p>
    <ul>
      <li>admin/ - verwaltet die gesamte Anwendung </li>
      <li>auth/ - Plugin Module um Anwender zu identifizieren  </li>
      <li>course/ - Anzeige und Verwaltung der Kurse </li>
      <li>doc/ - Hilfedateien f&uuml;r Moodle (z.B. diese Seite)</li>
      <li>files/ - Anzeige und Verwaltung hochgeladener Dateien</li>
      <li>lang/ - Texte in verschiedenen Sprachen </li>
      <li>lib/ - Bibliotheken des Kerns von Moodle  </li>
      <li>login/ - Steuerung des Login und der Anmeldungen </li>
      <li>mod/ - alle Moodle Kursmodule</li>
      <li>pix/ - Grafische Gestaltung der Seiten</li>
      <li>theme/ - Vorlagen f&uuml;r die visuelle Gestaltung der Seiten (Themes/Skins).</li>
      <li>user/ - Anzeige und Verwaltung von Benutzern</li>
    </ul>
    <p>&nbsp;</p>
  </blockquote>
</BLOCKQUOTE>
<H3><A NAME="data"></A>4. Ein Datenverzeichnis erstellen</H3>
<blockquote>
  <p>Moodle braucht nun  etwas Speicherplatz f&uuml;r hochgeladene Dateien wie Kursdokumente und Nutzerbilder.</p>

  <p>Erstellen Sie an einer beliebigen Stelle auf Ihrem Server f&uuml;r diesen Zweck ein Verzeichnis. Aus Sicherheitsgr&uuml;nden sollte dierses Verzeichnis NICHT f&uuml;r jedermann direkt &uuml;bers Web zugreifbar sein. Am besten richten Sie es ausserhalb des Programmverzeichnisses ein, oder Sie sch&uuml;tzen es mit Hilfe einer .htaccess-Datei mit folgendem Inhalt:
  <blockquote>
     <PRE>deny from all</PRE>
  </blockquote>

  <p>Pr&uuml;fen Sie ob Moodle in diesem Vezeichnis Dtaeien ablegen darf, indem Sie &uuml;berpr&uuml;fen, ob die WebServer Software (z.B. Apache) f&uuml;r dieses Verzeichnis Scheiberlaubnis hat. Auf Unix-Rechnern lautet die Einstellung f&uuml;r das Verzeichnis &quot;nobody&quot; oder &quot;apache&quot;.</p>

  <p><br>
  Wenn Sie einen gemieteten Server nutten, der von mehrren Nutzern in Anspruch genommen werden, sollten Sie darauf achten, das nichta lle anderen Nutzer auf Ihre Daten zugreifen k&ouml;nnen. Wenn Sie sich nicht sicher sind, wenden Sie sich an den Administrator Ihres Providesr.</p>

</blockquote>
<P>&nbsp;</P>
<H3><A NAME="database"></A>5. Eine Datenbank erstellen</H3>
<blockquote>
<p>Erstellen Sie nun eine leere Datenbank (z.B. "moodle") in Ihrem Datenbanksystem
    mit dem Nutzer (z.B. "moodleuser") der auf diese Datenbank zugreifen kann. Richten Sie in jedem Falle ein Passwort ein, wenn Sie einen Online-Server nutzen, damit niemand anderer auf Ihre Datenbank zugreifen kann.
</p>
  <p>Aufruf f&uuml;r MySQL (Beispiel): </p>
  <PRE>
   # mysql -u root -p
   > CREATE DATABASE moodle;
   > GRANT SELECT,INSERT,UPDATE,DELETE,CREATE,DROP,INDEX,ALTER ON moodle.*
           TO moodleuser@localhost IDENTIFIED BY 'yourpassword';
   > quit
   # mysqladmin -p reload
</PRE>
  <p>Aufruf f&uuml;r PostgreSQL (Beispiel): </p>
  <PRE>
   # su - postgres
   > psql -c "create user moodleuser createdb;" template1
   > psql -c "create database moodle;" -U moodleuser template1
   > psql -c "alter user moodleuser nocreatedb;" template1
</PRE>
  <p>(F&uuml;r MySQL empfehle ich den Gebrauch von <a href="http://phpmyadmin.sourceforge.net/">phpMyAdmin</a>
    zur Bearbeitung der Datenbank).</p>
<p>Ab der Version 1.0.8 unterst&uuml;tzt Moodle Vorzeichen f&uuml;r die Datenbanktabellen. Dadurch k&ouml;nnen Sie die gleiche Datenbank mit mehreren Moodle-Installationen oder anderen Webanwendungen nutzen.</p>
</blockquote>
<P>&nbsp;</P>
<H3><A NAME="webserver" id="webserver"></A>6. Die Web-Server Einstellungen &uuml;berpr&uuml;fen</H3>
<blockquote>
  <p>Stellen Sie zun&auml;chst sicher, dass Ihr Webserver automatisch die Index.php Datei aufruft (evtl erg&auml;nzend zur index.html, default.htm etc).</p>
  <p>In Apache erfolgt diese Einstellung in der httpd.conf
    Datei. Darin sollte z.B. folgender Text stehen:</p>
  <blockquote>
    <pre><strong>DirectoryIndex</strong> index.php index.html index.htm </pre>
  </blockquote>
  <p>index.php mu&szlig; in dieser &Uuml;bersicht aufgef&uuml;hrt sein. Am besten steht es sogar ganz am Anfang der Liste.</p>
  <p>Dann erfordert Moodle einige PHP-Einstellungen, damit es arbeiten kann.  <B>Zumeist sind diese bereits als Grundeinstellungen vorhanden.</B>
     Einige PHP-Server (besonders solche mit &auml;lteren Versionen)m&uuml;ssen entsprechend eingestellt werden. Sie finden die Einstellungen in der PHP-Konfigurationsdatei (php.ini):</p>
  <blockquote>

<pre>magic_quotes_gpc = On
magic_quotes_runtime = Off
file_uploads = On
short_open_tag = On
session.auto_start = Off
session.bug_compat_warn = Off
</pre>
  </blockquote>
  <p>Wenn Sie keinen Zugriff auf die Dateien httpd.conf oder php.ini auf Ihrem Server haben, oder wenn andere Anwendungen andere Einstellungen erfordern als Moodle gehen Sie wie folgt vor.

  <p>Erstellen Sie eine Datei mit Namen <B>.htaccess</B> im Hauptverzeichnis von Moodle
     mit der Definition der folgenden Einstellungen.
     Dies ist jedoch nur bei Apache Servern m&ouml;glich und auch nur dann wenn Overrides zul&auml;ssig sind.
     <BLOCKQUOTE><PRE>
DirectoryIndex index.php index.html index.htm
php_value magic_quotes_gpc On
php_value magic_quotes_runtime Off
php_value file_uploads On
php_value short_open_tag On
php_value session.auto_start Off
php_value session.bug_compat_warn Off</BLOCKQUOTE></PRE>
     <P>Sie k&ouml;nnen nun auch die maximale Dateigr&ouml;&szlig;e festlegen, die hochgeladen werden darf:
     <BLOCKQUOTE><PRE>
php_value upload_max_filesize 2M
php_value post_max_size 2M
     </BLOCKQUOTE></PRE>

  <p>Am einfachsten kopieren Sie die Beispieldatei aus lib/htaccess
     und bearbeiten Sie nach Ihren Vorstellungen.  Sie finden dort weitere Informationen.  Rufen Sie in der Unix Shell folgenden Befehl auf:
  <blockquote>
    <pre>cp lib/htaccess .htaccess</pre>
  </blockquote>

</blockquote>
<p>&nbsp;</p>
<H3><A NAME="config"></A>7. Die config.php anpassen</H3>
<blockquote>
  <p>Nun k&ouml;nnen Sie die Konfigurationsdatei <strong>config.php</strong> mit einem einfachen texteditor bearbeiten. Diese Datei wird von allen anderen Moodle-Dateien genutzt.</p>
  <p>Erstellen Sie eine Kopie der Datei config-dist.php und benennen Sie sie mit config.php. Wenn Sie sp&auml;ter ein Update von moodle vornehmen wird diese zentrale Datei nicht &uuml;berschriebenW. </p>
  <p>Tragen Sie in der config.php die Datenbankangaben und die Pr&auml;fixe der Tabellen (der Pr&auml;fix ist bei einer PostgreSQL-Datenbank UNBEDINGT erforderlich), tragen Sie auch die Web-Adresse Ihrer neuen Moodle-Seite, das Verzeichnis der Moodle-Dateien und das Verzeichnis f&uuml;r die Kursdaten in der config.php ein. Weitere Informationen finden Sie in der config.php.</p>
  <p>F&uuml;r die weiteren Beschreibungen gehen wir davon aus, dass Ihre Seite an folgender Stelle liegt:
    <u>http://example.com/moodle</u></p>
</blockquote>
<P>&nbsp;</P>
<H3><A NAME="admin"></A>8. Die Administrationsseite starten</H3>
<blockquote>
  <p>Rufen Sie nun die Administrationsseite mit folgendem Befehl auf: <u>http://example.com/moodle/admin</u>.
    Beim ersten Aufruf der Seite m&uuml;ssen Sie der GPL-Lizenzvereinbarung zustimmen bevor das Setup fortgesetzt wird.</p>
  <P>(Moodle wird  nun versuchen, einige Cookies auf Ihrem PC zu installieren. Wenn Ihr Browser Sie um Zustimmung zur Installation der Moodle Cookies fragt, m&uuml;ssen Sie dies best&auml;tigen, da andernfalls Moodle nicht von Ihrem Rechner aus genutzt werden kann.)
  <p>Moodle richtet nun die Datenbank ein und erstellt die erforderlichen Tabellen in der Datenbank.
    Zuerst werden die Datenbanktabellen erstellt. Sie sehen auf dem Bildschirm eine Reihe von SQL-Meldungen und Best&auml;tigungsmeldungen in roter oder gr&uuml;ner Schrift. Dies sieht in etwa so aus:</p>
  <blockquote>
    <p>CREATE TABLE course ( id int(10) unsigned NOT NULL auto_increment, category
      int(10) unsigned NOT NULL default '0', password varchar(50) NOT NULL default
      '', fullname varchar(254) NOT NULL default '', shortname varchar(15) NOT
      NULL default '', summary text NOT NULL, format tinyint(4) NOT NULL default
      '1', teacher varchar(100) NOT NULL default 'Teacher', startdate int(10)
      unsigned NOT NULL default '0', enddate int(10) unsigned NOT NULL default
      '0', timemodified int(10) unsigned NOT NULL default '0', PRIMARY KEY (id))
      TYPE=MyISAM</p>
    <p><FONT COLOR="#006600">SUCCESS</FONT></p>
    <p>...und so weiter, gefolgt von: <FONT COLOR="#FF0000">Main databases set up
      successfully</FONT>. </p>
  </blockquote>
  <p>Wenn Sie dies nicht angezeigt bekommen, besteht ein Problem mit der Datenbank oder den Einstellungen in der Konfigurationsdatei config.php. Pr&uuml;fen Siue, ob PHP nicht im eingeschr&auml;nkten
     "safe mode" l&auml;uft (Kommerzielle Webhoster aktivieren h&auml;ufig den safe mode). Die PHP Variablen k&ouml;nnen Sie selber mit einer kleinen Datei mit folgendem Inhalt &uuml;berpr&uuml;fen: &lt?
    phpinfo() ?&gt. Speichern Sie die Datei in einen Webverzeichnis und rufen Sie sie mit dem Browser auf. Nun k&ouml;nnen Sie alle Einstellungen von PHP ablesen. Pr&uuml;fen Sie diese Schritte und und versuchen Sie dann die Admin-Seite erneut aufzurufen.</p>
  <p>Scrollen sie nun bis zum Ende der Seite und dr&uuml;cken Sie den Button e &quot;Continue/Weiter&quot;
    .</p>
  <p>Danach sehen Sie eine Reihe von Anzeigen, die das Erstellen der tabellen f&uuml;r die verschiedenen Module von Moodle best&auml;tigen. Wie zuvor sollten alle Eintr&auml;ge gr&uuml;n sein.</p>

  <p>Dr&uuml;cken Sie nun am Fu&szlig; der Seite wieder den &quot;Continue/Weiter&quot;
    Button.</p>

  <p>Nun sehen Sie ein Formular mit dem Sie weitere Einstellungen an Ihrem Moodle vornehmen k&ouml;nnen, wie z.B. die voreingestellte Sprache, SMTP hosts und so weiter.
     Sie m&uuml;ssen nicht alle Einstellungen sofort vornehmen. Sie k&ouml;nnen die Einstellungen jederzeit im Administrationsmenu nachbearbeiten.
     Am Fu&szlig; der Seite finden Sie wieder einen Button &quot;&Auml;ndern der Einstellungen/Save changes&quot; Button.</p>

  <p>Wenn (und wirklich nur dann) das Setup stecken bleibt, dann hat Ihr Server wom&ouml;glich ein "buggy referrer" Problem.  Dieses ist jedoch leicht zu beheben: Setzen Sie in der config.php die Variable buggy_referrer auf <i>true</i> und starten Sie die Adminseite erneut.</p>

  <p>Auf der n&auml;chsten Seite legen Sie weitere Einstellungen Ihrer seite fest (z.B. Name der Seite, Formate, Beschreibungen und so weite).

    F&uuml;llen Sie alle Angaben aus (&Auml;nderungen k&ouml;nnen sie jederzeit &uuml;ber das Administrationsmenu vornehmen) und klicken Sie auf
    &quot;&Auml;nderungen best&auml;tigen/Save changes&quot;.</p>

  <p>Als letzten Schritt legen Sie die Zugangsdaten f&uuml;r den Administrator von Moodle fest. Tragen Sie Ihren eigenen Name, Email etc. ein und klicken Sie auf &quot;&Auml;nderungen best&auml;tigen/Save changes&quot;. Nicht alle Felder m&uuml;ssen ausgef&uuml;llt werden. Falls Sie etwas vergessen haben, werden sie autromatisch daran erinnert.
  </p>
  <blockquote>
    <blockquote>
      <blockquote>
        <blockquote>
          <blockquote>
            <p><strong>Stellen Sie unbedingt sicher, dass Sie sich den Benutzernamen und das Passwort
            f&uuml;r den Administrationszugang merken. Er ist erforderlich f&uuml;r sp&auml;tere Verwaltungen auf
             Moodle.</strong></p>
          </blockquote>
        </blockquote>
      </blockquote>
    </blockquote>
  </blockquote>
  <p>Wenn Sie diesen Schritt erfolgreich abgeschlossen haben, sehen Sie die Administrationsseite. In dem Menu (es wird, wenn Sie sich als Admin einloggen auch auf der Startseite angezeigt) k&ouml;nnen Sie alle weiteren Einstellungen an Ihrem Moodle vornehmen wie z.B.:</p>
  <ul>
    <li>Erstellen und l&ouml;schen von Kursen</li>
    <li>Erstellen und bearbeiten von Nutzerzug&auml;ngen</li>
    <li>Verwaltung von Dozentenzug&auml;ngen</li>
    <li>Ver&auml;nderungen von Einstellungen,die f&uuml;r die gesamte Seite gelten.</li>
  </ul>
</blockquote>
<P>&nbsp;</P>
<H3><A NAME="cron"></A>9. Einen Cron-Job starten</H3>
<blockquote>
  <p>Einige Module von Moodle pr&uuml;fen regelm&auml;&szlig;ig, ob bestimmte Aufgaben ausgef&uuml;hrt werden m&uuml;ssen. Moodle &uuml;berpr&uuml;ft z.B. ob es im Forum neue Eintr&auml;ge gibt, die per Email an Nutzer versandt werden m&uuml;ssen.</p>
  <p>Das Skript, das all diese Vorg&auml;nge steuert finden Sie im Admin-Verzeichnis und hei&szlig;t
    cron.php. Diese Datei l&auml;uft nicht von alleine. Sie m&uuml;ssen einen Mechanismus einrichten, der die Datei z.B. alle f&uuml;nf Minuten ausf&uuml;hrt. Dazu ist es erforderlich, dass ein &quot;Impuls&quot; f&uuml;r jedes Modul ausgel&ouml;st wird.</p>
  <P><B>Der Ausl&ouml;ser dieses Impulses mu&szlig; nicht von dem Server erfolgen auf dem Moodle installiert ist.</B>.  Wenn Sie auf diesem Server keine Cron-Jobs ausf&uuml;hren k&ouml;nnen, kann dies von einem anderen Server ausgel&ouml;st oder von Ihrem PC gestartet werden. Es ist lediglich n&ouml;tig, die Datei cron.phpa lle f&uuml;nf Minuten aufzurufen.</p>
  <p>Testen Sie zuerst, ob die Datei funktioniert. Rufen Sie sie mit Ihrem Browser auf:</p>
  <blockquote>
    <PRE>http://example.com/moodle/admin/cron.php</PRE>
  </blockquote>
  <p>Nehmen Sie nun einige Einstellungen vor: </p>
  <H4> Aufruf des Skripts von der Kommandozeile</H4>
  <p>Rufen Sie die Datei wie zuvor auf. Nehmen Sie dazu z.B. den Unix-Befehl 'wget':</p>
  <blockquote>
    <PRE>wget -q -O /dev/null http://example.com/moodle/admin/cron.php</PRE>
  </blockquote>
  <p>In diesem Beispiel wird das Ergebnis abgelegt (nach /dev/null).</p>
  <p>Das gleiche mit lynx:</p>
  <blockquote>
    <pre>lynx -dump http://example.com/moodle/admin/cron.php &gt; /dev/null</pre>
  </blockquote>
  <p>Alternativ k&ouml;nnen Sie eine separate PHP-Version nutzen, die &uuml;ber die Kommandozeile gesteuert wird.

   Der Vorteil dieser Variante ist, dass in den Log-Dateien des Web- Servers der Aufruf von cron.php nicht ständig protokolliert wird. Der Nachteil dieser Variante besteht darin, dass sie einen Zugang zur Kommando-Zeile der PHP- Version benötigen.</p>
  <blockquote>
    <PRE>/opt/bin/php /web/moodle/admin/cron.php


(Windows) C:\apache\php\php.exe C:\apache\htdocs\moodle\admin\cron.php

</PRE>
  </blockquote>
  <h4>Automatische Ausf&uuml;hrung des Skripts alle 5 Minuten</h4>
  <p>Bei UNIX- Systemen: Use <B>cron</B>. Passen sie ihre Einstellungen für Cron- Jobs über die Komandozeile mit folgendem Befehl an &quot;crontab -e&quot; und fügen sie folgende Zeile hinzu:</p>
  <blockquote>
    <PRE>*/5 * * * * wget -q -O /dev/null http://example.com/moodle/admin/cron.php</PRE>
  </blockquote>
  <p>Bei Windows- Systemen: Der einfachste Weg ist hier mein Programm zu benutzen, <A TITLE="Folgen sie diesem Link, um den Download des Programms durchzuführen.(150k)" HREF="http://moodle.com/download/moodle-cron-for-windows.zip">moodle-cron-for-windows.zip</A>
    wodurch die Anpassungen ganz einfach sind. Sie können alternativ dazu, die in Windows enthaltene Funktion "Scheduled Tasks" benutzen.</p>
  </p>
</blockquote>
<H3><A NAME="course"></A>10. Einen neuen Kurs anlegen</H3>
<blockquote>
  <p>Wenn alle Einstellungen vorgenommen wurden, sollte diese Moodle- Seite einsatzfähig sein und sie können einen Kurs erstellen. </p>
  <p>Wählen sie &quot;Neuen Kurs anlegen&quot; auf der Administrationsseite ( oder über den Link im Administrationsmenü auf der Hauptseite).</p>
  <p>Legen Sie die Grundeinstellungen fest. Achten sie dabei bitte besonders auf das Kursformat. Sie brauchen sich in dieser Sufe nicht zu intensiv mit den Details zu beschäftigen, da alle diese Einstellungen später durch den Lehrer geändert werden können.</p>
  <p>Über den Button &quot;Änderungen speichern&quot;, gelangen sie auf eine neue Seite. Auf dieser Seite können sie den Lehrer für diesen Kurs zuweisen. Sie können nur Teilnehmer als Lehrer zuweisen, die bereits einen Zugang zu diesem Moodle- System besitzen. Wenn ein neuer Lehrer- Zugang eingerichtet werden soll, bitten sie den Lehrer sich selbst einen Zugang einzurichten ( Über die Anmeldeseite) oder erzeugen sei einen neuen Zugang über das Administrationsmenü. Dort finden sie den Link &quot;Neuen Benutzer anlegen &quot;. </p>
  <p>Wenn dies erledigt ist, sind die Vorbereitungen abgeschlossen und der Kurs kann über den Link &quot;Kurse&quot; auf der Hauptseite weiter bearbeitet werden.</p>
  <p>Lesen sie das &quot;<A HREF="./?file=teacher.html">Lehrer Handbuch</A>&quot;, um weitere Informationen zur Erstellung eines Kurses zu erhalten. Eine ausführliche Anleitung in deutscher Sprache finden sie im <A HREF="http://moodle.org/file.php/18/Trainerhandbuch.pdf">Deutschen Forum.</A> </p>
</blockquote>
<P>&nbsp;</P>
<P ALIGN="CENTER"><FONT SIZE="1"><A HREF="." TARGET="_top">Moodle Dokumentation</A></FONT></P>
<P ALIGN="CENTER"><FONT SIZE="1">Version: $Id$</FONT></P>

</BODY>
