<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

<title>Moodle Dokumente: Philosophie</title>

<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS">

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
<body bgcolor="#ffffff">

<h1>Philosophie</h1>

<blockquote>
<h3>Vorbemerkung des deutschen &Uuml;bersetzers</h3><br>
Die &Uuml;bersetzung der p&auml;dagogischen Fachbegriffe und die Interpretation der knappen Zusammenfassung des hinter Moodle stehenden p&auml;dagogischen Konzepte von Martin Dougiamas f&auml;llt nicht leicht. Daher m&ouml;chte ich versuchen, mit eigenen Worten eine Adaption auf den deutschen Sprachgebrauch vorzunehmen, und meine &Uuml;bersetzung des Originaltextes anf&uuml;gen.<br>
Das Modell des 'N&uuml;rnberger Trichters' als Grundlage f&uuml;r Lernprozesse ist endg&uuml;ltig zu den Akten gelegt. Heute k&ouml;nnen wir davon ausgehen, dass Lernen in einem aktiven Aneignungsprozess mit einem immer wiederkehrenden Abgleich zwischen vorhandenen Erfahrungen und neuen Informationen erfolgt. (Theorie des Konstruktivismus)<br>
Wirkungsvolle Lernprozesse m&uuml;ssen daher Anreize bieten, neue Erfahrungen zu machen und Informationen aktiv anzuwenden. In der aktiven Anwendung und - besser noch - der eigenen Vermittlung neuer Informationen als Teilnehmer/in an andere liegen besonders gute Lernpotenziale.<br>
Moodle versucht nun eine Lernumgebung zu schaffen, in der die Interaktion der Lerngruppe einen hohen Stellenwert besitzt. Die Diskussion miteinander, die Auseinandersetzung mit Aufgaben und die gegenseitige Bewertung (z.B. im Workshop-Modul in der Form des peer assesment), aber auch die M&ouml;glichkeit aus Einsch&auml;tzungen und Kommentaren dazu zu lernen und eine Aufgabe in einer verbesserten Version wieder einzureichen sind zentrale M&ouml;glichkeiten einen Lernprozess zu gestalten.<br>
Moodle kann - daran darf es keinen Zweifel geben - als klassische 'Pauk-Maschine' oder als 'Online-Frontalunterricht' genutzt werden. Sein besonderes Augenmerk gilt aber der fortgeschrittenen und zielgerichteten Interaktion als Lernprozess.<br>
Zentral ist dabei ein Ver&auml;nderung der Aufgabe des/der Dozent/in vom Wissensvermittler hin zum Lernbegleiter. Im angels&auml;chsischen Sprachgebrauch (nicht von Martin Dougiamas) wird der Begriff des Facilitators verst&auml;rkt genutzt. Seine Aufgabe ist es, einen Handlungsrahmen zu schaffen, in dem eine lern- und entwicklungsf&ouml;rderliche Umgebung besteht, die ein entdeckendes und aktives Lernen erm&ouml;glicht.<br>
R&uuml;ckfragen an den &Uuml;bersetzer unter ralf.hilgenstock@dialoge.net.<br><br>


<h3>Hier nun die &Uuml;bersetzung des Orioginaltextes</h3>
  <p>Die Gestaltung und Entwicklung von Moodle wurde gepr&auml;gt von einer Lernphilosophie, einem Weg des Denkens, den man vereinfacht als quot;<em>soziale f&ouml;rdernde P&auml;dagogik</em>&quot; bezeichnen kann. (Einige unter Ihnen werden denken &quot;'Hokus-Pokus-P&auml;dagogik'&quot; und wegklicken wollen. Aber bitte lesen Sie weiter!)</p>
  <p>Diese Seite versucht, Ihnen mit einfachen Begriffe die <strong>vier Hauptkonzepte</strong> zu erl&auml;utern, die dahinter stecken. Jedes Teilkonzept fasst die Ergebnisse umfangreicher Forschungsarbeiten zusammen. Zwangsl&auml;ufig muss daher diese kurze Beschrreibung oberfl&auml;chlich bleiben.</p>
  <p>Wenn diese Konzeopte f&uuml;r Sie g&auml;nzlich neu sind, mag es sein, dass das eine oder andere zun&auml;chst etwas schwer zu verstehen ist. Als kleiner Tipp hilft vielleicht beim Lesen &uuml;ber die eigenen Erfahrungen beim Lernen nachzudenken.<br>
  </p>
  <h3>1. F&ouml;rderung (Constructivism)</h3>
  <blockquote>
    <p>Diese Betrachtungsweise geht davon aus, dass Menschen ihr Wissen aktiv aus der Interaktion mit ihrer Umgebung <strong>entwickeln</strong>. </p>
    <p>Alles, was Sie lesen, sehen, h&ouml;ren, f&uuml;hlen und ber&uuml;hren - also mit Ihren Sinnen wahrnehmen - wird mit Ihrem fr&uuml;heren Wissen verglichen und in Ihre Vorstellung und Erkl&auml;rung der Welt eingebaut. Daraus kann  neues Wissen entstehen, das Sie mit sich nehmen. Wissen wird best&auml;tigt wenn es sinnvoll genutzt werden kann in anderen Situationen. Menschen sind keine passiven Informationsdatenbanken, die alles in sich aufnehmen. Genausowenig kann Wissen durch einfaches Lesen oder H&ouml;ren &uuml;bertargen werden.</p>
    <p>Damit sei nicht gesagt, man k&ouml;nne durch das Lesen einer Webseite nichts lernen. Man kann nat&uuml;rlich. Es findet jedoch eine Interpretation des Gelesenen vor dem Hintergrund der vorhandenen Erfahrungen statt. Das uralte Modell des 'N&uuml;rnberger-Trichters' funktioniert so nicht. <br>
  </p>
  </blockquote>
  <h3>2. Lernen durch Vermittlung (Constructionism)</h3>
  <blockquote>
    <p>Konstruktionismus behauptet, dass Lernen besonders effektiv ist, wenn der Lerninhalt f&uuml;r andere aufbereitet - also aktiv angewandt wird. Dies kann durch einen gesprochenen Satz oder einen Diskussionsbeitrag erfolgen, oder anspruchsvoller durch die Erstellung eines Bildes, eines Hauses oder einer Software erfolgen (aktiv wiedergeben statt passiv konsumieren).</p>
    <p>Sie k&ouml;nnen - zum Beispiel - diese Seite mehrere Male lesen und werden vieles bis morgen schon wieder vergessen haben. Wenn Sie aber versuchen, die hier formulierten Ideen, einem anderen mit eigenen Worten zu erkl&auml;ren, eine Pr&auml;sentation dar&uuml;ber erstellen, dann kann ich ganz sicher sein, das Sie ein besseres Verst&auml;ndnis von diesen Ideen entwickelt habens. Das ist &uuml;brigens auch der Grund aus dem Menschen sich w&auml;hrend der &Uuml;bungen Notizen machen, selbst wenn sei diese sp&auml;ter nicht wieder lesen.<br>
  </p>
  </blockquote>
  <h3>3. Social Constructivism</h3>
  <blockquote>
    <p>Stellen wir uns diese Gedanken nun innerhalb einer Gruppe vor, die sich eine Kultur gemeinsam geteilten Wissens und gemeinsamer Bedeutungszusammenh&auml;nge erarbeitet. Wenn man einmal in diese Gruppe eingetaucht ist, lernt man kontinuierlich auf verschiedenen Ebenen.</p>
    <p>Ein sehr einfaches Beispiel ist ein Gegenstand wie z.B. eine Tasse. Die Tasse kann f&uuml;r sehr viele Zwecke genutzt werden. Aber seine Form erm&ouml;glicht es uns, einiges &uuml;ber das Transportieren von Fl&uuml;ssigkeiten in Erfahrung zu bringen. Ein komplexeres Beispiel ist ein Online-Kurs. Er wird nicht nur so verwandt, wie die Entwickler es sich vorgestellt haben. Die praktische Arbeit mit den einzelnen Elementen schafft Ideen f&uuml;r einen erweiteren Gebrauch und damit eine neue Wirklichkeit und neue M&ouml;glichkeiten. Dies passiert besonders h&auml;ufig wenn nicht nur einzelne, sondern Gruppen mit der Software arbeiten.<br>
  </p>
  </blockquote>
  <h3>4. Verbunden und aufgeteilt (Connected and Separate)</h3>
  <blockquote>
    <p>Dieser Gedanke befasst sich n&auml;her mit den Motiven der Einzelnen innerhalb von Diskussionen. 'Aufgeteiltes' Verhalten liegt vor, wenn jemand versucht objektiv zu bleiben und Fakten darzustellen. Er /sie wird dazu tendieren, die eigenen Ideen zu verteidigen und L&uuml;cken in der Argumentation der anderen zu entdecken. 'Verbundenes' Verhalten stellt mehr ein empathisches Verhalten dar, das Subjektivit&auml;t einbezieht, versucht zuzuh&ouml;ren, Fragen zu stellen in der Absicht, den anderen zu verstehen.
    'Entwickeltes (constructed) Verhalten beide Ann&auml;herungen an einen Gegenstand nutzen kann und in der Lage ist, die geeignete Form in der jeweiligen Situation auszuw&auml;hlen.
    </p>
    <p>Das gemeinsame Verhalten ist starker Anreiz f&uuml;r den Lernprozess. Er bringt nicht nur die Teilnehmer n&auml;her miteinander in Kontakt, unterst&uuml;tzt eine tiefere Reflexion und f&ouml;rdert die &Uuml;berpr&uuml;fung bestehender Annahmen.</p>
  </blockquote>
  <hr>
  <p>Wenn Sie &uuml;ber all dies nachdenken, dann hilft es, sich auf die wichtigsten Lernerfahrungen aus der Lernersicht zu konzentrieren und nicht die Informationen zu ver&ouml;ffentlichen und zu pr&uuml;fen, von der Sie denken, dass sie gewu&szlig;t werden sollten. Es kann auch hilfreich sein, dar&uuml;ber nachzudenken in welcher weise jede/r Teilnehmer gleicherma&szlig;en Lerner und Lehrer sein kann. Ihre Aufgabe als Dozent/in kann sich wandeln vom allwissenden Informationsgeber zum Vorbild, der den Teilnehmer/innen erm&ouml;glicht, ihren eigenen Lernbedarf zu erkennen, Diskussionen moderiert und durch &Uuml;bungen die ganze Gruppe zu ihren Lernzielen f&uuml;hrt.
  </p>
  <p>Moodle alleine schafft diese Lernsituation nicht. Moodle unterst&uuml;tzt sie aber effektiv. In der Zukunft, wenn die technische Basis von Moodle stabil ist, wird sich die weitere Entwicklung von Moodle auf die p&auml;dagogische Unterst&uuml;tzung dieses Prozesses konzentrieren.</p>
</blockquote>
<hr>
<p align="CENTER"><font size="1"><a href="." target="_top">Moodle Dokumentation</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>
</body>
</html>