<?PHP // $Id$ 
      // auth.php - created with Moodle 1.1 (2003082800)


$string['auth_dbdescription'] = "Αυτή η μέθοδος χρησιμοποιεί έναν εξωτερικό πίνακα βάσης δεδομένων για να ελέγξει εάν ένα δοσμένο όνομα χρήστη και ένας κωδικός πρόσβασης ισχύουν.  Εάν ο λογαριασμός είναι καινούριος, τότε οι πληροφορίες από άλλα πεδία μπορούν επίσης να αντιγραφούν σε Moodle.";
$string['auth_dbextrafields'] = "Αυτά τα πεδία είναι προαιρετικά. Υπάρχει η επιλογή να προ-συμπληρώσετε μερικά Moodle πεδία χρηστών χρησιμοποιώντας πληροφορίες από την <Β> εξωτερική βάση δεδομένων</B> που διευκρινίζετε εδώ. <P> Εάν τα αφήσετε κενά, τότε θα χρησιμοποιηθούν τα προκαθορισμένα στοιχεία.<P> Σε κάθε περίπτωση, ο χρήστης θα μπορεί να παρέμβει σε όλα αυτά τα πεδία μετά την σύνδεση. ";
$string['auth_dbfieldpass'] = "Όνομα πεδίου που περιέχει τους κωδικούς πρόσβασης";
$string['auth_dbfielduser'] = "Όνομα πεδίου που περιέχει τα ονόματα χρηστών";
$string['auth_dbhost'] = "Ο υπολογιστής που φιλοξενεί τον εξυπηρετητή βάσης δεδομένων";
$string['auth_dbname'] = "Όνομα της βάσης δεδομένων";
$string['auth_dbpass'] = "Κωδικός πρόσβασης που αντιστοιχεί στο παραπάνω όνομα χρήστη";
$string['auth_dbpasstype'] = "Διευκρινήστε τη μορφή που χρησιμοποιείται από το πεδίο του κωδικού πρόσβασης. Η κρυπτογράφηση MD5 είναι χρήσιμη για σύνδεση με άλλες κοινές διαδικτυακές εφαρμογές όπως η PostNuke.";
$string['auth_dbtable'] = "Όνομα του πίνακα στην βάση δεδομένων.";
$string['auth_dbtitle'] = "Χρήση μιας εξωτερικής βάσης δεδομένων.";
$string['auth_dbtype'] = "Ο τύπος της βάσης δεδομένων (Δείτε την <A HREF=../lib/adodb/readme.htm#drivers>τεκμηρίωση ADOdb</A> για λεπτομέρειες)";
$string['auth_dbuser'] = "Όνομα χρήστη με δικαίωμα ανάγνωσης της βάσης δεδομένων.";
$string['auth_emaildescription'] = "Η επιβεβαίωση μέσω ηλ. ταχυδρομείου είναι η προκαθορισμένη μέθοδος πιστοποίησης. Όταν ο χρήστης συνδεθεί επιλέγοντας το δικό του όνομα χρήστη και κωδικό πρόσβασης, αποστέλεται στην ηλ. διεύθυνσή του ένα μήνυμα ηλεκτρονικού ταχυδρομείου για επιβεβαίωση. Αυτό το μήνυμα περιέχει έναν ασφαλή σύνδεσμο για μία σελίδα όπου ο χρήστης μπορεί να επιβεβαιώσει τον λογαριασμό του. Σε κάθε μελλοντική σύνδεση, απλά ελέγχεται το όνομα χρήστη και ο κωδικός πρόσβασης σε σχέση με τις αποθηκευμένες τιμές στη βάση δεδομένων Moodle.";
$string['auth_emailtitle'] = "Πιστοποίηση βασισμένη στο ηλ. ταχυδρομείο.";
$string['auth_imapdescription'] = "Η μέθοδος αυτή χρησιμοποιεί έναν IMAP εξυπηρετητή που ελέγχει εάν το όνομα χρήστη και ο κωδικός πρόσβασης είναι έγκυρος.";
$string['auth_imaphost'] = "Η διεύθυνση του IMAP εξυπηρετητή. Χρησιμοποιήστε την διεύθυνση IP και όχι το όνομα DNS.";
$string['auth_imapport'] = "Το νούμερο της θύρας του IMAP εξυπηρετητή. Συνήθως είναι 143 ή 993.";
$string['auth_imaptitle'] = "Χρησιμοποιείστε έναν IMAP εξυπηρετητή.";
$string['auth_imaptype'] = "Ο τύπος του IMAP εξυπηρετητή. Οι IMAP εξυπηρετητές μπορούν να έχουν διαφορετικούς τύπους επικύρωσης και διαπραγμάτευσης.";
$string['auth_ldap_bind_dn'] = "Εάν θέλετε να χρησιμοποιήσετε την υπηρεσία bind-user για να αναζητήσετε χρήστες, διευκρινήστε το εδώ. Κάτι όπως 'cn=ldapuser,ou=public,o=org'";
$string['auth_ldap_bind_pw'] = "Κωδικός πρόσβασης για bind-user.";
$string['auth_ldap_contexts'] = "Λίστα πλαισίων όπου οι χρήστες είναι τοποθετημένοι. Χωρίστε διαφορετικά πλαίσια με ';'.Για παράδειγμα:'ou=users,o=org; ou=others,o=org'";
$string['auth_ldap_create_context'] = "Αν ενεργοποιήσετε τη δημιουγία χρηστών με επιβεβαίωση μέσω ηλεκτρονικού ταχυδρομείου τότε καθορίστε το context στο οποίο θα δημιουργηθούν οι χρήστες. Αυτό θα πρέπει να είναι διαφορετικό από ότι άλλων χρηστών για να αποφευχθούν προβλήματα ασφαλείας. Δεν χρειάζεται να προσθέσετε αυτή την τιμή στη μεταβλητή ldap_context, το Moodle θα αναζητήσει χρήστες αυτού του context αυτόματα.";
$string['auth_ldap_creators'] = "Κατάλογος ομάδων των οποίων τα μέλη επιτρέπεται να δημιουργήσουν νέα μαθήματα. Οι ομάδες διαχωρίζονται με ';'. Συνήθως κάτι σαν 'cn=teachers,ou=staff,o=myorg'";
$string['auth_ldap_host_url'] = "Διευκρινίστε τον διακομιστή LDAP σε url-μορφή όπως \\\"ldap://ldap.myorg.com/\\\" ή 'ldaps://ldap.myorg.com/' ";
$string['auth_ldap_memberattribute'] = "Καθορίστε τις ιδιότητες των μελών χρηστών που ορίζουν πότε ένας χρήστης ανήκει σε ένα group. Συνήθως 'member'";
$string['auth_ldap_search_sub'] = "Βάλτε τις τιμές &lt;&gt; 0 εάν θέλετε να αναζητήσετε χρήστες από τα υπο-περιεχόμενα.";
$string['auth_ldap_update_userinfo'] = "Ενημερώστε τις πληροφορίες χρήστη (όνομα, επώνυμο, διεύθυνση...) από το LDAP στο Moodle. Δείτε την σελίδα /auth/ldap/attr_mappings.php για πληροφορίες χαρτογράφησης.";
$string['auth_ldap_user_attribute'] = "Το χαρακτηριστικό που χρησιμοποιείται για την ονομασία/αναζήτηση χρηστών. Συνήθως 'cn'.";
$string['auth_ldapdescription'] = "Αυτή η μέθοδος παρέχει πιστοποίηση έναντι σε έναν εξωτερικό εξυπηρετητή LDAP. Εάν το δοσμένο όνομα χρήστη και ο κωδικός πρόσβασης ισχύουν, το Moodle δημιουργεί μια νέα καταχώρηση χρήστη στη βάση δεδομένων του. Αυτή η ενότητα μπορεί να διαβάσει τις ιδιότητες χρηστών από τον LDAP και να συμπληρώσει εκ των προτέρων τα ζητούμενα πεδία στο Moodle. Για τις επόμενες συνδέσεις μόνο το όνομα χρήστη και ο κωδικός πρόσβασης ελέγχονται.";
$string['auth_ldapextrafields'] = "Αυτά τα πεδία είναι προαιρετικά. Μπορείτε να επιλέξετε να συμπληρώσετε εκ των προτέρων μερικά πεδία χρηστών Moodle με τις πληροφορίες από < B>LDAP πεδία</B > που διευκρινίζετε εδώ. <p>Εάν αφήσετε τα πεδία αυτά κενά, τίποτα δεν θα μεταφερθεί από τον LDAP και τα προκαθορισμένα στοιχεία (default) Moodle  θα χρησιμοποιηθούν αντ' αυτών.<p>Σε κάθε περίπτωση, ο χρήστης θα είναι σε θέση να παρέμβει σε όλα αυτά τα πεδία μετά τη σύνδεση.";
$string['auth_ldaptitle'] = "Χρησιμοποιείστε έναν  LDAP εξυπηρετητή.";
$string['auth_manualdescription'] = "Αυτή η μέθοδος αφαιρεί κάθε δυνατότητα στους χρήστες να δημιουργούν δικούς τους λογαριασμούς. Όλοι οι λογαριασμοί πρέπει να δημιουργηθούν από το διαχειριστή.";
$string['auth_manualtitle'] = "Λογαριασμοί από το διαχειριστή μόνο";
$string['auth_nntpdescription'] = "Αυτή η μέθοδος χρησιμοποιεί έναν NNTP εξυπηρετητή να ελέγξει εάν ένα δοσμένο όνομα χρήστη ή κωδικός πρόσβασης είναι έγκυρα";
$string['auth_nntphost'] = "Η διεύθυνση του NNTP εξυπηρετητή. Χρησιμοποιείστε το IP νούμερο και όχι το DNS όνομα.";
$string['auth_nntpport'] = "Η θύρα του εξηπηρετητή. (119 είναι η πιο κοινή)";
$string['auth_nntptitle'] = "Χρησιμοποιείστε έναν NNTP εξυπηρετητή.";
$string['auth_nonedescription'] = "Οι χρήστες μπορούν να συνδεθούν και να δημιοργήσουν έγκυρους λογαριασμούς αμέσως, χωρίς πιστοποίηση έναντι σε έναν εξωτερικό εξυπηρετητή και χωρίς επιβεβαίωση μέσω ηλεκτρονικού ταχυδρομείου. Να είστε προσεκτικοί χρησιμοποιώντας αυτήν την επιλογή - σκεφτείτε τα προβλήματα ασφάλειας και διαχείρισης που αυτό θα μπορούσε να προκαλέσει.";
$string['auth_nonetitle'] = "Χωρίς πιστοποίηση";
$string['auth_pop3description'] = "Αυτή η μέθοδος χρησιμοποιεί έναν POP3 εξυπηρετητή να ελέγξει εάν ένα δοσμένο όνομα χρήστη και κωδικός πρόσβασης είναι έγκυρα.";
$string['auth_pop3host'] = "Η διεύθυνση του POP3 εξυπηρετητή. Χρησιμοποιήστε το IP νούμερο και όχι το DNS όνομα.";
$string['auth_pop3port'] = "Θύρα εξυπηρετητή (η 110 είναι η πιό κοινή)";
$string['auth_pop3title'] = "Χρησιμοποιείστε έναν POP3 εξυπηρετητή.";
$string['auth_pop3type'] = "Ο τύπος του εξυπηρετητή. Εάν ο εξυπηρετητής σας χρησιμοποιεί ασφάλεια μέσω πιστοποιητικών,επιλέχτε  pop3cert.";
$string['auth_user_create'] = "Επιτρέπεται η δημιουργία χρηστών";
$string['auth_user_creation'] = "Νέοι (ανώνυμοι) χρήστες μπορούν να δημιουργήσουν λογαριασμούς χρηστών στο εξωτερικό σημείο πιστοποίησης και να τους επιβεβαιώσουν μέσω ηλεκτρονικού ταχυδρομείου. Αν το ενεργοποιήσετε αυτό, θυμηθείτε επίσης να επεξεργαστείτε τις επιλογές κάθε συγκεκριμμένης ενότητας για τη δημιουργία χρηστών";
$string['auth_usernameexists'] = "Αυτό το όνομα χρήστη υπάρχει ήδη. Παρακαλώ επιλέξτε άλλο.";
$string['authenticationoptions'] = "Επιλογές πιστοποίησης";
$string['authinstructions'] = "Εδώ μπορείτε να παρέχετε τις οδηγίες για τους χρήστες σας, έτσι ώστε να ξέρουν ποιό όνομα χρήστη και κωδικό πρόσβασης πρέπει να χρησιμοποιούν.  Το κείμενο που εισάγετε εδώ θα εμφανιστεί στη σελίδα σύνδεσης.  Εάν το αφήσετε  κενό, τότε καμία οδηγία δεν θα τυπωθεί.";
$string['changepassword'] = "Αλλαγή κωδικού πρόσβασης URL";
$string['changepasswordhelp'] = "Εδώ μπορείτε να διευκρινίσετε μια θέση στην οποία οι χρήστες σας μπορούν να ανακτήσουν ή να αλλάξουν το όνομα χρήστη/τον κωδικό πρόσβασής τους εάν τα έχουν ξεχάσει.  Αυτό θα παρέχεται στους χρήστες ως σύνδεσμος στη σελίδα σύνδεσης και τη σελίδα χρηστών τους.  Εάν το αφήσετε κενό, ο σύνδεσμος δεν θα τυπωθεί.";
$string['chooseauthmethod'] = "Επιλέξτε μία μέθοδο πιστοποίησης:";
$string['guestloginbutton'] = "Σύνδεσμος για την σύνδεση";
$string['instructions'] = "Οδηγίες";
$string['md5'] = "MD5 κρυπτογράφηση";
$string['plaintext'] = "Απλό κείμενο";
$string['showguestlogin'] = "Μπορείτε να κρύψετε ή να εμφανίσετε το σύνδεσμο στη σελίδα σύνδεσης";

?>
