<?PHP // $Id$ 
      // moodle.php - created with Moodle 1.1 (2003082800)


$string['action'] = "Δράση";
$string['activities'] = "Δραστηριότητες";
$string['activity'] = "Δραστηριότητα";
$string['activityclipboard'] = "Μετακίνηση αυτής της δραστηριότητας: <b>\$a</b>";
$string['activityiscurrentlyhidden'] = "Δυστυχώς αυτή η δραστηριότητα είναι προς το παρόν κρυφή";
$string['activitymodule'] = "Ενότητα δραστηριότητας";
$string['activityreport'] = "Αναφορά δραστηριότητας";
$string['activityselect'] = "Επέλεξε αυτή τη δραστηριότητα να μετακινηθεί κάπου αλλού";
$string['activitysince'] = "Δραστηριότητα από \$a";
$string['add'] = "Προσθήκη";
$string['addadmin'] = "Προσθήκη διαχειριστή";
$string['addcreator'] = "Προσθήκη δημιουργού";
$string['added'] = "Προστέθηκε \$a";
$string['addinganew'] = "Προσθήκη νέας \$a";
$string['addinganewto'] = "Προσθέτει νέα \$a->σε μια  \$a->σε";
$string['addingdatatoexisting'] = "Προσθήκη δεδομένων στα υπάρχοντα";
$string['addnewcategory'] = "Προσθήκη νέας κατηγορίας";
$string['addnewcourse'] = "Προσθήκη νέου μαθήματος";
$string['addnewuser'] = "Προσθήκη νέου χρήστη";
$string['address'] = "Διεύθυνση";
$string['addstudent'] = "Προσθήκη μαθητή";
$string['addteacher'] = "Προσθήκη εκπαιδευτή";
$string['admin'] = "Διαχειριστής";
$string['adminhelpaddnewuser'] = "Δημιουργία λογαριασμού ενός νέου χρήστη χειροκίνητα";
$string['adminhelpassignadmins'] = "Οι διαχειριστές μπορούν να κάνουν οτιδήποτε και να πάνε οπουδήποτε σ' αυτό το δικτυακό τόπο";
$string['adminhelpassigncreators'] = "Οι δημιουργοί μπορούν να δημιουργήσουν νέα μαθήματα και να διδάξουν σ' αυτά";
$string['adminhelpassignstudents'] = "Μπείτε σε ένα μάθημα και προσθέστε μαθητές από το μενού του διαχειριστή";
$string['adminhelpassignteachers'] = "Βρες ένα μάθημα κι έπειτα χρησιμοποίησε το εικονίδιο για να προσθέσεις καθηγητές";
$string['adminhelpauthentication'] = "Μπορείς να χρησιμοποιήσεις εσωτερικούς λογαριασμούς χρηστών ή εξωτερικές βάσεις δεδομένων";
$string['adminhelpconfiguration'] = "Διαμόρφωση της εμφάνισης και της λειτουργίας του site";
$string['adminhelpconfigvariables'] = "Διαμόρφωση των μεταβλητών που επηρεάζουν τη γενική λειτουργία του site";
$string['adminhelpcourses'] = "Όρισε μαθήματα και κατηγορίες και εκχώρισε άτομα σ' αυτές";
$string['adminhelpedituser'] = "Ξεφύλλισε τη λίστα των λογαριασμών χρηστών και επεξεργάσου κάποιες απ' αυτές";
$string['adminhelplanguage'] = "Για έλεγχο και επεξεργασία του τρέχοντος γλωσσικού πακέτου";
$string['adminhelplogs'] = "Ξεφύλλισε τις συνδέσεις όλων των δραστηριοτήτων σ' αυτό το site";
$string['adminhelpmanagedatabase'] = "Απευθείας πρόσβαση στη βάση δεδομένων (πρόσεχε!)";
$string['adminhelpmanagemodules'] = "Διαχειρίσου τις εγκατεστημένες ενότητες και τις ρυθμίσεις τους";
$string['adminhelpsitefiles'] = "Για έκδοση γενικών αρχείων ή φόρτωση εξωτερικών αντιγράφων ασφαλείας";
$string['adminhelpsitesettings'] = "Προσδιορίστε πώς θα φαίνεται η αρχική σελίδα του site";
$string['adminhelpthemes'] = "Επιλέξτε πώς θα φαίνεται το site (χρώματα, φόντο κλπ)";
$string['adminhelpusers'] = "Πιστοποιήστε τους χρήστες και τις ρυθμίσεις σας";
$string['administration'] = "Διαχείριση";
$string['administrator'] = "Διαχειριστής";
$string['administrators'] = "Διαχειριστές";
$string['again'] = "πάλι";
$string['all'] = "Όλα";
$string['alldays'] = "όλες τις ημέρες";
$string['allfieldsrequired'] = "Απαιτούνται όλα τα πεδία";
$string['alllogs'] = "Όλες οι συνδέσεις";
$string['allow'] = "Επιτρέπεται";
$string['allowguests'] = "Αυτή η ενότητα επιτρέπει την είσοδο σε επισκέπτες";
$string['allownot'] = "Δεν επιτρέπεται";
$string['allparticipants'] = "Όλοι οι συμμετέχοντες";
$string['alphanumerical'] = "Μπορεί μόνο να περιέχει γράμματα της αλφαβήτου ή νούμερα";
$string['alreadyconfirmed'] = "Η καταχώρηση έχει ήδη επιβεβαιωθεί";
$string['answer'] = "Απάντηση";
$string['areyousuretorestorethis'] = "Θέλετε να συνεχίσετε;";
$string['areyousuretorestorethisinfo'] = "Αργότερα σ' αυτή τη διαδικασία θα έχετε την επιλογή της προσθήκης αυτού του αντιγράφου ασφαλείας σε ένα υπάρχον μάθημα ή της δημιουργίας ενός εντελώς νέου μαθήματος.";
$string['assessment'] = "Αποτίμηση";
$string['assignadmins'] = "Προσδιορισμός διαχειριστών";
$string['assigncreators'] = "Προσδιορισμός δημιουργών";
$string['assignstudents'] = "Εγγραφή μαθητών";
$string['assignstudentsnote'] = "Σημείωση: μπορεί να μην είναι απαραίτητο να χρησιμοποιήσετε αυτή τη σελίδα, εφόσον είναι πιθανό για τους μαθητές να εγγράψουν τους εαυτούς τους σ' αυτό το μάθημα.";
$string['assignstudentspass'] = "Το μόνο που χρειάζεται να κάνεις είναι να γνωστοποιήσεις στους μαθητές σου το πλήκτρο εγγραφής γι' αυτό το μάθημα, το οποίο έχει προς το παρόν ρυθμιστεί σε: '\$a'";
$string['assignteachers'] = "Προσδιορισμός εκπαιδευτών";
$string['authentication'] = "Πιστοποίηση";
$string['autosubscribe'] = "Αυτόματη εγγραφή στις ομάδες συζητήσεων";
$string['autosubscribeno'] = "Όχι: να μην εγγράφομαι αυτόματα σε ομάδες συζητήσεων";
$string['autosubscribeyes'] = "Ναι: όταν αναρτώ ανακοινώσεις σε μια ομάδα συζητήσεων να εγγράφομαι αυτόματα σε αυτή";
$string['availability'] = "Διαθεσιμότητα";
$string['availablecourses'] = "Διαθέσιμα Μαθήματα";
$string['backup'] = "Αντίγραφο ασφαλείας";
$string['backupdate'] = "Ημερομηνία αντίγραφου ασφαλείας";
$string['backupdetails'] = "Λεπτομέρειες αντίγραφου ασφαλείας";
$string['backupfilename'] = "αντίγραφο ασφαλείας";
$string['backupfinished'] = "Το αντίγραφο ασφαλείας ολοκληρώθηκε επιτυχώς";
$string['backupnameformat'] = "%%Y%%m%%d-%%H%%M";
$string['backuporiginalname'] = "Όνομα αντίγραφου ασφαλείας";
$string['backupversion'] = "Έκδοση αντίγραφου ασφαλείας";
$string['cancel'] = "Ακύρωση";
$string['categories'] = "Κατηγορίες ενοτήτων";
$string['category'] = "Κατηγορία ";
$string['categoryadded'] = "Η κατηγορία '\$a' προστέθηκε";
$string['categorydeleted'] = "Η κατηγορία  '\$a' διαγράφηκε";
$string['categoryduplicate'] = "Υπάρχει ήδη κατηγορία με το όνομα '\$a'!";
$string['changedpassword'] = "Ο κωδικός πρόσβασης άλλαξε";
$string['changepassword'] = "Αλλαγή του κωδικού πρόσβασης";
$string['changessaved'] = "Οι αλλαγές αποθηκεύτηκαν";
$string['checkingbackup'] = "Έλεγχος αντιγράφου ασφαλείας";
$string['checkingcourse'] = "Έλεγχος μαθήματος";
$string['checkinginstances'] = "Έλεγχος περιπτώσεων";
$string['checkingsections'] = "Έλεγχος τμημάτων";
$string['checklanguage'] = "Ελέγξτε την γλώσσα";
$string['choose'] = "Επιλέξτε";
$string['choosecourse'] = "Επιλέξτε ένα μάθημα";
$string['chooselivelogs'] = "ή παρακολουθήστε την τρέχουσα δραστηριότητα";
$string['chooselogs'] = "Επιλέξτε ποιές καταχωρήσεις θέλετε να δείτε";
$string['choosetheme'] = "Επιλέξτε ένα θέμα";
$string['chooseuser'] = "Επιλέξτε ένα χρήστη";
$string['city'] = "Πόλη/χωριό";
$string['cleaningtempdata'] = "Καθαρισμός δεδομένων";
$string['closewindow'] = "Κλείστε αυτό το παράθυρο";
$string['comparelanguage'] = "Σύγκρινετε και επεξεργαστείτε την χρησιμοποιούμενη γλώσσα";
$string['complete'] = "Ολοκλήρωση";
$string['configcountry'] = "Εάν θέσετε μία χώρα εδώ, τότε αυτή η χώρα θα τεθεί σαν προκαθορισμένη σε νέους λογαριασμούς χρηστών. Για να αναγκάσετε τους χρήστες να διαλέξουν χώρα, απλά αφήστε το κενό.";
$string['configdebug'] = "Εάν αυτό τεθεί σε λειτουργία, τότε αναφορές λαθών της php θα είναι πιό λεπτομερείς και πιο πολλές προειδοποιήσεις θα τυπωθούν. Αυτό χρησιμεύει μόνο σε υπευθύνους για την ανάπτυξη.";
$string['configerrorlevel'] = "Επιλέξτε την ποσότητα των προειδοποιήσεων php που θέλετε να εμφανίζονται. Το κανονικό είναι συνήθως η καλύτερη επιλογή.";
$string['configframename'] = "Αν εμβυθίζετε το Moodle σε ένα frame, τότε βάλτε το όνομα του frame εδώ.  Αλλιώς αυτή η τιμή θα πρέπει να παραμείνει '_top'";
$string['configgdversion'] = "Υποδείξτε την έκδοση του GD που είναι εγκατεστημένη. Η έκδοση που έχει προκαθοριστεί είναι αυτή που έχει αυτόματα επιλεγεί. Μην το αλλάξετε αυτό εκτός κι αν ξέρετε πραγματικά τι κάνετε.";
$string['confightmleditor'] = "Επιλέξτε εαν πρέπει να επιτραπεί η χρήση του ενσωματωμένου επεξεργαστή κειμένων HTML. Ακόμα κι αν επιλέξετε να επιτραπεί, αυτός ο επεξεργαστής θα εμφανιστεί μόνο εάν ο χρήστης χρησιμοποιεί έναν συμβατό πλοηγό (Δηλ. IE 5.5 ή επόμενη έκδοση). Οι χρήστες μπορούν επίσης να επιλέξουν να μην το χρησιμοποιήσουν.";
$string['configidnumber'] = "Αυτή η επιλογή προσδιορίζει αν (α)Δεν ζητείται καθόλου στους χρήστες αριθμός ID, (β)Ζητείται από τους χρήστες ένας αριθμός ID αλλά μπορούν να το αφήσουν κενό ή (γ)Ζητείται από τους χρήστες ένας αριθμός ID και δεν μπορούν να το αφήσουν κενό. Αν δοθεί, ο αριθμός ID του χρήστη εμφανίζεται στο Προφίλ.";
$string['configintro'] = "Σε αυτή τη σελίδα μπορείτε να διευκρινήσετε έναν αριθμό μεταβλητών που βοηθούν το Moodle να δουλέψει καλύτερα. Μην ανησυχείτε ιδιαίτερα για αυτές - οι προκαθαρισμένες τιμές δουλεύουν καλά και μπορείτε πάντα να επιστρέψετε σε αυτή τη σελίδα και να τις τροποποιήσετε.";
$string['configintroadmin'] = "Σε αυτή τη σελίδα μπορείτε να ρυθμίσετε τον κύριο λογαριασμό διαχείρισης ο οποίος θα έχει πλήρη έλεγχο πάνω στο δικτυακό τόπο. Βεβαιωθείτε πως του αντιστοιχείτε ασφαλές όνομα χρήστη και κωδικό πρόσβασης καθώς και έγκυρη διεύθυνση ηλεκτρονικού ταχυδρομείου.  Μπορείτε να δημιουργήσετε περισσότερους λογαριασμούς διαχείρισης αργότερα.";
$string['configintrosite'] = "Σε αυτή τη σελίδα μπορείτε να ρυθμίσετε την αρχική σελίδα και το όνομα αυτού του νέου δικτυακού τόπου.  Μπορείτε να επιστρέψετε εδώ αργότερα και να αλλάξετε αυτές τις ρυθμίσεις χρησιμοποιώντας το σύνδεσμο 'Ρυθμίσεις δικτυακού τόπου' στην αρχική σελίδα.";
$string['configlang'] = "Επιλέξτε μια γλώσσα για το σύνολο του δικτυακού τόπου. Οι χρήστες μπορούν να αγνοήσουν αργότερα αυτή την επιλογή.";
$string['configlangdir'] = "Οι περισσότερς γλώσσες γράφονται από αριστερά προς δεξιά, αλλά μερικές, όπως η Αραβική και η Εβραϊκή, γράφονται από δεξιά προς αριστερά.";
$string['configlanglist'] = "Αφήστε το κενό για να επιτρέψετε στους χρήστες να επιλέξουν από οποιαδήποτε γλώσσα είναι διαθέσιμη σε αυτή την εγκατάσταση του Moodle.  Ωστόσο, μπορείτε να περιορίσετε την επιλογή εισάγοντας μια λίστα κωδικών γλωσσών χωρισμένους με κόμμα.  Για παράδειγμα:  en,es_es,fr,it";
$string['configlangmenu'] = "Επιλέξτε αν θέλετε να εμφανίζεται ή όχι το γενικό μενού επιλογής γλώσσας στην αρχική σελίδα, στη σελίδα σύνδεσης κτλ. Αυτό δεν επηρεάζει τη δυνατότητα των χρηστών να ορίζουν την προτιμώμενη γλώσσα στο δικό τους προφίλ .";
$string['configlocale'] = "Επιλέξτε μια χώρα για το σύνολο του δικτυακού τόπου. Αυτό θα επηρεάσει τη μορφή και τη γλώσσα των ημερομηνιών. Τα δεδομένα για τη χώρα αυτή θα πρέπει να είναι εγκατηστημένα στο λειτουργικό σύστημα. (πχ. en_US ή es_ES ή el_GR). Αν δεν είστε βέβαιοι αφήστε το κενό.";
$string['configloglifetime'] = "Αυτό καθορίζει το εύρος χρόνου για το οποίο θέλετε να τηρείτε αρχεία καταγραφής σχετικά με τη δραστηριότητα των χρηστών.  Αρχεία καταγραφής μεγαλύτερα από αυτό διαγράφονται αυτόματα. Το καλύτερο είναι να τηρείτε αρχεία καταγραφής για το μεγαλύτερο δυνατό διάστημα, για την περίπτωση που τα χρειαστείτε, αλλά αν ο διακομιστής είναι πολύ απασχολημένος και έχετε προβλήματα απόδοσης ίσως να θέλετε να μειώσετε το χρόνο ζωής των αρχείων καταγραφής.";
$string['configlongtimenosee'] = "Αν οι μαθητές κάνουν πολύ καιρό να χρησιμοποιήσουν το σύστημα, τότε αυτόματα θα διαγραφούν από τα μαθήματα. Αυτή η παράμετρος καθορίζει αυτό το χρονικό όριο.";
$string['configmaxeditingtime'] = "Αυτό καθορίζει το χρόνο μέσα στον οποίο κάποιος πρέπει να επεξεργαστεί ξανά ανακοινώσεις, ημερολόγια κτλ. 30 λεπτά είναι συνήθως μια καλή τιμή.";
$string['configproxyhost'] = "Αν αυτός ο <B>εξυπηρετητής</B> χρειάζεται έναν διακομιστή μεσολάβησης (proxy, πχ ένα firewall) για να έχει πρόσβαση στο Διαδίκτυο, τότε δηλώστε τη διεύθυνση και τη θύρα του εδώ. Αλλιώς αφήστε το κενό.";
$string['configsecureforms'] = "Το Moodle μπορεί να χρησιμοποιήσει ένα επιπλέον επίπεδο ασφάλειας όταν δέχεται δεδομένα από φόρμες. Αν αυτό ενεργοποιηθεί τότε η μεταβλητή HTTP_REFERER του φυλλομετρητή θα ελέγχεται αν είναι ίδια με τη διεύθυνση της φόρμας. Σε μερικές περιπτώσεις, αν ο χρήστης χρησιμοποιεί firewall (π.χ. Zonealarm) το οποίο να αφαιρεί το HTTP_REFERER από τα δεδομένα που διακινούνται, αυτό μπορεί να προκαλέσει προβλήματα. Το σύμπτωμα που θα εμφανιστεί θα είναι να 'κολλάει' ένας χρήστης σε μια φόρμα. Αν οι χρήστες σας έχουν πρόβλημα με τη σελίδα σύνδεσης (για παράδειγμα) τότε ίσως θα θέλετε να απενεργοποιήσετε αυτή την επιλογή, αν και αυτό θα αφήσει το δικτυακό σας τόπο πιο ανοιχτό σε επιθέσεις brute force. Αν δεν είστε σίγουροι αφήστε το στη θέση 'Ναι'.";
$string['configsessiontimeout'] = "Αν οι χρήστες που έχουν συνδεθεί δεν εκτελούν καμιά δραστηριότητα σε αυτό το δικτυακό τόπο, τότε αποσυνδέονται αυτόματα (η συνεδρία τους λήγει). Αυτή η μεταβλητή καθορίζει πόσο θα είναι αυτό το διάστημα.";
$string['configslasharguments'] = "Αρχεία (φορτώσεις εικόνων, αρχείων κτλ) παρέχονται από ένα μικρό πρόγραμμα χρησιμοποιώντας 'παραμέτρους slash' (εδώ η δεύτερη επιλογή). Αυτή η μέθοδος επιτρέπει σε αρχεία να αποθηκεύονται πιο εύκολα στην ενδιάμεση μνήμη του φυλλομετρητή ή του διακομιστή μεσολάβησης κτλ. Δυστυχώς, ορισμένοι εξυπηρετητές PHP δεν επιτρέπουν αυτή τη μέθοδο και έτσι αν έχετε πρόβλημα στην προβολή αρχείων ή εικόνων που έχουν φορτωθεί επιλέξτε την πρώτη τιμή για αυτή τη μεταβλητή.";
$string['configsmtphosts'] = "Δώστε το πλήρες όνομα ενός ή περισσοτέρων τοπικών εξυπηρετητών SMTP τους οποίους θα πρέπει να χρησιμοποιήσει το Moodle ώστε να στείλει μηνύματα ηλεκτρονικού ταχυδρομείου (πχ. 'mail.a.com' ή 'mail.a.com;mail.b.com'). Αν το αφήσετε κενό, το Moodle θα χρησιμοποιήσει την προκαθορισμένη μέθοδο της PHP για την αποστολή των μηνυμάτων.";
$string['configsmtpuser'] = "Αν έχετε καθορίσει εξυπηρετητή SMTP πιο πάνω και ο εξυπηρετητής απαιτεί πιστοποίηση τότε εισάγετε το όνομα χρήστη και τον κωδικό πρόσβασης εδώ.";
$string['configteacherassignteachers'] = "Θα πρέπει να επιτρέπεται στους συνήθεις καθηγητές να καθορίζουν άλλους καθηγητές στα μαθήματα; Αν 'Όχι', τότε μόνο οι δημιουργοί και οι διαχειριστές μπορούν να καθορίσουν καθηγητές.";
$string['configunzip'] = "Υποδείξτε τη θέση του προγράμματος αποσυμπίεσης (unzip, μόνο σε Unix). Αν προσδιοριστεί, θα χρησιμοποιηθεί για να αποσυμπιέζονται στον εξυπηρετητή συμπιεσμένα αρχεία. Αν το αφήσετε κενό, τότε το Moodle θα χρησιμοποιήσει εσωτερικές ρουτίνες.";
$string['configuration'] = "Διαμόρφωση";
$string['configvariables'] = "Μεταβλητές";
$string['configwarning'] = "Να είστε προσεκτικοί στη διαμόρφωση αυτών των μεταβλητών - οι περίεργες τιμές μπορεί να προκαλέσουν προβλήματα";
$string['configzip'] = "Υποδείξτε τη θέση του προγράμματος συμπίεσης (zip, μόνο σε Unix). Αν καθοριστεί, θα χρησιμοποιηθεί για να συμπιέζονται στον εξυπηρετητή αρχεία. Αν το αφήσεις κενό, τότε το Moodle θα χρησιμοποιήσει εσωτερικές ρουτίνες.";
$string['confirmed'] = "Η εγγραφή σας επιβεβαιώθηκε";
$string['confirmednot'] = "Η εγγραφή σας δεν έχει επιβεβαιωθεί ακόμη!";
$string['continue'] = "Συνέχεια";
$string['cookiesenabled'] = "Τα cookies πρέπει να είναι ενεργοποιημένα στο φυλλομετρητή σας";
$string['copy'] = "αντιγραφή";
$string['copyingcoursefiles'] = "Αντιγραφή αρχείων μαθημάτων";
$string['copyinguserfiles'] = "Αντιγραφή αρχείων χρήστη";
$string['copyingzipfile'] = "Αντιγραφή συμπιεσμένου αρχείου";
$string['copyrightnotice'] = "Σημείωση πνευματικών δικαιωμάτων";
$string['country'] = "Χώρα";
$string['course'] = "Μάθημα";
$string['courseavailable'] = "Αυτό το μάθημα είναι διαθέσιμο σε μαθητές";
$string['courseavailablenot'] = "Αυτό το μάθημα δεν είναι διαθέσιμο σε μαθητές";
$string['coursebackup'] = "Αντίγραφο ασφαλείας μαθήματος";
$string['coursecategories'] = "Κατηγορίες μαθήματος";
$string['coursecategory'] = "Κατηγορία μαθήματος";
$string['coursecreators'] = "Δημιουργοί μαθήματος";
$string['coursefiles'] = "Αρχεία μαθήματος";
$string['courseformats'] = "Τύποι μαθήματος";
$string['coursegrades'] = "Βαθμοί μαθήματος";
$string['courseinfo'] = "Πληροφορίες μαθήματος";
$string['courserestore'] = "Επαναφορά μαθήματος";
$string['courses'] = "Μαθήματα";
$string['courseupdates'] = "Ενημερώσεις μαθήματος";
$string['create'] = "Δημιουργία";
$string['createaccount'] = "Δημιουργία του νέου μου λογαριασμού";
$string['createfolder'] = "Δημιούργησε έναν φάκελο στο \$a";
$string['createuserandpass'] = "Δημιουργία ενός νέου ονόματος χρήστη και κωδικού πρόσβασης για είσοδο στο σύστημα";
$string['createziparchive'] = "Δημιουργία συμπιεσμένου αρχείου";
$string['creatingcategoriesandquestions'] = "Δημιουργία κατηγοριών και ερωτήσεων";
$string['creatingcoursemodules'] = "Δημιουργία ενοτήτων μαθήματος";
$string['creatinglogentries'] = "Δημιουργία συνδέσεων";
$string['creatingnewcourse'] = "Δημιουργία νέου μαθήματος";
$string['creatingscales'] = "Δημιουργία βαθμίδων";
$string['creatingsections'] = "Δημιουργία τομέων";
$string['creatingtemporarystructures'] = "Δημιουργία προσωρινών δομών";
$string['creatingusers'] = "Δημιουργία χρηστών";
$string['creatingxmlfile'] = "Δημιουργία αρχείου XML";
$string['currentcourseadding'] = "Τρέχον μάθημα, προσθήκη δεδομένων σ' αυτό";
$string['currentcoursedeleting'] = "Τρέχον μάθημα, διαγραφή του πρώτα";
$string['currentlanguage'] = "Επιλεγμένη γλώσσα";
$string['currentlocaltime'] = "η τωρινή τοπική ώρα";
$string['currentrelease'] = "Πληροφορίες τρέχουσας έκδοσης";
$string['currentversion'] = "Τρέχουσα έκδοση";
$string['databasechecking'] = "Αναβάθμιση της βάσης δεδομένων του  Moodle database από την έκδοση \$a->oldversion στην \$a->newversion...";
$string['databasesetup'] = "Ρύθμιση της βάσης δεδομένων";
$string['databasesuccess'] = "Η βάση δεδομένων αναβαθμίστηκε επιτυχώς";
$string['databaseupgradebackups'] = "Η έκδοση αντιγράφου ασφαλείας είναι τώρα \$a";
$string['databaseupgrades'] = "Αναβάθμιση της βάσης δεδομένων";
$string['day'] = "ημέρα";
$string['days'] = "ημέρες";
$string['defaultcoursefullname'] = "Όνομα Μαθήματος 101";
$string['defaultcourseshortname'] = "ΜΟ101";
$string['defaultcoursestudent'] = "Μαθητής";
$string['defaultcoursestudents'] = "Μαθητές";
$string['defaultcoursesummary'] = "Γράψτε μια περιεκτική και ενδιαφέρουσα παράγραφο η οποία να εξηγεί περί τίνος πρόκειται σε αυτό το μάθημα";
$string['defaultcourseteacher'] = "Εκπαιδευτής";
$string['defaultcourseteachers'] = "Εκπαιδευτές";
$string['delete'] = "Διαγραφή";
$string['deletecheck'] = "\$a - να διαγραφεί;";
$string['deletecheckfiles'] = "Είστε απολύτως βέβαιοι ότι θέλετε να διαγράψετε αυτά τα αρχεία;";
$string['deletecheckfull'] = "Είστε απολύτως βέβαιοι πως θέλετε να διαγραφεί το \$a;";
$string['deletecheckwarning'] = "Πρόκειται να διαγραφούν αυτά τα αρχεία";
$string['deletecompletely'] = "Απόλυτη διαγραφή";
$string['deletecourse'] = "Διαγραφή ενός μαθήματος";
$string['deletecoursecheck'] = "Είστε απολύτως βέβαιοι πως θέλετε να διαγράψετε εντελώς αυτό το μάθημα και όλα τα δεδομένα που περιέχει;";
$string['deleted'] = "Διαγράφηκε";
$string['deletedactivity'] = "\$a - διαγράφηκε";
$string['deletedcourse'] = "\$a διαγράφηκε εντελώς";
$string['deletednot'] = "\$a - δεν ήταν δυνατή η διαγραφή!";
$string['deletingcourse'] = "\$a - διαγραφή σε εξέλιξη";
$string['deletingexistingcoursedata'] = "Διαγραφή υπαρχόντων δεδομένων μαθήματος";
$string['deletingolddata'] = "Διαγραφή παλαιών δεδομένων";
$string['department'] = "Τμήμα";
$string['description'] = "Περιγραφή";
$string['displayingfirst'] = "Μόνο τα πρώτα \$a->count \$a->things προβάλλονται";
$string['displayingrecords'] = "Προβολή \$a εγγραφών";
$string['displayingusers'] = "Προβολή χρηστών \$a->start μέχρι \$a->end";
$string['documentation'] = "Τεκμηρίωση του Moodle";
$string['donotask'] = "Μην Ρωτάτε";
$string['downloadexcel'] = "Αποθήκευση σε μορφή Excel";
$string['downloadtext'] = "Αποθήκευση σε μορφή κειμένου";
$string['doyouagree'] = "Έχετε διαβάσει και κατανοήσει αυτούς τους όρους;";
$string['edit'] = "Επεξεργασία \$a";
$string['editcoursesettings'] = "Επεξεργασία των ρυθμίσεων του μαθήματος";
$string['editinga'] = "Επεξεργασία ενός \$a";
$string['editmyprofile'] = "Επεξεργασία του προφίλ";
$string['editsummary'] = "Επεξεργασία της σύνοψης";
$string['editthisactivity'] = "Επεξεργασία αυτής της δραστηριότητας";
$string['editthiscategory'] = "Επεξεργασία αυτής της κατηγορίας";
$string['edituser'] = "Επεξεργασία των λογαριασμών των χρηστών";
$string['email'] = "Διεύθυνση ηλεκτρονικού ταχυδρομείου";
$string['emailconfirm'] = "Επιβεβαιώστε το λογαριασμό σας";
$string['emailconfirmation'] = "Γειά σας, 

Έχει γίνει αίτηση ενός νέου λογαριασμού στο '\$a->sitename'
χρησιμοποιώντας τη δική σας διεύθυνση ηλεκτρονικού ταχυδρομείου.

Για να επιβεβαιώσετε το νέο λογαρισμό σας, παρακαλώ επισκεφθείτε την παρακάτω διεύθυνση:

  \$a->link

Στα περισσότερα προγράμματα ηλεκτρονικού ταχυδρομείου αυτό θα πρέπει να εμφανίζεται σαν μπλε σύνδεσμος στο οποίο μπορείτε να πατήσετε με το ποντίκι. Αν αυτό δε λειτουργεί τότε αντιγράψτε και επικολλήστε αυτή τη διεύθυνση στη γραμμή διευθύνσεων στο πάνω μέρος του φυλλομετρητή.

Φιλικά, 
ο διαχειριστής του '\$a->sitename',
\$a->admin";
$string['emailconfirmationsubject'] = "\$a: επιβεβαίωση λογαριασμού";
$string['emailconfirmsent'] = "   <P>Ένα μήνυμα ηλεκτρονικού ταχυδρομείου θα πρέπει να έχει σταλεί στη διεύθυνσή σας, <B>\$a</B>
   <P>Περιέχει απλές οδηγίες για την ολοκλήρωση της εγγραφής σας.
   <P>Αν συνεχίζετε να αντιμετωπίζεται δυσκολίες, επικοινωνήστε με το διαχειριστή του δικτυακού τόπου.";
$string['emaildisplay'] = "Απόκρυψη της διεύθυνσης ηλεκτρονικού ταχυδρομείου";
$string['emaildisplaycourse'] = "Η διεύθυνση ηλεκτρονικού ταχυδρομείου μου είναι ορατή μόνο στα άλλα μέλη του μαθήματος";
$string['emaildisplayno'] = "Απόκρυψη της πραγματικής διεύθυνσης ηλεκτρονικού ταχυδρομείου μου για όλους";
$string['emaildisplayyes'] = "Η διεύθυνση ηλεκτρονικού ταχυδρομείου μου είναι ορατή σε όλους τους χρήστες";
$string['emailexists'] = "Αυτή η διεύθυνση ηλεκτρονικού ταχυδρομείου έχει ήδη εγγραφεί.";
$string['emailformat'] = "Μορφή μηνύματος ηλεκτρονικού ταχυδρομείου";
$string['emailmustbereal'] = "Σημείωση: η διεύθυνση ηλεκτρονικού ταχυδρομείου σας πρέπει να είναι πραγματική";
$string['emailpasswordconfirmation'] = "Γειά σας \$a->firstname,

Κάποιος (πιθανότατα εσείς ο ίδιος) έχει ζητήσει ένα νέο κωδικό πρόσβασης 
για το λογαριασμό σας στο '\$a->sitename'.

Για να το επιβεβαιώσετε αυτό και για να παραλάβετε ένα νέο κωδικό πρόσβασης μέσω
ηλεκτρονικού ταχυδρομείου, ακουθήστε την παρακάτω διεύθυνση:

  \$a->link

Στα περισσότερα προγράμματα ηλεκτρονικού ταχυδρομείου αυτό θα πρέπει να
εμφανίζεται σαν μπλε σύνδεσμος στον οποίο μπορείτε να κάνετε κλικ. Αν αυτό δε
λειτουργεί, τότε αντιγράψτε και επικολλήστε τη διεύθυση στη 'Γραμμή διευθύνσεων'
του φυλλομετρητή σας.

Αν χρειάζεστε βοήθεια, παρακαλώ επικοινωνήστε με το διαχειριστή του δικτυακού τόπου, 
\$a->admin";
$string['emailpasswordconfirmationsubject'] = "\$a: αλλαγή κωδικού πρόσβασης";
$string['emailpasswordconfirmsent'] = "Ένα μήνυμα ηλεκρονικού ταχυδρομείου έχει σταλεί στην ηλεκτρονική σου διεύθυνση στο <b>\$a</b>.
<p>Περιέχει εύκολες οδηγίες για επιβεβαίωση και ολοκλήρωση της αλλαγής του κωδικού πρόσβασης.
Αν συνεχίσεις να αντιμετωπίζεις δυσκολία, επικοινώνησε με το διαχειριστή του δικτυακού τόπου.";
$string['emailpasswordsent'] = "Ευχαριστούμε για την επιβεβαίωση της αλλαγής του κωδικού πρόσβασης.  //FIX
<p>Ένα μήνυμα ηλεκτρονικού ταχυδρομείου που περιέχει το νέο σου κωδικό πρόσβασης έχει σταλεί στην ηλεκτρονική σου διεύθυνση στο <b>\$a->email</b>.
<p>Ο νέος κωδικός πρόσβασης δημιουργήθηκε αυτόματα - πιθανώς να θέλεις
<a href=\$a->link>να αλλάξεις τον κωδικό σου</a> με κάποιον που να μπορείς να θυμηθείς πιο εύκολα.";
$string['enrolmentconfirmation'] = "Θα εγγραφείς σαν μέλος αυτού του μαθήματος.<br/>Είστε βέβαιοι ότι θέλετε να το κάνετε;";
$string['enrolmentkey'] = "Κλειδί εγγραφής";
$string['enrolmentkeyfrom'] = "Αυτό το μάθημα απαιτεί ένα 'κλειδί εγγραφής' - έναν κωδικό μιας χρήσης<BR>
το οποίο θα έπρεπε να τον έχετε παραλάβει από τον \$a";
$string['enrolmentkeyhint'] = "Αυτό το κλειδί εγγραφής ήταν λάθος, παρακαλώ δοκιμάστε ξανά<BR>
(Συμβουλή - ξεκινά με '\$a')";
$string['entercourse'] = "Πατήστε για να εισέλθετε σε αυτό το μάθημα";
$string['enteremailaddress'] = "Εισάγετε τη διεύθυνση ηλεκτρονικού ταχυδρομείου σας ώστε να αλλάξει 
ο κωδικός πρόσβασής σας - ο νέος κωδικός πρόσβασης θα σας αποσταλεί μέσω ηλεκτρονικού ταχυδρομείου";
$string['error'] = "Σφάλμα";
$string['errortoomanylogins'] = "Δυστυχώς οι απόπειρες σύνδεσής σας έχουν υπερβεί τον επιτρεπτό αριθμό. Επανεκκινήστε, το φυλλομετρητή σας.";
$string['existing'] = "Υπάρχει";
$string['existingadmins'] = "Υπάρχοντες διαχειριστές";
$string['existingcourse'] = "Υπάρχουσα ενότητα";
$string['existingcourseadding'] = "Υπάρχον μάθημα, προσθήκη δεδομένων σ' αυτό";
$string['existingcoursedeleting'] = "Υπάρχον μάθημα, διαγραφή του πρώτα";
$string['existingcreators'] = "Υπάρχοντες δημιουργοί μαθημάτων";
$string['existingstudents'] = "Εγγεγραμένοι μαθητές";
$string['existingteachers'] = "Υπάρχοντες εκπαιδευτές";
$string['feedback'] = "Απαντήσεις";
$string['filemissing'] = "\$a - λείπει";
$string['files'] = "Αρχεία";
$string['filesfolders'] = "Αρχεία/φάκελοι";
$string['filloutallfields'] = "Παρακαλώ συμπληρώστε όλα τα πεδία";
$string['findmorecourses'] = "Εύρεση περισσότερων μαθημάτων...";
$string['firstname'] = "Όνομα";
$string['firsttime'] = "Είναι η πρώτη σας φορά εδώ;";
$string['followingoptional'] = "Τα επόμενα είναι προαιρετικά";
$string['followingrequired'] = "Τα επόμενα είναι απαραίτητα";
$string['forgotten'] = "Ξεχάσατε το όνομα χρήστη ή τον κωδικό πρόσβασης;";
$string['format'] = "Μορφή";
$string['formathtml'] = "Μορφή HTML";
$string['formatplain'] = "Μορφή απλού κειμένου";
$string['formatsocial'] = "Κοινωνική μορφή";
$string['formattext'] = "Αυτόματη μορφή από το Moodle";
$string['formattexttype'] = "Μορφοποίηση";
$string['formattopics'] = "Μορφή θεμάτων";
$string['formatweeks'] = "Εβδομαδιαία μορφή";
$string['formatwiki'] = "Μορφή Wiki ";
$string['from'] = "Από";
$string['frontpagecategorynames'] = "Εμφάνιση μιας λίστας κατηγοριών";
$string['frontpagecourselist'] = "Εμφάνιση μιας λίστας μαθημάτων";
$string['frontpagedescription'] = "Περιγραφή της αρχικής σελίδας";
$string['frontpageformat'] = "Μορφή της αρχικής σελίδας";
$string['frontpagenews'] = "Εμφάνιση ειδήσεων";
$string['fulllistofcourses'] = "Όλα τα μαθήματα";
$string['fullname'] = "Πλήρες όνομα";
$string['fullprofile'] = "Πλήρες προφίλ";
$string['fullsitename'] = "Πλήρες όνομα δικτυακού τόπου";
$string['gd1'] = "Το GD 1.x είναι εγκατεστημένο";
$string['gd2'] = "Το GD 2.x is είναι εγκατεστημένο";
$string['gdneed'] = "Το GD πρέπει να είναι εγκατεστημένο ώστε να δείτε αυτό το γράφο";
$string['gdnot'] = "Το GD δεν είναι εγκατεστημένο";
$string['gpl'] = "Copyright (C) 2001-2002  Martin Dougiamas  (http://dougiamas.com)

Αυτό το πρόγραμμα είναι δωρεάν λογισμικό; μπορείτε να το ανακατανείμετε και/ή να το τροποποιήσετε υπό τους όρους του GNU General Public Licence όπως δημοσιεύεται στο Free Software Foundation, είτε την έκδοση 2 ή (κατά δική σας επιλογή) μια επόμενη έκδοση.

Αυτό το πρόγραμμα κατανέμεται ελπίζοντας ότι θα φανεί χρήσιμο,όμως ΧΩΡΙΣ ΚΑΜΙΑ ΕΓΓΥΗΣΗ, χωρίς ακόμα και την υπονούμενη εγγύηση
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  Δείτε το GNU General Public License για περισσότερες λεπτομέρειες:

http://www.gnu.org/copyleft/gpl.html";
$string['grade'] = "Βαθμός";
$string['grades'] = "Βαθμοί";
$string['guestskey'] = "Επιτρέπονται επισκέπτες που έχουν το κλειδί";
$string['guestsno'] = "Να μην επιτρέπονται επισκέπτες";
$string['guestsnotallowed'] = "Δυστυχώς, ο/η '\$a' δεν επιτρέπει την πρόσβαση στους επισκέπτες.";
$string['guestsyes'] = "Επιτρέπονται επισκέπτες που δεν έχουν το κλειδί";
$string['guestuser'] = "Επισκέπτης";
$string['guestuserinfo'] = "Αυτός είναι ένας ειδικός χρήστης που έχει πρόσβαση μόνο για ανάγνωση σε μερικά μαθήματα.";
$string['help'] = "Βοήθεια";
$string['helpemoticons'] = "Χρήστη των emoticons";
$string['helpformatting'] = "Σχετικά με τη μορφοποίηση κειμένου";
$string['helphtml'] = "Πώς να γράψετε HTML";
$string['helpindex'] = "Ταξινόμηση όλων αρχείων βοήθειας";
$string['helppicture'] = "Πώς να φορτώσετε μια εικόνα";
$string['helpquestions'] = "Ρωτήστε καλές ερωτήσεις";
$string['helpreading'] = "Διαβάστε προσεκτικά";
$string['helprichtext'] = "Σχετικά με τον επεεξεργαστή κειμένου Richtext";
$string['helpsummaries'] = "Σχετικά με αυτές τις περιλήψεις";
$string['helptext'] = "Πώς να γράψετε κείμενο";
$string['helpwiki'] = "Πώς να γράψετε κείμενο Wiki";
$string['helpwriting'] = "Γράψτε προσεκτικά";
$string['hide'] = "Απόκρυψη";
$string['hits'] = "Επισκέψεις";
$string['hitsoncourse'] = "Επισκέψεις στο \$a->coursename από την/τον \$a->username";
$string['hitsoncoursetoday'] = "Σημερινές επισκέψεις στο \$a->coursename από την/τον \$a->username";
$string['home'] = "Αρχή";
$string['hour'] = "ώρα";
$string['hours'] = "ώρες";
$string['howtomakethemes'] = "Πώς να δημιουργήσετε νέα θέματα";
$string['htmleditor'] = "Χρησιμοποιήστε τον επεξεργαστή κειμένου Richtext (IE 5.5 και έπειτα)";
$string['htmleditoravailable'] = "Ο επεξεργαστής κειμένου Richtext είναι διαθέσιμος";
$string['htmleditordisabled'] = "Έχετε απενεργοποιήσει τον επεξεργαστή κειμένου Richtext στο προφίλ σας";
$string['htmleditordisabledadmin'] = "Ο διαχειριστής έχει απενεργοποιήσει τον επεξεργαστή κειμένου Richtext σε αυτό το δικτυακό τόπο";
$string['htmleditordisabledbrowser'] = "Ο επεξεργαστής κειμένου Richtext δεν είναι διαθέσιμος επειδή δεν χρησιμοποιείτε Internet Explorer 5.5 ή μεγαλύτερο";
$string['htmlformat'] = "Μορφή Pretty HTML";
$string['icqnumber'] = "Αριθμός ICQ";
$string['idnumber'] = "Αριθμός ταυτότητας";
$string['include'] = "Συμπερίληψη";
$string['includeallusers'] = "Συμπερίληψη όλων των χρηστών";
$string['includecoursefiles'] = "Συμπερίληψη αρχείων μαθήματος";
$string['includecourseusers'] = "Συμπερίληψη των χρηστών του μαθήματος";
$string['included'] = "Συμπεριλήφθηκε/Συμπεριλήφθηκαν";
$string['includelogentries'] = "Συμπερίληψη εγγραφών καταγραφής";
$string['includeneededusers'] = "Συμπερίληψη απαραίτητων χρηστών";
$string['includeuserfiles'] = "Συμπερίληψη αρχείων χρηστών";
$string['invalidemail'] = "Άκυρη διεύθυνση ηλεκτρονικού ταχυδρομείου";
$string['invalidlogin'] = "Άκυρη είσοδος, παρακαλώ δοκιμάστε ξανά";
$string['jumpto'] = "Μετάβαση σε...";
$string['langltr'] = "Η γλώσσα γράφεται από αριστερά προς τα δεξιά";
$string['langrtl'] = "Η γλώσσα γράφεται από δεξιά προς τα αριστερά";
$string['language'] = "Γλώσσα";
$string['languagegood'] = "Αυτό το πακέτο γλώσσας είναι ενημερωμένο! :-)";
$string['lastaccess'] = "Τελευταία πρόσβαση";
$string['lastedited'] = "Τελευταία επεξεργασία";
$string['lastmodified'] = "Τελευταία μετατροπή";
$string['lastname'] = "Επώνυμο";
$string['latestlanguagepack'] = "Έλεγχος για το πιο ενημερωμένο πακέτο γλωσσών στο moodle.org";
$string['latestnews'] = "Τελευταία νέα";
$string['leavetokeep'] = "Αφήστε κενό για να διατηρήσετε τον υπάρχον κωδικό πρόσβασης";
$string['license'] = "Άδεια GPL";
$string['list'] = "Κατάλογος";
$string['listfiles'] = "Κατάλογος αρχείων στο \$a";
$string['listofallpeople'] = "Κατάλογος όλων των ατόμων";
$string['livelogs'] = "Ζωντανά αρχεία καταγραφής της τελευταίας ώρας";
$string['locale'] = "el";
$string['location'] = "Τόπος";
$string['loggedinas'] = "Έχετε εισέλθει ως \$a ";
$string['loggedinnot'] = "Δεν έχετε εισέλθει.";
$string['login'] = "Είσοδος";
$string['loginas'] = "Είσοδος ως";
$string['loginguest'] = "Είσοδος ως επισκέπτης";
$string['loginsite'] = "Είσοδος στο δικτυακό τόπο";
$string['loginsteps'] = "Γειά σας! Για πλήρη πρόσβαση στα μαθήματα θα χρειαστείτε ένα 
   λεπτό για να δημιουργήσετε νέο λογαριασμό για τον εαυτό σας σε αυτό το
   δικτυακό τόπο.
   Κάθε ξεχωριστό μάθημα μπορεί επιπλέον να έχει ένα &quot;κλειδί εγγραφής&quot;
   μιας χρήσης, το οποίο δε χρειάζεστε ακόμη. Αυτά είναι τα βήματα:
   <OL size=2>
   <LI>Συμπληρώστε τη φόρμα <A HREF=\$a>Νέου λογαριασμού</A> με τα δεδομένα σας.
   <LI>Ένα μήνυμα ηλεκτρονικού ταχυδρομείου θα αποσταλεί στη διεύθυνσή σας.
   <LI>Διαβάστε το μήνυμα και επιλέξτε τη διεύθυνση που περιέχει.
   <LI>Ο λογαριασμός σας θα επιβεβαιωθεί και θα συνδεθείτε.
   <LI>Τώρα, επιλέξτε το μάθημα στο οποίο θέλετε να συμμετέχετε.
   <LI>Αν σας ζητηθεί ένα &quot;κλειδί εγγραφής&quot; - χρησιμοποιήστε αυτό που 
   σας έδωσε ο εκπαιδευτής σας. Έτσι θα  &quot;εγγραφείτε&quot; στο μάθημα.
   <LI>Τώρα μπορείτε να έχετε πρόσβαση στο μάθημα. Από εδώ και στο εξής θα 
   χρειάζετε να δώσετε μόνο το ονόμα χρήστη και τον κωδικό πρόσβασης (όπως είναι
   σε αυτή τη σελίδα) για να εισέλθετε και να προσπελάσετε τα μαθήματα στα οποία
   έχετε εγγραφεί.
   </OL>";
$string['loginstepsnone'] = "Γειά σας!<P>Για πλήρη πρόσβαση στα μαθήματα θα πρέπει να δημιουργήσετε έναν λογαριασμό.<P>Χρειάζεται να σκεφτείτε ένα όνομα χρήστη και έναν
κωδικό πρόσβασης και να τα χρησιμοποιήσετε με τη μορφή που υπάρχουν σε αυτή τη σελίδα!<P>Αν το όνομα χρήστη που σκεφτήκατε έχει ήδη επιλεγεί από κάποιον άλλο,
τότε θα πρέπει να δοκιμάσετε ξανά με ένα νέο όνομα χρήστη.";
$string['loginto'] = "Είσοδος στο \$a";
$string['loginusing'] = "Εισέλθετε εδώ χρησιμοποιώντας όνομα χρήστη και κωδικό πρόσβασης";
$string['logout'] = "Έξοδος";
$string['logs'] = "Αρχεία καταγραφής";
$string['mainmenu'] = "Κύριο μενού";
$string['makeafolder'] = "Δημιουργία φακέλου";
$string['makeeditable'] = "Αν καταστήσετε το '\$a' προσβάσιμο για εγγραφή από τη διαδικασία του εξυπηρετητή (πχ. apache) τότε θα μπορείτε να επεξεργαστείτε αυτό το αρχείο απευθείας από αυτή τη σελίδα.";
$string['managedatabase'] = "Διαχείριση βάσης δεδομένων";
$string['managemodules'] = "Διαχείριση των modules";
$string['markedthistopic'] = "Αυτό το θέμα προβάλλεται ως τρέχον θέμα";
$string['markthistopic'] = "Σημείωση αυτού του θέματος σαν τρέχον θέμα";
$string['maximumchars'] = "Το πολύ \$a χαρακτήρες";
$string['maximumgrade'] = "Μέγιστος βαθμός";
$string['maximumshort'] = "Μέγιστο";
$string['maxsize'] = "Μέγιστο μέγεθος: \$a";
$string['min'] = "λεπτό";
$string['mins'] = "λεπτά";
$string['miscellaneous'] = "Ποικίλος";
$string['missingcategory'] = "Πρέπει να επιλέξετε κατηγορία";
$string['missingcity'] = "Λείπει η πόλη/χωριό";
$string['missingcountry'] = "Λείπει η χώρα";
$string['missingdescription'] = "Λείπει η περιγραφή";
$string['missingemail'] = "Λείπει η διεύθυνση ηλεκτρονικού ταχυδρομείου";
$string['missingfirstname'] = "Λείπει το όνομα";
$string['missingfullname'] = "Λείπει το πλήρες όνομα";
$string['missinglastname'] = "Λείπει το επώνυμο";
$string['missingnewpassword'] = "Λείπει ο νέος κωδικός πρόσβασης";
$string['missingpassword'] = "Λείπει ο κωδικός πρόσβασης";
$string['missingshortname'] = "Λείπει το σύντομο όνομα";
$string['missingshortsitename'] = "Λείπει το σύντομο όνομα του δικτυακού τόπου";
$string['missingsitedescription'] = "Λείπει η περιγραφή του δικτυακού τόπου";
$string['missingsitename'] = "Λείπει το όνομα του δικτυακού τόπου";
$string['missingstrings'] = "Έλεγχος για συμβολοσειρές που λείπουν";
$string['missingstudent'] = "Πρέπει να επιλεγεί κάτι";
$string['missingsummary'] = "Λείπει η σύνοψη";
$string['missingteacher'] = "Πρέπει να επιλεγεί κάτι";
$string['missingurl'] = "Λείπει το URL";
$string['missingusername'] = "Λείπει το όνομα χρήστη";
$string['modified'] = "Αλλαγμένο";
$string['moduledeleteconfirm'] = "Θα διαγράψετε τελείως την ενότητα '\$a'.  Αυτό θα διαγράψει από τη βάση δεδομένων οτιδήποτε σχετίζεται με αυτή την ενότητα.  Είστε ΒΕΒΑΙΟΙ πως θέλετε να συνεχίσετε;";
$string['moduledeletefiles'] = "Όλα τα δεδομένα που σχετίζονται με την ενότητα '\$a->module' διαγράφηκαν από τη βάση δεδομένων.  Για να ολοκληρωθεί η διαγραφή (και για να μην επανεγκατασταθεί η ενότητα αυτόματα), θα πρέπει τώρα να σβήσετε αυτό τον κατάλογο από τον εξυπηρετητή σας: \$a->directory";
$string['modulesetup'] = "Ρύθμιση των πινάκων της ενότητας";
$string['modulesuccess'] = "\$a έχουν ρυθμιστεί σωστά";
$string['moodleversion'] = "Έκδοση του Moodle";
$string['mostrecently'] = "πιο πρόσφατα";
$string['move'] = "Μετακίνηση";
$string['movecategoryto'] = "Μετακίνηση κατηγορίας σε:";
$string['movecourseto'] = "Μετακίνηση μαθήματος σε:";
$string['movedown'] = "Μετακίνηση κάτω";
$string['movefilestohere'] = "Μετακίνηση αρχείων εδώ";
$string['movefull'] = "Μετακίνηση \$a σ' αυτή την τοποθεσία";
$string['movehere'] = "Μετακίνηση εδώ";
$string['moveselectedcoursesto'] = "Μετακίνηση επιλεγμένων μαθημάτων σε...";
$string['movetoanotherfolder'] = "Μετακίνηση σε άλλο φάκελο";
$string['moveup'] = "Μετακίνηση πάνω";
$string['mustconfirm'] = "Πρέπει να επιβεβαιώσετε τη σύνδεσή σας";
$string['mycourses'] = "Τα μαθήματά μου";
$string['name'] = "Όνομα";
$string['namesocial'] = "τομέας";
$string['nametopics'] = "θέμα";
$string['nameweeks'] = "εβδομάδα";
$string['needed'] = "Απαραίτητο";
$string['never'] = "Ποτέ";
$string['neverdeletelogs'] = "Ποτέ να μη διαγράφονται αρχεία καταγραφής";
$string['new'] = "Νέο";
$string['newaccount'] = "Νέος λογαριασμός";
$string['newcourse'] = "Νέο μάθημα";
$string['newpassword'] = "Νέος κωδικός πρόσβασης";
$string['newpasswordtext'] = "Γειά σας,  \$a->firstname,

Ο κωδικός πρόσβασης του λογαριασμού σας στο '\$a->sitename' έχει οριστεί ξανά 
και έχει εκδοθεί προσωρινός κωδικός πρόσβασης.

Οι πληροφορίες σύνδεσής σας τώρα είναι
   Όνομα χρήστη: \$a->username
   Κωδικός πρόσβασης: \$a->newpassword

Παρακαλώ επισκεφθείτε αυτή τη σελίδα και αλλάξτε τον κωδικό πρόσβασής σας:
   \$a->link

Στα περισσότερα προγράμματα ηλεκτρονικού ταχυδρομείου αυτό θα πρέπει να εμφανίζεται σαν μπλε σύνδεσμος στο οποίο μπορείτε να πατήσετε με το ποντίκι. Αν αυτό δε λειτουργεί τότε αντιγράψτε και επικολλήστε αυτή τη διεύθυνση στη γραμμή διευθύνσεων στο πάνω μέρος του φυλλομετρητή.

Γειά σας από τον διαχειριστή του '\$a->sitename',
\$a->admin";
$string['newpicture'] = "Νέα εικόνα";
$string['newsitem'] = "αντικείμενο νέων";
$string['newsitems'] = "αντικείμενα νέων";
$string['newsitemsnumber'] = "Αντικείμενα νέων προς προβολή";
$string['newuser'] = "Νέος χρήστης";
$string['newusers'] = "Νέοι χρήστες";
$string['next'] = "Επόμενος";
$string['no'] = "Όχι";
$string['nocoursesfound'] = "Δεν βρέθηκαν μαθήματα με τις λέξεις '\$a'";
$string['nocoursesyet'] = "Δεν υπάρχουν μαθήματα σε αυτή την κατηγορία";
$string['noexistingadmins'] = "Δεν υπάρχουν διαχειριστές, αυτό είναι ένα σοβαρό σφάλμα και δε θα έπρεπε να έχει συμβεί ποτε.";
$string['noexistingcreators'] = "Δεν υπάρχουν δημιουγοί";
$string['noexistingstudents'] = "Δεν υπάρχουν μαθητές";
$string['noexistingteachers'] = "Δεν υπάρχουν εκπαιδευτές";
$string['nofilesselected'] = "Δεν έχουν επιλεγεί αρχεία για επαναφορά";
$string['nofilesyet'] = "Δεν έχουν φορτωθεί αρχεία στο μάθημά σας ακόμα";
$string['nograde'] = "Δεν υπάρχει βαθμός";
$string['noimagesyet'] = "Δεν έχουν φορτωθεί εικόνες στο μάθημά σας ακόμα";
$string['nomorecourses'] = "Δεν βρίσκονται μαθήματα που να ταιριάζουν";
$string['none'] = "Κανένα";
$string['nopotentialadmins'] = "Κανένας πιθανός διαχειριστής";
$string['nopotentialcreators'] = "Κανένας πιθανός δημιουργός";
$string['nopotentialstudents'] = "Κανένας πιθανός μαθητής";
$string['nopotentialteachers'] = "Κανένας πιθανός εκπαιδευτής";
$string['normal'] = "Κανονικά";
$string['nostudentsyet'] = "Δεν έχουν εγγραφεί μαθητές σε αυτό το μάθημα ακόμη";
$string['nosuchemail'] = "Δεν υπάρχει τέτοια διεύθυνση ηλεκτρονικού ταχυδρομείου";
$string['notavailable'] = "Δεν είναι διαθέσιμο";
$string['noteachersyet'] = "Δεν υπάρχουν εκπαιδευτές σε αυτό το μάθημα ακόμη";
$string['notenrolled'] = "\$a - δεν είναι εγγεγραμμένος σε αυτό το μάθημα.";
$string['noteuserschangednonetocourse'] = "Σημείωση: οι χρήστες του μαθήματος πρέπει να αποκατασταθούν όταν αποκατασταθούν και τα δεδομένα του χρήστη. Αυτή η ρύθμιση έχει αλλάξει για σένα.";
$string['nothingnew'] = "Τίποτε νέο από την τελευταία σύνδεσή σας";
$string['notincluded'] = "Δεν έχει συμπεριληφθεί";
$string['nousersmatching'] = "Δε βρέθηκε χρήστης που να ταιριάζει με '\$a'";
$string['nousersyet'] = "Δεν υπάρχουν χρήστες ακόμη";
$string['now'] = "τώρα";
$string['numberweeks'] = "Αριθμός εβδομάδων/θεμάτων";
$string['numdays'] = "\$a ημέρες";
$string['numhours'] = "\$a ώρες";
$string['numminutes'] = "\$a λεπτά";
$string['numviews'] = "\$a όψεις";
$string['numweeks'] = "\$a εβδομάδες";
$string['numwords'] = "\$a λέξεις";
$string['numyears'] = "\$a έτη";
$string['ok'] = "OK";
$string['opentoguests'] = "Πρόσβαση επισκέπτη";
$string['optional'] = "προαιρετικό";
$string['order'] = "Ταξινόμηση";
$string['other'] = "Άλλο";
$string['outline'] = "Περιγραφή";
$string['page'] = "Σελίδα";
$string['participants'] = "Συμμετέχοντες";
$string['password'] = "Κωδικός πρόσβασης";
$string['passwordchanged'] = "Ο κωδικός πρόσβασης έχει αλλάξει";
$string['passwordconfirmchange'] = "Επιβεβαίωση αλλαγής κωδικού πρόσβασης";
$string['passwordrecovery'] = "Ναι, βοήθησέ με να εισέλθω";
$string['passwordsdiffer'] = "Οι κωδικοί πρόσβασης είναι διαφορετικοί";
$string['passwordsent'] = "Ο κωδικός πρόσβασης έχει αποσταλεί";
$string['passwordsenttext'] = "   <P>Ένα μήνυμα ηλεκτρονικού ταχυδρομείου έχει 
   σταλεί στη διεύθυνση \$a->email.
   <P><B>Παρακαλώ ελέγξτε το ηλεκτρονικό σας ταχυδρομείο για να μάθετε τον κωδικό πρόσβασης</B>
   <P>Ο νέος κωδικός πρόσβασης έχει δημιουργηθεί αυτόματα. Ίσως να θέλετε να το 
   <A HREF=\$a->link>αλλάξετε σε κάτι πιο ευκολομνημόνευτο</A>.";
$string['people'] = "Άτομα";
$string['personalprofile'] = "Προσωπικό προφίλ";
$string['phone'] = "Τηλέφωνο";
$string['phpinfo'] = "PHP info";
$string['popupwindow'] = "Άνοιγμα του αρχείου σε νέο παράθυρο";
$string['potentialadmins'] = "Πιθανοί διαχειριστές";
$string['potentialcreators'] = "Πιθανοί δημιουργοί μαθημάτων";
$string['potentialstudents'] = "Πιθανοί μαθητές";
$string['potentialteachers'] = "Πιθανοί εκπαιδευτές";
$string['preferredlanguage'] = "Προτεινόμενη γλώσσα";
$string['preview'] = "Προεπισκόπιση";
$string['previeworchoose'] = "Προεπισκόπηση ή επιλογή θέματος";
$string['publicdirectory'] = "Δημόσιος κατάλογος";
$string['publicdirectory0'] = "Παρακαλώ μη δημοσιεύσετε αυτό το δικτυακό τόπο";
$string['publicdirectory1'] = "Δημοσίευση του ονόματος του δικτυακού τόπου μόνο";
$string['publicdirectory2'] = "Δημοσίευση του ονόματος του δικτυακού τόπου με έναν σύνδεσμο";
$string['publicsitefileswarning'] = "Σημείωση: τα αρχεία που τοποθετούνται εδώ μπορούν να προσπελαστούν από οποιονδήποτε";
$string['question'] = "Ερώτηση";
$string['readinginfofrombackup'] = "Ανάγνωση πληροφοριών από το αντίγραφο ασφαλείας";
$string['readme'] = "ΔΙΑΒΑΣΕ ΜΕ";
$string['recentactivity'] = "Πρόσφατη δραστηριότητα";
$string['registration'] = "Καταχώρηση του Moodle";
$string['registrationemail'] = "Ειδοποιήσεις μέσω ηλεκτρονικού ταχυδρομείου";
$string['registrationinfo'] = "<p>Αυτή η σελίδα σας επιτρέπει να καταχωρήσετε το Moodle σας στο moodle.org. Η καταχώρηση είναι δωρεάν.
Το κύριο πλεονέκτημα είναι ότι θα προστεθείτε σε μια mailing list χαμηλής κίνησης
για σημαντικές ειδοποιήσεις όπως θέματα ασφαλείας και νέες εκδόσεις του Moodle.
<p>Εξ ορισμού, οι πληροφορίες σας θα είναι εμπιστευτικές και δε θα πωληθούν ή θα προωθηθούν σε κανέναν άλλο. Ο μόνος λόγος για τη συλλογή αυτής της πληροφορίας είναι για λόγους υποστήριξης και για να δημιουργηθεί μια στατιστική εικόνα της κοινότητας του Moodle.
<p>Αν θέλετε, μπορείτε να επιλέξετε το όνομα του δικτυακού σας τόπου, της χώρας και το URL να προστεθούν στο δημόσιο κατάλογο δικτυακών τόπως Moodle.
<p>Όλες οι νέες καταχωρήσεις ελέγχονται πριν προστεθούν στη λίστα, αλλά μπορείτε να ενημερώνετε την καταχώρηση (και στο δημόσιο κατάλογο) οποιαδήποτε στιγμή απλά συμπληρώνοντας αυτή τη φόρμα.";
$string['registrationno'] = "Όχι, δε θέλω να λαμβάνω μηνύματα ηλεκτρονικού ταχυδρομείου";
$string['registrationsend'] = "Αποστολή πληροφοριών εγγραφής στο moodle.org";
$string['registrationyes'] = "Ναι, παρακαλώ ειδοποίησέ με σχετικά με σημαντικά θέματα";
$string['removeadmin'] = "Αφαίρεση διαχειριστή";
$string['removecreator'] = "Αφαίρεση δημιουργού μαθημάτων";
$string['removestudent'] = "Αφαίρεση μαθητή";
$string['removeteacher'] = "Αφαίρεση εκπαιδευτή";
$string['rename'] = "Μετονομασία";
$string['renamefileto'] = "Μετονομασία <b>\$a</b> σε";
$string['required'] = "Απαιτείται";
$string['requireskey'] = "Αυτό το μάθημα απαιτεί κλειδί εγγραφής";
$string['resortcoursesbyname'] = "Επαναταξινόμηση μαθημάτων κατά όνομα";
$string['resources'] = "Πόροι";
$string['restore'] = "Επαναφορά";
$string['restorecancelled'] = "Η επαναφορά ακυρώθηκε";
$string['restorecoursenow'] = "Επαναφορά του μαθήματος τώρα!";
$string['restorefinished'] = "Η επαναφορά ολοκληρώθηκε επιτυχώς";
$string['restoreto'] = "Επαναφορά σε";
$string['returningtosite'] = "Επιστρέφετε σε αυτό το δικτυακό τόπο;";
$string['revert'] = "Αναίρεση";
$string['role'] = "Ρόλος";
$string['savechanges'] = "Αποθήκευση αλλαγών";
$string['scale'] = "Κλίμακα";
$string['scales'] = "Κλίμακες";
$string['scalescustom'] = "Κλίμακες συνήθειας";
$string['scalescustomcreate'] = "Προσθήκη μιας κλίμακας";
$string['scalescustomno'] = "Δεν έχουν δημιουργηθεί κλίμακες συνήθειας ακόμα";
$string['scalesstandard'] = "Τυποποιημένες κλίμακες";
$string['search'] = "Αναζήτηση";
$string['searchagain'] = "Αναζήτηση ξανά";
$string['searchcourses'] = "Αναζήτηση μαθημάτων";
$string['searchhelp'] = "Μπορείς να αναζητήσεις πολλές λέξεις με μια φορά.<p>word: εύρεση ταιριάσματος αυτής της λέξης μέσα στο κείμενο. <br>+word: μόνο ακριβείς λέξεις θα βρεθούν. <br>-word: μην συμπεριλάβετε τα αποτελέσματα που περιέχουν αυτή η λέξη.";
$string['searchresults'] = "Αναζήτηση αποτελεσμάτων";
$string['sec'] = "δευτερόλεπτο";
$string['secs'] = "δευτερόλεπτα";
$string['section'] = "Τομέας";
$string['sections'] = "Τομείς";
$string['select'] = "Επιλογή";
$string['selectacountry'] = "Επιλέξτε μια χώρα";
$string['selectednowmove'] = "\$a αρχεία επιλέχθηκαν για μετακίνηση. Τώρα πήγαινε στον προορισμό και πάτα 'Μετακίνησε τα αρχεία εδώ'";
$string['senddetails'] = "Αποστολή των στοιχείων μου μέσω ηλεκτρονικού ταχυδρομείου";
$string['separateandconnected'] = "Ξεχωριστοί και Συγγενείς τρόποι γνώσης";
$string['serverlocaltime'] = "Τοπική ώρα του εξυπηρετητή";
$string['settings'] = "Ρυθμίσεις";
$string['shortname'] = "Σύντομο όνομα";
$string['shortnametaken'] = "Το σύντομο όνομα χρησιμοποιείται ήδη για άλλο μάθημα (\$a)";
$string['shortsitename'] = "Σύντομο όνομα του δικτυακού τόπου (πχ. μοναδική λέξη)";
$string['show'] = "Προβολή";
$string['showall'] = "Προβολή όλων \$a";
$string['showallcourses'] = "Προβολή όλων των μαθημάτων";
$string['showalltopics'] = "Προβολή όλων των θεμάτων";
$string['showallusers'] = "Προβολή όλων των χρηστών";
$string['showallweeks'] = "Προβολή όλων των εβδομάδων";
$string['showgrades'] = "Προβολή βαθμών";
$string['showlistofcourses'] = "Προβολή καταλόγου μαθημάτων";
$string['showonlytopic'] = "Προβολή μόνο του θέματος \$a";
$string['showonlyweek'] = "Προβολή μόνο της εβδομάδας \$a";
$string['showrecent'] = "Προβολή πρόσφατης δραστηριότητας";
$string['showtheselogs'] = "Προβολή αρχείων καταγραφής";
$string['site'] = "Δικτυακός τόπος";
$string['sitefiles'] = "Αρχεία δικτυακού τόπου";
$string['sitelogs'] = "Αρχεία καταγραφής του δικτυακού τόπου";
$string['sitenews'] = "Νέα του δικτυακού τόπου";
$string['sites'] = "Δικτυακοί τόποι";
$string['sitesettings'] = "Ρυθμίσεις δικτυακού τόπου";
$string['size'] = "Μέγεθος";
$string['socialheadline'] = "Κοινωνικό φόρουμ - τελευταία θέματα";
$string['someallowguest'] = "Μερικά μαθήματα μπορεί να επιτρέπουν πρόσβαση επισκεπτών";
$string['someerrorswerefound'] = "Κάποια πληροφορία έλειπε ή ήταν εσφαλμένη. Κοιτάξτε κάτω για λεπτομέρειες.";
$string['startdate'] = "Ημερομηνία έναρξης μαθήματος";
$string['startsignup'] = "Ξεκινήστε τώρα δημιουργώντας νέο λογαριασμό!";
$string['state'] = "Περιοχή";
$string['status'] = "Κατάσταση";
$string['strftimedate'] = "%%d %%B %%Y";
$string['strftimedateshort'] = "%%d %%B";
$string['strftimedatetime'] = "%%d %%B %%Y, %%I:%%M %%p";
$string['strftimedaydate'] = "%%A, %%d %%B %%Y";
$string['strftimedaydatetime'] = "%%A, %%d %%B %%Y, %%I:%%M %%p";
$string['strftimerecent'] = "%%d %%b, %%H:%%M";
$string['strftimerecentfull'] = "%%a, %%d %%b %%Y, %%I:%%M %%p";
$string['strftimetime'] = "%%I:%%M %%p";
$string['stringsnotset'] = "Τα ακόλουθα αλφαριθμητικά δεν είναι ορισμένα στο \$a";
$string['studentnotallowed'] = "Δυστυχώς δεν μπορείτε να εισέλθετε σε αυτό το μάθημα ως '\$a'";
$string['students'] = "Μαθητές";
$string['subcategories'] = "Υποκατηγορίες";
$string['success'] = "Επιτυχία";
$string['summary'] = "Σύνοψη";
$string['summaryof'] = "\$a - σύνοψη";
$string['supplyinfo'] = "Παρακαλώ δώστε κάποιες πληροφορίες σχετικές με εσάς";
$string['teacheronly'] = "για τον/την \$a μόνο";
$string['teacherroles'] = "\$a ρόλοι";
$string['teachers'] = "Καθηγητές";
$string['textediting'] = "Στην επεξεργασία κειμένου";
$string['texteditor'] = "Χρήση τυποποιημένων φορμών web";
$string['textformat'] = "Μορφή απλού κειμένου";
$string['thanks'] = "Ευχαριστώ";
$string['theme'] = "Θέμα";
$string['themes'] = "Θέματα";
$string['themesaved'] = "Το νέο θέμα αποθηκεύτηκε";
$string['thischarset'] = "windows-1253";
$string['thislanguage'] = "&#917;&#955;&#955;&#951;&#957;&#953;&#954;&#940;";
$string['time'] = "Ώρα";
$string['timezone'] = "Ζώνη ώρας";
$string['to'] = "Έως";
$string['today'] = "Σήμερα";
$string['todaylogs'] = "Σημερινά αρχεία καταγραφής";
$string['toomanytoshow'] = "Οι χρήστες είναι πάρα πολλοί για να προβληθούν";
$string['top'] = "Μέγιστο";
$string['topic'] = "Θέμα";
$string['topichide'] = "Απέκρυψε αυτό το θέμα από τον/την \$a";
$string['topicoutline'] = "Περιγραφή θέματος";
$string['topicshow'] = "Δείξε αυτό το θέμα στον/στην \$a";
$string['total'] = "Συνολικά";
$string['turneditingoff'] = "Τέλος επεξεργασίας";
$string['turneditingon'] = "Επεξεργασία";
$string['undecided'] = "Δεν έχει αποφασιστεί";
$string['unenrol'] = "Ακύρωση εγγραφής";
$string['unenrolme'] = "\$a - ακύρωση της εγγραφής μου";
$string['unenrolsure'] = "Είστε σίγουροι για την ακύρωση της εγγραφής της/του \$a από αυτό το μάθημα;";
$string['unknowncategory'] = "Άγνωστη κατηγορία";
$string['unpacking'] = "Αποσυμπίεση του \$a";
$string['unsafepassword'] = "Ο κωδικός πρόσβασης δεν είναι ασφαλής - δοκιμάστε κάτι άλλο";
$string['unusedaccounts'] = "Για λογαριασμούς που δεν έχουν χρησιμοποιηθεί για περισσότερο από \$a ημέρες ακυρώνεται αυτόματα η εγγραφή";
$string['unzip'] = "Αποσυμπίεση";
$string['unzippingbackup'] = "Αποσυμπίεση αντιγράφου ασφαλείας";
$string['update'] = "Ενημέρωση";
$string['updated'] = "\$a - ενημερώθηκε";
$string['updatemyprofile'] = "Ενημέρωση προφίλ";
$string['updatesevery'] = "Ενημερώνει κάθε \$a δευτερόλεπτα";
$string['updatethis'] = "Ενημέρωση αυτού: \$a";
$string['updatethiscourse'] = "Ενημέρωση αυτού του μαθήματος";
$string['updatinga'] = "Ενημέρωση ενός \$a";
$string['updatingain'] = "Ενημέρωση ενός \$a->what σε \$a->in";
$string['upload'] = "Φόρτωση";
$string['uploadafile'] = "Φόρτωση ενός αρχείου";
$string['uploadedfileto'] = "Φορτώθκε το \$a->file στο \$a->directory";
$string['uploadnofilefound'] = "Κανένα αρχείο δε βρέθηκε - είστε σίγουροι πως επιλέξατε κάποιο για φόρτωση;";
$string['uploadproblem'] = "Ένα άγνωστο πρόβλημα παρουσιάστηκε κατά τη φόρτωση του αρχείου '\$a' (μήπως ήταν πολύ μεγάλο;)";
$string['uploadthisfile'] = "Φόρτωση αυτού του αρχείου";
$string['user'] = "Χρήστης";
$string['userdeleted'] = "Αυτός ο λογαριασμός χρήστη έχει διαγραφεί";
$string['userdescription'] = "Περιγραφή";
$string['userfiles'] = "Αρχεία χρηστών";
$string['username'] = "Όνομα χρήστη";
$string['usernameexists'] = "Αυτό το όνομα χρήστη υπάρχει ήδη, επιλέξτε άλλο";
$string['userprofilefor'] = "\$a - προφίλ χρήστη";
$string['users'] = "Χρήστες";
$string['userzones'] = "Ζώνες χρηστών";
$string['usingexistingcourse'] = "Χρήση υπάρχοντος μαθήματος";
$string['view'] = "Προβολή";
$string['webpage'] = "Ιστοσελίδα";
$string['week'] = "Εβδομάδα";
$string['weekhide'] = "Απέκρυψε αυτή την εβδομάδα από τον/την \$a";
$string['weeklyoutline'] = "Εβδομαδιαία περιγραφή";
$string['weekshow'] = "Δείξε αυτή την εβδομάδα στον/στην \$a";
$string['welcometocourse'] = "Καλωσήλθατε στο \$a";
$string['welcometocoursetext'] = "Καλωσήλθατε στο \$a->coursename!

Ένα από τα πρώτα πράγματα που θα πρέπει να κάνετε είναι να επεξεργαστείτε τη σελίδα
με το προφίλ σας μέσα σε αυτό το μάθημα ώστε να μάθουμε περισσότερα για εσάς:

  \$a->profileurl";
$string['whattocallzip'] = "Πως θέλετε να λέγεται το αρχείο zip σας;";
$string['withchosenfiles'] = "Με επιλεγμένα αρχεία";
$string['withoutuserdata'] = "χωρίς τα δεδομένα του χρήστη";
$string['withuserdata'] = "με τα δεδομένα του χρήστη";
$string['wordforstudent'] = "Η λέξη σας για Μαθητής";
$string['wordforstudenteg'] = "πχ. Μαθητής, Συμμετέχων κτλ.";
$string['wordforstudents'] = "Η λέξη σας για Μαθητές";
$string['wordforstudentseg'] = "πχ. Μαθητές, Συμμετέχοντες κτλ.";
$string['wordforteacher'] = "Η λέξη σας για Εκπαιδευτής";
$string['wordforteachereg'] = "πχ. Εκπαιδευτής, Καθηγητής, Δάσκαλος κτλ.";
$string['wordforteachers'] = "Η λέξη σας για Εκπαιδευτές";
$string['wordforteacherseg'] = "πχ. Εκπαιδευτές, Καθηγητές, Δάσκαλοι κτλ.";
$string['writingcategoriesandquestions'] = "Εγγραφή κατηγοριών και ερωτήσεων";
$string['writingcoursedata'] = "Εγγραφή δεδομένων μαθήματος";
$string['writinggeneralinfo'] = "Εγγραφή γενικών πληροφοριών";
$string['writingheader'] = "Εγγραφή επικεφαλίδας";
$string['writingloginfo'] = "Εγγραφή πληροφοριών εισόδων";
$string['writingmoduleinfo'] = "Εγγραφή πληροφοριών ενοτήτων";
$string['writingscalesinfo'] = "Εγγραφή πληροφοριών κλίμακας";
$string['writinguserinfo'] = "Εγγραφές πληροφοριών χρηστών";
$string['wrongpassword'] = "Λάθος κωδικός πρόσβασης για αυτό το όνομα χρήστη";
$string['yes'] = "Ναι";
$string['youareabouttocreatezip'] = "Θα δημιουργήσεις ένα αρχείο zip που θα περιέχει";
$string['youaregoingtorestorefrom'] = "Θα επαναφέρετε από:";
$string['yourlastlogin'] = "Η τελευταία σας είσοδος ήταν";
$string['yourself'] = "εσείς ο ίδιος";
$string['yourteacher'] = "η/ο \$a σας";
$string['zippingbackup'] = "Συμπίεση αντιγράφου ασφαλείας";

?>
