<?PHP // $Id$ 
      // survey.php - created with Moodle 1.1 (2003082800)


$string['actual'] = "Πραγματικό";
$string['actualclass'] = "Πραγματική τάξη";
$string['actualstudent'] = "\$a πραγματικό";
$string['allquestions'] = "Όλες οι ερωτήσεις στη σειρά, όλοι οι μαθητές";
$string['allscales'] = "Όλες οι κλίμακες, όλοι οι μαθητές";
$string['alreadysubmitted'] = "Έχεις ήδη καταχωρήσει αυτή την έρευνα";
$string['analysisof'] = "Ανάλυση του \$a";
$string['answers'] = "Απαντήσεις";
$string['attls1'] = "Στο να εκτιμήσω τι λέει κάποιος, εστιάζομαι επάνω στην ποιότητα της συζήτησης και όχι στο πρόσωπο που την παρουσιάζει.";
$string['attls10'] = "Είναι σημαντικό για μένα να παραμένω όσο αντικειμενικός γίνεται όταν αναλύω κάτι.";
$string['attls10short'] = "παραμένω αντικειμενικός";
$string['attls11'] = "Προσπαθώ να σκέφτομαι με τους ανθρώπους παρά να είμαι αντίθετος με αυτούς.";
$string['attls11short'] = "σκέψου ΜΕ τους ανθρώπους";
$string['attls12'] = "Έχω συγκεκριμένα κριτήρια που χρησιμοποιώ στην εκτίμηση μιας συζήτησης.";
$string['attls12short'] = "χρήση κριτηρίων στην εκτίμηση";
$string['attls13'] = "Είναι πιο πιθανό να προσπαθήσω να κατανοήσω τη γνώμη κάποιου άλλου παρά να την αξιολογήσω.";
$string['attls13short'] = "προσπάθησε να καταλάβεις";
$string['attls14'] = "Προσπαθώ να επισημάνω αδυναμίες στη σκέψη των άλλων και να τους βοηθήσω να διευκρινήσουν την άποψή τους.";
$string['attls14short'] = "επισημάνετε τις αδυναμίες";
$string['attls15'] = "Έχω την τάση να βάζω τον εαυτό μου στη θέση των άλλων όταν συζητώ αμφιλεγόμενα θέματα, για να δω γιατί σκέφτονται κατ' αυτόν τον τρόπο.";
$string['attls15short'] = "βάζω τον εαυτό μου στη θέση τους";
$string['attls16'] = "Κάποιος θα μπορούσε να χαρακτηρίσει τον τρόπο με τον οποίο αναλύω τα πράγματα ότι 'τα περνάω από δίκη' γιατί είμαι προσεκτικός στο να εκτιμήσω όλα τα στοιχεία.";
$string['attls16short'] = "περνώ από δίκη";
$string['attls17'] = "Εκτιμώ τη χρήση της λογικής και της αιτιολόγησης των δικών μου ανησυχιών όταν επιλύω προβλήματα.";
$string['attls17short'] = "εκτιμώ περισσότερο τη λογική";
$string['attls18'] = "Μπορώ να αποκτήσω διορατικότητα σχετικά με απόψεις που διαφέρουν από τη δική μου, μέσω της ταύτισης";
$string['attls18short'] = "διορατικότητα μέσω ταύτισης";
$string['attls19'] = "Όταν συναντώ άτομα των οποίων οι απόψεις μου φαίνονται παράξενες, κάνω συνειδητή προσπάθεια να 'επεκτείνω' τον εαυτό μου στη θέση του, να δω για ποιό λόγο έχει αυτές τις απόψεις.";
$string['attls19short'] = "κάνω προσπάθεια να επεκτείνω";
$string['attls1short'] = "Ποιότητα εστίασης της συζήτησης.";
$string['attls2'] = "Μου αρέσει να κάνω το δικηγόρο του διαβόλου - υποστηρίζοντας το αντίθετο από αυτό που κάποιος λέει.";
$string['attls20'] = "Αφιερώνω χρόνο προσπαθώντας να καταλάβω τι είναι 'λάθος'. Για παράδειγμα, θα ψάξω για κάτι στη λογοτεχνική του ερμηνεία και που δεν συζητείται αρκετά.";
$string['attls20short'] = "τι είναι λάθος;";
$string['attls2short'] = "Παίζουμε το δικηγόρο του διαβόλου";
$string['attls3'] = "Μου αρέσει να κατανοώ από που 'προέρχονται' οι άλλοι άνθρωποι, ποιές εμπειρίες τους έχουν οδηγήσει στο να σκέφτονται έτσι.";
$string['attls3short'] = "Από πού προέρχονται οι άνθρωποι";
$string['attls4'] = "Το πιο σημαντικό μέρος της εκπαίδευσής μου με έχει μάθει να καταλαβαίνω τους ανθρώπους οι οποίοι είναι πολύ διαφορετικοί από εμένα.";
$string['attls4short'] = "Καταλαβαίνω τους διαφορετικούς ανθρώπους";
$string['attls5'] = "Αισθάνομαι οτι ο καλύτερος τρόπος για μένα στο να επιτύχω τη δική μου ταυτότητα, είναι να αλληλεπιδράσω με την ποικιλία των άλλων ανθρώπων.";
$string['attls5short'] = "Αλληλεπιδράστε με την ποικιλία";
$string['attls6'] = "Απολαμβάνω να ακούω τις απόψεις ανθρώπων οι οποίοι προέρχονται από διαφορετικά υπόβαθρα από το δικό μου - με βοηθάει να κατανοήσω πώς τα ίδια πράγματα μπορούν ειδοθούν με τόσο διαφορετικούς τρόπους.";
$string['attls6short'] = "Μου αρέσει να ακούω τις απόψεις";
$string['attls7'] = "Μπορώ να ενισχύσω τη δική μου γνώμη μέσω της συζήτησης με κάποιον που διαφωνεί μαζί μου.";
$string['attls7short'] = "ενίσχυση μέσω της συζήτησης";
$string['attls8'] = "Πάντα με ενδιέφερε να μαθαίνω γιατί οι άνθρωποι λένε και πιστεύουν τα πράγματα που αυτοί κάνουν.";
$string['attls8short'] = "ξέρω γιατί οι άνθρωποι κάνουν";
$string['attls9'] = "Συχνά πιάνω τον εαυτό μου να διαφωνεί με τους συντάκτες των βιβλίων που διαβάζω, προσπαθώντας με τη λογική να καταλάβω γιατί είναι λάθος.";
$string['attls9short'] = "διαφωνώ με τους συντάκτες";
$string['attlsintro'] = "Ο σκοπός αυτού του ερωτηματολογίου είναι να βοηθήσει εμάς να εκτιμήσουμε τη στάση σου απέναντι στη σκέψη και στη μάθηση.

Δεν υπάρχουν 'σωστές' ή 'λάθος' απαντήσεις; μας ενδιαφέρει μόνο η γνώμη σου. Παρακαλούμε να είστε βέβαιοι πως ο χειρισμός των απαντήσεών σας θα γίνει εμπιστευτικά και δε θα επηρεάσει την αξιολόγησή σας";
$string['attlsm1'] = "Τοποθετήσεις Απέναντι στη Σκέψη και την Εκμάθηση";
$string['attlsm2'] = "Συνδεδεμένη Μάθηση";
$string['attlsm3'] = "Ξεχωριστή Μάθηση";
$string['attlsmintro'] = "Υπό συζήτηση ...";
$string['attlsname'] = "ATTLS (έκδοση 20 αντικειμένων)";
$string['ciq1'] = "Σε ποιά χρονική στιγμή είχατε εμπλακεί περισσότερο στο ρόλο του μαθητή;";
$string['ciq2'] = "Σε ποιά χρονική στιγμή είχατε απομακρυνθεί περισσότερο από το ρόλο του μαθητή;";
$string['ciq3'] = "Ποιά ενέργεια οποιουδήποτε στις ομάδες συζητήσεων θεωρείτε πως ήταν θετική ή πως βοήθησε πολύ;";
$string['ciq4'] = "Ποιά ενέργεια οποιουδήποτε στις ομάδες συζητήσεων θεωρείτε πως προκάλεσε σύγχυση ή προβλήματα;";
$string['ciq5'] = "Ποιό γεγονός σας εξέπληξε περισσότερο;";
$string['ciqintro'] = "Ανασκοπώντας πρόσφατα γεγονότα στην τάξη, απαντήστε τις παρακάτω ερωτήσεις.";
$string['ciqname'] = "Κρίσιμα επεισόδια";
$string['clicktocontinue'] = "Κάντε κλίκ εδώ για να συνεχίσετε";
$string['clicktocontinuecheck'] = "Κάντε κλίκ εδώ για έλεγχο και συνέχεια";
$string['colles1'] = "εστιάζω τη μάθησή μου σε κεφάλαια που με ενδιαφέρουν.";
$string['colles10'] = "Ζήτησα από τους άλλους μαθητές να εξηγήσουν τις ιδέες τους.";
$string['colles10short'] = "Ζήτησα εξηγήσεις";
$string['colles11'] = "Οι άλλοι μαθητές μου ζήτησαν να εξηγήσω τις ιδέες μου.";
$string['colles11short'] = "Μου ζητήθηκε να δώσω εξηγήσεις";
$string['colles12'] = "Οι άλλοι μαθητές αποκρίνονται στις ιδέες μου.";
$string['colles12short'] = "Οι μαθητές αποκρίνονται σε εμένα";
$string['colles13'] = "Ο εκπαιδευτής προκαλεί τη σκέψη μου.";
$string['colles13short'] = "Ο εκπαιδευτής προκαλεί τη σκέψη";
$string['colles14'] = "Ο εκπαιδευτής με ενθαρρύνει να συμμετάσχω.";
$string['colles14short'] = "Ο εκπαιδευτής με ενθαρρύνει";
$string['colles15'] = "Ο εκπαιδευτής προβάλει την σωστή συζήτηση.";
$string['colles15short'] = "Ο εκπαιδευτής προβάλει τη συζήτηση";
$string['colles16'] = "Ο εκπαιδευτής προβάλει την κριτική θεώρηση του εαυτού μας.";
$string['colles16short'] = "Ο εκπαιδευτής προβάλει τη θεώρηση του εαυτού μας.";
$string['colles17'] = "Οι άλλοι μαθητές ενθαρρύνουν τη συμμετοχή μου.";
$string['colles17short'] = "Οι μαθητές με ενθαρρύνουν";
$string['colles18'] = "Οι άλλοι μαθητές επαινούν την συνεισφορά μου.";
$string['colles18short'] = "Οι μαθητές με επαινούν";
$string['colles19'] = "Οι άλλοι μαθητές εκτιμούν την συνεισφορά μου.";
$string['colles19short'] = "Οι μαθητές με εκτιμούν";
$string['colles1short'] = "εστιάζω σε ενδιαφέροντα θέματα";
$string['colles2'] = "ό,τι μαθαίνω είναι σημαντικό για την επιστημονική μου πρακτική.";
$string['colles20'] = "Οι άλλοι μαθητές κατανοούν την προσπάθειά μου για μάθηση.";
$string['colles20short'] = "Οι μαθητές με κατανοούν";
$string['colles21'] = "Βγάζω νόημα από τα μηνύματα των άλλων μαθητών.";
$string['colles21short'] = "Καταλαβαίνω τους άλλους μαθητές";
$string['colles22'] = "Οι άλλοι μαθητές καταλαβαίνουν τα μηνύματά μου.";
$string['colles22short'] = "Οι μαθητές με καταλαβαίνουν";
$string['colles23'] = "Βγάζω νόημα από τα μηνύματα του δάσκαλου.";
$string['colles23short'] = "Καταλαβαίνω το δάσκαλο";
$string['colles24'] = "Ο δάσκαλος βγάζει νόημα από τα μηνύματά μου.";
$string['colles24short'] = "Ο δάσκαλος με καταλαβαίνει";
$string['colles2short'] = "σημαντικό για την πρακτική μου";
$string['colles3'] = "Μαθαίνω πως να βελτιώσω την επιστημονική μου πρακτική.";
$string['colles3short'] = "βελτιώνω την πρακτική μου";
$string['colles4'] = "ό,τι μαθαίνω συνδέεται καλά με την επαγγελματική μου πρακτική.";
$string['colles4short'] = "συνδέεται με την πρακτική μου";
$string['colles5'] = "Σκέφτομαι κριτικά για τη μάθησή μου.";
$string['colles5short'] = "Είμαι κριτικός στη μάθησή μου";
$string['colles6'] = "Σκέφτομαι κριτικά για τις ιδέες μου.";
$string['colles6short'] = "Είμαι κριτικός στις ιδέες μου";
$string['colles7'] = "Σκέφτομαι κριτικά για τις ιδέες άλλων μαθητών.";
$string['colles7short'] = "Είμαι κριτικός στις ιδέες άλλων μαθητών";
$string['colles8'] = "Σκέφτομαι κριτικά για το υλικό μάθησης.";
$string['colles8short'] = "Είμαι κριτικός στο υλικό";
$string['colles9'] = "Εξηγώ τις ιδέες μου στους άλλους μαθητές.";
$string['colles9short'] = "Εξηγώ τις ιδέες μου";
$string['collesaintro'] = "Ο σκοπός αυτής της έρευνας είναι να μας βοηθήσει να καταλάβουμε πόσο καλά η δικτυακή παράδοση αυτής της ενότητας σας καθιστά ικανό να μάθετε.

Κάθε μια από τις παρακάτω 24 προτάσεις ρωτά για την εμπειρία σας σε αυτή την ενότητα.

Δεν υπάρχουν 'σωστές' ή 'λάθος' απαντήσεις. Ενδιαφερόμαστε μόνο για τη γνώμη σας. Παρακαλούμε να είστε βέβαιοι πως ο χειρισμός των απαντήσεών σας θα γίνει εμπιστευτικά και δε θα επηρεάσει την αξιολόγησή σας.

Οι προσεχτικά θεωρημένες απαντήσεις σας, θα μας βοηθήσουν να βελτιώσουμε τον τρόπο με τον οποίο αυτή η ενότητα θα παρουσιάζεται στο μέλλον.

Σας ευχαριστούμε πολύ.";
$string['collesaname'] = "COLLES (Πραγματικό)";
$string['collesapintro'] = "Ο σκοπός αυτού του ερωτηματολογίου είναι να βοηθήσει εμάς να καταλάβουμε πόσο καλά η δικτυακή παράδοση αυτής της ενότητας σας καθιστά ικανό να μάθετε.

Κάθε μια από τις παρακάτω 24 προτάσεις σας ζητά να συγκρίνετε την <b>προτιμώμενη</b> και την <b>πραγματική</b> εμπειρία σας σε αυτή την ενότητα.

Δεν υπάρχουν 'σωστές' ή 'λάθος' απαντήσεις. Ενδιαφερόμαστε μόνο για τη γνώμη σας. Παρακαλούμε να είστε βέβαιοι πως ο χειρισμός των απαντήσεών σας θα γίνει εμπιστευτικά και δε θα επηρεάσει την αξιολόγησή σας.

Οι προσεχτικά θεωρημένες απαντήσεις σας, θα μας βοηθήσουν να βελτιώσουμε τον τρόπο με τον οποίο αυτή η ενότητα θα παρουσιάζεται στο μέλλον.

Σας ευχαριστούμε πολύ.";
$string['collesapname'] = "COLLES (Προτιμώμενη και πραγματική)";
$string['collesm1'] = "Συνάφεια";
$string['collesm1short'] = "Συνάφεια";
$string['collesm2'] = "Στοχαστική σκέψη";
$string['collesm2short'] = "Στοχαστική σκέψη";
$string['collesm3'] = "Αλληλεπίδραση";
$string['collesm3short'] = "Αλληλεπίδραση";
$string['collesm4'] = "Υποστήριξη εκπαιδευτή";
$string['collesm4short'] = "Υποστήριξη εκπαιδευτή";
$string['collesm5'] = "Υποστήριξη συμμαθητών";
$string['collesm5short'] = "Υποστήριξη συμμαθητών";
$string['collesm6'] = "Ερμηνεία";
$string['collesm6short'] = "Ερμηνεία";
$string['collesmintro'] = "Σε αυτή την ενότητα δικτυακής εκπαίδευσης...";
$string['collespintro'] = "Ο σκοπός αυτής της έρευνας είναι να βοηθήσει εμάς να καταλάβουμε τί εκτιμάτε σε μια δικτυακή εκπαίδευση.

Κάθε μια από τις 24 παρακάτω προτάσεις σας ζητά να αναφέρετε την <b>προτιμώμενη</b> (ιδανική) εμπειρία σε αυτή την ενότητα.

Δεν υπάρχουν 'σωστές' ή 'λάθος' απαντήσεις. Ενδιαφερόμαστε μόνο για τη γνώμη σας. Παρακαλούμε να είστε βέβαιοι πως ο χειρισμός των απαντήσεών σας θα γίνει εμπιστευτικά και δε θα επηρεάσει την αξιολόγησή σας.

Οι προσεχτικά θεωρημένες απαντήσεις σας, θα μας βοηθήσουν να βελτιώσουμε τον τρόπο με τον οποίο αυτή η μονάδα θα παρουσιάζεται στο μέλλον.

Σας ευχαριστούμε πολύ.";
$string['collespname'] = "COLLES (Προτιμώμενη)";
$string['done'] = "Ολοκληρώθηκε";
$string['download'] = "Κατέβασμα";
$string['downloadexcel'] = "Κατέβασε το αρχείο σαν φύλλο Excel";
$string['downloadinfo'] = "Μπορείς να κατεβάσεις ολόκληρη τη σειρά δεδομένων για αυτή την έρευνα σε έναν τύπο κατάλληλο για ανάλυση στο Excel, SPSS ή σε κάποιο άλλο πακέτο.";
$string['downloadtext'] = "Κατέβασε τις πληροφορίες σαν αρχείο απλού κειμένου";
$string['editingasurvey'] = "Επεξεργασία μιας έρευνας";
$string['guestsnotallowed'] = "Οι επισκέπτες δεν επιτρέπεται να υποβάλουν έρευνες";
$string['helpsurveys'] = "Βοήθεια σχετικά με τους διαφορετικούς τύπους ερευνών";
$string['howlong'] = "Πόση ώρα σας πήρε για να συμπληρώσετε αυτή την έρευνα;";
$string['howlongoptions'] = "Κάτω από 1 λεπτό, 1-2 λεπτά, 2-3 λεπτά, 3-4 λεπτά, 4-5-λεπτά, 5-10 λεπτά, περισσότερο από 10 λεπτά";
$string['ifoundthat'] = "Ανακάλυψα οτι";
$string['introtext'] = "Κείμενο εισαγωγής";
$string['ipreferthat'] = "Προτιμώ ";
$string['modulename'] = "Έρευνα";
$string['modulenameplural'] = "Έρευνες";
$string['name'] = "Όνομα";
$string['newsurveyresponses'] = "Νέες απαντήσεις ερευνών";
$string['nobodyyet'] = "Κανένας δεν έχει ολοκληρώσει αυτή την έρευνα";
$string['notdone'] = "Δεν έχει γίνει ακόμα";
$string['notes'] = "Οι προσωπικές σας αναλύσεις και σημειώσεις";
$string['othercomments'] = "Έχετε να κάνετε άλλα σχόλια;";
$string['peoplecompleted'] = "\$a άνθρωποι έχουν ολοκληρώσει την έρευνα ως εδώ";
$string['preferred'] = "Προτιμώμενες";
$string['preferredclass'] = "Προτιμώμενη τάξη";
$string['preferredstudent'] = "\$a προτιμάται";
$string['question'] = "Ερώτηση";
$string['questions'] = "Ερωτήσεις";
$string['questionsnotanswered'] = "Μερικές από τις ερωτήσεις πολλαπλής επιλογής δεν έχουν απαντηθεί.";
$string['report'] = "Αναφορά έρευνας";
$string['savednotes'] = "Οι σημειώσεις σας αποθηκεύτηκαν";
$string['scaleagree5'] = "Διαφωνώ έντονα, Διαφωνώ μερικώς, Ούτε συμφωνώ ούτε διαφωνώ, Συμφωνώ μερικώς, Συμφωνώ έντονα";
$string['scales'] = "Κλίμακες";
$string['scaletimes5'] = "Σχεδόν ποτέ, Σπάνια, Μερικές φορές, Συχνά, Σχεδόν πάντα";
$string['seemoredetail'] = "Κάντε κλικ εδώ για να δείτε περισσότερες λεπτομέρειες";
$string['selectedquestions'] = "Επιλεγμένες ερωτήσεις μιας κλίμακας, όλοι οι μαθητές";
$string['summary'] = "Περίληψη";
$string['surveycompleted'] = "Έχετε ολοκληρώσει αυτή την έρευνα. Το παρακάτω γράφημα δείχνει μια περίληψη των αποτελεσμάτων σας, συγκρινόμενο με τους μέσους όρους της τάξης.";
$string['surveyname'] = "Ονομασία έρευνας";
$string['surveysaved'] = "Αποθήκευση έρευνας";
$string['surveytype'] = "Τύπος έρευνας";
$string['thanksforanswers'] = "Ευχαριστούμε που απαντήσατε σε αυτή την έρευνα, \$a";
$string['time'] = "Χρόνος";
$string['viewsurveyresponses'] = "Δες \$a απαντήσεις της έρευνας";

?>
