<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <title>Moodle Docs: C&uacute;lra</title>
  <link rel="stylesheet" href="./docstyles.css" type="TEXT/CSS" />
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
</head>
<body>

<h1>C&uacute;lra</h1>

<blockquote>
	<p>T&aacute; Moodle gn&iacute;omhach agus &aacute; athchl&oacute;
	i gc&oacute;na&iacute;. Chuir <a href="http://moodle.org/user/view.php?id=1&amp;course=1" target="_top">Martin
	Dougiamas</a> t&uacute;s leis an bhforbairt, agus is &eacute; at&aacute;
	i gceannas ar an tionscnamh i gc&oacute;na&iacute;:</p>
		<blockquote><p><i>T&aacute; m&eacute; ag obair air bealach n&oacute; bealach
		eile leis na blianta. Thosaigh s&eacute; sna 90'daigh nuair a bh&iacute;
		m&eacute; i mo Mh&aacute;istir Gr&eacute;as&aacute;in ag <a href="http://www.curtin.edu.au/" target="_top">Curtin
		University of Technology</a> agus i mo riarth&oacute;ir c&oacute;rais ar
		a n-insealbh&uacute; WebCT. Bh&iacute; bamba ag baint le WebCT agus chuir
		s&eacute; tochas orm n&aacute;r mh&oacute;r dom &eacute; a scr&iacute;obadh
		- chaithfeadh s&eacute; go mbeadh bealach n&iacute;os fearr ar f&aacute;il
		(n&iacute; hea, n&iacute; an Cl&aacute;r Dubh :-)</i></p>
		<p><i>T&aacute; aithne freisin agam ar l&iacute;on m&oacute;r daoine i
		scoileanna agus in institi&uacute;id bheaga (agus i roinnt cinn mh&oacute;ra!)
		ar mhaith leo leas n&iacute;os fearr a bhaint as an Idirl&iacute;on ach
		nach bhfuil a fhios acu c&aacute; dtos&oacute;id&iacute;s - cuireann na
		teicneola&iacute;ochta&iacute; agus na hoideola&iacute;ochta&iacute; at&aacute;
		ar f&aacute;il mearbhall orthu. Bh&iacute; m&eacute; f&eacute;in ag s&uacute;il
		i gc&oacute;na&iacute; go mbeadh rogha &eacute;igin eile ar f&aacute;il,
		saor in aisce, le go bhf&eacute;adfadh a leith&eacute;id sin de dhaoine
		a scileanna m&uacute;inteoireachta a aistri&uacute; go timpeallacht ar
		l&iacute;ne.</i></p>
		<p><i>Ag eascairt as mo chreideamh l&aacute;idir sna f&eacute;idearthachta&iacute;
		neamhr&eacute;adaithe a bhaineann le hoideachas Idirl&iacute;n-bhunaithe,
		rinne m&eacute; M&aacute;istreacht agus ansin PhD san Oideachas, ag comhcheangal
		na gairme a bh&iacute; agam san Eola&iacute;ocht R&iacute;omhaireachta le heolas nua&nbsp;
		maidir le nad&uacute;r na foghlama agus na comhoibrithe. T&aacute; tionchar
		ach go h&aacute;irithe ag eipist&eacute;imeola&iacute;ocht th&oacute;g&aacute;lachais s&oacute;isialta orm -
		cur chuige a phl&eacute;ann le foghlaim, n&iacute; amh&aacute;in mar ghn&iacute;omh s&oacute;isialta, ach a dh&iacute;r&iacute;onn aird freisin
		ar an bhfoghlaim a tharla&iacute;onn agus duine go gn&iacute;omhach ag t&oacute;g&aacute;il ruda (mar shampla, t&eacute;acs)
		a bheidh le feice&aacute;il ag n&oacute; le h&uacute;s&aacute;id ag daoine eile.</i></p>
		<p><i>T&aacute; s&eacute; r&iacute;-th&aacute;bhachtach domsa go mbeadh an bogearra seo &eacute;asca le h&uacute;s&aacute;id - ba cheart d&oacute; a bheith chomh hiomasach
		agus is f&eacute;idir.</i></p>
		<p><i>T&aacute; geallta agam leanacht le mo chuid oibre ar Moodle agus &eacute; a choinne&aacute;il Oscailte
		agus Saor in Aisce. T&aacute; creideamh domhain agam sa t&aacute;bhacht a bhaineann le hoideachas &eacute;aguimsithe
		agus le m&uacute;ineadh cumhachtaithe, agus is &eacute; Moodle an pr&iacute;omhbhealach inar f&eacute;idir liomsa mo chuid a dh&eacute;anamh ar mhaithe leis
		na spriocanna seo a chur i gcr&iacute;ch.</i></p>
		</blockquote>

	<p>Crutha&iacute;odh agus cuile&aacute;ladh l&iacute;on &aacute;irithe fr&eacute;amhsamhlacha sular chuir s&eacute; leagan
	1.0 ar f&aacute;il don domhan m&oacute;r neamh-amhrasach ar an 20&uacute; L&uacute;nasa, 2002. Bh&iacute;
	an leagan seo d&iacute;rithe ar ranganna beaga, caidreamhacha ag leibh&eacute;al na hOllscoile
	agus b'&aacute;bhar c&aacute;s-staid&eacute;ir taighde a bh&iacute; ann inar d&eacute;anadh mionscr&uacute;d&uacute; ar n&aacute;d&uacute;r
	an chomhoibrithe agus an mhachnaimh a bh&iacute; ar si&uacute;l sna gr&uacute;pa&iacute;
	beaga seo de rannph&aacute;irtithe f&aacute;sta.</p>
	<p>&Oacute; shin t&aacute; sruth rialta de leaganacha nua tagtha chun solais a bhfuil gn&eacute;ithe nua ag baint leo, maraon le hinsc&aacute;laitheacht
	at&aacute; n&iacute;os fearr agus feidhm&iacute;ocht fheabhsaithe.</p>
	<p>Agus Moodle ag leathn&uacute; amach agus an comhphobal ag f&aacute;s, t&aacute; ionchur &aacute; tharraingt &oacute;
	r&eacute;imse n&iacute;os leithne daoine i raon leathan cine&aacute;lacha m&uacute;inteoireachta.
	Mar shampla, &uacute;s&aacute;idtear Moodle anois n&iacute; hamh&aacute;in in Ollscoileanna ach i me&aacute;nscoileanna,
	i mbunscoileanna, in eagra&iacute;ochta&iacute; seachbhrab&uacute;sacha, i gcomhlachta&iacute; pr&iacute;obh&aacute;ideacha.
	T&aacute; s&eacute; &aacute; &uacute;s&aacute;id freisin ag m&uacute;inteoir&iacute; neamhsple&aacute;cha agus fi&uacute; ag tuismitheoir&iacute; ag m&uacute;ineadh sa bhaile. T&aacute; l&iacute;on m&oacute;r daoine &oacute; gach c&uacute;inne den domhan ag cur le
	Moodle ar bheala&iacute; &eacute;ags&uacute;la - le teacht ar n&iacute;os m&oacute; sonra&iacute; maidir leis seo
	f&eacute;ach an leathanach  <a href="?file=credits.html">Creidi&uacute;int&iacute;</a> .</p>
	<p>Gn&eacute; t&aacute;bhachtach de thionscnamh Moodle is ea l&aacute;ithre&aacute;n gr&eacute;as&aacute;in <a href="http://moodle.org" target="_top">moodle.org</a>
	, a shol&aacute;thra&iacute;onn l&aacute;rionad eolais, pl&eacute; agus comhoibrithe
	d'&uacute;s&aacute;ideoir&iacute; Moodle, agus ina measc si&uacute;d riarth&oacute;ir&iacute; c&oacute;rais, m&uacute;inteoir&iacute;,
	taighdeoir&iacute;, dearth&oacute;ir&iacute; oideasacha agus ar nd&oacute;igh forbr&oacute;ir&iacute;. Cos&uacute;il le Moodle f&eacute;in,
	t&aacute; an su&iacute;omh seo ag &eacute;abhl&oacute;id i gc&oacute;na&iacute; le freastal ar riachtanais an chomhphobail, agus cos&uacute;il le
	Moodle, beidh s&eacute; Saor in Aisce i gc&oacute;na&iacute;.</p>
	<p>I 2003, buan&iacute;odh an comhlacht <a href="http://moodle.com/" target="_top">moodle.com</a>
	le taca&iacute;ocht bhreise tr&aacute;cht&aacute;la a shol&aacute;thar d&oacute;ibh si&uacute;d a raibh s&eacute; uathu,
	maraon le bainist&iacute;ocht &oacute;st&aacute;la, comhairleoireacht agus seirbh&iacute;s&iacute; eile.</p>
	<p>Le teacht ar a thuilleadh eolais maidir le todhcha&iacute; Moodle, f&eacute;ach l&eacute;arsc&aacute;il <a href="?file=future.html">&aacute;r dTodhcha&iacute;</a></p>
.</blockquote>

<p align="center"><font size="1"><a href="." target="_top">Doicim&eacute;ad&uacute; Moodle</a></font></p>
<p align="center"><font size="1">Leagan: $Id$</font></p>

</body>
</html>
