<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>

<title>Doic. Moodle: Suite&aacute;il</title>

<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS" />

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<style type="text/css">
<!--
.style3 {color: #660000}
-->
</style>
</head>

<body>

<h1>
Moodle a Shuite&aacute;il</h1>

<blockquote>M&iacute;n&iacute;onn an treoir seo c&eacute;n chaoi le Moodle
a shuite&aacute;il don ch&eacute;ad uair. T&aacute; mionsonra&iacute; ann
maidir le roinnt de na c&eacute;imeanna, le go gcl&uacute;d&oacute;fa&iacute;
an r&eacute;imse &eacute;ags&uacute;lachta&iacute; idir cumra&iacute;ocht
freastalaithe gr&eacute;as&aacute;in, agus mar sin b'fh&eacute;idir go
bhfuil cuma fada casta ar an doicim&eacute;ad seo. N&aacute; b&iacute;
buartha faoi seo - de ghn&aacute;th suite&aacute;ilim-se Moodle laistigh
dech&uacute;pla n&oacute;im&eacute;ad!

<p>T&oacute;g do amagus d&eacute;an do bhealach tr&iacute;d an doicim&eacute;ad
seo go c&uacute;ramach - s&aacute;bh&aacute;ilfidh s&eacute; am ort ar
ball.</p>

<p>Rann&oacute;ga sa doicim&eacute;ad seo:</p>
<ol>
<li>
<a href="#requirements">Riachtanais</a></li>

<li>
<a href="#downloading">&Iacute;osl&oacute;d&aacute;il</a></li>

<li>
<a href="#site">Strucht&uacute;r an tSu&iacute;mh</a></li>

<li>
<a href="#data">Cruthaigh comhadlann sonra&iacute;</a></li>

<li>
<a href="#database">Cruthaigh bunachas sonra&iacute;</a></li>

<li>
<a href="#webserver">Seice&aacute;il cumra&iacute;ocht an fhreastala&iacute;
gr&eacute;as&aacute;in</a></li>

<li>
<a href="#config">Eagraigh config.php</a></li>

<li>
<a href="#admin">T&eacute;igh go dt&iacute; an leathanach riarach&aacute;in</a></li>

<li>
<a href="#cron">Cumraigh cron</a></li>

<li>
<a href="#course">Cruthaigh c&uacute;rsa nua</a></li>
</ol>
&nbsp;</blockquote>

<h3 class="sectionheading">
<a name="requirements"></a>1. Riachtanais</h3>

<blockquote>Forbra&iacute;odh Moodle go pr&iacute;omha i Linux ag &uacute;s&aacute;id
Apache, MySQL agus PHP (ar a tugtar uaireanta ard&aacute;n LAMP), ach t&aacute;st&aacute;iltear
go rialta &eacute; le PostgreSQL agus ar ch&oacute;rais oibri&uacute;ch&aacute;in
Windows XP, Mac OS X agus Netware 6.

<p>Is iad seo a leanas na riachtanais le haghaidh Moodle:</p>
<ol>
<li>
Bogearra freastala&iacute; gr&eacute;as&aacute;in. &Uacute;s&aacute;ideann
an chuid is m&oacute; de dhaoine <a href="http://www.apache.org/" target="_blank">Apache</a>,
ach ba cheart go bhfeidhmeodh Moodle go bre&aacute; faoi aon fhreastala&iacute;
gr&eacute;as&aacute;in a thaca&iacute;onn le PHP, ar n&oacute;s IIS ar
ard&aacute;in Windows.</li>

<li>
Teanga Scripte <a href="http://www.php.net/" target="_blank">PHP</a> (leagan
4.1.0 n&oacute; n&iacute;os nua), leis na socraithe seo:</li>

<li>
<ul>
<li>
<a href="http://www.boutell.com/gd/" target="_blank">Leabharlann GD</a>
LASTA, le taca&iacute;ocht do fhorm&aacute;id&iacute; JPG agus PNG</li>

<li>
Leabharlann zlib LASTA (m&aacute;s mian leat c&uacute;ltaca/athchur a &uacute;s&aacute;id
ar Windows)</li>

<li>
Taca&iacute;ocht seisi&uacute;n LASTA</li>

<li>
Uasl&oacute;d&aacute;il comhad LASTA</li>

<li>
Modh Sl&aacute;n M&Uacute;CHTA (f&eacute;ach na f&oacute;raim ar moodle.org
maidir le fadhbanna a chotha&iacute;onn Modh Sl&aacute;n)</li>
</ul>
</li>

<li>
freastala&iacute; infheidhme do bhunachair sonra&iacute;: Taca&iacute;tear
go hioml&aacute;n le <a href="http://www.mysql.com/" target="_blank">MySQL</a>
n&oacute; le <a href="http://www.postgresql.org/" target="_blank">PostgreSQL</a>
agus moltar iad lena n-&uacute;s&aacute;id le Moodle 1.1. Tac&oacute;far
go hioml&aacute;n le gach bunachar sonra&iacute; eile sa ch&eacute;ad eisi&uacute;int
eile.</li>
</ol>
Tugann formh&oacute;r &oacute;staigh gr&eacute;as&aacute;n taca&iacute;ocht
d&oacute; seo ar fad mar r&eacute;amhshocr&uacute;. M&aacute; t&aacute;
s&iacute;nti&uacute;s agatsa le ceannn den bheag&aacute;n nach nd&eacute;anann,
fiafraigh d&iacute;obh c&eacute;n f&aacute;th agus cuimhnigh ar do ghn&oacute;
a aistri&uacute; go &aacute;it &eacute;igin eile.

<p>M&aacute;s mian leat Moodle a rith ar do r&iacute;omhaire f&eacute;in
ach m&aacute; bhreathna&iacute;onn s&eacute; cine&aacute;l treascrach,
breathnaigh ar &aacute;r dtreoir: <a href="http://moodle.org/doc/?file=installamp.html">Apache,
MySQL agus PHP a shuite&aacute;il</a>. T&aacute; treoracha c&eacute;im-ar-ch&eacute;im
ann le &eacute; seo a shuite&aacute;il ar formh&oacute;r na n-ard&aacute;n
aitheanta.</p>

<p>&nbsp;</p></blockquote>

<h3 class="sectionheading">
<a name="downloading"></a>2. &Iacute;osl&oacute;d&aacute;il</h3>

<blockquote><p>T&aacute; dh&aacute; bhealach ann le Moodle a fh&aacute;il,
mar phac&aacute;iste comhbhr&uacute;ite agus tr&iacute; CVS. M&iacute;n&iacute;tear
go beacht iad seo ar an leathanach &iacute;osl&oacute;d&aacute;la: <a href="http://moodle.org/download/" target="_blank">http://moodle.org/download/</a></p>

<p>Tar &eacute;is an cartlann a &iacute;osl&oacute;d&aacute;il agus a dh&iacute;phac&aacute;il,
n&oacute; tar &eacute;is na comhaid a dh&iacute;chl&aacute;r&uacute; chuig
do r&iacute;omhaire tr&iacute; CVS, beidh comhadlann agat agus "moodle"
mar ainm air, inabhfuil l&iacute;on &aacute;irithe comhad agus fillte&aacute;n.</p>

<p>F&eacute;adfaidh t&uacute; an fillte&aacute;n ar fad a chur i do chomhadlann
doicim&eacute;ad ar do fhreastala&iacute; gr&eacute;as&aacute;in, sa chaoi
is go mbeidh an su&iacute;omh lonnaithe ag <b>http://dofhreastalaigreasain.com/moodle</b>,
n&oacute; f&eacute;adfaidh t&uacute; an t-&aacute;bhar ar fad a ch&oacute;ipe&aacute;il
d&iacute;reach isteach sa chomhadlann doicim&eacute;ad ar an bpr&iacute;omhfhreastala&iacute;,
sa chaoi is gur <b>http://dofhreastalaigreasain.com</b> a bheidh i do shu&iacute;omh.</p></blockquote>
&nbsp;
<h3 class="sectionheading">
<a name="site"></a>3. Strucht&uacute;r an tSu&iacute;mh</h3>

<blockquote>Seo achoimhre tapa den &aacute;bhar at&aacute; sa bhfillte&aacute;n
Moodle, le cuidi&uacute; leat do bhealach a aimsi&uacute;:
<blockquote>config.php - an T-AON chomhad ar g&aacute; duit eagar a chur
air le tos&uacute;
<br />version.php - sainmh&iacute;n&iacute;onn s&eacute; an leagan reatha
de ch&oacute;d Moodle
<br />index.php - leathanach tosaigh an tsu&iacute;mh
<ul>
<li>
admin/ - c&oacute;d leis an bhfreastala&iacute; ioml&aacute;n a riar</li>

<li>
auth/ - mod&uacute;il breise&aacute;in le h&uacute;s&aacute;ideoir&iacute;
a fh&iacute;ordheimhni&uacute;</li>

<li>
course/ - c&oacute;d le c&uacute;rsa&iacute; a l&eacute;iri&uacute; agus
a bhainisti&uacute;</li>

<li>
doc/ - doicim&eacute;ad&uacute; cabhrach do Moodle (msh an leathanach seo)</li>

<li>
files/ - c&oacute;d le comhaid uasl&oacute;d&aacute;ilte a l&eacute;iri&uacute;
agus a bhainisti&uacute;</li>

<li>
lang/ - t&eacute;acsanna i dteangacha &eacute;ags&uacute;la, comhadlann
amh&aacute;in an teanga</li>

<li>
lib/ - leabharlanna de ch&oacute;d l&aacute;rnach Moodle</li>

<li>
login/ - c&oacute;d le log&aacute;il isteach agus cruth&uacute; cuntais
a l&aacute;imhse&aacute;il</li>

<li>
mod/ - mod&uacute;il uile Moodle</li>

<li>
pix/ - grafaic&iacute; cine&aacute;lacha an tsu&iacute;mh</li>

<li>
theme/ - pac&aacute;ist&iacute; t&eacute;ama/craicinn le dearadh an tsu&iacute;mh
a athr&uacute;.</li>

<li>
user/ - c&oacute;d le h&uacute;s&aacute;ideoir&iacute; a l&eacute;iri&uacute;
ags a bhainisti&uacute;</li>
</ul>
&nbsp;</blockquote>
</blockquote>

<h3 class="sectionheading">
<a name="data"></a>4. Cruthaigh comhadlann sonra&iacute;</h3>

<blockquote>Beidh sp&aacute;s ag teast&aacute;il freisin &oacute; Moodle
ar do dhiosca crua le comhaid uasl&oacute;d&aacute;ilte a st&oacute;r&aacute;il,
ar n&oacute;s doicim&eacute;id ch&uacute;rsa agus picti&uacute;ir &uacute;s&aacute;ideora.

<p>Cruthaigh comhadlann chuige seo in &aacute;it &eacute;igin. Ar mhaithe
le sl&aacute;nd&aacute;il, is fearr NACH mbeadh an comhadlann seo inrochtana
&oacute;n ngr&eacute;as&aacute;n. An bealach is &eacute;asca &eacute; seo
a dh&eacute;anamh n&aacute; &eacute; a chur TAOBH AMUIGH den chomhadlann
gr&eacute;as&aacute;inm seachas sin cosain &eacute; tr&iacute; chomhad
a chruth&uacute; sa chomhadlann sonra&iacute; ar a dtugtar .htaccess, agus
an l&iacute;ne seo ann:</p>
<blockquote>
<pre>deny from all</pre>
</blockquote>
Lena dhearbh&uacute; gur f&eacute;idir le Moodle comhaid uasl&oacute;d&aacute;ilte
a sh&aacute;bh&aacute;il sa chomhadlann seo, seice&aacute;il go bhfuil
cead ag bogearra an fhreastala&iacute; gr&eacute;as&aacute;in (msh Apache)
scr&iacute;obh chuig an gcomhadlann seo. Ar mheais&iacute;n Unix, cialla&iacute;onn
s&eacute; seo gur g&aacute; &uacute;in&eacute;ara na comhadlanna a shocr&uacute;
mar rud &eacute;igin ar n&oacute;s "duinearbith" n&oacute; "apache".

<p>On many shared hosting servers, you will probably need to restrict all
file access to your "group" (to prevent other webhost customers from looking
at or changing your files), but provide full read/write access to everyone
else (which will allow the web server to access your files). Speak to your
server administrator if you are having trouble setting this up securely.</p></blockquote>
&nbsp;
<h3 class="sectionheading">
<a name="database"></a>5. Cruthaigh bunachar sonra&iacute;</h3>

<blockquote>N&iacute; m&oacute;r duit bunachar sonra&iacute; folamh a chruth&uacute;
(msh "moodle") i do ch&oacute;ras bunachair sonra&iacute; maraon le h&uacute;s&aacute;ideoir
speisialta (msh "moodleusaideoir") a bhfuil rochtain acu ar an mbunachar
sin (agus ar an mbunachar sin amh&aacute;in). D'fh&eacute;adf&aacute; an
"fr&eacute;amh" &uacute;s&aacute;ideoir a &uacute;s&aacute;id d&aacute;
mba mhian leat, ach n&iacute; moltar &eacute; seo do ch&oacute;ras t&aacute;irg&iacute;ochta:
m&aacute; &eacute;ir&iacute;onn le bradaithe an pasfhocal a aimsi&uacute;
bheadh do ch&oacute;ras bunachair sonra&iacute; ioml&aacute;n i bpriacail
, seachas d&iacute;reach bunachar sonra&iacute; amh&aacute;in.

<p>L&iacute;nte orduithe samplacha do MySQL:</p>
<pre>&nbsp;&nbsp; # mysql -u root -p
&nbsp;&nbsp; > CREATE DATABASE moodle;&nbsp;
&nbsp;&nbsp; > GRANT SELECT,INSERT,UPDATE,DELETE,CREATE,DROP,INDEX,ALTER ON moodle.*&nbsp;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; TO moodleuser@localhost IDENTIFIED BY 'yourpassword';&nbsp;
&nbsp;&nbsp; > quit&nbsp;
&nbsp;&nbsp; # mysqladmin -p reload</pre>
L&iacute;nte orduithe samplacha do PostgreSQL:
<pre>&nbsp;&nbsp; # su - postgres
&nbsp;&nbsp; > psql -c "create user moodleuser createdb;" template1
&nbsp;&nbsp; > psql -c "create database moodle;" -U moodleuser template1
&nbsp;&nbsp; > psql -c "alter user moodleuser nocreatedb;" template1</pre>
(Le MySQL molaim go hard go n-&uacute;s&aacute;idf&iacute; <a href="http://phpmyadmin.sourceforge.net/">phpMyAdmin</a>
le do bhunachair sonra&iacute; a bhainisti&uacute; - f&eacute;adfaidh t&uacute;
&eacute; seo ar fad a dh&eacute;anamh tr&iacute; chomh&eacute;adan gr&eacute;as&aacute;in).

<p>&Oacute; leagan 1.0.8 i leith, taca&iacute;onn Moodle anois le r&eacute;im&iacute;reanna
t&aacute;bla, agus mar sin is f&eacute;idir bunachar sonra&iacute; a roinnt
go sl&aacute;n le t&aacute;bla&iacute; &oacute; fheidhmchl&aacute;ir eile.</p></blockquote>
&nbsp;
<h3 class="sectionheading">
<a name="webserver" id="webserver"></a>6. Seice&aacute;il cumra&iacute;ocht
do fhreastala&iacute; gr&eacute;as&aacute;in</h3>

<blockquote>Ar dt&uacute;s cinntigh go bhfuil do fhreastala&iacute; gr&eacute;as&aacute;in
socraithe le index.php a &uacute;s&aacute;id mar leathanach r&eacute;amhshocraithe
(b'fh&eacute;idir anuas ar index.html, default.htm agus araile).

<p>In Apache, d&eacute;antar &eacute; seo tr&iacute; pharaim&eacute;adar
DirectoryIndex a &uacute;s&aacute;id i do chomhad httpd.conf. Breathna&iacute;onn
mo cheann-sa mar seo de ghn&aacute;th:</p>
<blockquote>
<pre><b>DirectoryIndex</b> index.php index.html index.htm</pre>
</blockquote>
N&iacute;l agat ach a bheith cinnte go bhfuil index.php sa liosta (agus
is fearr &eacute; a bheith i dtreo a th&uacute;s, ar mhaithe le h&eacute;ifeachtacht).

<p>Sa dara h&aacute;it, <b>m&aacute; t&aacute; Apache 2 &aacute; &uacute;s&aacute;id
agat</b>, ba cheart duit an t-athr&oacute;g <i>AcceptPathInfo</i> a lasadh,
rud a cheada&iacute;onn go gcuirf&iacute; arg&oacute;int&iacute; ar n&oacute;s
http://server/file.php/arg1/arg2 chuig scripteanna. T&aacute; s&eacute;
seo eisinti&uacute;il le nascanna comhghaolmhara a chead&uacute; idir do
chuid acmhainn&iacute;, agus cuireann s&eacute; feabhas ar an bhfeidhm&iacute;ocht
do dhaoine at&aacute; ag &uacute;s&aacute;id do shu&iacute;mh gr&eacute;as&aacute;in
Moodle. F&eacute;adfaidh t&uacute; &eacute; seo a lasadh tr&iacute; na
l&iacute;nte seo a chur le do comhad httpd.conf.</p>
<blockquote>
<pre><b>AcceptPathInfo</b> on</pre>
</blockquote>
Sa tr&iacute;&uacute; h&aacute;it, n&iacute; m&oacute;r go mbeadh l&iacute;on
&aacute;irithe socruithe PHP gn&iacute;omhach le go n-oibreoidh Moodle.
<b>Ar an gcuid is m&oacute; de fhreastalaithe is iad seo na r&eacute;amhshocruithe.</b>
Ach d'fh&eacute;adfadh ruda&iacute; a bheith socraithe go h&eacute;ags&uacute;il
ag roinnt freastalaithe PHP, &aacute;fach, (agus roinnt de na leaganach
is nua de PHP). Sainmh&iacute;nitear iad seo i gcomhad cumra&iacute;ochta
PHP (de ghn&aacute;th php.ini):
<blockquote>
<pre>magic_quotes_gpc = 1&nbsp;&nbsp;&nbsp; (preferred but not necessary)
magic_quotes_runtime = 0&nbsp;&nbsp;&nbsp; (necessary)
file_uploads = 1
session.auto_start = 0
session.bug_compat_warn = 0</pre>
</blockquote>
Muna bhfuil teacht agat ar httpd.conf n&oacute; ar php.ini ar do fhreastala&iacute;,
n&oacute; m&aacute; t&aacute; Moodle agat ar fhreastala&iacute; le fheidhmchl&aacute;ir
eile a &eacute;il&iacute;onn socruithe &eacute;ags&uacute;la, n&aacute;
b&iacute; buartha, f&eacute;adfaidh t&uacute; f&oacute;s na r&eacute;amhshocruithe
ar fad A SH&Aacute;R&Uacute;.

<p>Chun &eacute; seo a dh&eacute;anamh, n&iacute; m&oacute;r duit comhad
a chruth&uacute; darb ainm <b>.htaccess</b> sa phr&iacute;omhchomhadlann
ag Moodle ina bhfuil sainmh&iacute;nithe ar na socraithe seo. N&iacute;
oibr&iacute;onn s&eacute; seo ach amh&aacute;in ar fhreastalaithe Apache
agus nuair a ceada&iacute;tear s&aacute;r&uacute; amh&aacute;in.</p>
<blockquote>
<pre>DirectoryIndex index.php index.html index.htm

&lt;IfDefine APACHE2>
&nbsp;&nbsp;&nbsp;&nbsp; <b>AcceptPathInfo</b> on
&lt;/IfDefine>

php_flag magic_quotes_gpc 1
php_flag magic_quotes_runtime 0
php_flag file_uploads 1
php_flag session.auto_start 0
php_flag session.bug_compat_warn 0</pre>
</blockquote>
F&eacute;adfaidh t&uacute; ruda&iacute; a dh&eacute;anamh, freisin, ar
n&oacute;s uasmh&eacute;id a chruth&uacute; do chomhaid uasl&oacute;d&aacute;ilte:
<blockquote>
<pre>LimitRequestBody 0
php_value upload_max_filesize 2M
php_value post_max_size 2M</pre>
</blockquote>
An rud is &eacute;asca le d&eacute;anamh n&aacute; an comhad samplach a
ch&oacute;ipe&aacute;il &oacute; lib/htaccess agus eagar a chur air lena
chur in oiri&uacute;int duit f&eacute;in. T&aacute; treoracha breise ann.
Mar shampla, i mblaosc Unix:
<blockquote>
<pre>cp lib/htaccess .htaccess</pre>
</blockquote>
</blockquote>
&nbsp;
<h3 class="sectionheading">
<a name="config"></a>7. Eagraigh config.php</h3>

<blockquote>F&eacute;adfaidh t&uacute; anis an comhad cumra&iacute;ochta,
<b>config.php</b>, a eagr&uacute; le heagarth&oacute;ir t&eacute;acs. &Uacute;s&aacute;ideann
gach comhad eile i Moodle an comhad seo.

<p>Mar th&uacute;s, d&eacute;an c&oacute;ip de <b>config-dist.php</b> agus
glaoigh config.php air. D&eacute;anann muid &eacute; seo le nach scr&iacute;obhfar
thar do config.php sa ch&aacute;s go nd&eacute;anann t&uacute; uasghr&aacute;d&uacute;
ar Moodle ar ball.</p>

<p>Eagraigh <b>config.php</b> le go sonr&oacute;far na mionsonra&iacute;
bunachair sonra&iacute; at&aacute; d&iacute;reach sainmh&iacute;nithe agat
(agus r&eacute;im&iacute;r t&aacute;bla&iacute; san &aacute;ireamh - tabhair
faoi deara go bhfuil s&eacute; seo RIACHTANACH le haghaidh PostgreSQL),
maraon le seoladh an tsu&iacute;mh, comhadlann c&oacute;rais comhaid agus
comhadlann bunachair sonra&iacute;. T&aacute; treoracha agus sampla&iacute;
mionsonr&uacute;la ag an gcomhad config &eacute; f&eacute;in.</p>

<p>Nuair a bh&iacute;onn an m&eacute;id seo d&eacute;anta agat, is tr&iacute;
chomh&eacute;adan gr&eacute;as&aacute;in a d&eacute;antar an chuid eile
den suite&aacute;il. Don chuid eile den doicim&eacute;ad suite&aacute;la
seo glacfaimid leis go bhfuil do shu&iacute;omh lonnaithe ag: <u>http://sampla.com/moodle</u></p></blockquote>
&nbsp;
<h3 class="sectionheading">
<a name="admin"></a>8. T&eacute;igh go dt&iacute; an leathanach riarach&aacute;in</h3>

<blockquote>Ba cheart don leathanach riarach&aacute;in a bheith ag feidhmi&uacute;
anois ag: <u>http://sampla.com/moodle/admin</u>. M&aacute; thriaileann
t&uacute; teacht ar leathanach tosaigh do shu&iacute;mh tabharfar ansin
go huathoibr&iacute;och t&uacute; ar aon n&oacute;s. An ch&eacute;ad uair
a th&eacute;ann t&uacute; chuig an leathanach riarach&aacute;in seo, gheodhaidh
t&uacute; comhaont&uacute; GPL "scann&aacute;n cumhdaithe" (shrinkwrap)
nach m&oacute;r duit aont&uacute; leis sular f&eacute;idir leat lean&uacute;int
leis an suite&aacute;il.

<p>(D&eacute;anfaidh Moodle iarracht freisin fian&aacute;in a shocr&uacute;
i do bhrabhs&aacute;la&iacute;. M&aacute; t&aacute; do bhrabhs&aacute;la&iacute;
socraithe agatsa le rogha a thabhairt glacadh le fian&aacute;in n&oacute;
gan glacadh leo, <b>caithfidh</b>t&uacute; glacadh le fian&aacute;in Moodle,
n&oacute; n&iacute; fheidhmeoidh Moodle i gceart.)</p>

<p>Anois tos&oacute;idh Moodle ag suite&aacute;il do bhunachair sonra&iacute;
agus ag cruth&uacute; t&aacute;bla&iacute; le sonra&iacute; a st&oacute;r&aacute;il.
Ar dt&uacute;s cruth&oacute;far na pr&iacute;omhth&aacute;bla&iacute; bunachair
sonra&iacute;. Ba cheart go bhfeicfe&aacute; l&iacute;on &aacute;irithe
r&aacute;iteas SQL agus, ina ndiaidh sin, teachtaireachta&iacute; st&aacute;dais
(i uaine n&oacute; i ndearg) a bhreathn&oacute;idh mar seo:</p>
<blockquote>CREATE TABLE course ( id int(10) unsigned NOT NULL auto_increment,
category int(10) unsigned NOT NULL default '0', password varchar(50) NOT
NULL default '', fullname varchar(254) NOT NULL default '', shortname varchar(15)
NOT NULL default '', summary text NOT NULL, format tinyint(4) NOT NULL
default '1', teacher varchar(100) NOT NULL default 'Teacher', startdate
int(10) unsigned NOT NULL default '0', enddate int(10) unsigned NOT NULL
default '0', timemodified int(10) unsigned NOT NULL default '0', PRIMARY
KEY (id)) TYPE=MyISAM

<p><font color="#006600">SUCCESS</font></p>

<p>...agus mar sin de, &aacute; lean&uacute;int ag: <font color="#006600">Main
databases set up successfully.</font></p></blockquote>
Muna bhfeiceann t&uacute; iad seo, caithfidh go raibh fadhbanna ann leis
an mbunachar sonra&iacute; n&oacute; leis na socruithe cumra&iacute;ochta
a shainmh&iacute;nigh t&uacute; i config.php. Seice&aacute;il nach bhfuil
PHP i "Modh Sl&aacute;n" srianta (uaireanta b&iacute;onn modh sl&aacute;
lasta ag &oacute;staigh tr&aacute;cht&aacute;la gr&eacute;as&aacute;in).
F&eacute;adfaidh t&uacute; athr&oacute;ga PHP a sheice&aacute;il tr&iacute;
chomhad beag ina bhfuil &lt;? phpinfo() ?> a chruth&uacute; agus breathn&uacute;
ar tr&iacute; bhrabhs&aacute;la&iacute;. Seice&aacute;il iad seo ar fad
agus triail an leathanach seo ar&iacute;s.

<p>Scrollaigh s&iacute;os go bun ar fad an leathanaigh agus br&uacute;igh
ar an nasc "Ar Aghaidh".</p>

<p>Ansin ba cheart go bhfeicfe&aacute; leathanach cos&uacute;il leis a
shocra&iacute;onn na t&aacute;bla&iacute; ar fad at&aacute; ag teast&aacute;il
&oacute; gach mod&uacute;l Moodle. Faoi mar a bh&iacute; cheana, ba cheart
go mbeid&iacute;s uaine.</p>

<p>Scrollaigh s&iacute;os go bun ar fad an leathanaigh agus br&uacute;igh
ar an nasc "Ar Aghaidh".</p>

<p>Ba cheart anois go bhfeicfe&aacute; foirm inar f&eacute;idir leat tuilleadh
athr&oacute;ga cumra&iacute;ochta a shaini&uacute; do do shuite&aacute;il,
ar n&oacute;s an teanga r&eacute;amhshocraithe, &oacute;staigh SMTP agus
araile. N&aacute; b&iacute; r&oacute;-bhuartha faoi gach rud a bheith d&iacute;reach
ceart anois - f&eacute;adfaidh t&uacute; i gc&oacute;na&iacute; teacht
ar ais agus iad seo a athr&uacute; leis an gcomh&eacute;adan riarach&aacute;in.
Scrollaigh s&iacute;os go dt&iacute; an bun agus clice&aacute;il ar "S&aacute;bh&aacute;il
Athruithe".</p>

<p>Sa ch&aacute;s go bhfuil t&uacute; ag &eacute;ir&iacute; greamaithe
ar an leathanach seo (agus sa ch&aacute;s seo amh&aacute;in), gan a bheith
in ann lean&uacute;int, b'fh&eacute;idir go bhfuil fadhb "an tagr&oacute;ra
fabhtaigh" agat, mar a ghlaoimse air. T&aacute; s&eacute; &eacute;asca
&eacute; seo a dheisi&uacute;: m&uacute;ch an socr&uacute; "secureforms",
agus ansin d&eacute;an iarracht eile lean&uacute;int ar aghaidh.</p>

<p>Foirm at&aacute; sa ch&eacute;ad leathanach eile inar f&eacute;idir
leat paraimadair a shaini&uacute; do do shu&iacute;omh Moodle agus don
leathanach tosaigh, ar n&oacute;s an t-ainm, form&aacute;id, cur s&iacute;os,
agus araile. L&iacute;on amach &eacute; seo (f&eacute;adfaidh t&uacute;
i gc&oacute;na&iacute; teacht ar ais agus iad seo a athr&uacute; ar ball)
agus br&uacute;igh "S&aacute;bh&aacute;il athruithe".</p>

<p>Ar deireadh, iarrfar ort &uacute;s&aacute;ideoir ardleibh&eacute;il
a chruth&uacute; le haghaidh rochtana ar an leathanach riarach&aacute;in
sa todhcha&iacute;. Cuir isteach do chuid sonra&iacute; f&eacute;in, do
r-phost, srl agus clice&aacute;il ar "S&aacute;bh&aacute;il athruithe".
N&iacute; na r&eacute;ims&iacute; ar fad riachtanach, ach m&aacute; fh&aacute;gann
t&uacute; glan aon cheann t&aacute;bhachtach tabharfar leid eile duit d&oacute;ibh.</p>
<blockquote>
<blockquote>
<blockquote>
<blockquote>
<blockquote><b>B&iacute; cinnte go gcuimhn&iacute;onn t&uacute; ar an ainm
&uacute;s&aacute;ideora agus an pasfhocal a roghna&iacute;onn t&uacute;
don chuntas riarth&oacute;ra, &oacute;s rud &eacute; go mbeidh siad riachtanach
le teacht ar an leathanach riarach&aacute;in sa todhcha&iacute;.</b></blockquote>
</blockquote>
</blockquote>
</blockquote>
</blockquote>
(M&aacute; idirbhristear an suite&aacute;il ar ch&uacute;is ar bith, n&oacute;
m&aacute; t&aacute; earr&aacute;id c&oacute;rais &eacute;igin ann a choinn&iacute;onn
t&uacute; &oacute; log&aacute;il isteach leis an gcuntas riarth&oacute;ra,
f&eacute;adfaidh t&uacute; de ghn&aacute;th log&aacute;il isteach leis
and ainm &uacute;s&aacute;ideora r&eacute;amhshocraithe "<b>admin</b>",
leis an bpasfhocal "<b>admin</b>".)

<p>&Oacute; &eacute;ir&iacute;onn leat, cuirfear ar ais chuig leathanach
baile do shu&iacute;mh t&uacute;. Tabhair faoi deara na nascanna riarach&aacute;in
at&aacute; ar thaobh cl&eacute; an leathanaigh (l&eacute;ir&iacute;tear
chomh maith iad seo ar leathanach ar leith Riarach&aacute;in) - f&eacute;adfaidh
tusa iad seo a fheice&aacute;il toisc go bhfuil tusa log&aacute;ilte isteach
mar riarth&oacute;ir. F&eacute;adfaidh t&uacute; an riarach&aacute;n ar
fad Moodle amach anseo a dh&eacute;anamh tr&iacute;d an roghchl&aacute;r
seo anois, ar n&oacute;s:</p>
<ul>
<li>
c&uacute;rsa&iacute; a chruth&uacute; agus a scrios</li>

<li>
cuntais &uacute;s&aacute;ideora a chruth&uacute; agus a scrios</li>

<li>
cuntais m&uacute;inteora a riar</li>

<li>
athraigh socruithe at&aacute; ar an su&iacute;omh uile, ar n&oacute;s t&eacute;ama&iacute;,
srl</li>
</ul>
</blockquote>
&nbsp;
<h3 class="sectionheading">
<a name="cron"></a>9. Cumraigh cron</h3>

<blockquote>T&aacute; seice&aacute;il rialta ag teast&aacute;il &oacute;
roinnt de mhod&uacute;il Moodle le tascanna a chur i bhfeidhm. Mar shampla,
n&iacute; m&oacute;r do Moodle f&oacute;raim pl&eacute; a sheice&aacute;il
le gur f&eacute;idir leis c&oacute;ipeanna den phost is d&eacute;ana&iacute;
a sheoladh chuig daoine at&aacute; liost&aacute;ilte.

<p>T&aacute; an script a chuireann &eacute; seo i gcr&iacute;ch lonnaithe
sa chomhadlann riarach&aacute;in agus cron.php an t-ainm at&aacute; air.
N&iacute; f&eacute;idir leis &eacute; f&eacute;in a rith &aacute;fach agus
mar sin n&iacute; m&oacute;r meicn&iacute;ocht a shocr&uacute; le go ritear
an script seo go rialta (msh gach c&uacute;ig n&oacute; deich n&oacute;im&eacute;ad).
Crutha&iacute;onn s&eacute; seo "buille cro&iacute;" le go gcuirfidh an
script feidhmeanna i gcr&iacute;ch ag tr&eacute;imhs&iacute; a sain&iacute;tear
le gach mod&uacute;l.</p>

<p>Tabhair faoi deara <b>nach g&aacute; gurb &iacute; an mheais&iacute;n
ch&eacute;anna ar a ritheann Moodle</b> agus a chuireann cron i gcr&iacute;ch.
Mar shampla, m&aacute; t&aacute; seirbh&iacute;s srianta &oacute;sta&iacute;ochta
gr&eacute;as&aacute;in agat nach bhfuil cron aige, d'fh&eacute;adf&aacute;,
d&aacute; mba mhian leat, cron a rith ar fhreastala&iacute; eil n&oacute;
&oacute; do r&iacute;omhaire baile. An t-aon rud at&aacute; t&aacute;bhachtach
n&aacute; go nglaofa&iacute; ar an gcomhad cron.php go rialta.</p>

<p>N&iacute;l ualach na scripte seo r&oacute;-mh&oacute;r, agus m&aacute;s
sea t&aacute; 5 n&oacute;im&eacute;ad r&eacute;as&uacute;nta go leor, ach
m&aacute; t&aacute; t&uacute; buartha faoi, f&eacute;adfaidh t&uacute;
an t-amthr&eacute;imhse a laghd&uacute; go 15 n&oacute;im&eacute;ad n&oacute;
fi&uacute; go 30 n&oacute;im&eacute;ad. Is fearr gan an tr&eacute;imhse
a bheith r&oacute;-fhada, toisc go moill&iacute;tear gn&iacute;omha&iacute;ocht
ar an gc&uacute;rsa nuair a cuirtear moill ar fh&oacute;gra&iacute; r-phoist.</p>

<p>Ar dt&uacute;s, t&aacute;st&aacute;il go bhfuil an script ag feidhmi&uacute;
i gceart tr&iacute; &eacute; a rith go d&iacute;reach &oacute; do bhrabhs&aacute;la&iacute;:</p>
<blockquote>
<pre>http://sampla.com/moodle/admin/cron.php</pre>
</blockquote>
Anois, teasta&iacute;onn bealach uait leis an script a rith go huathoibr&iacute;och
agus go rialta.
<h4>
An script a rith &oacute; l&iacute;ne na n-orduithe</h4>
F&eacute;adfaidh t&uacute; an leathanach a ghlaoch &oacute; l&iacute;nena
n-orduithe faoi mar a rinne t&uacute; sa sampla thuas. Mar shampla, f&eacute;adfaidh
t&uacute; &aacute;irge Unix a &uacute;s&aacute;id ar n&oacute;s 'wget':
<blockquote>
<pre>wget -q -O /dev/null http://sampla.com/moodle/admin/cron.php</pre>
</blockquote>
Tabhair faoi deara sa sampla seo go gcaitear amach an t-aschur (to /dev/null).

<p>An rud c&eacute;anna ag &uacute;s&aacute;id lynx:</p>
<blockquote>
<pre>lynx -dump http://sampla.com/moodle/admin/cron.php > /dev/null</pre>
</blockquote>
Mar mhalairt ar seo, d'fh&eacute;adf&aacute; leagan aonair de PHP a &uacute;s&aacute;id,
tiomsaithe le rith ar l&iacute;ne na n-orduithe. Is &eacute; an bunt&aacute;iste
a bhaineann leis seo n&aacute; nach mb&iacute;onn loga&iacute; do fhreastala&iacute;
gr&eacute;as&aacute;in l&aacute;n le hiarratais rialta ar cron.php. Is
&eacute; an m&iacute;bhunt&aacute;iste n&aacute; go gcaithfidh t&uacute;
rochtain a bheith agat ar leagan l&iacute;ne na n-orduithe de php.
<blockquote>
<pre>/opt/bin/php /web/moodle/admin/cron.php


(Windows) C:\apache\php\php.exe C:\apache\htdocs\moodle\admin\cron.php</pre>
</blockquote>

<h4>
An script a rith go huathoibr&iacute;och gach 5 n&oacute;im&eacute;ad</h4>
<b>Ar ch&oacute;rais Unix</b>: &Uacute;s&aacute;id <b>cron</b>. Eagraigh
do shocraithe cron &oacute;n l&iacute;ne orduithe ag &uacute;s&aacute;id
"crontab -e" agus l&iacute;ne a chur leis ar n&oacute;s:
<blockquote>
<pre>*/5 * * * * wget -q -O /dev/null http://sampla.com/moodle/admin/cron.php</pre>
</blockquote>
De ghn&aacute;th cuirfidh an t-ord&uacute; "crontab" isteach san eagarth&oacute;ir
'vi' t&uacute;. Iontr&aacute;lann t&uacute; "modh ions&aacute;" tr&iacute;
"i" a bhr&uacute;, agus ansin an l&iacute;ne a chl&oacute; mar at&aacute;
thuas, ansin f&aacute;g modh ions&aacute; tr&iacute; ESC a bhr&uacute;.
S&aacute;bh&aacute;il agus f&aacute;g tr&iacute; ":wq" a chl&oacute;, n&oacute;
f&aacute;g gan s&aacute;bh&aacute;il tr&iacute; ":q!" a &uacute;s&aacute;id
(gan na comhartha&iacute; athfhriotail).

<p><b>Ar ch&oacute;rais Windows</b>: An bealach is &eacute;asca n&aacute;
an pac&aacute;iste beag seo a &uacute;s&aacute;id <a href="http://moodle.org/download/moodle-cron-for-windows.zip" title="Click to download this package (150k)" target="_blank">moodle-cron-for-windows.zip</a>,
rud a dh&eacute;anann gach rud an-&eacute;asca. D'fh&eacute;adf&aacute;
breathn&uacute; freisin ar ghn&eacute; de Windows le haghaidh "Scheduled
Tasks".</p>

<p>Ar &oacute;staigh gr&eacute;as&aacute;n: D'fh&eacute;adfadh go mbeadh
leathanach gr&eacute;as&aacute;in ar do phain&eacute;al rial&uacute;ch&aacute;in
gr&eacute;as&aacute;n-bhunaithe a ligean duit an pr&oacute;iseas cron a
shocr&uacute;. Fiafraigh de do riarth&oacute;ir c&eacute; mar a oibr&iacute;onn
s&eacute;.</p></blockquote>

<h3 class="sectionheading">
<a name="course"></a>10. Cruthaigh c&uacute;rsa nua</h3>

<blockquote>Anois &oacute; t&aacute; Moodle ag rith i gceart, f&eacute;adfaidh
t&uacute; c&uacute;rsa a chruth&uacute;.

<p>Roghnaigh "Cruthaigh c&uacute;rsa nua" &oacute;n leathanach Riarach&aacute;in
(n&oacute; &oacute; na nascanna riarach&aacute;in ar an leathanach baile).</p>

<p>L&iacute;on amach an fhoirm, ag tabhairt aird ar leith ar fhorm&aacute;id
an ch&uacute;rsa. N&iacute; g&aacute; duit a bheith buartha faoi na mionsonra&iacute;
ag an staid seo - f&eacute;adfaidh an m&uacute;inteoir gach rud a athr&uacute;
ar ball.</p>

<p>Br&uacute;igh ar "S&aacute;bh&aacute;il athruithe", agus tabharfar t&uacute;
chuig foirm nua &aacute;it ar f&eacute;idir leat m&uacute;inteoir&iacute;
a shannadh leis an gc&uacute;rsa. N&iacute; fh&eacute;adfaidh t&uacute;
ach cuntais &uacute;s&aacute;ideora at&aacute; ann cheana a chur leis an
bhfoirm seo - m&aacute;s mian leat cuntasnua m&uacute;inteora a chruth&uacute;
iarr ar an m&uacute;inteoir cuntas a chruth&uacute; d&oacute;ibh f&eacute;in
(f&eacute;ach an leathanach log&aacute;la), n&oacute; cruthaigh ceann d&oacute;ibh
tr&iacute; "Cuir &uacute;s&aacute;ideoir nua leis" ar an leathanach Riarach&aacute;in.</p>

<p>&Eacute; sin d&eacute;anta, t&aacute; anc&uacute;rsa r&eacute;idh lena
oiri&uacute;n&uacute;, agus is f&eacute;idir teacht air tr&iacute;d an
nasc "C&uacute;rsa&iacute;" ar an leathanach baile.</p>

<p>F&eacute;ach "<a href="?file=teacher.html">Leabhr&aacute;n an Mh&uacute;inteora</a>"
le haghaidh n&iacute;os m&oacute; eolais faoi ch&uacute;rsa&iacute; a chruth&uacute;.</p></blockquote>
&nbsp;
<center><font size="1"><a href="." target="_top">Doicim&eacute;id Moodle</a></font></center>

<center><font size="1">Leagan: $Id: install.html,v 1.17 2003/10/01 18:00:40
moodler Exp $</font></center>
&nbsp;
</body>
</html>
