<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>Doic. Moodle: L&aacute;mhleabhar an Mh&uacute;inteora</title>
<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS" />
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
</head>

<body>

<h1>
L&aacute;mhleabhar an Mh&uacute;inteora</h1>
Treoir an-tapa is ea an leathanach seo le c&uacute;rsa&iacute; a chruth&uacute;
ar-l&iacute;ne le Moodle. Tugtar iml&iacute;ne ann ar na pr&iacute;omhfheidhmeanna
at&aacute; ar f&aacute;il, maraon le roinnt de na pr&iacute;omhchinnidh
a bheidh ort a dh&eacute;anamh.

<p>Rann&oacute;ga sa doicim&eacute;ad seo:</p>
<ol>
<li>
<a href="#started">Ag tos&uacute;</a></li>

<li>
<a href="#settings">Socruithe an ch&uacute;rsa</a></li>

<li>
<a href="#upload">Comhaid a uasl&oacute;d&aacute;il</a></li>

<li>
<a href="#activities">Gn&iacute;omha&iacute;ochta&iacute; a shocr&uacute;</a></li>

<li>
<a href="#course">An c&uacute;rsa a rith</a></li>

<li>
<a href="#further">A thuilleadh eolais</a></li>
</ol>

<h3 class="sectionheading">
<a name="started"></a>Ag tos&uacute;</h3>

<blockquote>Glacann an doicim&eacute;ad seo leis go bhfuil Moodle socraithe
ag riarth&oacute;ir an tsu&iacute;mh agus gur thug siad c&uacute;rsa nua,
glan duit le tos&uacute; air. Glactar leis chomh maith go bhfuil t&uacute;
log&aacute;ilte isteach ar do ch&uacute;rsa tr&iacute; do chuntas m&uacute;inteora.

<p>Seo tr&iacute; nod ginear&aacute;lta le cabhr&uacute; leat tos&uacute;.</p>
<ol>
<li>
<b>N&aacute; b&iacute;odh fait&iacute;os ort triail a bhaint as ruda&iacute;:</b></li>
<li>
<blockquote>T&aacute; t&uacute; saor le breathn&uacute; thart agus le ruda&iacute;
a athr&uacute;. T&aacute; s&eacute; an-deacair aon rud a bhriseadh ar ch&uacute;rsa
Moodle, agus fi&uacute; m&aacute; dh&eacute;anann, de ghn&aacute;th t&aacute;
s&eacute; &eacute;asca &eacute; a dheisi&uacute;.</blockquote></li>

<li>
<b>Tabhair faoi deara agus &uacute;s&aacute;id na deilbh&iacute;n&iacute;
beaga seo</b>:</li>

<li>
<blockquote>&nbsp;<img src="edit.gif" alt="edit" /> - ligeann an <b>deilbh&iacute;n
eagarth&oacute;ireachta</b> duit eagar a chur ar p&eacute; rud at&aacute;
in aice leis.

<p><img src="help.gif" height="17" width="22" alt="help" /> - cuireann an <b>deilbh&iacute;n
cabhrach </b><a href="../help.php?file=index.html" target="helpwindow">fuinneog
cabhrach</a> ar f&aacute;il duit.</p>

<p>&nbsp;<img src="hide.gif" height="16" width="16" alt="hide" /> - ligeann an <b>deilbh&iacute;n
s&uacute;il-ar-oscailt</b> duit rud a cheilt &oacute; mhic l&eacute;inn</p>

<p>&nbsp;<img src="show.gif" height="16" width="16" alt="show"/> - cuireann an <b>deilbh&iacute;n
s&uacute;il-d&uacute;nta</b> rud at&aacute; faoi cheilt ar f&aacute;il</p></blockquote>
</li>
<li>
<b>&Uacute;s&aacute;id an barra nasclean&uacute;na ag barr gach leathanach</b></li>
<li>
<blockquote>cabhr&oacute;idh s&eacute; seo leat cuimhni&uacute; c&aacute;
bhfuil t&uacute; agus gan dul ar strae.</blockquote>
</li>
</ol>
&nbsp;</blockquote>

<h3 class="sectionheading">
<a name="settings"></a>Socruithe an ch&uacute;rsa</h3>

<blockquote>An ch&eacute;ad rud ba cheart duit a dh&eacute;anamh n&aacute;
breathn&uacute; faoi "Riarach&aacute;n" ar leathanach baile do ch&uacute;rsa
agus clice&aacute;il ar "<b>Socruithe...</b>" (Tabhair faoi deara nach
bhfuil an nasc seo, agus go deimhin an rann&oacute;g ioml&aacute;n Riarach&aacute;in,
ar f&aacute;il ach duitse (agus do riarth&oacute;ir an tsu&iacute;mh).
N&iacute; fheicfidh na mic l&eacute;inn na nascanna seo fi&uacute;.

<p>Ar leathanach na Socruithe f&eacute;adfaidh t&uacute; roinnt de na socruithe
do do ch&uacute;rsaa athr&uacute;, &oacute;na ainm go dt&iacute; an l&aacute;
ar a dtosa&iacute;onn s&eacute;. N&iacute; labhr&oacute;idh m&eacute; anseo
f&uacute;thu sin ar fad, &oacute;s rud &eacute; go bhfuil deilbh&iacute;n
cabhrach in aice leo ar fad a mh&iacute;n&iacute;onn go beacht iad. Mar
sin f&eacute;in, labhr&oacute;idh m&eacute; faoin ngn&eacute; is t&aacute;bhachta&iacute;
d&iacute;obh seo - <b>form&aacute;id an ch&uacute;rsa</b>.</p>

<p>Socr&oacute;idh an fhorm&aacute;id a roghna&iacute;onn t&uacute; don
ch&uacute;rsa an leagan amach bun&uacute;sach a bheidh air, mar a dh&eacute;anfadh
teimpl&eacute;ad. T&aacute; tr&iacute; fhorm&aacute;id le Moodle leagan
1.0 - gach seans go mbeidh i bhfad n&iacute;os m&oacute; ann sa todhcha&iacute;
(seol smaointe nua chuig <a href="mailto:martin@moodle.org">martin@moodle.org</a>,
le bhur dtoil!)</p>

<p>Seo l&eacute;iri&uacute; sc&aacute;ile&aacute;in de ch&uacute;rsa&iacute;
samplacha i ngach ceann den tr&iacute; fhorm&aacute;id (d&eacute;an neamhaird
de na dathanna &eacute;ags&uacute;la, rud a shocra&iacute;onn riarth&oacute;ir
an tsu&iacute;mh don su&iacute;omh ioml&aacute;n):</p>
<p align="center"><b>Form&aacute;id sheachtaini&uacute;il:</b></p>

<p align="center"><img src="weekly.jpg" height="527" width="570" alt="weekly" /></p>

<p align="center">&nbsp;</p>

<p align="center"><b>Form&aacute;id &aacute;bhair:</b></p>

<p align="center"><img src="topics.jpg" height="463" width="570" alt="topics"/></p>

<p align="center">&nbsp;</p>

<p align="center"><b>Form&aacute;id sh&oacute;isialta:</b></p>

<p align="center"><img src="social.jpg" height="429" width="570" alt="social"/></p>


<p>&nbsp;</p>

<p>Tabhair faoi deara go bhfuil na form&aacute;id&iacute; seachtaini&uacute;il
agus &aacute;bhair an-chos&uacute;il &oacute; thaobh strucht&uacute;ir
de. An pr&iacute;omhdhifr&iacute;ocht n&aacute; go gcl&uacute;da&iacute;onn
gach bosca seachtain go d&iacute;reach sa bhform&aacute;id sheachtaini&uacute;il,
agus sa bhform&aacute;id &aacute;bhair go gcl&uacute;da&iacute;onn bosca
p&eacute; rud is mian leat. N&iacute; &uacute;s&aacute;ideann an fhorm&aacute;id
sh&oacute;isialta m&oacute;r&aacute;n inneachair ar chor ar bith agus buna&iacute;tear
&eacute; timpeall ar fh&oacute;ram amh&aacute;in - l&eacute;ir&iacute;tear
&eacute; seo ar an bpr&iacute;omhleathanach.</p>

<p>F&eacute;ach na cnaip&iacute; cabhrach ar an leathanach Socruithe an
Ch&uacute;rsa le haghaidh a thuilleadh sonra&iacute;.</p>

<p>&nbsp;</p></blockquote>

<h3 class="sectionheading">
<a name="upload"></a>Comhaid a uasl&oacute;d&aacute;il</h3>

<blockquote>B'fh&eacute;idir go bhfuil &aacute;bhar agat cheana ba mhaith
leat a chur le do ch&uacute;rsa, ar n&oacute;s leathanaigh gr&eacute;as&aacute;n,
comhaid fuaime, comhaid f&iacute;se, doicim&eacute;id Word n&oacute; beochan
flash. Is f&eacute;idir gach cine&aacute;l comhaid a uasl&oacute;d&aacute;il
chuig do ch&uacute;rsa agus a st&oacute;r&aacute;il ar an bhfreastala&iacute;.
Agus do chomhaid ar an bhfreastala&iacute; f&eacute;adfaidh t&uacute; iad
a bhogadh, a athainmni&uacute;, a eagr&uacute; n&oacute; iad a scrios.

<p>D&eacute;antar &eacute; seo ar fad tr&iacute;d an nasc <b>Comhaid</b>
ar do roghchl&aacute;r Riarach&aacute;in. T&aacute; cuma mar seo ar an
rann&oacute;g Comhaid:</p>
<p align="center"><img src="files.jpg" height="347" width="400" alt="files" /></p>


<p>&nbsp;</p>

<p>N&iacute;l an comh&eacute;adan seo ar f&aacute;il ach do Mh&uacute;inteoir&iacute;
- n&iacute; f&eacute;idir le mic l&eacute;inn teacht air. Cuirtear comhaid
indibhidi&uacute;la ar f&aacute;il do mhic l&eacute;inn ar ball (mar "Acmhainn&iacute;"
- f&eacute;ach an ch&eacute;ad rann&oacute;g eile).</p>

<p>Mar at&aacute; le feice&aacute;il &oacute;n l&eacute;iri&uacute; sc&aacute;ile&aacute;in,
liost&aacute;iltear comhaid le fochomhadlanna. F&eacute;adfaidh t&uacute;
l&iacute;on ar bith fochomhadlanna a chruth&uacute; le do chuid comhad
a choinne&aacute;il in ord, agus f&eacute;adfaidh t&uacute; na comhaid
a bhogadh &oacute; cheann go ceann.</p>

<p>T&aacute; srian ar uasl&oacute;d&aacute;il comhad faoi l&aacute;thair
- ceann ag an am a ceada&iacute;tear. M&aacute;s mian leat l&iacute;on
m&oacute;r comhad a uasl&oacute;d&aacute;il san aon turas (mar shampla,
su&iacute;omh gr&eacute;as&aacute;in ioml&aacute;n), t&aacute; s&eacute;
i bhfad n&iacute;os &eacute;asca <b>zipchl&aacute;r</b> a &uacute;s&aacute;id
le iad a chomhbhr&uacute; isteach i gcomhad amh&aacute;in, uasl&oacute;d&aacute;il
an zipchomhad, agus ansin d&iacute;zipe&aacute;il ar&iacute;s iad ar an
bhfreastala&iacute; (feicfidh t&uacute; nasc "d&iacute;zipe&aacute;il"
in aice leis na zipchartlanna).</p>

<p>Le r&eacute;amhamharc a fh&aacute;il ar aon chomhad a uasl&oacute;d&aacute;il
t&uacute;, clice&aacute;il ar a ainm. D&eacute;anfaidh do bhrabhs&aacute;la&iacute;
an gn&oacute; cu&iacute; tr&iacute; &eacute; a oscailt n&oacute; &eacute;
a &iacute;osl&oacute;d&aacute;il chuig do r&iacute;omhaire.</p>

<p>Is f&eacute;idir comhaid HTML agus t&eacute;acs a eagr&uacute; san &aacute;it
ina bhfuli siad ar l&iacute;ne. Beidh g&aacute; comhaid eile a eagr&uacute;
ar do r&iacute;omhaire agus iad a uasl&oacute;d&aacute;il ar&iacute;s.
M&aacute; uasl&oacute;d&aacute;ileann t&uacute; comhad leis an ainm c&eacute;anna
at&aacute; ag comhad at&aacute; ann cheana c&oacute;ipe&aacute;ilfar anuas
air go huathoibr&iacute;och.</p>

<p>N&oacute;ta deiridh: m&aacute;s ar an ngr&eacute;as&aacute;n at&aacute;
do chuid &aacute;bhair n&iacute; g&aacute; duit na comhaid a uasl&oacute;d&aacute;il
arr chor ar bith - f&eacute;adfaidh t&uacute; nasc a choth&uacute; chucu
go d&iacute;reach &oacute;n gc&uacute;rsa (f&eacute;ach an mod&uacute;l
Acmhainn&iacute; agus an ch&eacute;ad rann&oacute;g ele).</p>

<p>&nbsp;</p></blockquote>

<h3 class="sectionheading">
<a name="activities"></a>Gn&iacute;omha&iacute;ochta&iacute; a shocr&uacute;</h3>

<blockquote>Le c&uacute;rsa a th&oacute;g&aacute;il, cuirtear mod&uacute;il
gn&iacute;omha&iacute;ochta an ch&uacute;rsa leis an bpr&iacute;omhleathanach
san ord ina n-&uacute;s&aacute;idfidh mic l&eacute;inn iad. F&eacute;adfaidh
t&uacute; an t-ord a shuaitheadh amar bith is mian leat.

<p>Le eagarth&oacute;ireacht a lasadh, clice&aacute;il "Las eagarth&oacute;ireacht"
faoi Riarach&aacute;n. L&eacute;ir&iacute;onn n&oacute; ceala&iacute;onn
an lasc scor&aacute;naithe seo na rial&uacute;ch&aacute;in bhreise a ligean
duit pr&iacute;omhleathanach do ch&uacute;rsa a ionramh&aacute;il. Tabhair
faoi deara sa l&eacute;iri&uacute; thuas (ar an gc&uacute;rsa i bhform&aacute;id
Sheachtaini&uacute;il) go bhfuil na rial&uacute;ch&aacute;in eagarth&oacute;ieachta
lasta.</p>

<p>Le gn&iacute;omha&iacute;ocht nua a chur isteach, t&eacute;igh chuig
an seachtain, n&oacute; an t-&aacute;bhar n&oacute; an rann&oacute;g ar
an sc&aacute;ile&aacute;n, agus roghnaigh an cine&aacute;l gn&iacute;omha&iacute;ochta
at&aacute; uait &oacute;n roghchl&aacute;r an&iacute;os. Seo achoimre ar
na gn&iacute;omha&iacute;ochta&iacute; caighde&aacute;nacha ar fad at&aacute;
i Moodle 1.0:</p>
<dl>
<dt>
<b>Tasc</b></dt>

<dd>
Is &eacute; at&aacute; i Tasc n&aacute; nuair a shocra&iacute;onn t&uacute;
tasc le spriocdh&aacute;ta agus le huasghr&aacute;d. Beidh mic l&eacute;inn
in ann comhad amh&aacute;in a uasl&oacute;d&aacute;il leis na riachtanais
a sh&aacute;samh. Coinn&iacute;tear taifead den d&aacute;ta ar uasl&oacute;d&aacute;il
siad an comhad. Ina dhiaidh, beidh leathanach amh&aacute;in agatsa ar ar
f&eacute;idir leat breathn&uacute; ar gach comhad (agus chomh luath n&oacute;
mall is at&aacute; s&eacute;), agus ansin gr&aacute;d agus imchaint a thaifead.
Leathuair tar &eacute;is duit gr&aacute;d a bhronnadh ar aon mhac l&eacute;inn,
seolfaidh Moodle r-phost go huathoibr&iacute;och chuig an mac l&eacute;inn
&aacute; fh&oacute;gairt sin.

<br /><br /></dd>
<dt>
<b>Rogha</b></dt>

<dd>
T&aacute; gn&iacute;omha&iacute;ocht rogha an-simpl&iacute; - cuireann
t&uacute; ceist agus sonra&iacute;onn t&uacute; rogha freagra&iacute;.
F&eacute;adfaidh mic l&eacute;inn a rogha a dh&eacute;anamh, agus t&aacute;
sc&aacute;ile&aacute;n tuairisce agatsa &aacute;it a fheiceann t&uacute;
na tortha&iacute;. &Uacute;s&aacute;idim f&eacute;in &eacute; le toili&uacute;
taighde a bhaili&uacute; &oacute; mo mhic l&eacute;inn, ach d'fh&eacute;adfa&iacute;
&eacute; a &uacute;s&aacute;id le haghaidh v&oacute;ta&iacute;ocht ranga
n&oacute; a leith&eacute;id freisin.

<br /><br /></dd>
<dt>
<b>F&oacute;ram</b></dt>

<dd>
Is &eacute; seo cinnte an ceann is t&aacute;bhachta&iacute; - is anseo
a tharla&iacute;onn pl&eacute;. Nuair a chuireann t&uacute; isteach f&oacute;ram
nua, tabharfar rogha duit idir cine&aacute;lacha &eacute;ags&uacute;la
- pl&eacute; simpl&iacute; aon-&aacute;bhair, f&oacute;ram ginear&aacute;lta
saor do gach duine, n&oacute; sn&aacute;ithe-amh&aacute;in-pl&eacute;-an-&uacute;s&aacute;ideoir.

<br /><br /></dd>
<dt>
<b>Irise&aacute;n</b></dt>

<dd>
Iontr&aacute;il in Irise&aacute;n an ch&uacute;rsa is ea gach gn&iacute;omha&iacute;ocht
irise&aacute;in. Do gach ceann, f&eacute;adfaidh t&uacute; ceist oscailte
a shonra&iacute; a sti&uacute;rann an t-&aacute;bhar a scr&iacute;obhann
mic l&eacute;inn, chomh maith leis an bearna ama ina mbeidh an t-irise&aacute;n
ar oscailt (form&aacute;id sheachtaini&uacute;il amh&aacute;in). Riail
ginear&aacute;lta at&aacute; &uacute;s&aacute;ideach is ea irise&aacute;n
amh&aacute;in sa seachtain a chruth&uacute;. Spreag mic l&eacute;inn le
go scr&iacute;obhadh siad go smaointeach agus go critici&uacute;il sna
hirise&aacute;in seo &oacute;s rud &eacute; nach bhfuil siad ar f&aacute;il
ach d&oacute;ibh f&eacute;in agus duitse. Ina dhiaidh beidh t&uacute; in
ann na hiontr&aacute;lach ar fad don tseachtain sin a ghr&aacute;d&uacute;
agus tr&aacute;cht orthu, agus gheobhaidh mic l&eacute;inn r-phost uathoibr&iacute;och
ag f&oacute;gairt do chuid aiseolais. N&iacute;or dearadh irise&aacute;in
le go gcuirf&iacute; leo go lean&uacute;nach - m&aacute;s mian leat &eacute;
sin a dh&eacute;anamh, cuir isteach gn&iacute;omha&iacute;ochta&iacute;
bhreise irise&aacute;n.

<br /><br /></dd>
<dt>
<b>Acmhainn</b></dt>

<dd>
Is iad na hacmhainn&iacute; &aacute;bhar do ch&uacute;rsa. D'fh&eacute;adfadh
gurb &eacute; at&aacute; san acmhainn aon chomhad at&aacute; uasl&oacute;d&aacute;ilte
agat n&oacute; ar f&eacute;idir leat pointe&aacute;il chuig le URL. F&eacute;adfaidh
t&uacute; leathanaigh simpl&iacute; t&eacute;acsbhunaithe a choth&uacute;
freisin tr&iacute; iad a chl&oacute; go d&iacute;reach isteach i bhfoirm.

<br /><br /></dd>
<dt>
<b>Tr&aacute;th na gCeist</b></dt>

<dd>
Ligean an mod&uacute;l seo duit t&aacute;st&aacute;lacha i bhfoirm tr&aacute;th
na gceist a dhearadh agus a shocr&uacute;. Is f&eacute;idir ceisteanna
a bheith ilroghnacha, f&iacute;or-br&eacute;agach, n&oacute; le freagra&iacute;
gairide. Coinn&iacute;tear na ceisteanna seo i mbunachar sonra&iacute;
catag&oacute;irithe, agus is f&eacute;idir iad a ath&uacute;s&aacute;id
laistigh de ch&uacute;rsa n&oacute; fi&uacute; idir ch&uacute;rsa&iacute;.
Is f&eacute;idir iarrachta&iacute; iolracha a chead&uacute;. Marc&aacute;iltear
go huathoibr&iacute;och gach iarracht, agus is f&eacute;idir leis an m&uacute;inteoir
roghn&uacute; ar mian leo aiseolas n&oacute; na freagra&iacute; cearta
a thabhairt. T&aacute; &aacute;iseanna gr&aacute;d&aacute;la sa mod&uacute;l
seo.

<br /><br /></dd>
<dt>
<b>Suirbh&eacute;</b></dt>

<dd>
T&aacute; uirlis&iacute; r&eacute;amhshainithe suirbh&eacute; sa mod&uacute;l
suirbh&eacute; at&aacute; &uacute;s&aacute;ideach le do rang a mheas agus
a thuiscint. Faoi l&aacute;thair t&aacute; na huirlis&iacute; COLLES agus
ATTLS ina measc. Is f&eacute;idir iad a thabhairt do na mic l&eacute;inn
go luath sa ch&uacute;rsa mar uirlis dhiagn&oacute;iseach agus ag deireadh
an ch&uacute;rsa mar uirlis meast&oacute;ireachta (bainimse leas as ceann
gach seachtain i mo chuidse c&uacute;rsa&iacute;).</dd>
</dl>
&nbsp;

<p>Tar &eacute;is duit do chuid gn&iacute;omha&iacute;ochta&iacute; a chur
isteach, f&eacute;adfaidh t&uacute; iad a bhogadh suas agus s&iacute;os
i leagan amach do ch&uacute;rsa r&iacute; chlice&aacute;il ar na saigheada
beaga (<img src="up.gif" height="10" width="9" alt="up" />&nbsp;<img src="down.gif" height="10" width="9" alt="down" />)
in aice le gach ceann. F&eacute;adfaidh t&uacute; iad a scrios freisin
tr&iacute; dheilbh&iacute;n na croise a &uacute;s&aacute;id&nbsp;<img src="delete.gif" height="10" width="10" alt="delete" />,
agus iad a atheagr&uacute; tr&iacute; an deilbh&iacute;n eagarth&oacute;ireachta
a chlice&aacute;il&nbsp;<img src="edit.gif" height="11" width="10" alt="edit" />.</p>

<p>&nbsp;</p></blockquote>

<h3 class="sectionheading">
<a name="course"></a>Ag rith an ch&uacute;rsa</h3>

<blockquote>T&aacute; plean m&oacute;r againn cur leis an doicim&eacute;ad
seo le rang teagaisc cuimsitheach a dh&eacute;anamh de. Go dt&iacute; sin,
seo c&uacute;pla smaoineamh:
<ol>
<li>
Liost&aacute;il d'ainm leis na f&oacute;raim ar fad le go mbeidh teagmh&aacute;il
rialta agat le gn&iacute;omha&iacute;ocht do ranga.</li>

<li>
Spreag do mhic l&eacute;inn le go l&iacute;onaid&iacute;s isteach a bpr&oacute;if&iacute;l
&uacute;s&aacute;ideora (grianghrafanna san &aacute;ireamh) agus l&eacute;igh
iad ar fad - cabhr&oacute;idh s&eacute; seo le comhth&eacute;acs a thabhairt
don mh&eacute;id a scr&iacute;obhann siad ar ball, agus cuideoidh s&eacute;
leat freagairt ar chaoi at&aacute; oiri&uacute;nach d&aacute; riachtanais.</li>

<li>
Coinnigh n&oacute;ta&iacute; duit f&eacute;in i "bh<b>F&oacute;ram na M&uacute;inteoir&iacute;</b>"
(faoi Riarach&aacute;n) at&aacute; pr&iacute;obh&aacute;ideach. T&aacute;
s&eacute; seo an-&uacute;s&aacute;ideach i gc&aacute;s m&uacute;inteoireachta
bu&iacute;ne.</li>

<li>
&Uacute;s&aacute;id an nasc "<b>Loga&iacute;</b>" (faoi Riarach&aacute;n)
le rochtain a fh&aacute;il ar loga&iacute; amha, ioml&aacute;na. Istigh
ansin feicfidh t&uacute; nasc chuig fuinneog a uasdh&aacute;ta&iacute;onn
gach seasca soicind agus a thaispe&aacute;nann an uair an chloig dheiridh
gn&iacute;omha&iacute;ochta. T&aacute; s&eacute; &uacute;s&aacute;ideach
&eacute; seo a choinne&aacute;il ar oscailt ar do dheascar feadh anlae
le go n-aireoidh t&uacute; ceangal le gn&iacute;omha&iacute;ocht laeth&uacute;il
an ch&uacute;rsa.</li>

<li>
&Uacute;s&aacute;id na "<b>Tuairisc&iacute; Gn&iacute;omha&iacute;ochta</b>"
(in aice le gach ainm sa liosta daoine, n&oacute; &oacute; aon leathanach
pr&oacute;if&iacute;le &uacute;s&aacute;ideora). Bealach iontach iad seo
le feice&aacute;il c&eacute;ard at&aacute; ar bun ag aon duine ar leith
ar an gc&uacute;rsa.</li>

<li>
Tabhair freagra do do chuid mac l&eacute;inn go tapa. N&aacute; f&aacute;g
go dt&iacute; ar ball &eacute; - d&eacute;an l&aacute;ithreach &eacute;.
N&iacute; hamh&aacute;in go bhfuil s&eacute; &eacute;asca airecht&aacute;il
pl&uacute;chta leis an toirt a gintear, ach is gn&eacute; r&iacute;th&aacute;bhachtach
&eacute; de sprid agus s&oacute;dh chomhphobail a th&oacute;g&aacute;il
agus a choth&uacute; ar do ch&uacute;rsa.</li>
</ol>
&nbsp;</blockquote>

<h3 class="sectionheading">
<a name="further"></a>A thuilleadh eolais</h3>

<blockquote>M&aacute; bh&iacute;onn fadhb ar leith agat le do shu&iacute;omh,
ba cheart duit teagmh&aacute;il a dh&eacute;anamh le riarth&oacute;ir &aacute;iti&uacute;il
do shu&iacute;mh.

<p>M&aacute; t&aacute; smaointe iontacha agat faoi c&eacute;n chaoi le
feabhas a chur ar Moodle, n&oacute; fi&uacute; roinnt sc&eacute;alta maithe,
tar anoon go <a href="http://moodle.org/" target="_top">moodle.org</a>
agus buail linn ar an gc&uacute;rsa "<a href="http://moodle.org/course/view.php?id=5" target="_top">Using
Moodle</a>". Ba bhre&aacute; linn cloiste&aacute;il uait, agus is f&eacute;idir
leat cabhr&uacute; linn Moodle a fheabhs&uacute;.</p>

<p>M&aacute;s mian leat bheith rannph&aacute;irteach i gc&oacute;d&uacute;
mod&uacute;l nua, n&oacute; i scr&iacute;obh na ndoicim&eacute;ad, n&oacute;
i scr&iacute;obh altanna, d&eacute;an teagmh&aacute;il liomsa: <a href="http://moodle.org/user/view.php&amp;id=1&amp;course=1" target="_top">Martin
Dougiamas</a> n&oacute; brabhs&aacute;il an su&iacute;omh "rianaitheoir
fabhtanna" at&aacute; ag Moodle, ag <a href="http://moodle.org/bugs/" target="_top">moodle.org/bugs</a></p>

<p>Agus mar fhocal scoir, cuimhnigh na deilbh&iacute;n&iacute; cabhrach
a &uacute;s&aacute;id - seo <a href="../help.php?file=index.html" target="helpwindow">inn&eacute;acs
de na comhaid chabhrach ar fad i Moodle</a>.</p>


 <p align="center">Go raibh maith agat as Moodle a &uacute;s&aacute;id - agus go n-&eacute;ir&iacute;
le do chuid m&uacute;inteoireachta!</p>
  <hr />
  <p>&nbsp;</p>
</blockquote>
<p align="center"><font size="1"><a href="." target="_top">Doicim&eacute;id Moodle</a></font></p>
<p align="center"><font size="1">Version: $Id: teacher.html,v 1.4 2002/08/18 10:00:01
  martin Exp $</font></p>
</body>


</html>
