

<P>Moodle enth&auml;lt eine breite Strecke der T&auml;tigkeitsmodule, die benutzt werden k&ouml;nnen, um irgendeine Art selbstverst&auml;ndlich aufzubauen.</P>

<P><IMG VALIGN=absmiddle SRC="<?=$CFG->wwwroot?>/mod/forum/icon.gif"><B> Foren </B></P>
<UL>
<P>Diese T&auml;tigkeit kann das wichtigste sein - es ist hier, da&szlig; die meiste Diskussion stattfindet.  Foren k&ouml;nnen in den unterschiedlichen Weisen strukturiert werden, und k&ouml;nnen Gleichbewertung von bekanntgebendem jedem umfassen.  Die postings k&ouml;nnen in einer Vielzahl f&uuml;r Formate angesehen werden und k&ouml;nnen Zubeh&ouml;re mit einschlie&szlig;en.  Indem sie zu einem Forum unterzeichnen, empfangen Teilnehmer Kopien von jedem neue Eintragung in ihrem email.  Ein Lehrer kann Subskription jeder auferlegen, wenn sie zu w&uuml;nschen.</UL>

<P><IMG VALIGN=absmiddle SRC="<?=$CFG->wwwroot?>/mod/journal/icon.gif"><B> Journale </B></P>
<UL>
<P>Dieses Modul ist eine sehr wichtige reflektierende T&auml;tigkeit.  Der Lehrer bittet den Kursteilnehmer, sich auf einem bestimmten Thema zu reflektieren, und der Kursteilnehmer kann ihre Antwort &uuml;ber Zeit redigieren und verfeinern.  Diese Antwort ist privat und kann vom Lehrer nur gesehen werden, der R&uuml;ckgespr&auml;ch und ein anbieten kann Grad auf jedem Journaleintrag.  Es ist normalerweise eine gute Idee, ungef&auml;hr eine Journalt&auml;tigkeit pro Woche zu haben.</P>
</UL>

<P><IMG VALIGN=absmiddle SRC="<?=$CFG->wwwroot?>/mod/resource/icon.gif"><B> Betriebsmittel </B></P>
<UL>
<P>Betriebsmittel sind Inhalt:  Informationen, die der Lehrer in den Kurs holen m&ouml;chte.  Diese k&ouml;nnen die vorbereiteten Akten sein, die zum Kursbediener Antriebskraft sind;  Seiten redigiert direkt in Moodle;  oder externe Netzseiten gebildet, um zu erscheinen Teil dieses Kurses.</P>
</UL>

<P><IMG VALIGN=absmiddle SRC="<?=$CFG->wwwroot?>/mod/assignment/icon.gif"><B> Anweisungen </B></P>
<UL>
<P>Anweisungen erlauben dem Lehrer, eine Aufgabe zu spezifizieren, die Kursteilnehmer erfordert, digitalen Inhalt (irgendein Format) vorzubereiten und ihn einzureichen, indem es ihn beim Bediener hochl&auml;dt.  Typische Anweisungen umfassen Versuche, Projekte, Reports und so weiter.  Dieses Modul umfa&szlig;t ordnenden Service.</P>
</UL>

<P><IMG VALIGN=absmiddle SRC="<?=$CFG->wwwroot?>/mod/quiz/icon.gif"><B> Quiz </B></P>
<UL>
<P>Dieses Modul erlaubt dem Lehrer, die Quiztests zu entwerfen und einzustellen, besteht aus mehrfacher Wahl, zutreffend-falsch und kurze Antwortfragen.  Diese Fragen werden in einer kategorisierten Datenbank gehalten, und k&ouml;nnen innerhalb der Kurse wiederverwendet werden und gleichm&auml;&szlig;ig zwischen Kursen.  Quiz k&ouml;nnen mehrfache Versuche erlauben.  Jeder Versuch wird automatisch gekennzeichnet, und der Lehrer kann w&auml;hlen, ob man R&uuml;ckgespr&auml;ch gibt oder korrekte Antworten zeigt.  Dieses Modul umfa&szlig;t ordnenden Service.</P>
</UL>

<P><IMG VALIGN=absmiddle SRC="<?=$CFG->wwwroot?>/mod/choice/icon.gif"><B> Wahlen </B></P>
<UL>
<P>Eine Auswahlphase ist sehr einfach - der Lehrer stellt eine Frage und spezifiziert eine Wahl der mehrfachen Antworten.  Es kann als schnelle Abstimmung n&uuml;tzlich sein, das Denken an ein Thema anzuregen;  die Kategorie auf einer Richtung f&uuml;r den Kurs w&auml;hlen lassen;  oder Forschungszustimmung erfassen.</UL>

<P><IMG VALIGN=absmiddle SRC="<?=$CFG->wwwroot?>/mod/survey/icon.gif"><B> &Uuml;bersichten </B></P>
<UL>
<P>Das &Uuml;bersichtsmodul liefert eine Anzahl von &uuml;berpr&uuml;ften &Uuml;bersichtsinstrumenten, die n&uuml;tzlich im Festsetzen und im anregenden Lernen in den on-line-Klimas gefunden worden sind.  Lehrer k&ouml;nnen diese verwenden, um Daten von ihren Kursteilnehmern zu erfassen, die ihnen &uuml;ber, ihre Kategorie zu erlernen helfen und auf ihrem eigenen Unterricht sich zu reflektieren.</P>
</UL>


