<p align="center"><b>Lernaktivit&#228;ten</b></p>
<p>Moodle enth&#228;lt eine gro&#223;en Anzahl von
Lernaktivit&#228;ten, die benutzt werden k&#246;nnen um jegliche
Art von Kursen aufzubauen.</p>
<p><img src=
"http://moodle.org/mod/attendance/icon.gif"> <b>Anwesenheit</b></p>
<div style="margin-left: 2em">
<p>Dieses Modul erm&#246;glicht es Ihnen, die Teilnahme jedes
einzelnen Teilnehmers/Teilnehmerin f&#252;r jede einzelnen
Aufgabenstellung nachzuverfolgen.</p>
</div>
<p><img   src=
"http://moodle.org/mod/assignment/icon.gif"> <b>Aufgabe</b></p>
<div style="margin-left: 2em">
<p>Dieses Modul gibt die M&#246;glichkeit, Aufgaben an alle
Teilnehmer/innen zu richten. Die Kursteilnehmer/innen haben die
M&#246;glichkeit, die bearbeiteten Aufgaben in digitaler Form
einzureichen (z. B. Upload einer Textdatei). Es ist auch
m&#246;glich eine Offline-Aktivit&#228;t zu veranlassen bei der
keine Dokumente auf den Servern geladen werden m&#252;ssen. Mit
dem Aufgabenmodul wird z. B. die Bearbeitung von Versuchen,
Projekten, Reports und die Erstellung von Berichten veranlasst.
F&#252;r jede Aufgabe k&#246;nnen Bewertungskriterien festgelegt
werden.</p>
</div>
<p><img   src=
"http://moodle.org/mod/chat/icon.gif"> <b>Chat</b></p>
<div style="margin-left: 2em">
<p>Das Chatmodul erlaubt Teilnehmer/innen in Echtzeit online
miteinander zu diskutieren. Dies ist sinnvoll um einen direkten
Austausch zu einem bestimmten Thema zu erm&#246;glichen. Durch
diesen direkten Austausch kann sich das Verst&#228;ndnis der
Teilnehmer/innen untereinander verbessern und der Austausch zu
einem bestimmten Thema verbessert und intensiviert werden. Alle
Chatsitzungen werden in der Datenbank gespeichert k&#246;nnen
verwaltet und sp&#228;ter erneut eingesehen werden.</p>
</div>
<p><img   src=
"http://moodle.org/mod/dialogue/icon.gif"> <b>Dialog</b></p>
<div style="margin-left: 2em">
<p>Dieses Modul bietet eine einfache
Kommunikationsm&#246;glichkeit f&#252;r mehrere Benutzerpaare.
Ein/ Trainer/in kann einen Dialog mit einem/r Teilnehmer/in
beginnen und eine Teilnehmer/in kann einen Dialog mit einer/m
Trainer/in beginnen. Optional k&#246;nnen untereinander Diaoge
beginnen. Jede/r kann zugleich mehrere Dialoge f&#252;hren.</p>
</div>
<p><img   src=
"http://moodle.org/mod/label/icon.gif"> <b>Einleitung</b></p>
<div style="margin-left: 2em">
<p>Einleitung ist kein wirkliches Modul - es ist ein Modul,
welches als Platzhalter verwendet wird. Dadurch ist es
m&#246;glich, einen Text oder eine Grafik auf der Ebene der
anderen Module in den Kurs einzuf&#252;gen.</p>
</div>
<p><img   src=
"http://moodle.org/mod/forum/icon.gif"> <b>Forum</b></p>
<div style="margin-left: 2em">
<p>Dieses Modul ist sicherlich eins der wichtigsten Module in
moodle. Mit Hilfe der Foren finden die meisten Diskussionen
statt. Foren k&#246;nnen auf verschiedene Art und Weise
strukturiert sein und Bewertungen jedes einzelnen Beitrags
beinhalten. Die Beitr&#228;ge k&#246;nnen frei formatiert werden
und auch Datei-Anh&#228;nge einschlie&#223;en (z.B. PDF- Office-
ZIP- oder Bilddateien). Durch das Ver&#246;ffentlichen eines
Beitrages in einem Forum ist man f&#252;r dieses Forum
automatisch als Abonnent/in eingetragen. Dies bedeutet, dass man
ab sofort Kopien aller neuen Eintr&#228;ge des Forums per E-Mail
erh&#228;lt. Der/die Trainer/in hat die M&#246;glichkeit
Teilnehmer/innen auch manuell f&#252;r bestimmte Foren zu
abonnieren, wenn diese es w&#252;nschen oder f&#252;r den Kurs
als notwendig erscheint.</p>
</div>
<p><img   src=
"http://moodle.org/mod/glossary/icon.gif"> <b>Glossar
(W&#246;rterbuch)</b></p>
<blockquote>
<p>Das Glossar erlaubt den Teilnehmer/innen eine Liste von
Definitionen, vergleichbar mit einem W&#246;rterbuch, zu
erstellen und zu pflegen. Die Eintr&#228;ge k&#246;nnen in vielen
verschiedenen Formaten durchsucht und angeschaut werden. Das
Glossar erm&#246;glicht, dass Trainer/innen Eintr&#228;ge aus
einem Glossar in ein anderes (das Hauptglossar) innerhalb des
selben Kurs exportieren. Zu guter letzt ist es m&#246;glich,
automatische Verkn&#252;pfungen zu den Eintr&#228;gen innerhalb
des gesamten Kurses zu erstellen.</p>
</blockquote>
<p><img   src=
"http://moodle.org/mod/journal/icon.gif"> <b>Journal</b></p>
<blockquote>
<p>Das Journal dient in erster Linie als Modul zur Reflexion
zwischen Teilnehmer/innen und Trainer7innen. Der/die Trainer/in
bittet Kursteilnehmer/innen sich zu einem bestimmten Thema oder
einer Fragestellung zu &#228;u&#223;ern. Nur der/die Trainner/in
kann diese Antworten einsehen. Teilnehmer/innen k&#246;nnen die
Antworten sp&#228;ter ver&#228;ndern und verfeinern.
Trainer/innen k&#246;nnen auf jeden Journaleintrag ein Feedback
geben und somit im Verlauf der ver&#228;nderten und verfeinerten
Eintr&#228;ge des Teilnehmers eine reflektierende Entwicklung zu
begleiten. Es wird empfohlen, das Journal ca. einmal pro Woche zu
nutzen.</p>
</blockquote>
<p><img   src=
"http://moodle.org/mod/resource/icon.gif"> <b>Arbeitsunterlagen</b></p>
<blockquote>
<p>Mit Hilfe des Moduls "Arbeitsunterlagen" werden die Inhalte
wie Arbeitsmaterialien und Dokumente f&#252;r den Kurs
bereitgestellt. Es gibt verschiedene Formate in denen sie
bereitgestellt werden k&#246;nnen. Zum einen vorbereitete
Dokumente wie z. B. PDF, Office und &#228;hnliche Dokumente die
zuvor auf den Server geladen werden m&#252;ssen. Es besteht auch
die M&#246;glichkeit, Materialien im HTML Format bereitzustellen
und externe Web-Seiten in den Kurs zu verkn&#252;pfen. Eine Liste
den verschiedenen Formaten finden Sie <a href=
"%3C?php%20echo%20$CFG-%3Ewwwroot?%3E/help.php?module=resource&file=resourcetype.html"
target="_self">hier</a>.</p>
</blockquote>
<p><img   src=
"http://moodle.org/mod/quiz/icon.gif"> <b>Test/Quiz</b></p>
<blockquote>
<p>Quizze erlauben den Trainer/innen Tests zu entwerfen und
bereitzustellen. Tests k&#246;nnen <a href=
"%3C?php%20echo%20$CFG-%3Ewwwroot?%3E/help.php?module=quiz&file=questiontypes.html"
target="_self">verschiedene Frageformen</a> beinhalten. Die
einzelnen Fragen lassen sich in unterschiedlichen Kategorien
ablegen. Aus den erstellten Fragen kann dann ein Quiz
zusammengestellt werden. So lassen sich alle Fragen mehrfach und
in unterschiedlicher Zusammensetzung wiederverwenden. Quizze
k&#246;nnen mehrfache Versuche erlauben. Jeder Versuch wird
automatisch gespeichert. Der/die Trainer/in R&#252;ckantworten
definieren oder die richtigen Antworten zeigen lassen. F&#252;r
das Quizmodul k&#246;nnen Bewertungen festgelegt werden
(R&#228;nge).</p>
</blockquote>
<p><img   src=
"http://moodle.org/mod/exercise/icon.gif"> <b>&#220;bung</b></p>
<blockquote>
<p>Eine &#220;bung ist ein einfaches aber wirkungsvolles Modul
zur Bearbeitung von Aufgabenstellungen. In einer &#220;bung wird
der/die Teilnehmer/in aufgefordert selber eine Arbeit
anzufertigen. Dies kann ein Text, eine Pr&#228;sentation oder
eine Tabellenberechnung sein. Die/der Teilnehmer/in ist
aufgefordert nach der Fertigstellung, die eigene Arbeit selber zu
bewerten. Wenn er die eigene Arbeit und die Selbstbewertung an
den Lehrer weitergegeben hat, kann dieser beide Teile (Arbeit und
Selbstbewertung) bewerten. Der Lehrer kann dem/der Teilnehmer/in
ein Feedback geben und auffordern die Arbeit zu &#252;berarbeiten
und ggfs. wieder abzugeben.</p>
</blockquote>
<p><img   src=
"http://moodle.org/mod/survey/icon.gif"> <b>Umfrage</b></p>
<blockquote>
<p>Das Umfrage-Modul bietet eine Reihe gepr&#252;fter
Umfrageinstrumente (standardisiert), die als sinnvoll erachtet
werden, um das Lernen in Online-Umgebungen anzuregen und zu
&#252;berpr&#252;fen. Trainer/innen k&#246;nnen Daten von Ihren
Telnehmer/innen erheben, die Ihnen helfen, die Gruppe besser
kennenzulernen und ein Feedback auf ihren eigenen Lehrstil zu
erhalten. Momentan bietet Moodle <a href=
"%3C?php%20echo%20$CFG-%3Ewwwroot?%3E/help.php?module=moodle&file=surveys.html"
target="_self">folgende Umfragen</a> an.</p>
</blockquote>
<p><img   src=
"http://moodle.org/mod/choice/icon.gif"> <b>Wahl</b></p>
<blockquote>
<p>Bei der Wahl stellt der Lehrer eine Frage und gibt eine
Auswahl von mehreren Antworten. Dies kann f&#252;r ein schnelle
Umfrage sehr n&#252;tzlich sein, um z. B. von den Teilnehmer zu
erfahren wie sie sich den weiteren Verlauf des Kurses
w&#252;nschen bzw. vorstellen. Die Wahl ist ein sehr einfaches
Modul.</p>
</blockquote>
<p><img   src=
"http://moodle.org/mod/workshop/icon.gif"> <b>Workshop</b></p>
<blockquote>
<p>Ein Workshop ist eine Pr&#252;fungskonzeption mit einer
Vielzahl von Optionen, die variiert werden k&#246;nnen. Es
erlaubt den Teilnehmer/innen sich gegenseitig mit den Arbeiten zu
bewerten. Genauso k&#246;nnen &#220;bungsprojekte in
vielf&#228;ltiger Weise bewertet werden. Das Modul organisiert
die Sammlung und Verteilung der zu bewertenden Arbeiten. Das
Workshop-Modul wurde von Ray Kingdon entwickelt.</p>
</blockquote>