

<p align=center style='text-align:center;mso-outline-level:1'><b>Vorhandene Bewertungen</b></p>

<p class=MsoNormal>Momentan bietet Moodle nur spezielle Arten von Bewertungen
an (zuk&uuml;nftige Versionen werden dagegen selbsterstellte Bewertungen erlauben)</p>

<p class=MsoNormal>Die verf&uuml;gbaren Bewertungen sind so gew&auml;hlt worden, um
m&ouml;glichst n&uuml;tzlich f&uuml;r die Auswertung von Online-Lern-Umgebungen zu sein, die diese
aufbauende P&auml;dagogik nutzen. Sie sind n&uuml;tzlich, bestimmte Tendenzen zu erkennen,
die sich unter Ihren Teilnehmern entwickeln k&ouml;nnen. </p>

<p class=MsoNormal>Eine Ver&ouml;ffentlichung in englischer Sprache, wo dies f&uuml;r detaillierte
Analysen benutzt wurde, findet man unter folgender URL: <a
href="http://dougiamas.com/writing/herdsa2002" target=paper>http://dougiamas.com/writing/herdsa2002</a></p>


<div class=MsoNormal align=center style='text-align:center'>

<hr size=2 width="100%" align=center>

</div>


<p style='mso-outline-level:1'><b>COLLES - Constructivist On-Line Learning
Environment Survey ( Konstruktivische Bewertung der Online-Lern-Umgebung)</b></p>

<p style='margin-left:36.0pt'>Colles enth&auml;lt 24 &ouml;konomische Aussagen, die in 6
Gruppen eingeteilt werden, jede davon hilft uns die Qualit&auml;t einer
Online-Lern-Ungebung zu hinterfragen:</p>

<table border=0 cellspacing=10 cellpadding=0 style='mso-cellspacing:7.5pt;
 margin-left:36.0pt;mso-padding-alt:7.5pt 7.5pt 7.5pt 7.5pt'>
 <tr>
  <td valign=top style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>Bedeutung</p>
  </td>
  <td style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>Wie bedeutend ist das Online-Lernen f&uuml;r die Berufspraxis
  der Studenten?</p>
  </td>
 </tr>
 <tr>
  <td valign=top style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>Widerspiegelung </p>
  </td>
  <td style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>Stimuliert das Online-Lernen das studentische kritisch-reflektive
  Denken?</p>
  </td>
 </tr>
 <tr>
  <td valign=top style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>Interaktivit&auml;t </p>
  </td>
  <td style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>In welchem Ma&szlig;e engagieren sind Studenten online in
  Bildungs-Dialogen?</p>
  </td>
 </tr>
 <tr>
  <td valign=top style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>Lehrer Unterst&uuml;tzung </p>
  </td>
  <td style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>Wie gut erm&ouml;glichen es Lehrer den Studenten, online am
  Lernen teilzunehmen? </p>
  </td>
 </tr>
 <tr>
  <td valign=top style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>Gruppenunterst&uuml;tzung</p>
  </td>
  <td style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>Wird von Komilitonen eine feinf&uuml;hlige und anspornende Unterst&uuml;tzung
  gegeben?</p>
  </td>
 </tr>
 <tr>
  <td valign=top style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal><span lang=EN-GB style='mso-ansi-language:EN-GB'>Interpretation
  <o:p></o:p></span></p>
  </td>
  <td style='padding:7.5pt 7.5pt 7.5pt 7.5pt'>
  <p class=MsoNormal>Haben Studenten und Lehrer einen guten Sp&uuml;rsinn f&uuml;r die
  gegenseitige Online-Kommunikation?<span lang=EN-GB style='mso-ansi-language:
  EN-GB'><o:p></o:p></span></p>
  </td>
 </tr>
</table>

<p style='margin-left:36.0pt'>Das dynamische Wesen des Lernens zu untermauern
ist eine neue Theorie des Wissens: Sozialkonstruktivismus, welcher den
Lernenden als einen aktiven, begrifflich Denkenden innerhalb einer gesellschaftlich
wechselwirkenden Lernumgebung darstellt. Gesellschaftlicher Konstrukivismus ist
eine Erkenntnistheorie oder eine Art des Wissens, bei der Lernende denkend
zusammenarbeiten, um gemeinsam neue Erkenntnisse zu erarbeiten, vor allem im Zusammenhang
der gegenseitigen Hinterfragung und begr&uuml;ndet durch pers&ouml;nliche Erfahrung. </p>

<p style='margin-left:36.0pt'>Mittelpunkt dieser Zusammenarbeit ist die
Entwicklung der kommunikativen Kompetenz der Kursteilnehmer, d.h. die F&auml;higkeit
sich in einer offenen und kritischen Diskussion mit dem Lehrer und den
Kommilitonen zu engagieren. Diese Gespr&auml;che sind gekennzeichnet durch eine
einf&uuml;hlsame Erfassung der Situation und durch ein gegenseitiges Verst&auml;ndnis und
eine kritische Einstellung zu den zu pr&uuml;fenden Annahmen. </p>

<p style='margin-left:36.0pt'>COLLES ist entworfen worden, um Ihnen zu gestatten
die M&ouml;glichkeiten zu erfassen, welche die interaktive Kapazit&auml;t des World Wide
Web zur Engagierung von Studenten in dynamischen Lern-Aktivit&auml;ten bietet. </p>

<p style='margin-left:36.0pt'>(Diese Informationen sind der COLLES-Webseite
entnomen worden . Mehr &uuml;ber COLLES und den Autor k&ouml;nnen Sie unter: <a
href="http://surveylearning.com/colles/" target=paper>http://surveylearning.com/colles/</a>
in englische Sprache erfahren.)</p>


<div class=MsoNormal align=center style='text-align:center'>

<hr size=2 width="100%" align=center>

</div>


<p style='mso-outline-level:1'><b>ATTLS - Attitudes to Thinking and Learning
Survey &#8211; Einstellung zur Denk-und Lern-Bewertung<o:p></o:p></b></p>

<p style='mso-outline-level:1'><![if !supportEmptyParas]>&nbsp;<![endif]><o:p></o:p></p>

<p style='margin-left:36.0pt'>Die Theorie der &#8220;Arten des Denkens&#8221;, urspr&uuml;nglich
stammend aus der Sph&auml;re der Geschlechtsforschung (Belenky et al., 1986)
versorgt uns mit einem Bewertungswerkzeug, um die Qualit&auml;t der Gespr&auml;che
innerhalb einer Gemeinschaft zu &uuml;berpr&uuml;fen. <span style="mso-spacerun:
yes">&nbsp;</span></p>

<p style='margin-left:36.0pt'>Die Einstellung gegen&uuml;ber Denk- und
Lernbewertungen (ATTLS) sind ein Instrument, entwickelt von Galotti et al. (1999),
um die Art zu messen, welche eine Person ist: Ein mit anderen verbundener Wissender
(CK) oder ein separater Wissender (SK). </p>

<p style='margin-left:36.0pt'>Leute mit h&ouml;heren CK-Mengen neigen dazu, Lernen erfreulich
zu finden, und sind oft kooperativer, symphatisch und bereiter, ihre Ideen
anderen zu vermitteln, w&auml;hrend solche mit h&ouml;heren SK-Eigenschaften dazu
tendieren, eine kritischere und argumentative Position zum Lernen einzunehmen.</p>

<p style='margin-left:36.0pt'>Studien haben gezeigt, da&szlig; diese zwei Lernarten voneinander
unabh&auml;ngig sind (Galotti et al., 1999; Galotti et al., 2001). Au&szlig;erdem sind sie
nur eine Widerspiegelung der Einstellung zum Lernen und kein Indiz f&uuml;r
Lern-Leistungsverm&ouml;gen oder die intellektuelle Kraft. </p>

<p style='margin-left:36.0pt'><i><span lang=EN-GB style='mso-ansi-language:
EN-GB'>Belenky, M. F., Clinchy, B. M., Goldberger, N. R., &amp; Tarule, J. M.
(1986). Women's Ways of Knowing: The Development of Self, Voice, and Mind. New
York: Basic Books, Inc. </span></i><span lang=EN-GB style='mso-ansi-language:
EN-GB'><o:p></o:p></span></p>

<p style='margin-left:36.0pt'><i><span lang=EN-GB style='mso-ansi-language:
EN-GB'>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., &amp;
Mansfield, A. F. (1999). A New Way of Assessing Ways of Knowing: The Attitudes
Towards Thinking and Learning Survey (ATTLS). Sex Roles, 40(9/10), 745-766.</span></i><span
lang=EN-GB style='mso-ansi-language:EN-GB'><o:p></o:p></span></p>

<p style='margin-left:36.0pt'><i><span lang=EN-GB style='mso-ansi-language:
EN-GB'>Galotti, K. M., Reimer, R. L., &amp; Drebus, D. W. (2001). Ways of
knowing as learning styles: Learning MAGIC with a partner. </span>Sex Roles,
44(7/8), 419-436.</i></p>

</div>

</body>

</html>