<p align="center"><b>Envoyer une image</b></p>

<p>Il est possible d'envoyer vers ce site une image pr&eacute;sente sur votre
   ordinateur. Cette image sera utilis&eacute;e &agrave;
   diff&eacute;rents endroits pour vous repr&eacute;senter, par exemple
   sur chaque message que vous posterez dans les forums.</p>

<p>&Agrave; cet effet, il est pr&eacute;f&eacute;rable d'utiliser une photo
   qui cadre votre visage d'assez pr&egrave;s. L'utilisation d'une
   photo personnelle rend plus r&eacute;el les &eacute;changes dans les
   forums. Vous pouvez utiliser toutefois n'importe quelle image.
   Dans tous les cas, le fichier doit &ecirc;tre au format JPEG ou PNG
   (g&eacute;n&eacute;ralement son nom se termine alors par
   &laquo;&nbsp;.jpg&nbsp;&raquo; ou &laquo;&nbsp;.png&nbsp;&raquo;). Pour obtenir
   cette image, vous pouvez utiliser l'une des m&eacute;thodes suivantes&nbsp;:
<ol>
<li>utiliser un appareil photo num&eacute;rique. Dans ce cas vos
    photos devraient se trouver sur votre ordinateur au
    bon format&nbsp;;</li>
<li>digitaliser une photo papier avec un scanner (choisissez
    le format JPEG ou PNG)&nbsp;;</li>
<li>si vous avez des dons artisitiques, vous pouvez dessiner
    une image avec un logiciel de dessin sur ordinateur&nbsp;;</li>
<li>enfin, vous pouvez utiliser une image t&eacute;l&eacute;charg&eacute;e sur le Web.
    Le site <a target="google" href="http://images.google.fr/">http://images.google.fr</a>
    est l'endroit indiqu&eacute; pour trouver des images (une fois que vous avez
    trouv&eacute; l'image qui vous pla&icirc;t, cliquez dessus avec le bouton
    droit de la souris pour choisir l'option &laquo;&nbsp;Enregistrer
    l'image&nbsp;&raquo; dans le menu qui appara&icirc;t).</li>
</ol></p>

<p>Pour envoyer l'image, cliquez sur le bouton &laquo;&nbsp;Parcourir...&nbsp;&raquo;
   dans le formulaire et s&eacute;lectionnez l'image sur le disque de votre ordinateur.
   Cliquez ensuite sur le button &laquo;&nbsp;Enregistrer mon profil&nbsp;&raquo; en bas de la
   page. L'image sera redimensionn&eacute;e en un carr&eacute; de 100x100 pixels.</p>

<p>Lorsque vous reviendrez sur la page de votre profil, il se
   peut que l'image ne soit pas mise &agrave; jour. Dans ce cas utilisez le
   bouton &laquo;&nbsp;Actualiser&nbsp;&raquo; de votre navigateur.</p>
