<p align="center"><b>Poser de bonnes questions</b></p>

<p>Poser des questions est une bonne m&eacute;thode pour amener les gens
&agrave; r&eacute;fl&eacute;chir sur un sujet. Quand on vous pose une
bonne question, cela vous permet de synth&eacute;tiser votre
pens&eacute;e, d'&eacute;valuer les id&eacute;es existantes et d'en
cr&eacute;er d'autres.</p>

<p>On appelle <i>questionnement socratique</i> la technique didactique
o&ugrave; l'on pose des questions dans le but d'aider les autres
&agrave; apprendre. Cette d&eacute;nomination provient de la
fa&ccedil;on d'enseigner de Socrate, au Ve si&egrave;cle avant notre
&egrave;re.</p>

<p>Le questionnement socratique exige d'&eacute;couter tr&egrave;s
attentivement l'interlocuteur pour vous permettre de formuler une
question constructive qui permette de l'aider sans le braquer.</p>

<p>Voici quelques exemples de telles questions</i></p>

<h3>Questions de clarification</h3>
<ul>
  <li>Qu'entendez vous par _____ ?</li>
  <li>Quelle est votre difficult&eacute; principale ?</li>
  <li>Quel est le lien entre _____ et _____ ?</i>
  <li>Vous est-il possible de reformuler ?</li>
  <li>Je ne suis pas s&ucirc;r de bien vous comprendre ; voulez-vous dire que _____ ou bien que _____ ?</li>
  <li>De quelle mani&egrave;re est-ce en relation avec notre probl&egrave;me/discussion ?</li>
  <li>Jeanne, pouvez-vous r&eacute;sumer avec vos propres termes ce qui Pierre a dit ? ... Pierre, est-ce ce que vous avez voulu dire ?</li>
  <li>Pourriez-vous me donner un exemple ?</li>
  <li>Est-ce que ceci conviendrait comme exemple : _____ ?</li>
</ul>
<h3>Questions sur les hypoth&egrave;ses</h3>
<ul>
  <li>Que supposez-vous ?</li>
  <li>Que suppose Jeanne ?</li>
  <li>Quelle supposition pourrions-nous faire &agrave; la place ?</li>
  <li>Il semble que vous supposez que _____. Est-ce que je vous comprends correctement?</li>
  <li>Tout votre raisonnement d&eacute;pend de l'id&eacute;e que _____. Pourquoi avez-vous bas&eacute; votre raisonnement sur _____ plut&ocirc;t que sur _____?</li>
  <li>Il semble que vous supposez que _____. Qu'est-ce qui vous fait penser que c'est vrai ?</li>
  <li>Is that always the case? Why do you think the assumption holds here?</li>
  <li>Pourquoi pourrait-on faire une telle supposition ?</li>
</ul>
<h3>Questions sur les raisons et les preuves</h3>
<ul>
  <li>Pouvez-vous nous expliquer vos raisons ?</li>
  <li>Comment ceci s'applique &agrave; notre cas ?</li>
  <li>Y a-t-il une raison de douter de cet argument ?</li>
  <li>Qui pourrait savoir si cela est vrai ?</li>
  <li>Que pourriez-vous r&eacute;pondre &agrave; une personne qui dit que ____?</li>
  <li>Quelqu'un d'autre peut-il donner un argument qui conforte cette opinion ?</li>
  <li>Par quel raisonnement &ecirc;tes-vous arriver &agrave; cette conclusison ?</li>
  <li>Comment pourriez-vous d&eacute;couvrir si cela est vrai ? </li>
</ul>
<h3>Questions sur les opinions ou les points de vue</h3>
<ul>
  <li>Qu'en concluez-vous ?</li>
  <li>Quand vous dites _____, en concluez-vous que _____?</li>
  <li>Si cela se passait, quelles en seraient les cons&eacute;quences ? Pourquoi ?</li>
  <li>Quel effet cela pourrait-il avoir ?</li>
  <li>Est-ce que ceci surviendrait n&eacute;cessairement ou seulement probablement/peut-&ecirc;tre ?</li>
  <li>Y a-t-il une alternative ?</li>
  <li>Si _____ et _____ sont av&eacute;r&eacute;s, qu'est-ce qui pourrait aussi &ecirc;tre vrai ?</li>
  <li>Si l'on dit que ce ____ est &eacute;thique, qu'en est-il de _____? </li>
</ul>
<h3>Questions sur les implications et des cons&eacute;quences</h3>
<ul>
  <li>Comment peut-on d&eacute;couvrir que _____ ?</li>
  <li>Dans cette question, quelle supposition fait-on ?</li>
  <li>Est-ce que _____ poserait cette question diff&eacute;remment ?</li>
  <li>Comment pourrait-on am&eacute;liorer cette question ?</li>
  <li>Pouvons-nous enti&egrave;rement d&eacute;composer cette question ?</li>
  <li>Cette question est-elle claire ? Est-ce que nous la comprenons ?</li>
  <li>Est-il facile ou difficile de r&eacute;pondre &agrave; cette question ? Pourquoi ?</li>
  <li>Sommes-nous tous d'accord que c'est l&agrave; la question ?</li>
  <li>Avant de r&eacute;pondre &agrave; cette question, &agrave; quelles autres questions devrions-nous r&eacute;pondre d'abord ?</li>
  <li>Comment _____ exposerait ce sujet ?</li>
  <li>Pourquoi ce sujet est-il important ?</li>
  <li>Est-ce la question la plus importante, ou y a-t-il une question sous-jacente ?</li>
  <li>Pouvez-vous voir en quoi cela pourrait &ecirc;tre li&eacute; &agrave; ________ ?</li>
</ul>

<hr>
<font size="1"><i>Questions adapt&eacute;es de from Paul, R. (1993). Critical Thinking: How To Prepare Students for a Rapidly Changing World: Foundation for Critical Thinking, Santa Rosa, CA. </i></font>

<p align=right><a href="help.php?file=writing.html">Plus d'informations sur l'&eacute;criture de textes</a></p>
<p align=right><a href="help.php?file=reading.html">Plus d'informations sur la lecture de textes</a></p>