<p align="center"><b>Formatage d'un texte</b></p>

<p>Lorsque vous saisissez du texte dans Moodle, vous pouvez choisir entre plusieurs formats en fonction de votre expertise et du type de navigateur utilis&eacute;.</p>

<p><b>La plupart du temps, le format par d&eacute;faut produira les r&eacute;sultats attendus.</b>.</p>

<p><b>1. Format Moodle</b></p>

<ul>
<p>Ce format est pr&eacute;f&eacute;rable &agrave; l'&eacute;diteur WYSIWYG int&eacute;gr&eacute; lorsque vous entrez du texte dans un formulaire standard sur une page Web. &Eacute;crivez normalement votre texte comme si c'&eacute;tait un courriel.</p>
<p>Moodle effectuera certaines transformations lorsque vous sauvegarderez votre texte.</p>
<p>Moodle ajoutera automatiquement des balises HTML n&eacute;cessaires pour que&nbsp;:</p>
<p>Les adresses URL, par exemple <a href="http://moodle.org/">http://moodle.org/</a> et <a href="http://www.etoile-des-enfants.ch/">www.etoile-des-enfants.ch</a> seront transform&eacute;es en liens hypertextes.</p>
<p>Les changements de ligne et les lignes vides seront conserv&eacute;es.</p>
<p>Les binettes, par exemple :-), seront remplac&eacute;es par leurs &eacute;quivalents graphiques.</p>
<p>Vous pouvez ins&eacute;rer du code HTML, qui sera interpr&eacute;t&eacute; correctement.</p>
<p align="right"><a href="help.php?file=text.html">Informations suppl&eacute;mentaires sur le format Moodle</a></p>
</ul>


<p><b>2. Format HTML</b></p>

<ul>
<p>Ce format est le format des pages Web. Il est constitu&eacute; de texte et de balises HTML. Il est utilis&eacute; par d&eacute;faut par l'&eacute;diteur WYSIWYG int&eacute;gr&eacute;. Les boutons de la barre d'outils produisent automatiquement le code HTML pour vous.</p>
<p>Si vous n'utilisez pas l'&eacute;diteur WYSIWYG int&eacute;gr&eacute;, vous pouvez saisir directement le code HTML pour obtenir le r&eacute;sultat d&eacute;sir&eacute;.</p>
<p>Il n'y a aucun formatage automatique comme dans le format automatique de Moodle. </p>
<p align="right"><a href="help.php?file=html.html">Informations suppl&eacute;mentaires sur le code HTML dans Moodle</a></p>
<p align="right"><a href="help.php?file=richtext.html">Informations suppl&eacute;mentaires sur l'&eacute;diteur WYSIWYG int&eacute;gr&eacute;</a></p>
</ul>


<p><b>3. Format texte</b></p>

<ul>
<p>Utilisez ce format lorsque vous avez beaucoup de code ou de balises HTML &agrave; &eacute;crire. Seuls les espaces et les retours &agrave; la ligne seront produits automatiquement. Tout le reste ne sera pas format&eacute;.</p>
</ul>


<p><b>4. Format Wiki</b></p>
<ul>
<p>Ce format utilise pour le formatage du texte des codes simplifi&eacute;s&nbsp;; il est connu sous le nom de Texte Wiki.</p>
<p>Les textes Wiki demeurent tr&egrave;s lisibles malgr&eacute; les codes employ&eacute;s pour les formater. Ces codes seront automatiquement convertis en balises HTML pour la g&eacute;n&eacute;ration des listes, des ent&ecirc;tes et autres formatages complexes.</p>

<p align="right"><a href="help.php?file=wiki.html">Informations suppl&eacute;mentaires sur le format Wiki</a></p>
</ul>