<P ALIGN=CENTER><B>Analisi delle valutazioni</B></P>
<P>Questa analisi riguarda le valutazioni fatte sugli esempi e quelle fatte durante la fase di valutazione reciproca del lavoro di gruppo. Essa cerca di individuare le valutazioni migliori nell'insieme di tutte quelle fatte dal docente e dai partecipanti. Queste valutazioni &quot;migliori&quot; sono poi utilizzate nel calcolo delle votazioni finali.</p>
<p>L'analisi si realizza meglio se sono presenti valutazioni del docente. Queste possono essere utilizzate come riferimenti rispetto ai quali giudicare le valutazioni dei partecipanti. Non c'&egrave; bisogno che  docente valuti ogni esempio e ogni lavoro, ma affinch&eacute; l'analisi sia significativa &egrave; meglio avere un numero di valutazioni del docente maggiore della media del numero di valutazioni fatte dai partecipanti. E pi&ugrave; sono le valutazioni del docente pi&ugrave; affidabile pu&ograve; essere il risultato dell'analisi.</p>
<p>L'analisi pu&ograve; essere ripetuta pi&ugrave; volte, ogni volta cambiando uno o pi&ugrave; opzioni. L'analisi &egrave; controllata da tre opzioni che appaiono in testa alla pagina.</p>
<ol><li>Il <B>coefficiente delle valutazioni del docente</B> definisce il peso da dare a tali valutazioni in confronto a quelle dei partecipanti nella fase di analisi degli errori. Se  docente vuole che la propria strategia di valutazione domini quella dei partecipanti, allora lui deve essere, tra tutti, quello con il pi&ugrave; basso &quot;Errore medio&quot; nella &quot;Tabella errori&quot;. Se  docente non risulta in testa a tale tabella, allora il suo coefficiente delle valutazioni &egrave; incrementato fino a che il suo errore medio &egrave; il minore di tutti. Di conseguenza le valutazioni del docente sono dominanti. I partecipanti che votano come  docente si ritrovano nella parte alta della Tabella errori. Invece i partecipanti elencati nella parte bassa sono quelli che valutano in un modo differente da quello del docente e dei partecipanti elencati in testa. Pi&ugrave; sono le valutazioni del docente, pi&ugrave; &egrave; probabile che questa opzione non deve essere utilizzata per forzare lo stesso in testa alla tabella. Da notare che tale opzione non definisce un peso da dare alle valutazioni del docente quando vengono calcolati i voti finali. In tale calcolo le valutazioni del docente hanno lo stesso peso di quelle dei partecipanti. Cos&igrave;, per esempio, se il lavoro di un partecipante &egrave; valutato al 41% dal docente e al 45% e 55% da due partecipanti, il voto finale del lavoro &egrave; (41% + 45% + 55%) / 3 = 47%.</li>
<li>Il <B>coefficiente della capacit&agrave; di valutazione</B> &egrave; usato nel calcolo dei voti finali. Una semplice formula &egrave; usata per calcolare la &quot;capacit&agrave; di valutazione&quot; di un partecipante. E' il rapporto di &quot;buone&quot; valutazioni fatte rispetto al massimo numero di quelle che pu&ograve; fare. Cos&igrave;, per esempio, se il compito richiede che il partecipante faccia tre valutazioni del lavoro di esempio e 5 valutazioni degli altri lavori, e lo stesso effettua sette valutazioni di cui una &egrave; scartata dall'analisi (vedi sotto), allora la sua capacit&agrave; di valutazione &egrave; (7 - 1)/8, cio&egrave; 75%. Il voto finale del compito &egrave; una combinazione pesata di questa capacit&agrave; di valutazione e del voto migliore (se ha inviato pi&ugrave; volte il lavoro) che lo stesso compito ha ricevuto. Il peso del voto di un lavoro &egrave; sempre 1. Cos&igrave; se si imposta questo coefficiente, per esempio, a 0,5, questo significa che la capacit&agrave; di valutazione avr&agrave; per il voto finale un valore (peso) met&agrave; del valore del voto del compito.</li>
<li>La <B>percentuale di valutazioni da eliminare</B> determina il numero di valutazioni che devono essere escluse nel calcolo del voto finale. Questo numero pu&ograve; essere impostato in uno dei seguenti due modi.
<ul>
<li>Dato il modo in cui la Capacit&agrave; di valutazione &egrave; calcolata, ogni partecipante, se valuta tutti i lavori che gli vengono assegnati, pu&ograve; raggiungere il massimo dei punti (per questo elemento), se non viene scartata alcuna sua valutazione. Se  docente desidera avere un valore medio pi&ugrave; ragionevole, impostando, per esempio, questa opzione al 30%, far&agrave; in modo che la media delle capacit&agrave; di valutazione sia di circa il 70% (ammesso che tutti i partecipanti hanno valutato tutti i lavori loro assegnati).</li>
<li>Altrimenti il numero di valutazioni da scartare pu&ograve; essere impostato in modo da contenere in un valore ragionevole gli Errori medi (riportati nella quarta colonna della Tabella errori). Per esempio, si potrebbe desiderare che tutte le valutazioni dei partecipanti ricadano (in media) in un intervallo del 20%. Quindi l'analisi &egrave; ripetuta pi&ugrave; volte aggiustando il numero di valutazioni da scartare fino a che i valori in questa colonna stiano entro un limite particolare. 
</ul>
</ol>
<p>Oltre alla Tabella errori l'Analisi elenca, nella Tabella voti, i giudizi di tutte le valutazioni e i voti finali dati ai partecipanti. Questa tabella deve essere verificata per controllare che i risultati siano ragionevoli. In particolare se sono scartate molte valutazioni alcuni lavori potrebbero rimanere non valutati e il voto finale del partecipante risulterebbe troppo basso. L'analisi riporta il numero dei lavori inviati all'inizio della pagina e subito prima della tabella dei voti. Questi due numeri dovrebbero essere uguali. Se risultano uno o pi&ugrave; lavori non valutati e  docente non vuole diminuire il numero di valutazioni da scartare allora quei lavori dovrebbero essere valutati dal docente e l'analisi ripetuta. E' importante che tutti i lavori siano valutati almeno una volta nella fase finale dell'analisi, cio&egrave; quando sono calcolati i voti finali.</p>
<p>C'&egrave; un equilibrio tra il numero di valutazioni scartate e il voto generale finale. Pi&ugrave; sono le valutazioni scartate pi&ugrave; &egrave; probabile che il voto finale sia basso. Comunque, se le cattive valutazioni non vengono scartate, i partecipanti potrebbero lamentarsi della qualit&agrave; delle valutazioni stesse che hanno determinato il voto del proprio lavoro. Ammesso che ci siano sufficienti valutazioni da parte del docente da dominare l'analisi senza troppe forzature, potrebbe sembrare ragionevole scartare tra il 15% e il 30% delle valutazioni.</p>
<p>Da notare che questa analisi pu&ograve; durare un p&ograve; di tempo in quanto prevede un processo iterativo. Bisogna aspettarsi tempi di risposta abbastanza lunghi.</p>
