<P ALIGN=CENTER><B>Calcolo del voto finale</B></P>
<P>La tabella di questa pagina mostra come viene calcolato il voto finale dei partecipanti. Tale voto &egrave; il risultato della somma pesata di massimo cinque componenti.
	
<OL>
<LI>Il voto del docente per il lavoro inviato. Questo &egrave; opzionale e sar&agrave; utilizzato se  docente effettivamente valuta il lavoro dei partecipanti. Se questi inviano pi&ugrave; di un lavoro, nel calcolo verr&agrave; usato il voto &quot;migliore&quot; dove migliore significa il lavoro col valore pi&ugrave; alto della combinazione del voto del docente e del voto medio degli altri partecipanti.
<LI>La media dei voti degli altri partecipanti espressi sul lavoro inviato. Anche qui se un partecipante invia pi&ugrave; di un lavoro, verr&agrave; preso il voto &quot;migliore&quot;. Il voto degli altri pu&ograve; eventualmente includere il voto del docente. Questo sar&agrave; preso in considerazione, se il numero dei voti degli altri &egrave; molto basso o se si pensa che gli altri voti non siano sicuri o per un difetto di soglia (di solito verso l'alto) o per mancanza di affidabilit&agrave;. Se incluso, nel calcolo della media, il voto del docente &egrave; trattato nello stesso modo di un voto di un partecipante.
<LI>Il valore di soglia dei voti su un lavoro da parte dei partecipanti. Questo numero rappresenta la misura di quanto i voti degli altri sono &quot;spostati&quot; troppo verso l'alto o troppo verso il basso. Non &egrave; una misura assoluta perch&eacute; &egrave; basata sulla differenza tra il voto di un partecipante e le medie dei voti per ognuno dei lavori che vengono valutati. In genera a questa componente non dovrebbe essere dato un peso troppo alto.
<LI>Il grado di affidabilit&agrave; dei partecipanti nel valutare i lavori. Questo numero &egrave; la misura di quanto la valutazione di un partecipante &egrave; vicina alla media delle valutazioni degli altri sullo stesso lavoro. Questo riduce il valore di soglia e media le differenze tra i voti di un partecipante e le medie dei voti degli altri. In teoria, se i partecipanti assegnano voti alti a lavori buoni e voti bassi a lavori cattivi, allora la loro affidabilit&agrave; &egrave; alta. Se c'&egrave; il sospetto che i partecipanti in generale non sono abili valutatori, allora nelle medie dovrebbe essere incluso il voto del docente e questo dovrebbe rendere i valori di affidabilit&agrave; pi&ugrave; significativi.
<LI>Il voto medio dato dal docente alle valutazioni dei partecipanti. Questo comprende sia le valutazioni preliminari fatte sugli esempi di lavoro del docente sia le valutazioni fatte dal docente stesso dei giudizi dati dai partecipanti durante la fase di valutazione del compito.
In generale questa componente &egrave; probabilmente pi&ugrave; importante sia di quella sul valore di soglia che di quella sull'affidabilit&agrave; e quindi, se presente, dovrebbe avere un peso maggiore.
</OL>
<P>A queste cinque componenti pu&ograve; essere assegnato un peso come ritenuto pi&ugrave; opportuno per il compito assegnato. Per esempio il voto del docente pu&ograve; pesare maggiormente, se la componente relativa alla valutazione reciproca non &egrave; considerata molto importante nell'ambito del lavoro di gruppo assegnato. Invece, se  docente valuta solamente pochi lavori, i suoi voti possono essere completamente ignorati dando loro un peso 0 (zero). Se il compito &egrave; tutto sulle capacit&agrave; dei partecipanti di giudicare e di commentare i lavori, allora il peso delle prime due componenti pu&ograve; essere impostato a 0 (zero) o basso e le capacit&agrave; di valutare dei partecipanti determineranno i voti finali.
<P>Da notare che questa pagina pu&ograve; essere usata iterativamente mentre i voti finali non sono ancora visualizzabili dai partecipanti. Quando  docente sar&agrave; soddisfatto dei voti finali e dei pesi applicati, allora i voti stessi potranno essere accessibili ai partecipanti al gruppo di lavoro.</P>
