<p align="center"><span style="font-weight: bold;">Sz&#369;r&#337;k kezel&eacute;se</span></p>

<p>A Sz&#369;r&#337;k kezel&eacute;se oldalon megadhatja, mely sz&#369;r&#337;ket &eacute;s milyen 
sorrendben alkalmazzon a program a kijelzett sz&ouml;veghez. Emellett el&eacute;rhet&#337;v&eacute; tesz n&eacute;h&aacute;ny, 
a sz&#369;r&#337;kn&eacute;l rendelkez&eacute;sre &aacute;ll&oacute; be&aacute;ll&iacute;t&aacute;si oldalt.
Megjelen&iacute;t&eacute;s el&#337;tt a legt&ouml;bb felhaszn&aacute;l&oacute;i sz&ouml;veg sz&#369;r&#337;k&ouml;n megy kereszt&uuml;l. 
Ezekkel az 'utols&oacute; pillanatban' m&oacute;dos&iacute;that&oacute; a sz&ouml;veg.</p>

<p>A sz&#369;r&#337;k 'bedughat&oacute;' eszk&ouml;z&ouml;k. R&eacute;szletesebben olvashat r&oacute;luk itt: 
   <a href="http://download.moodle.org/modules/filters.php">
   http://download.moodle.org/modules/filters.php</a>.</p>

<p>A szem ikonnal tegye l&aacute;that&oacute;v&aacute; azokat a rejtett sz&#369;r&#337;ket, 
amelyeket haszn&aacute;lni k&iacute;v&aacute;n. Ha egyszerre t&ouml;bb is l&aacute;tszik,
a fel &eacute;s le nyilakkal be&aacute;ll&iacute;thatja alkalmaz&aacute;suk sorrendj&eacute;t. </p> 
   
<p><span style="font-weight: bold;">TeX-jel&ouml;l&eacute;s</span></p>

<div class="indent">
  <p>A TeX-jel&ouml;l&eacute;sm&oacute;ddal els&#337;sorban matematikai k&eacute;pleteket sz&uacute;rhat be egy Moodle-forr&aacute;sba. 
  P&eacute;ld&aacute;ul:  $$ sqrt(a+b) $$ (a $$ a k&eacute;plet elej&eacute;t &eacute;s v&eacute;g&eacute;t jelzi).</p>
  <p>A Moodle k&uuml;ls&#337; programokat haszn&aacute;l a k&eacute;pekhez, melyek esetenk&eacute;nt be&aacute;ll&iacute;t&aacute;sra 
  szorulhatnak az adott rendszerben. A sz&#369;r&#337; el&#337;sz&ouml;r ellen&#337;rzi, van-e LaTeX-&aacute;talak&iacute;t&oacute; 
  (ehhez a met&oacute;dushoz sz&uuml;ks&eacute;ges a Ghostscript is), ha nincs, akkor a Moodle-csomagban l&eacute;v&#337; egyszer&#369;bb 
  <i>miktex</i> programot haszn&aacute;lja. A LaTex lehet&#337;v&eacute; teszi a teljes szintaxis haszn&aacute;lat&aacute;t, 
  m&iacute;g a miktex csak egy matematikai r&eacute;szhalmazt t&aacute;mogat.</p>
  <p>A be&aacute;ll&iacute;t&aacute;si oldalon megadhatja a LaTeX &eacute;s a Ghostscript &uacute;tvonal&aacute;t, a LaTeX el&#337;tagj&aacute;val egy&uuml;tt.</p>
  <p>Tov&aacute;bbi inform&aacute;ci&oacute;k</p>
  <p><a href="http://www.miktex.org/">MiKTeX</a><br/>
     <a href="http://www.latex-project.org/">LaTeX</a><br/>
     <a href="http://www.ghostscript.com/">Ghostscript</a></p>
</div>

<p><span style="font-weight: bold;">Sz&oacute;haszn&aacute;lat korl&aacute;toz&aacute;sa</span></p>

<div class="indent">
  <p>A sz&oacute;haszn&aacute;latot korl&aacute;toz&oacute; sz&#369;r&#337; egy megadott jegyz&eacute;k alapj&aacute;n keres r&aacute; a 
  k&aacute;romkod&aacute;sokra. Minden nyelvi csomaghoz saj&aacute;t sz&oacute;jegyz&eacute;k tartozik, de &Ouml;n is megadhatja saj&aacute;t szavait. 
  Ehhez t&eacute;rjen &aacute;t a be&aacute;ll&iacute;t&aacute;sok oldal&aacute;ra &eacute;s adja meg a szavak felsorol&aacute;s&aacute;t. 
  A felhaszn&aacute;l&oacute; el&#337;tt ezeket a szavakat egy fekete n&eacute;gysz&ouml;g takarja el, j&oacute;llehet, az 
  eg&eacute;rmutat&oacute; f&ouml;l&eacute; vitel&eacute;vel l&aacute;that&oacute;v&aacute; v&aacute;lik az eredeti sz&oacute;.</p>
</div>

<p><span style="font-weight: bold;">Forr&aacute;snevek automatikus kapcsol&aacute;sa</span></p>

<div class="indent">
  <p>A forr&aacute;snevek automatikus kapcsol&aacute;sa sor&aacute;n a program v&eacute;gigvizsg&aacute;lja az azonos kurzusban szerepl&#337; 
  forr&aacute;sok c&iacute;m&eacute;t a sz&ouml;vegben. Ha tal&aacute;l ilyet, megjel&ouml;li &eacute;s ugr&oacute;pontot k&eacute;sz&iacute;t 
  hozz&aacute;. Az eszk&ouml;z hat&eacute;kony haszn&aacute;lat&aacute;hoz haszn&aacute;ljon kell&#337;en tartalmas c&iacute;meket. 
  P&eacute;ld&aacute;ul a <span style="font-style: italic;">Bevezet&eacute;s</span> nemigen alkalmas erre a c&eacute;lra, mert annak 
  a sz&ouml;vegben val&oacute; minden el&#337;fordul&aacute;s&aacute;hoz ugr&oacute;pont k&eacute;sz&uuml;l, f&uuml;ggetlen&uuml;l att&oacute;l, 
  hogy mire vonatkozik.</p>
</div>

<p><span style="font-weight: bold;">Tev&eacute;kenys&eacute;gnevek automatikus kapcsol&aacute;sa</span></p>

<div class="indent">
  <p>A tev&eacute;kenys&eacute;gnevek automatikus kapcsol&aacute;sa sor&aacute;n a program v&eacute;gigvizsg&aacute;lja az azonos kurzusban 
  szerepl&#337; tev&eacute;kenys&eacute;gek megnevez&eacute;s&eacute;t a sz&ouml;vegben. Ha tal&aacute;l ilyet, megjel&ouml;li &eacute;s 
  ugr&oacute;pontot k&eacute;sz&iacute;t hozz&aacute;. Az eszk&ouml;z hat&eacute;kony haszn&aacute;lat&aacute;hoz haszn&aacute;ljon kell&#337;en 
  tartalmas neveket. P&eacute;ld&aacute;ul a <span style="font-style: italic;">Teszt</span> nemigen alkalmas erre a c&eacute;lra, mert annak 
  a sz&ouml;vegben val&oacute; <span style="font-weight: bold;">minden</span> el&#337;fordul&aacute;s&aacute;hoz ugr&oacute;pont k&eacute;sz&uuml;l, f&uuml;ggetlen&uuml;l att&oacute;l, 
  hogy mire vonatkozik.</p>
</div>

<p><span style="font-weight: bold;">Fogalomt&aacute;r automatikus kapcsol&aacute;sa</span></p>

<div class="indent">
  <p>Ez a sz&#369;r&#337; v&eacute;gigvizsg&aacute;lja a kurzusban szerepl&#337; &ouml;sszes fogalomt&aacute;rban l&eacute;v&#337; 
  kulcsszavakat a sz&ouml;vegben. Ha tal&aacute;l ilyet, megjel&ouml;li &eacute;s 
  ugr&oacute;pontot k&eacute;sz&iacute;t hozz&aacute;.
  </p>
</div>

<p><span style="font-weight: bold;">E-mail v&eacute;delme</span></p>

<div class="indent">
  <p>Az e-mail v&eacute;delm&eacute;t szolg&aacute;l&oacute; sz&#369;r&#337; a sz&ouml;vegben l&eacute;v&#337; e-mail c&iacute;meket keresi ki.
  Ha tal&aacute;l, 'elk&ouml;d&ouml;s&iacute;ti', ily m&oacute;don megakad&aacute;lyozva azt, hogy e-mail c&iacute;meket hal&aacute;sz&oacute; 
  rendszerek &eacute;rj&eacute;k el. Ezzel cs&ouml;kkenthet&#337; a lev&eacute;lszem&eacute;t megjelen&eacute;s&eacute;nek a kock&aacute;zata,
  ha a Moodle-port&aacute;lj&aacute;n egyes r&eacute;szek nyitva vannak.</p>
</div>

<p><span style="font-weight: bold;">Tidy</span></p>

<div class="indent">
  <p>A Tidy a sz&ouml;vegben l&eacute;v&#337; HTML-k&oacute;dokat vizsg&aacute;lja v&eacute;gig. Ha ilyet tal&aacute;l, megpr&oacute;b&aacute;lja 
  az &eacute;rv&eacute;nytelen k&oacute;dot &eacute;rv&eacute;nyess&eacute; alak&iacute;tani. Ennek m&#369;k&ouml;d&eacute;s&eacute;hez ne feledje 
  a vonatkoz&oacute; funkci&oacute;t a PHP telep&iacute;t&eacute;se sor&aacute;n bekapcsolni.</p>
</div>

<p><span style="font-weight: bold;">T&ouml;bbnyelv&#369; tartalom</span></p>

<div class="indent">
  <p>Ez a sz&#369;r&#337; t&ouml;bbnyelv&#369; forr&aacute;sok l&eacute;trehoz&aacute;s&aacute;t teszi lehet&#337;v&eacute;. 
  A forr&aacute;snyelv ez esetben v&aacute;ltozik, ha a felhaszn&aacute;l&oacute; m&oacute;dos&iacute;tja a kiv&aacute;lasztott Moodle nyelvi 
  k&ouml;rnyezetet. Haszn&aacute;lat&aacute;hoz el&#337;bb k&eacute;sz&iacute;tse el a tartalmakat t&ouml;bb nyelven (azonos forr&aacute;son 
  bel&uuml;l). Ezut&aacute;n az egyes nyelvi blokkokat tegye az al&aacute;bbi elemek k&ouml;z&eacute;:</p>
  <pre>      &lt;lang lang="XX"&gt;tartalom_ide&lt;/lang&gt;</pre>
 </div>
