<p align="center"><strong>K&eacute;p felt&ouml;lt&eacute;se</strong></p>

<p>Egy k&eacute;pet felt&ouml;lthet a szerverre. Ezt a k&eacute;pet azt&aacute;n k&uuml;l&ouml;nf&eacute;le helyeken haszn&aacute;lhatja
 azonos&iacute;t&aacute;s c&eacute;lj&aacute;ra.</p>
<p>Erre a c&eacute;lra a legmegfelel&#337;bb egy k&ouml;zeli arcfelv&eacute;tel, de b&aacute;rmilyen egy&eacute;b k&eacute;pet haszn&aacute;lhat.</p>
<p>A k&eacute;pet JPG vagy PNG form&aacute;tumban kell elk&eacute;sz&iacute;teni (teh&aacute;t a nevek .jpg vagy .png kiterjeszt&eacute;ssel v&eacute;gz&#337;dnek).</p>
<p>A k&eacute;p az al&aacute;bbi n&eacute;gy m&oacute;dszer valamelyik&eacute;vel k&eacute;sz&iacute;thet&#337; el:
<ol>
<li>Digit&aacute;lis f&eacute;nyk&eacute;pez&#337;g&eacute;ppel, mely esetben a f&eacute;nyk&eacute;p a sz&aacute;m&iacute;t&oacute;g&eacute;pen
 feltehet&#337;leg megfelel&#337; form&aacute;ban m&aacute;r rendelkez&eacute;sre &aacute;ll.</li>
<li>Lapolvas&oacute;val r&ouml;gz&iacute;thet egy megl&eacute;v&#337; f&eacute;nyk&eacute;pet. Ez esetben &uuml;gyeljen arra, hogy JPG vagy PNG 
form&aacute;ban mentse el a k&eacute;pet.</li>
<li>Akinek a m&#369;v&eacute;szi hajlama lehet&#337;v&eacute; teszi, rajzolhat k&eacute;pet egy k&eacute;pszerkeszt&#337; programmal.</li>
<li>V&eacute;gezet&uuml;l az Internetr&#337;l is "elcsenhet" k&eacute;peket. A <a target="google" href="http://images.google.com/">http://images.google.com</a>
 honlapr&oacute;l kiindulva sz&aacute;mos k&eacute;pet vad&aacute;szhat le az Internetr&#337;l. Ha megtal&aacute;lta a szimpatikusat, a jobb 
 eg&eacute;rgombra kattintva elmentheti a k&eacute;pet a "Save this image..." [K&eacute;p ment&eacute;se] parancs seg&iacute;ts&eacute;g&eacute;vel 
 a megjelen&#337; men&uuml;pontra kattintva (ennek m&oacute;dja sz&aacute;m&iacute;t&oacute;g&eacute;penk&eacute;nt n&eacute;mileg elt&eacute;r&#337; lehet).</li> </ol>

<p>A k&eacute;p felt&ouml;lt&eacute;s&eacute;hez kattintson ezen a szerkeszt&#337; oldalon a "Choose" [V&aacute;laszt&aacute;s] gombra 
&eacute;s v&aacute;lassza ki a merevlemezr&#337;l a k&eacute;pet.</p>
<p>MEGJEGYZ&Eacute;S: &Uuml;gyeljen arra, hogy a k&eacute;p ne legyen nagyobb, mint a megadott maxim&aacute;lis m&eacute;ret, 
ellenkez&#337; esetben a rendszer nem t&ouml;lti fel a k&eacute;pet.</p>
<p>Ezut&aacute;n kattintsunk a lenti  "Profilom friss&iacute;t&eacute;se" gombra. A k&eacute;p n&eacute;gyzet alak&uacute; &eacute;s 100x100 k&eacute;perny&#337;pont m&eacute;ret&#369; lesz.</p>
<p>Ha visszaker&uuml;l a profilj&aacute;t tartalmaz&oacute; oldalra, el&#337;fordulhat, hogy a k&eacute;p m&oacute;dos&iacute;t&aacute;sa 
m&eacute;g nem lesz l&aacute;that&oacute;. Ilyen esetben kattintson a b&ouml;ng&eacute;sz&#337; "Reload" [&Uacute;jrat&ouml;lt&eacute;s] gombj&aacute;ra. </p>