<P ALIGN=CENTER><B>K&eacute;p felt&ouml;lt&eacute;se</B></P>

<P>Egy k&eacute;pet felt&ouml;lthet&uuml;nk erre a szerverre. Ezt a k&eacute;pet azt&aacute;n k&uuml;l&ouml;nf&eacute;le helyeken haszn&aacute;lhatjuk azonos&iacute;t&aacute;sunk c&eacute;lj&aacute;ra.
<P>Erre a c&eacute;lra a legmegfelel&#337;bb egy k&ouml;zeli arcfelv&eacute;tel, de b&aacute;rmilyen egy&eacute;b k&eacute;pet haszn&aacute;lhatunk.
<P>A k&eacute;pet JPG vagy PNG form&aacute;tumban kell elk&eacute;sz&iacute;teni (teh&aacute;t a nevek .jpg vagy .png kiterjeszt&eacute;ssel v&eacute;gz&#337;dnek).
<P>A k&eacute;p az al&aacute;bbi n&eacute;gy m&oacute;dszer valamelyik&eacute;vel k&eacute;sz&iacute;thet&#337; el:

<OL>
<LI>Digit&aacute;lis f&eacute;nyk&eacute;pez&#337;g&eacute;ppel, mely esetben a f&eacute;nyk&eacute;p a sz&aacute;m&iacute;t&oacute;g&eacute;pen feltehet&#337;leg megfelel&#337; form&aacute;ban m&aacute;r rendelkez&eacute;sre &aacute;ll.
<LI>Lapolvas&oacute;val r&ouml;gz&iacute;thet&uuml;nk egy megl&eacute;v&#337; f&eacute;nyk&eacute;pet. Ez esetben &uuml;gyelj&uuml;nk arra, hogy JPG vagy PNG form&aacute;ban ments&uuml;k el a k&eacute;pet.
<LI>Akinek a m&#369;v&eacute;szi hajlama lehet&#337;v&eacute; teszi, rajzolhat k&eacute;pet egy k&eacute;pszerkeszt&#337; programmal.
<LI>V&eacute;gezet&uuml;l az Internetr&#337;l is "elcsenhet&uuml;nk" k&eacute;peket. A <A TARGET=google HREF="http://images.google.com/">http://images.google.com</A> honlapr&oacute;l kiindulva sz&aacute;mos k&eacute;pet vad&aacute;szhatunk le az Internetr&#337;l. Ha megtal&aacute;ltuk a nek&uuml;nk szimpatikusat, a jobb eg&eacute;rgombra kattintva elmenthetj&uuml;k a k&eacute;pet a "Save this image..." [K&eacute;p ment&eacute;se] parancs seg&iacute;ts&eacute;g&eacute;vel a megjelen&#337; men&uuml;pontra kattintva (ennek m&oacute;dja sz&aacute;m&iacute;t&oacute;g&eacute;penk&eacute;nt n&eacute;mileg elt&eacute;r&#337; lehet). </OL>

<P>A k&eacute;p felt&ouml;lt&eacute;s&eacute;hez kattintsunk ezen a szerkeszt&#337; oldalon a "Browse" [Tall&oacute;z&aacute;s] gombra &eacute;s v&aacute;lasszuk ki a merevlemezr&#337;l a k&eacute;pet.
<P>MEGJEGYZ&Eacute;S: &Uuml;gyelj&uuml;nk arra, hogy a k&eacute;p ne legyen nagyobb, mint a megadott maxim&aacute;lis m&eacute;ret, ellenkez&#337; esetben a felt&ouml;lt&eacute;s elmarad.
<P>Ezut&aacute;n kattintsunk a lenti  "Update my Profile" [Profil friss&iacute;t&eacute;se] gombra. A k&eacute;p n&eacute;gyzet alak&uacute; &eacute;s 100x100 k&eacute;perny&#337;pont m&eacute;ret&#369; lesz.
<P>Ha visszaker&uuml;l&uuml;nk a profilunkat tartalmaz&oacute; oldalra, el&#337;fordulhat, hogy a k&eacute;p m&oacute;dos&iacute;t&aacute;sa m&eacute;g nem lesz l&aacute;that&oacute;. Ilyen esetben kattintsunk a b&ouml;ng&eacute;sz&#337; "Reload" [Friss&iacute;t&eacute;s] gombj&aacute;ra. 