<P ALIGN=CENTER><B>Haszn&aacute;lhat&oacute; felm&eacute;r&eacute;sek</B></P>

<P>Jelenleg a Moodle csak meghat&aacute;rozott t&iacute;pus&uacute; felm&eacute;r&eacute;sek haszn&aacute;lat&aacute;t t&aacute;mogatja (a k&eacute;s&#337;bbi v&aacute;ltozatokban m&aacute;r saj&aacute;t felm&eacute;r&eacute;seket k&eacute;sz&iacute;thet&uuml;nk).</P>

<P>A haszn&aacute;lhat&oacute; felm&eacute;r&eacute;sek kiv&aacute;laszt&aacute;sa annak alapj&aacute;n t&ouml;rt&eacute;nt, hogy mennyire bizonyulnak hasznosnak azon online tanul&aacute;si k&ouml;rnyezetek &eacute;rt&eacute;kel&eacute;se szempontj&aacute;b&oacute;l, amelyek konstruktivista pedag&oacute;gi&aacute;ra &eacute;p&uuml;lnek. A felm&eacute;r&eacute;sek olyan trendek meg&aacute;llap&iacute;t&aacute;sa sor&aacute;n bizonyulnak hasznosnak, amelyek a r&eacute;sztvev&#337;ink k&ouml;z&ouml;tt zajlanak. (Egy p&eacute;lda az ilyen folyamatok r&eacute;szletes elemz&eacute;s&eacute;re el&eacute;rhet&#337; itt: 
<A TARGET=paper HREF="http://dougiamas.com/writing/herdsa2002">http://dougiamas.com/writing/herdsa2002</A>).</P>

<HR>
<P><B>COLLES - Constructivist On-Line Learning Environment Survey [Konstruktivista online tanul&aacute;si k&ouml;rnyezet felm&eacute;r&eacute;se]</B></P>
<UL>
  <p>A COLLES 24, hat oszt&aacute;lyba sorolt t&ouml;m&ouml;r meg&aacute;llap&iacute;t&aacute;st tartalmaz, amelyek az online tanul&aacute;si k&ouml;rnyezet min&#337;s&eacute;g&eacute;vel kapcsolatos valamely kardin&aacute;lis k&eacute;rd&eacute;st veszik c&eacute;lba: </p>

<table BORDER="0" CELLSPACING="10" CELLPADDING="10">
  <tr> 
    <td valign=top>Relevancia</td>
    <td>Mennyire relev&aacute;ns az online tanul&aacute;s a tanul&oacute;k szakmai munk&aacute;ja szempontj&aacute;b&oacute;l? </td>
  </tr>
  <tr> 
    <td valign=top>Reflexi&oacute; </td>

    <td>Az online tanul&aacute;s &ouml;szt&ouml;nzi-e a tanul&oacute; kritikai reflekt&iacute;v gondolkod&aacute;s&aacute;t? </td>
  </tr>
  <tr> 
    <td valign=top>Interaktivit&aacute;s </td>
    <td>Milyen m&eacute;rt&eacute;kben kapcsol&oacute;dnak be a tanul&oacute;k az online pedag&oacute;gia jelleg&#369; p&aacute;rbesz&eacute;dbe? </td>
  </tr>
  <tr> 
    <td valign=top>Tutort&aacute;mogat&aacute;s</td>

    <td>Mennyire sikeresen vonj&aacute;k be a tutorok a tanul&oacute;kat az online tanul&aacute;sba val&oacute; bekapcsol&oacute;d&aacute;sba? </td>
  </tr>
  <tr> 
    <td valign=top>Interpret&aacute;ci&oacute; </td>

    <td>Haszn&aacute;ra v&aacute;lik-e a tanul&oacute;knak &eacute;s a tutoroknak az egym&aacute;ssal val&oacute; online kommunik&aacute;ci&oacute;?</td>
  </tr>
</table>

  <p>A tanul&aacute;s dinamikus megk&ouml;zel&iacute;t&eacute;s&eacute;nek el&#337;t&eacute;rbe helyez&eacute;se a tud&aacute;s &uacute;jfajta elm&eacute;let&eacute;hez vezet: a szoci&aacute;lis konstruktivizmushoz, amelyben a tanul&oacute; akt&iacute;v fogalomalkot&oacute;k&eacute;nt t&#369;nik f&ouml;l egy szoci&aacute;lisan interakt&iacute;v tanul&aacute;si k&ouml;rnyezetben. A szoci&aacute;lis konstruktivizmus egyfajta episztemol&oacute;gia vagy tud&aacute;sm&oacute;d, amelyben a tanul&oacute;k reflekt&iacute;v m&oacute;don m&#369;k&ouml;dnek egy&uuml;tt annak &eacute;rdek&eacute;ben, hogy egy&uuml;tt &uacute;jszer&#369; meg&eacute;rt&eacute;st alak&iacute;tsanak ki, k&uuml;l&ouml;n&ouml;sen a szem&eacute;lyes tapasztalatukban gy&ouml;kerez&#337; k&ouml;z&ouml;s vizsg&aacute;l&oacute;d&aacute;s kontextus&aacute;ban. </p>

  <p>Ezen egy&uuml;ttm&#369;k&ouml;d&eacute;s k&ouml;zponti eleme a tanul&oacute; kommunikat&iacute;v kompetenci&aacute;j&aacute;nak, vagyis azon k&eacute;pess&eacute;g&eacute;nek a fejleszt&eacute;se, amellyel mind a tan&aacute;rral, mind a csoportt&aacute;rsakkal ny&iacute;lt &eacute;s kritikai besz&eacute;dbe elegyedhet. A besz&eacute;lget&eacute;s a k&ouml;lcs&ouml;n&ouml;s meg&eacute;rt&eacute;s emp&aacute;ti&aacute;s orient&aacute;ci&oacute;j&aacute;ra &eacute;p&uuml;l, melyhez a m&ouml;g&ouml;ttes megfontol&aacute;sok vizsg&aacute;lat&aacute;hoz val&oacute; kritikus viszonyul&aacute;s p&aacute;rosul. </p>

  <p>A COLLES r&eacute;v&eacute;n figyelemmel k&iacute;s&eacute;rhetj&uuml;k azt, hogy mennyire vagyunk k&eacute;pesek kiakn&aacute;zni a vil&aacute;gh&aacute;l&oacute; interakt&iacute;v kapacit&aacute;s&aacute;t arra a c&eacute;lra, hogy a tanul&oacute;k dinamikus tanul&aacute;si k&eacute;szs&eacute;geket saj&aacute;t&iacute;thassanak el. </p>

<P>
(A fenti t&aacute;j&eacute;koztat&aacute;s a COLLES oldal&aacute;r&oacute;l lett adapt&aacute;lva. Tov&aacute;bbi inform&aacute;ci&oacute; tal&aacute;lhat&oacute; a COLLES-r&#337;l &eacute;s szerz&#337;j&eacute;r&#337;l itt: 
<A TARGET=paper HREF="http://surveylearning.com/colles/">http://surveylearning.com/colles/</A>).</P>
</UL>


<HR>
<P><B>ATTLS - Attitudes to Thinking and Learning Survey [Megk&ouml;zel&iacute;t&eacute;sek a gondolkod&aacute;si &eacute;s tanul&aacute;si felm&eacute;r&eacute;shez]</B></P>
<UL>

<P>A 'tud&aacute;sm&oacute;dok' elm&eacute;lete eredetileg a nemek kutat&aacute;si ter&uuml;lete volt (Belenky et al., 1986), &eacute;s egy felm&eacute;r&eacute;si eszk&ouml;zt ny&uacute;jt ahhoz, hogy megvizsg&aacute;lhassuk a besz&eacute;lget&eacute;s min&#337;s&eacute;g&eacute;t egy egy&uuml;ttm&#369;k&ouml;d&#337; k&ouml;rnyezetben. <P>Az ATTLS nev&#369; eszk&ouml;z kifejleszt&#337;i Galotti &eacute;s mtsai (1999); ezzel m&eacute;rhet&#337;, hogy egy szem&eacute;ly milyen m&eacute;rt&eacute;kben rendelkezik '&ouml;sszekapcsolt tud&aacute;ssal' (CK) vagy 'k&uuml;l&ouml;n&aacute;ll&oacute; tud&aacute;ssal' (SK). 

<P>A magasabb CK-ponttal rendelkez&#337;k a tanul&aacute;st jobban &eacute;lvezik, gyakran egy&uuml;ttm&#369;k&ouml;d&#337;bbek, kellemesebbek &eacute;s hajlamosabbak arra, hogy m&aacute;sok gondolatait tov&aacute;bbfejlessz&eacute;k, m&iacute;g a magasabb SK-ponttal rendelkez&#337;k kritikusabban &eacute;s vitatkoz&oacute;bban viszonyulnak a tanul&aacute;shoz. 

<P>A vizsg&aacute;latok szerint ez a k&eacute;t tanul&aacute;si st&iacute;lus f&uuml;ggetlen egym&aacute;st&oacute;l (Galotti et al., 1999; Galotti et al., 2001). Emellett csup&aacute;n visszat&uuml;kr&ouml;z&#337;d&eacute;sei a tanul&aacute;shoz val&oacute; viszonyul&aacute;snak, de nem jelzik a tanul&aacute;s k&eacute;pess&eacute;g&eacute;t vagy a szellem erej&eacute;t. 

<P><I>Belenky, M. F., Clinchy, B. M., Goldberger, N. R., &amp; Tarule, J. M. (1986). Women's Ways of Knowing: The Development of Self, Voice, and Mind. New York: Basic Books, Inc. </I></P>

<P><I>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., &amp; Mansfield, A. F. (1999). A New Way of Assessing Ways of Knowing: The Attitudes Towards Thinking and Learning Survey (ATTLS). Sex Roles, 40(9/10), 745-766.</I></P>

<P><I>Galotti, K. M., Reimer, R. L., &amp; Drebus, D. W. (2001). Ways of knowing as learning styles: Learning MAGIC with a partner. Sex Roles, 44(7/8), 419-436.</I></P>


</UL>
