<P ALIGN=CENTER><B>Sz&ouml;veg form&aacute;z&aacute;sa </B></P>

<P>Ha sz&ouml;veget &iacute;runk Moodle-ban, ehhez t&ouml;bbf&eacute;le forma k&ouml;z&uuml;l v&aacute;laszthatunk j&aacute;rtass&aacute;gunknak &eacute;s a haszn&aacute;lt b&ouml;ng&eacute;sz&#337; t&iacute;pus&aacute;nak megfelel&#337;en.

<P><B>Rendszerint ezt a be&aacute;ll&iacute;t&aacute;st alap&eacute;rt&eacute;ken hagyhatjuk, &iacute;gy a dolgok a v&aacute;rhat&oacute; m&oacute;don fognak majd m&#369;k&ouml;dni</B>.

<P><B>1. A Moodle automatikus form&aacute;ja</B></P>

<UL>
<P>Ezt a form&aacute;t akkor a legjobb v&aacute;lasztani, ha adatbevitelre szok&aacute;sos &#369;rlapokat haszn&aacute;lunk (a richtext HTML-szerkeszt&#337; helyett). Ez esetben ugyan&uacute;gy g&eacute;pelhet&uuml;nk, mint ha egy e-mailt k&eacute;sz&uuml;ln&eacute;nk elk&uuml;ldeni.

<P>A sz&ouml;veg elment&eacute;sekor a Moodle egy sor dolgot v&eacute;grehajt ahhoz, hogy automatikusan megform&aacute;zza sz&aacute;munkra a sz&ouml;veget. 
<P>P&eacute;ld&aacute;ul az olyan URL-c&iacute;meket, mint a <A HREF="http://yahoo.com/">http://yahoo.com</A> vagy ak&aacute;r a <A HREF="http://www.yahoo.com/">www.yahoo.com</A>, &aacute;talak&iacute;tja hivatkoz&aacute;sokk&aacute;.
<P>A sort&ouml;r&eacute;seket meg&#337;rzi, az &uuml;res sorok pedig &uacute;j bekezd&eacute;seket fognak jel&ouml;lni.
<P>Az emotikonokat, p&eacute;ld&aacute;ul a ":-)" jelet, automatikusan &aacute;talak&iacute;tja grafikus megfelel&#337;j&uuml;kk&eacute;.
<P>Ha akarjuk, be&aacute;gyazhatunk HTML-k&oacute;dot is a sz&ouml;vegbe, amely meg&#337;rz&#337;dik. <p align=right><a href="help.php?file=text.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s a Moodle automatikus form&aacute;z&aacute;s&aacute;r&oacute;l</a></p>
</UL>


<P><B>2. HTML-forma</B></P>

<UL>
<P>Ez a forma felt&eacute;telezi, hogy sz&ouml;veg&uuml;nk kiz&aacute;r&oacute;lag HTML-t tartalmaz. Ha HTML-szerkeszt&#337;vel dolgozunk, ez lesz az alap&eacute;rtelmezett forma - az eszk&ouml;zt&aacute;ron szerepl&#337; &ouml;sszes parancs HTML-t &aacute;ll&iacute;t el&#337;.

<P>Ha nem a richtext HTML-szerkeszt&#337;t haszn&aacute;ljuk, akkor is helyezhet&uuml;nk el HTML-k&oacute;dot a sz&ouml;vegben, melynek pontosan sz&aacute;nd&eacute;kunk szerint kell megjelennie.

<P>A Moodle automatikus form&aacute;z&aacute;s&aacute;val ellent&eacute;tben itt semmilyen automatikus form&aacute;z&aacute;sra nem ker&uuml;l sor.
<p align=right><a href="help.php?file=html.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s a HTML Moodle-ban val&oacute; haszn&aacute;lat&aacute;r&oacute;l</a></p>
<p align=right><a href="help.php?file=richtext.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s a Richtext HTML-szerkeszt&#337;r&#337;l</a></p>
</UL>


<P><B>3. Egyszer&#369; sz&ouml;veges forma</B></P>

<UL>
<P>Ez a forma hasznos, ha nagyon sok olyan k&oacute;dot vagy HTML-t akarunk haszn&aacute;lni, amelyet a meg&iacute;rt m&oacute;don szeretn&eacute;nk megjelen&iacute;teni.

<P>Itt is meg&#337;rz&#337;dnek a sz&oacute;k&ouml;z&ouml;k &eacute;s a sort&ouml;r&eacute;sek, de egy&eacute;b tekintetben a sz&ouml;veg &eacute;rintetlen marad. </UL>


<P><B>4. Wiki sz&ouml;vegforma</B></P>
<UL>
<P>Enn&eacute;l a form&aacute;n&aacute;l a wiki n&eacute;ven ismert sz&ouml;vegg&eacute;pel&eacute;si m&oacute;dot haszn&aacute;ljuk.
<P>Ezzel m&eacute;g olvashat&oacute; form&aacute;ban g&eacute;pelhet&uuml;nk, de a sz&ouml;veg automatikusan &aacute;talak&iacute;that&oacute; HTML-sz&ouml;vegg&eacute;, a hozz&aacute; tartoz&oacute; fejl&eacute;cekkel, list&aacute;kkal &eacute;s bonyolult form&aacute;z&aacute;si megold&aacute;sokkal egy&uuml;tt.

<p align=right><a href="help.php?file=wiki.html">Tov&aacute;bbi inform&aacute;ci&oacute;k a wiki form&aacute;val kapcsolatosan</a></p>
</UL>

