<p align="center"><strong>Sz&ouml;veg form&aacute;z&aacute;sa </strong></p>

<p>Ha sz&ouml;veget &iacute;r Moodle-ban, ehhez t&ouml;bbf&eacute;le forma k&ouml;z&uuml;l v&aacute;laszthat 
j&aacute;rtass&aacute;g&aacute;nak &eacute;s a haszn&aacute;lt b&ouml;ng&eacute;sz&#337; t&iacute;pus&aacute;nak 
megfelel&#337;en.</p>

<p><strong>Rendszerint ezt a be&aacute;ll&iacute;t&aacute;st alapbe&aacute;ll&iacute;t&aacute;sban hagyhatja, &iacute;gy a 
dolgok a v&aacute;rhat&oacute; m&oacute;don fognak majd m&#369;k&ouml;dni</strong>.</p>

<p><strong>1. A Moodle automatikus form&aacute;ja</strong></p>

<ul>
<p>Ezt a form&aacute;t akkor a legjobb v&aacute;lasztani, ha adatbevitelre szok&aacute;sos &#369;rlapokat haszn&aacute;l (a richtext 
HTML-szerkeszt&#337; helyett). Ez esetben ugyan&uacute;gy g&eacute;pelhet, mint ha egy e-mailt k&eacute;sz&uuml;lne elk&uuml;ldeni.</p>

<p>A sz&ouml;veg elment&eacute;sekor a Moodle egy sor dolgot v&eacute;grehajt ahhoz, hogy automatikusan megform&aacute;zza 
sz&aacute;munkra a sz&ouml;veget. </p>
<p>P&eacute;ld&aacute;ul az olyan URL-c&iacute;meket, mint a <a href="http://yahoo.com/">http://yahoo.com</a> vagy ak&aacute;r 
a <a href="http://www.yahoo.com/">www.yahoo.com</a>, &aacute;talak&iacute;tja hivatkoz&aacute;sokk&aacute;.</p>
<p>A sort&ouml;r&eacute;seket meg&#337;rzi, az &uuml;res sorok pedig &uacute;j bekezd&eacute;seket fognak jel&ouml;lni.</p>
<p>Az emotikonokat, p&eacute;ld&aacute;ul a ":-)" jelet, automatikusan &aacute;talak&iacute;tja grafikus megfelel&#337;j&uuml;kk&eacute;.</p>
<p>Ha akarja, be&aacute;gyazhat HTML-k&oacute;dot is a sz&ouml;vegbe, amely meg&#337;rz&#337;dik. </p>
<p align="right"><a href="help.php?file=text.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s a Moodle automatikus 
form&aacute;z&aacute;s&aacute;r&oacute;l</a></p>
</ul>


<p><strong>2. HTML-forma</strong></p>

<ul>
<p>Ez a forma felt&eacute;telezi, hogy a sz&ouml;veg kiz&aacute;r&oacute;lag HTML-t tartalmaz. Ha HTML-szerkeszt&#337;vel dolgozik, ez lesz az 
alap&eacute;rtelmezett forma - az eszk&ouml;zt&aacute;ron szerepl&#337; &ouml;sszes parancs HTML-t &aacute;ll&iacute;t el&#337;.</p>

<p>Ha nem a richtext HTML-szerkeszt&#337;t haszn&aacute;lja, akkor is helyezhet el HTML-k&oacute;dot a sz&ouml;vegben, melynek pontosan a 
sz&aacute;nd&eacute;ka szerint kell megjelennie.</p>

<p>A Moodle automatikus form&aacute;z&aacute;s&aacute;val ellent&eacute;tben itt semmilyen automatikus form&aacute;z&aacute;sra nem ker&uuml;l sor.</p>
<p align="right"><a href="help.php?file=html.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s a HTML Moodle-ban val&oacute; 
haszn&aacute;lat&aacute;r&oacute;l</a></p>
<p align="right"><a href="help.php?file=richtext.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s a Richtext HTML-szerkeszt&#337;r&#337;l</a></p>
</ul>


<p><strong>3. Egyszer&#369; sz&ouml;veges forma</strong></p>

<ul>
<p>Ez a forma akkor hasznos, ha nagyon sok olyan k&oacute;dot vagy HTML-t akar haszn&aacute;lni, amelyet a meg&iacute;rt m&oacute;don 
szeretne megjelen&iacute;teni.</p>

<p>Itt is meg&#337;rz&#337;dnek a sz&oacute;k&ouml;z&ouml;k &eacute;s a sort&ouml;r&eacute;sek, de egy&eacute;b tekintetben a 
sz&ouml;veg &eacute;rintetlen marad. </ul></p>


<p><strong>4. Wiki sz&ouml;vegforma</strong></p>
<ul>
<p>Enn&eacute;l a form&aacute;n&aacute;l a wiki n&eacute;ven ismert sz&ouml;vegg&eacute;pel&eacute;si m&oacute;dot haszn&aacute;lja.</p>
<p>Ezzel m&eacute;g olvashat&oacute; form&aacute;ban g&eacute;pelhet, de a sz&ouml;veg automatikusan &aacute;talak&iacute;that&oacute; 
HTML-sz&ouml;vegg&eacute;, a hozz&aacute; tartoz&oacute; fejl&eacute;cekkel, list&aacute;kkal &eacute;s bonyolult form&aacute;z&aacute;si 
megold&aacute;sokkal egy&uuml;tt.</p>

<p align="right"><a href="help.php?file=wiki.html">Tov&aacute;bbi inform&aacute;ci&oacute;k a wiki form&aacute;val kapcsolatosan</a></p>
</ul>
