<p align="center"><span style="font-weight: bold;">Csoportok felt&ouml;lt&eacute;se</span></p>

<p>Ennek a seg&iacute;ts&eacute;g&eacute;vel csoportokat t&ouml;lthet fel a Moodle-ba.</p>


<ul>
  <li>Az &aacute;llom&aacute;ny minden sora egy-egy rekordot tartalmaz.</li>
  <li>Minden rekord vessz&#337;vel elhat&aacute;rolt adatok sorozata.</li>
  <li>Az &aacute;llom&aacute;ny els&#337; rekordja a mez&#337;neveket tartalmazza. Ez hat&aacute;rozza meg az &aacute;llom&aacute;ny t&ouml;bbi 
  r&eacute;sz&eacute;nek a form&aacute;j&aacute;t.    <blockquote>
      <p><strong>Sz&uuml;ks&eacute;ges mez&#337;k:</strong> ezeknek az els&#337; rekordban kell szerepelni &eacute;s 
      minden felhaszn&aacute;l&oacute;ra k&uuml;l&ouml;n meg kell adni.</p>
      <p></p>
      <font color="#990000" face="Courier New, Courier, mono">csoportn&eacute;v</font></p>
</p>
      <p><strong>Alapbe&aacute;ll&iacute;t&aacute;s szerinti mez&#337;nevek:</strong> ezek opcion&aacute;lisak - ha nem szerepelnek, akkor
      az &eacute;rt&eacute;kekeket a rendszer az adott nyelv &eacute;s adott kurzus alapj&aacute;n veszi fel</p>
      <p><font color="#990000" face="Courier New, Courier, mono">idnumber, coursename, lang</font> </p>
      <p><strong>Opcion&aacute;lis mez&#337;nevek: </strong>ezek mindegyike teljesen opcion&aacute;lis. </p>
      <p> <font color="#990000" face="Courier New, Courier, mono">description, picture, hidepicture</font></p>
    </blockquote>
    </li>
  <li>Az adatok k&ouml;z&ouml;tti vessz&#337;ket  &amp;#44 form&aacute;ban kell megadni - a program automatikusan vissza&aacute;ll&iacute;tja &#337;ket vessz&#337;kk&eacute;. </li>
  <li>Igen-nem mez&#337;k esetén 0 a hamis, 1 az igaz &eacute;rt&eacute;k. </li>
  <li>A kurzus azonos&iacute;t&aacute;s&aacute;ra egyar&aacute;nt haszn&aacute;lhat&oacute; az idnumber [azonos&iacute;t&oacute;sz&aacute;m] vagy a kurzusn&eacute;v. Az idnumber 
  fel&uuml;l&iacute;rja a kurzus nev&eacute;t. Ha egyik sincs megadva, a csoportok az &eacute;rv&eacute;nyes kurzushoz ad&oacute;dnak hozz&aacute;.
  <li>A kurzusn&eacute;v a kurzus r&ouml;vid megnevez&eacute;se.</li>
  <li>Megjegyz&eacute;s: ha egy csoport m&aacute;r szerepel a Moodle adott kurzushoz tartoz&oacute; adatb&aacute;zis&aacute;ban, akkor az a 
  k&oacute;d az adott csoport nev&eacute;t adja vissza. A tan&aacute;rok csak azon kurzushoz adhatnak hozz&aacute; csoportot, amelyet szerkeszthetnek.</li>
</ul>
   
<p>&Iacute;me egy p&eacute;lda egy megfelel&#337; import&aacute;l&aacute;si &aacute;llom&aacute;nyra:</p>
<p><font size="-1" face="Courier New, Courier, mono"></font>groupname,idnumber,lang,description,picture <br />
group1, Phil101, en, this group requires extra attention!, 0 <br />
group2, Math243, , ,
</font></p>

