<p align="center"><strong>&Iacute;r&aacute;s</strong></p>

<p>Ha m&aacute;sok &aacute;ltal olvasand&oacute; sz&ouml;veget &iacute;r, igyekezzen azt k&ouml;zvetlen&uuml;l az 
olvas&oacute;k&ouml;z&ouml;ns&eacute;gnek &iacute;rni.</p>

<p>Gondolatait a lehet&#337; legvil&aacute;gosabban &eacute;s legegyszer&#369;bben fejtse ki a f&eacute;lre&eacute;rt&eacute;sek 
elker&uuml;l&eacute;se v&eacute;gett. Az egyik eszk&ouml;z erre, ha r&ouml;vid szavakat haszn&aacute;l ott, ahol hosszabb kifejez&eacute;sek is 
szerepelhetn&eacute;nek.</p>

<p>A f&oacute;rumon mindenk&eacute;ppen seg&iacute;t, ha az &uuml;zeneteit r&ouml;vidre &eacute;s a t&aacute;rgyra vonatkoz&oacute;ra szabja. 
A hossz&uacute; &eacute;s szerte&aacute;gaz&oacute; hozz&aacute;sz&oacute;l&aacute;s helyett, melyben k&uuml;l&ouml;nf&eacute;le szempontokat 
vitat meg, val&oacute;sz&iacute;n&#369;leg jobb, ha n&eacute;h&aacute;ny r&ouml;vid &uuml;zenetet fogalmaz meg (ezek ak&aacute;r 
k&uuml;l&ouml;nf&eacute;le f&oacute;rumokhoz is tartozhatnak).</p>

<p>A sz&ouml;veget addig fogalmazza &uacute;jra &eacute;s &uacute;jra, am&iacute;g ki nem alakul a helyesnek v&eacute;lt v&aacute;ltozat. 
M&eacute;g f&oacute;rum&uuml;zenetek eset&eacute;n is rendelkez&eacute;sre &aacute;ll <?PHP echo ($CFG->maxeditingtime/60) ?> perc az &uuml;zenet 
felad&aacute;sa ut&aacute;n arra, hogy sz&uuml;ks&eacute;g eset&eacute;n korrig&aacute;ljon.</p>

<p>M&aacute;sokhoz &iacute;rt v&aacute;lasz eset&eacute;n pr&oacute;b&aacute;ljon &eacute;rdekes k&eacute;rd&eacute;seket feltenni. 
Ezzel mind maga, mind a m&aacute;sik szem&eacute;ly sz&aacute;m&aacute;ra es&eacute;lyt ad a megbesz&eacute;l&eacute;s folyam&aacute;n arra, 
hogy gondolkozzon (&eacute;s tanuljon!).</p>


<p align="right"><a href="help.php?file=questions.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s a k&eacute;rd&eacute;sfeltev&eacute;sr&#337;l</a></p>
<p align="right"><a href="help.php?file=reading.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s az olvas&aacute;sr&oacute;l</a></p>
