<p align="center"><b>Bewertungselemente</b></p>
<p>Jede Bewertung sollte verschiedene Bewertungselemenet
umfassen. Jedes einzelne Element sollte einen Teilaspekt der
P&uuml;fung abdecken. Die meisten Pr&uuml;fungen verf&uuml;gen
&uuml;ber 5 bis 15 Elemente f&uuml;r Kommentare und Noten, die
Zahl der Elemente h&auml;ngt vom Umfang und der Komplexit&auml;t
der Aufgabenstellung ab.</p>
<p>Die gew&auml;hlten Elemente ergeben sich aus der
Bewertungsstrategie.</p>
<p><b>Unbewertet.</b> Die einzelnen Elemente beschreiben einzelne
Kriterien der Bewertung. Zu jedem Kriterium wird von dem/der
Trainer/in ein Kommentar als Bewertung abgegeben. Wie bei allen
Bewertungsstrategien gibt es eine zus&auml;tzliche Rubrik
f&uuml;r einen Gesamtkommentar.</p>
<p><b>Zusammenfassende Bewertung.</b> Die Elemente verf&uuml;gen
&uuml;ber folgende Optionen:</p>
<ol>
<li>Die BESCHREIBUNG der Pr&uuml;fungselemente. Dies legt klar
fest, welche Aspekte gepr&uuml;ft werden. Bei einer qualitativen
Pr&uuml;fung sollten Details festgelegt werden, was eine
hervorragende, eine durchschnittliche und eine schlechte
L&ouml;sung darstellt.</li>
<li>Die BEWERTUNGSSKALEN f&uuml;r die Pr&uuml;fungselemente. Eine
Reihe von Skalen sind bereits vordefiniert. Sie k&ouml;nnen
einfach ausgew&auml;hlt werden. Sie reichen von einfachen
Ja/Nein-Skalen &uuml;ber Mehrpunkt-Skalen zu Prozentpunkt-Skalen.
Jedes Element der Pr&uuml;fung hat seine eignen Skalen zur
Bewertung und mu&szlig; vor Beginn der Pr&uuml;fung festgelegt
werden. Jede verwandte Skala hat zun&auml;chst das gleiche
Gewicht bei der Festlegung der Schlu&szlig;note.</li>
<li>Die GEWICHTUNG der Pr&uuml;fungselemente. In der
Grundeinstellung haben alle Pr&uuml;fungselemente die gleiche
Bedeutung f&uuml;r die Note. Dies kann individuell eingestellt
werden. Die Gewichtung kann auch negative Werte umfassen. Diese
M&ouml;glichkeit befindet sich zur Zeit noch in der
Erprobung.</li>
</ol>
<p><b>Zusammenfassende Fehlerbewertung:</b> Die Kriterien
beschreiben in der Regel Aspekte, die in der Arbeit erf&uuml;llt
sein sollen. Die Bewertung ergibt sich aus der Erf&uuml;llung
oder Nicht-Erf&uuml;llung festgelegter Kriterien. Der/die
Trainer/in mu&szlig; festlegen, welche Noten vergeben werden,
wenn alle Kriterien erf&uuml;llt sind, wenn eines fehlt, wenn
zwei fehlen usw. Wenn einzelne Kriterien wichtiger sind als
andere k&ouml;nnen sie entsprechend unterschiedlich bei der
Ermittlung der Gesamtbewertung gewichtet werden.</p>
<p><b>Kriterienbewertung.</b> In dieser Form wird eine Auswahl
von Leveln f&uuml;r das Kriterium angezeigt und ausgew&auml;hlt,
um die Einsch&auml;tzung vorzunehmen. Die Aussagen k&ouml;nen
kumulativ sein oder f&uuml;r sich alleine stehen. Der/die
Trainer/in entscheidet bei der Bewertung, welches Kriterium am
Besten zu der bewerteten Arbeit passt.</p>
<p><b>Rubrikenbewertung.</b> Bei dieser Form kann mehr als ein
Kriterium f&uuml;r die Bewertung verwandt werden. Die Zahl der
Kriterien wird bei den Einstellungen festgelegt. F&uuml;r jedes
Kriterium k&ouml;nnen bis zu f&uuml;nf Bewertungsebenen
festgelegt werden (level statements). In einer &Uuml;bung kann
die Zahl der Level f&uuml;r jedes Kriterium gesondert festgelegt
werden. Bei der Eingabe der Level signalisiert ein leeres
Level-Feld das Ende. Einige Kriterien haben wom&ouml;glich zwei,
andere f&uuml;nf Level f&uuml;r die Bewertung. Den Leveln werden
Punktwerte zugeordnet =,1,2,3,4. Die Gesamtbewertung der
&Uuml;bung resultiert aus der gewichteten Summe dieser
Punkte.</p>