<html>
<head>
<title>Bewertungsstrategie</title>
</head>
<body>
<p align="center"><b>Bewertungsstrategie</b></p>
<p>Es gibt vielfach M&ouml;glichkeiten, das Bewertungschema zu
gestalten.</p>
<ol>
<li><b>Keine Benotung:</b> Diese Form ist geeignet, wenn die/der
Trainer/in keine quantitative Note f&uuml;r die abgegebene Arbeit
vergeben will. Die/der Teilnehmer/in kommentiert die eigene
Arbeit, bewertet sie aber nicht. Die/der
Trainer/in kann, wenn
gew&uuml;nscht, diese Kommentare bewerten (Bewertung der
Bewertung) und daraus die Abschlu&szlig;note bilden. Wenn sie/er
darauf verzichtet, wird keine Abschlu&szlig;note vergeben.</li>
<li><b>Zusammenfassende Bewertung:</b> Dies ist die
voreingestellte Form der Bewertung. Die Note setzt sich aus
mehreren Bewertungselementen, zumeist 5 bis 15 Elementen,
zusammen. Wie viele Elemente verwandt werden h&auml;ngt von
Umfang und Komplexit&auml;t der Arbeit ab.
<p>Die Elemente haben folgende M&ouml;glichkeiten zur
Einstellung:</p>
</li>
<li>Die BESCHREIBUNG der Pr&uuml;fungselemente. Dies legt klar
fest, welche Aspekte gepr&uuml;ft werden. Bei einer qualitativen
Pr&uuml;fung sollten Details festgelegt werden, was eine
hervorragende, eine durchschnittliche und eine schlechte
L&ouml;sung darstellt.</li>
<li>Die BEWERTUNGSSKALEN f&uuml;r die Pr&uuml;fungselemente. Eine
Reihe von Skalen sind bereits vordefiniert. Sie k&ouml;nnen
einfach ausgew&auml;hlt werden. Sie reichen von einfachen
Ja/Nein-Skalen &uuml;ber Mehrpunkt-Skalen zu Prozentpunkt-Skalen.
Jedes Element der Pr&uuml;fung hat seine eignen Skalen zur
Bewertung und mu&szlig; vor Beginn der Pr&uuml;fung festgelegt
werden. Jede verwandte Skala hat zun&auml;chst das gleiche
Gewicht bei der Festlegung der Schlu&szlig;note.</li>
<li>Die GEWICHTUNG der Pr&uuml;fungselemente. In der
Grundeinstellung haben alle Pr&uuml;fungselemente die gleiche
Bedeutung f&uuml;r die Note. Dies kann individuell eingestellt
werden. Die Gewichtung kann auch negative Werte umfassen. Diese
M&ouml;glichkeit befindet sich zur Zeit noch in der
Erprobung.</li>
</ol>
<ul class="noindent">
<li><b>Zusammenfassende Fehlerbewertung:</b> Die Kriterien
beschreiben in der Regel Aspekte, die in der Arbeit erf&uuml;llt
sein sollten. Die Bewertung ergibt sich aus der Erf&uuml;llung
oder Nicht-Erf&uuml;llung festgelegter Kriterien. Die/der
Trainer/in
mu&szlig; festlegen, welche Noten vergeben werden, wenn alle
Kriterien erf&uuml;llt sind, wenn eines fehlt, wenn zwei fehlen
usw. Wenn einzelne Kriterien wichtiger sind als andere
k&ouml;nnen sie entsprechend unterschiedlich bei der Ermittlung
der Gesamtbewertung gewichtet werden.</li>
<li><b>Kriterienbewertung.</b> In dieser Form wird eine Auswahl
von Leveln f&uuml;r das Kriterium angezeigt und ausgew&auml;hlt,
um die Einsch&auml;tzung vorzunehmen. Die Aussagen k&ouml;nen
kumulativ sein oder f&uuml;r sich alleine stehen. Die/der
Trainer/in
entscheidet bei der Bewertung, welches Kriterium am Besten zu der
bewerteten Arbeit passt.</li>
<li><b>Rubrikenbewertung.</b> Bei dieser Form kann mehr als ein
Kriterium f&uuml;r die Bewertung verwandt werden.</li>
</ul>
</body>
</html>
