<html>
<head>
<title>Verwaltung von &Uuml;bungsaufgaben</title>
</head>
<body>
<p align="center"><b>Verwaltung von &Uuml;bungsaufgaben</b></p>
<p>Eine &Uuml;bungsaufgabe ist komplexer als eine einfach
Pr&uuml;fung. Sie vrl&auml;uft &uuml;ber vier Schritte oder
Phasen:</p>
<ol>
<li>
<p><b>Eine &Uuml;bung anlegen</b> Die Bewertung wird erleichtert,
wenn verschiedene Bewertungselemente definiert werden. Die
Bewertung wird dadurch weniger willk&uuml;rlich und stellt den
Teilnehmer/innen eine Grundlage f&uuml;r die
Selbsteinsch&auml;tzung und -bewertung zur Verf&uuml;gung. Der/die
Trainer/in hat die Aufgabe die Bewertungselemente in einem
Bewertungsbogen festzulegen.</p>
<p>In einem Word-Dokument oder einer HTML-Datei werden die
Aufgaben oder die &Uuml;bungen f&uuml;r die Teilnehmer/innen
beschrieben. Sie wird in der n&auml;chsten Phase angezeigt.</p>
<p>Trainer/in k&ouml;nnen, wenn sie wollen, eine Reihe &auml;hnlicher
Aufgabenstellungen bereitstellen. Sie m&uuml;ssen einander so
&auml;hnlich sein, dass sie mit dem gleichen Bewertungsbogen
bewertet werden k&ouml;nnen. Die Bereitstellung mehrerer
&auml;hnlichen Aufgaben sollte gut &uuml;berlegt sein. Es handelt
sich um eine Option. Es ist genauso gut m&ouml;glich, eine
einzelne Aufgabenstellung einzustellen.</p>
</li>
<li>
<p><b>Bearbeitung und Bewertung durch die Teilnehmer/innen</b>
Die Aufgabe wird nun den Teilnehmer/innen zur Verf&uuml;gung
gestellt. Stehen mehrere Aufgaben zur Verf&uuml;gung werden diese
nach dem Zufallsprinzip den Teilnehmer/innen zugewiesen. Sie
haben keine Auswahlm&ouml;glichkeit.</p>
<p>Bevor die Teilnehmer/innen ihre Arbeit abgegeben k&ouml;nnen,
m&uuml;ssen sie das Selbstbewertungsformular ausf&uuml;llen. Erst
wenn sie es komplett ausgef&uuml;llt haben, wird das
Upload-Formular zur Abgabe der Arbeit angezeigt. Die
Teilnehmer/innen k&ouml;nnen die Arbeit im Lichte der
Selbstbewertung noch einmal &uuml;berarbeiten. Der/die Trainer/in sieht
das ausgef&uuml;llte Selbstbewertungsformular und kann dazu
Kommentare und Bewertungen abgeben. Dies ist eine zweiseitige
Bewertung. Am Ende kann der/die Trainer/in den/die Teilnehmer/in
auffordern, die Arbeit noch einmal durchzusehen und zu
&uuml;berarbeiten.</p>
<p>Wenn der/die Teilnehmer/in eine &Uuml;berarbeitung vornimmt,
kann der/die Trainer/in eine Neubewertung vornehmen. Wenn der/die Trainer/in es
zul&auml;&szlig;t die Arbeit mehrfach einzureichen, mu&szlig; er/sie
entscheiden, ob die Gesamtbewertung auf der Grundlage der
Durchschnittsnote aller eingereichten Arbeiten des/der
Teilnehmer/in oder auf der besten Arbeit beruht. Diese Einstellung
kann jederzeit ver&auml;ndert werden.</p>
</li>
<li>
<p><b>Abschlu&szlig; der Arbeit und Bewertung durch die
Teilnehmer/innen</b> Wenn der Abgabetermin verstrichen ist
k&ouml;nnen keine weiteren Arbeiten mehr abgegeben werden und
keine Selbstbewertungen mehr vorgenommen werden. Der/die Trainer/in
sollte nun alle Bewertungen der eingereichten Arbeiten vornehmen
und noch nicht bewertete Selbsteinsch&auml;tzungen bewerten.</p>
</li>
<li>
<p><b>Bekanntgabe der Gesamtnote und der Noten&uuml;bersicht</b>
In dieser abschlie&szlig;enden Phase k&ouml;nnen die
Teilnehmer/innen ihre Abschlu&szlig;note einsehen. In allen
anderen Phase (au&szlig;er der ersten) k&ouml;nnen die
Teilnehmer/innen ebenfalls ihre Bewertungen einsehen. Es handelt
sich dabei aber immer nur um vorl&auml;ufige Noten oder
Teilergebnisse.</p>
<p>Den Teilnehmer/innen (und dem/der Trainer/in) werden
"Noten&uuml;bersichten" f&uuml;r die Arbeiten zur Verf&uuml;gung
gestellt. Sie sind in der Reihenfolge der Noten aufgestellt. Die
beste Bewertung steht oben auf der Liste. Die angezeigten
Bewertungen wurden von dem/der Trainer/in vergeben. Wenn von einem/r Teilnehmer/in
mehr als eine Arbeit eingereicht wurde, wird die beste Arbeit
ber&uuml;cksichtigt.</p>
</li>
</ol>
<p>Die Note ist eine gewichtete Kombination aus der Note f&uuml;r
die Arbeit und die (erste) Selbstbewertung. Beide Teile sind so
lange gleichstark gewichtet, bis auf der Verwaltungsseite eine
andere Gewichtung eingestellt wird. Die Gewichtung kann jederzeit
ver&auml;ndert werden.;/p&gt;</p>
<p>In jeder Phase kann der/die Trainer/in auf der Verwaltungsseite
Ver&auml;nderungen vornehmen. Er/sie findet dort die
Selbstbewertungen der Teilnehmer/innen und die abgegebenen
Arbeiten. Er/sie kann diese Seite nutzen, um Arbeiten zu bewerten und
erneut zu bewerten, Noten und Wiederbenotungen der
Selbstbewertungen vorzunehmen oder Arbeiten und Selbstbewertungen
zu l&ouml;schen. Die Seite gibt einen guten &Uuml;berblick
&uuml;ber den Fortschritt der Pr&uuml;fung.</p>
</body>
</html>
