<img alt="" src="<?php echo $CFG->wwwroot?>/mod/exercise/icon.gif" />&nbsp; <b>&#220;bungen</b>
<p>Eine &#220;bung ist eine einfache aber wirkungsvolle
Aufgabenstellung. In einer &#220;bung wird der/die Teilnehmner/in
aufgefordert selber eine Arbeit anzufertigen. Dies kann ein Text,
eine Pr&#228;sentation oder eine Tabellenberechnung sein. Die/der
Teilnehmer/in ist aufgefordert nach er Fertigstellung, die eigene
Arbeit selber zu bewerten. Wenn er die eigene Arbeit und die
Selbstbewertung an den Lehrer weitergegeben hat, kann dieser
beide Teile (Arbeit und Selbstbewertung) bewerten. Der/die Trainer/in
kann dem/der Teilnehmer/in ein Feedback geben und auffordert die
Arbeit zu &#252;berarbeiten und ggfs. wieder abzugeben.</p>
<p>Zur Vorbereitung stellt der/die Trainer/in eine Aufgabe zur
Verf&#252;gung z.B.</p>
<ol>
<li>als Word-Dokument oder als HTML-Datei, die in die
Aufgabenstellung einf&#252;hrt und den TeilnehmerInnen
erl&#228;uter, was sie zu tun haben. Diese Datei wird in die
&#220;bung hochgeladen.</li>
<li>Erg&#228;nzen der Textelemente und Auswahl der Optionen im
Bewertungsformular. Dieses Formular wird von den Teilnehmer/innen
und dem/der Trainer/in zur Bewertung der fertigen Aufgaben benutzt. Dazu
k&#246;nnen verschiedene Bewertungsformen genutzt werden (siehe
Hilfetext zu "Bewertungsstrategie")</li>
</ol>
<p>In gro&#223;en Gruppen kann es aus der Sicht des/der Trainer/in
sinnvoll sein, mehr als eine Version der &#220;bungsaufgabe zu
erstellen. Diese Varianten f&#252;hren zu einer
gr&#246;&#223;eren Bandbreite von Aufgaben und zu Unterschieden
in den Herausforderungen der Aufgaben. Die Aufgaben werden den
Teilnehmer/innen nach dem Zufallsprinzip zugewiesen. Jede/r
erh&#228;lt nur einen Aufgabe. Die verschiedenen Aufgaben werden
jedoch gleichm&#228;&#223;ig oft ausgegeben. Die verschiedenen
Aufgaben sollten sich nicht zu stark unterscheiden, so dass das
gleiche Bewertungsformular verwandt werden kann.</p>
<p>Mit der Beschreibung der Aufgabenstellungen und dem
vorbereiteten Bewertungsformular wird die &#220;bung f&#252;r die
Teilnehmer/innen gestartet. Wenn die Teilnehmer/innen ihre Arbeit
fertiggestellt haben, m&#252;ssen sie sie selbst bewerten mit
Hilfe des Bewertungsformulars bevor sie dann ihre Arbeit dem/der Trainer/in
einreichen. Das Bewertungsformular kann verwandt werden als
"Checkliste" von den Teilnehmer/innen. Sie k&#246;nnen, wenn sie
wollen beide Teile noch einmal &#252;berarbeiten, bevor sie sie
abgeben.</p>
<p>Wenn die/der Teilnehmer/in die eigene Arbeit und die Selbstbewertung
abgegeben hat, kann auch der/die Trainer/in sie einsehen. Sie/er kann die
Bewertung vornehmen und einen Kommentar eintragen. Bei der
Bewertung kann sie/er von der Selbstbewertung ausgehen und dann die
Arbeit einsch&#228;tzen. Sie/r kann den/die Teilnehmer/in auch
auffordern, die Arbeit noch einmal durchzusehen und zu
&#252;berarbeiten und dann die bearbeitete Fassung wieder
abzugeben.</p>
<p>Wenn der/die Trainer/in den Eindruck hat, dass die Arbeit noch weiter
entwickelt werden kann, bietet sie/er der/dem Teilnehmer/in die
M&#246;glichkeit, die Arbeit erneut abzugeben. Die aktualisierte
Arbeit bewertet er auf dem Formblatt mit dem bereits die erste
Fassung bewertet wurde.</p>
<p>Wenn der Schlu&#223;zeitpunkt f&#252;r die Abgabe der Arbeiten
erreicht ist, geht die &#220;bung in die n&#228;chste Phase. Die
weitere Abgabe von Arbeiten durch Teilnehmer/innen ist nun nicht
mehr m&#246;glich. Der/die Trainer/in bewertet nun alle Arbeiten, die
bislang noch nicht bewertet wurden.</p>
<p>Wenn alle Arbeiten bewertet wurden, kann der letzte Schritt
gestartet werden. Die Bewertungen werden f&#252;r die
Teilnehmer/innen ver&#246;ffentlicht. Die Note setzt sich
zusammen aus der Note des/der Trainer/in f&#252;r Arbeit und f&#252;r
die Bewertung des Teilnehmers/in. (Die Bewertung des Teilnehmers
f&#252;r die eigenen Arbeit wird <b>nicht</b> verwandt.)</p>
<p>Wenn der/die Trainer/in es zul&#228;sst, Arbeiten wiederholt
einzureichen, sollte er/sie beachten wie die Einstellung zur
Berechnung der Schlu&#223;note eingestellt ist. Sie/er kann
w&#228;hlen zwischen der besten Bewertung und einer mittleren
Bewertung der verschiedenen Arbeiten. Diese Einstellung kann
jederzeit ge&#228;ndert werden und wirkt sich direkt auf die
Berechnung der Endnote aus.</p>
<p>In der Schlu&#223;phase k&#246;nnen die Teilnehmer/innen eine
"Bewertungstabelle " der Arbeiten einsehen. Die beste Arbeit
steht an der Spitzer der Liste. Die weiteren Arbeiten sind nach
ihrer Bewertung geordnet. Falls mehrere Arbeiten eingereicht
wurden, wird nur die beste Arbeit eines/r Teilnehmers/in angezeigt.</p>