<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
</head>
<body>
<p align="center"><b>Composition de la note finale</b></p>
<p>Le tableau sur cet &eacute;cran montre votre note finale et comment
elle a &eacute;t&eacute; calcul&eacute;e. La note finale se compose
potentiellement de trois &eacute;l&eacute;ments&nbsp;:</p>
<ol>
  <li>La note accord&eacute;e par le professeur pour le travail que
vous avez soumis.</li>
  <li>La moyenne des notes accord&eacute;es par vos pairs (les
&eacute;tudiants) qui ont &eacute;valu&eacute; le travail que vous avez
soumis.</li>
  <li>Une note qui refl&egrave;te comment vous vous &ecirc;tes
vous-m&ecirc;me acquitt&eacute; de votre r&ocirc;le de correcteur.
Cette note a &eacute;t&eacute; &eacute;tablie en
tenant compte des &eacute;l&eacute;ments suivants&nbsp;: <br>
  </li>
</ol>
<ul>
  <ul>
    <li>si vos notes &eacute;taient trop hautes ou trop basses en
comparaison avec la note moyenne des autres &eacute;tudiants (biais) <br>
    </li>
  </ul>
</ul>
<ul>
  <ul>
    <li>si vos notes suivent la moyenne des notes donn&eacute;es par
les autres &eacute;tudiants (fiabilit&eacute;) <br>
    </li>
  </ul>
</ul>
<ul>
  <ul>
    <li>la qualit&eacute; de vos commentaires sur les autres travaux
que vous avez &eacute;valu&eacute;s (qualit&eacute;)
Ce dernier aspect a &eacute;t&eacute; &eacute;valu&eacute; par le
professeur. <br>
    </li>
  </ul>
</ul>
<div style="margin-left: 40px;">Ces trois &eacute;l&eacute;ments qui
refl&egrave;tent le biais, la fiabilit&eacute; et la qualit&eacute; de
vos &eacute;valuations ont &eacute;t&eacute; pond&eacute;r&eacute;s par
les facteurs 1:2:3 respectivement afin de calculer la note sur la
qualit&eacute; de vos &eacute;valuations. En d'autres termes,
l'&eacute;valuation du professeur de la qualit&eacute; de vos
commentaires a le m&ecirc;me poids que les facteurs sur le biais et de
la fiabilit&eacute; combin&eacute;s. </div>
<ol>
</ol>
<p>La pond&eacute;ration de ces trois composantes pour le calcul de la
note finale est fonction du type de travail &agrave; accomplir et a
&eacute;t&eacute; d&eacute;cid&eacute;e par le professeur. Ces poids
sont affich&eacute;s dans le petit tableau.
</p>
</body>
</html>
