<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
</head>
<body>
<p align="center"><b>Calcul de la note finale</b></p>
<p>Le tableau sur cet &eacute;cran montre comment les notes finales des
&eacute;tudiants sont calcul&eacute;es. Les notes finales sont une
somme pond&eacute;r&eacute;e d'un maximum de cinq composantes. Les
voici&nbsp;: </p>
<ol>
  <li>La note accord&eacute;e par le professeur pour le travail soumis
par l'&eacute;tudiant. Cette note est facultative et sera
employ&eacute;e si le professeur &eacute;value r&eacute;ellement le
travail de l'&eacute;tudiant. Si l'&eacute;tudiant soumet plus d'une
version du travail, on utilise alors la
&laquo;&nbsp;meilleure&nbsp;&raquo; note pond&eacute;r&eacute;e. La
meilleure note signifie la note pond&eacute;r&eacute;e la plus haute,
qui est une combinaison de la note du professeur et de la note de ses
pairs.</li>
  <li>La moyenne des notes accord&eacute;es par ses pairs pour le
travail soumis par l'&eacute;tudiant. Si l'&eacute;tudiant soumet plus
d'une version du travail, on utilise alors la
&laquo;&nbsp;meilleure&nbsp;&raquo; note pond&eacute;r&eacute;e. La
note des pairs peut optionnellement inclure la note du professeur.
Cette note sera incluse si le nombre des notes accord&eacute;es par les
pairs est tr&egrave;s bas ou si le professeur met en doute les notes
des pairs &agrave; cause d'un manque de fiabilit&eacute;, de notes trop
basses ou trop &eacute;lev&eacute;es). Lorsque la note du professeur
est incluse, elle a le m&ecirc;me poids que les notes des
&eacute;tudiants dans le calcul de la moyenne. </li>
  <li>Le biais que l'&eacute;tudiant introduit par des notes trop
hautes ou trop basses dans l'&eacute;valuation par les pairs. Ce n'est
pas une mesure absolue, car elle est bas&eacute;e sur la
diff&eacute;rence entre la note de l'&eacute;tudiant et les moyennes
des notes des autres &eacute;tudiants pour chacune des soumissions
qu'ils ont &eacute;valu&eacute;es. En g&eacute;n&eacute;ral, cette
composante ne devrait pas avoir un poids tr&egrave;s
&eacute;lev&eacute;. </li>
  <li>La fiabilit&eacute; des &eacute;valuations faites par
l'&eacute;tudiant. C'est une mesure qui indique jusqu'&agrave; quel
point les notes accord&eacute;es par l'&eacute;tudiant suivent la
moyenne des notes accord&eacute;es par les autres &eacute;tudiants pour
les m&ecirc;mes &eacute;valuations. La mesure enl&egrave;ve le biais
introduit par l'&eacute;tudiant et fait la moyenne des
diff&eacute;rences absolues entre la note accord&eacute;e par
l'&eacute;tudiant et les notes moyennes des autres &eacute;tudiants. En
la th&eacute;orie, l'&eacute;tudiant qui donne une note
&eacute;lev&eacute;e pour les bons travaux et une note faible pour les
mauvais travaux sera consid&eacute;r&eacute; comme fiable. Si le
professeur &eacute;value que les les &eacute;tudiants en
g&eacute;n&eacute;ral ne sont pas bons correcteurs, la note du
professeur devrait &ecirc;tre incluse pour rendre les notes sur la
valeur de fiabilit&eacute; plus significatives. </li>
  <li>La note moyenne donn&eacute;e par le professeur pour les
&eacute;valuations de l'&eacute;tudiant. Ceci inclut les deux
&eacute;valuations pr&eacute;liminaires faites par l'&eacute;tudiant
sur les exemples de travaux fournis par le professeur et toutes les
notes du professeur sur les &eacute;valuations produites pendant la
phase d'&eacute;valuation par les pairs. En g&eacute;n&eacute;ral,
cette composante est probablement plus importante que les composantes
sur le biais et sur la fiabilit&eacute;. Le poids de cette composante
(lorsque la pond&eacute;ration est disponible) devrait donc &ecirc;tre
sup&eacute;rieur.</li>
</ol>
<p>Ces cinq composantes peuvent &ecirc;tre pond&eacute;r&eacute;es
selon les objectifs du professeur et en fonction du type de travail.
Par exemple, la note du professeur pourrait avoir un fort poids si
l'&eacute;valuation par les pairs a une importance minime dans le
travail. Ou, si le professeur &eacute;value seulement quelques-unes des
soumissions ou s'il consid&egrave;re comme tr&egrave;s important le
r&ocirc;le de correcteur pour les &eacute;tudiants, les notes
accord&eacute;es par le professeur peuvent &ecirc;tre ignor&eacute;es
en leur donnant un poids nul ou tr&egrave;s faible. Dans ce dernier
exemple, c'est la capacit&eacute; d'&eacute;valuer des &eacute;tudiants
qui d&eacute;terminent les notes finales.</p>
<p>Notez que cet &eacute;cran est utilis&eacute; it&eacute;rativement
et les notes finales ne sont pas normalement disponibles aux
&eacute;tudiants avant la phase finale du travail. Une fois que le le
professeur est satisfait des notes finales et de leurs
pond&eacute;rations, elles sont alors affich&eacute;es. aux
&eacute;tudiants.
</p>
</body>
</html>
