<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
</head>
<body>
<p align="center"><b>Strat&eacute;gies d'&eacute;valuation</b></p>
<p>La <span style="font-weight: bold;">grille de correction</span>
pour &eacute;valuer un travail devrait avoir
un nombre raisonnable de <span style="font-weight: bold;">crit&egrave;res
d'&eacute;valuation</span>, soit
entre 5 et 15 crit&egrave;res selon la complexit&eacute; du travail. Il
est possible d'avoir un travail &eacute;valu&eacute; par les pairs avec
un seul crit&egrave;re, la strat&eacute;gie d'&eacute;valuation
&eacute;tant alors semblable &agrave; celle du devoir. </p>
<p>Le type de grille de correction d&eacute;pend de la <span
 style="font-weight: bold;">strat&eacute;gie
d'&eacute;valuation d&eacute;sir&eacute;e</span>&nbsp;:</p>
<ol>
  <li><b>&Eacute;valuation formative avec grille d'observation. </b>Les
crit&egrave;res peuvent prendre la forme
de descriptions de certains aspects du travail, de questions, de
commentaires. Le correcteur doit fournir ses observations sur le
travail en fonction de ces crit&egrave;res. Comme avec toutes les
strat&eacute;gies
d'&eacute;valuation, un espace est pr&eacute;vu pour des commentaires
d'ordre g&eacute;n&eacute;ral. L'&eacute;valuation est de type
qualitatif et donc le correcteur n'attribue pas de note. Le professeur
peut toutefois accorder une note pour l'&eacute;valuation du correcteur
qui sera &agrave; la base de la note qui appara&icirc;tra dans le
rapport des r&eacute;sultats du cours. Aucune note n'appara&icirc;tra
si le professeur ne donne pas de note.<br>
  </li>
  <li><b>Crit&egrave;res avec une &eacute;chelle d'appr&eacute;ciation.</b>
C'est la strat&eacute;gie par d&eacute;faut. L'&eacute;valuation se
fait &agrave; partir d'&eacute;nonc&eacute;s qui d&eacute;crivent&nbsp;
des aspects d&eacute;sirables dans le travail. Le correcteur attribue
une note &agrave; partir d'une &eacute;chelle d'appr&eacute;ciation
pour chaque crit&egrave;re. Chaque crit&egrave;re a les trois
caract&eacute;ristiques
suivantes&nbsp;: </li>
  <ul>
    <li><span style="font-style: italic;">Une description</span>&nbsp;:
La description explique clairement quel aspect de la t&acirc;che est
&eacute;valu&eacute;. Si l'&eacute;valuation est qualitative, on doit
inclure des d&eacute;tails sur ce qui est consid&eacute;r&eacute; comme
excellent, moyen et faible.</li>
  </ul>
  <ul>
    <li><span style="font-style: italic;">Une &eacute;chelle
d'appr&eacute;ciation</span>&nbsp;: Moodle offre plusieurs
&eacute;chelles pr&eacute;d&eacute;finies qui vont du simple Oui/Non
&agrave; une &eacute;chelle en pourcentage, en passant par une
&eacute;chelle de plusieurs points qui va d'excellent &agrave;
tr&egrave;s faible. Le professeur choisit l'&eacute;chelle en fonction
du type de crit&egrave;re. Le nombre de division sur l'&eacute;chelle
ne d&eacute;termine pas l'importance relative du crit&egrave;re&nbsp;:
c'est le poids du crit&egrave;re qui remplit cette fonction.</li>
  </ul>
  <ul>
    <li><span style="font-style: italic;">Un poids </span>: Par
d&eacute;faut, tous les crit&egrave;res ont le m&ecirc;me poids dans le
calcul de la note finale du travail. Le professeur peut toutefois
modifier l'importance relative de chaque crit&egrave;re en accordant un
poids plus grand que 1 &agrave; un crit&egrave;re plus important et un
poids inf&eacute;rieur &agrave; 1 &agrave; un crit&egrave;re moins
important (on peut fixer le poids &agrave; une valeur n&eacute;gative).
Le changement des poids des crit&egrave;res ne fait pas varier la note
maximale, car celui-ci d&eacute;pend d'un des param&egrave;tres de
l'atelier. </li>
    <ul>
    </ul>
  </ul>
  <li><b>Liste de v&eacute;rification.</b> Des crit&egrave;res
d&eacute;crivent les &eacute;l&eacute;ments qui doivent &ecirc;tre
pr&eacute;sents ou les aspects qui doivent &ecirc;tre couverts dans le
travail. Le correcteur doit d&eacute;terminer si <span
 style="font-style: italic;">oui </span>ou <span
 style="font-style: italic;">non </span>ces
&eacute;l&eacute;ments ou ces aspects se retrouvent dans le travail qui
a &eacute;t&eacute; soumis. Le professeur &eacute;tablit un
bar&egrave;me de correction lorsque tous les &eacute;l&eacute;ments
sont pr&eacute;sents, un &eacute;l&eacute;ment est absent, deux
&eacute;l&eacute;ments sont absents, etc. Il peut aussi modifier le
poids de chaque crit&egrave;re pour &eacute;tablir son importance
relative. La somme des erreurs correspond &agrave; la somme
pond&eacute;r&eacute;e des &eacute;l&eacute;ments manquants. Il n'est
pas n&eacute;cessaire que la distribution des poids soit
lin&eacute;aire. Par exemple, pour dix &eacute;nonc&eacute;s les notes
pourraient &ecirc;tre : 90%, 70%, 50%, 40%, 30%, 20%, 10%, 0%, 0%, 0%.
Le
correcteur peut toujours faire une r&eacute;vision des notes
sugg&eacute;r&eacute;es pouvant aller jusqu'&agrave; 20%.<br>
  </li>
  <li><b>Niveaux d'atteinte global des objectifs. </b> Le professeur
fournit plusieurs &eacute;nonc&eacute;s qui d&eacute;crivent des
niveaux diff&eacute;rents d'atteinte des objectifs. Le correcteur doit
choisir l'&eacute;nonc&eacute; qui correspond le plus au travail qui a
&eacute;t&eacute; soumis. Les &eacute;nonc&eacute;s peuvent
d&eacute;crire des niveaux successifs ou &ecirc;tre ind&eacute;pendants
les uns des autres. Le professeur &eacute;tablit un bar&egrave;me de
correction. Le correcteur peut apporter&nbsp; une r&eacute;vision des
notes
sugg&eacute;r&eacute;es pouvant aller jusqu'&agrave; 20%. </li>
  <li><b>Grille d'&eacute;valuation crit&eacute;ri&eacute;e. </b>
Cette strat&eacute;gie est semblable &agrave; celle du niveau
d'atteinte global des objectifs &agrave; la diff&eacute;rence qu'elle
comporte
plusieurs crit&egrave;res. Le nombre de crit&egrave;res est
d&eacute;termin&eacute; dans les param&egrave;tres de l'atelier. Pour
chaque crit&egrave;re, il peut y avoir jusqu'&agrave; cinq
&eacute;nonc&eacute;s d&eacute;crivant les niveaux atteints. Ce nombre
de niveaux peut varier d'un crit&egrave;re &agrave; l'autre. Un niveau
laiss&eacute; vide par le professeur signale que le niveau
pr&eacute;c&eacute;dent est le dernier. Les crit&egrave;res peuvent
&ecirc;tre pond&eacute;r&eacute;s. Les niveaux sont marqu&eacute;s par
les chiffres 0, 1, 2, 3 et 4. Ces chiffres correspondent &agrave; la
note accord&eacute;e &agrave; chaque niveau. La note finale pour ce
travail est la somme pond&eacute;r&eacute;e des notes pour chaque
crit&egrave;re.</li>
</ol>
</body>
</html>
