<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
</head>
<body>
<p align="center"><b>Gestion d'un atelier</b></p>
<p>Un atelier est plus complexe qu'une activit&eacute; ordinaire. Le
professeur apr&egrave;s avoir cr&eacute;&eacute; l'atelier et choisit
ses param&egrave;tres, g&egrave;re son d&eacute;roulement en activant
tour &agrave; tour les diff&eacute;rentes &eacute;tapes (ou phases) de
cet atelier&nbsp;:</p>
<ol>
  <li>
    <p><b>Cr&eacute;er l'atelier</b> La premi&egrave;re &eacute;tape
est automatiquement activ&eacute;e lors de la cr&eacute;ation de
l'atelier. Le professeur a d&eacute;cid&eacute; des param&egrave;tres
de l'atelier et il doit maintenant fournir les crit&egrave;res ou les
&eacute;nonc&eacute;s qui serviront &agrave; l'&eacute;valuation des
travaux qui seront soumis par les &eacute;tudiants. L'&eacute;valuation
sera donc moins arbitraire et plus &eacute;quitable en donnant aux
&eacute;tudiants un cadre de r&eacute;f&eacute;rence pour corriger les
travaux de leurs pairs. Le professeur a la responsabilit&eacute; de
fournir la grille et le bar&egrave;me de correction (voir l'aide
&agrave; ce sujet pour plus de d&eacute;tails).</p>
    <p>Le professeur pr&eacute;sente par la suite des
&eacute;chantillons de travaux pour servir d'exemples et de
contre-exemples. Les &eacute;tudiants devront les &eacute;valuer afin
de s'approprier les crit&egrave;res d'&eacute;valuation avant de
cr&eacute;er et de soumettre leurs propres travaux. Cependant, avant
que les &eacute;tudiants ne puissent soumettre leurs travaux, le
professeur devrait &eacute;valuer lui-m&ecirc;me ces exemples. Ceci
fournira au professeur des sp&eacute;cimens de r&eacute;ponses
lorsqu'il &eacute;valuera les &eacute;valuations de ces exemples faites
par les &eacute;tudiants (produites dans la phase suivante). </p>
    <p>Le professeur n'est pas oblig&eacute; de fournir des exemples de
travaux. Dans certains cas, cela pourrait m&ecirc;me se
r&eacute;v&eacute;ler inappropri&eacute;. </p>
  </li>
  <li>
    <p><b>Permettre la soumission de travaux aux &eacute;tudiants</b>
Le travail peut maintenant d&eacute;buter pour les &eacute;tudiants. Si
le professeur a fourni des exemples de travaux, les &eacute;tudiants
devront en &eacute;valuer un certain nombre (selon un des
param&egrave;tres de l'atelier). Une fois qu'un &eacute;tudiant a
corrig&eacute; le nombre d'exemples requis, il peut alors soumettre son
propre travail. S'il n'y a pas d'exemples &agrave; corriger, les
&eacute;tudiants peuvent d&egrave;s lors soumettre leurs travaux.</p>
    <p>Il est pr&eacute;f&eacute;rable de laisser l'atelier dans cette
phase pendant un certain temps afin de recueillir un nombre suffisant
de travaux pour en assurer une meilleure distribution aupr&egrave;s des
&eacute;tudiants-correcteurs. Les travaux seront distribu&eacute;s dans
les deux phases suivantes. Si le travail passe sans d&eacute;lai dans
la phase &laquo;&nbsp;Permettre les soumissions et les
&eacute;valuations&nbsp;aux &eacute;tudiants&raquo; (cela est permis),
les &eacute;tudiants qui soumettent leurs travaux en premier auront ces
premiers travaux &agrave; corriger, tandis que les &eacute;tudiants qui
seront les derniers &agrave; soumettre leurs travaux auront ceux-ci
&agrave; corriger. Ce d&eacute;lai r&egrave;gle en grande partie ce
probl&egrave;me. </p>
    <p>Lorsqu'un &eacute;tudiant soumet un travail, le professeur peut,
s'il le d&eacute;sire, &eacute;valuer ce travail. Cette
&eacute;valuation peut &ecirc;tre incorpor&eacute;e &agrave; la note
finale de l'&eacute;tudiant. Ces &eacute;valuations peuvent avoir lieu
dans les phases de soumission et d'&eacute;valuation du travail. Les
&eacute;valuations du professeur faites apr&egrave;s le calcul des
notes finales ne seront &eacute;videmment pas consid&eacute;r&eacute;es.</p>
  </li>
  <li>
    <p><b>Permettre les soumissions et les &eacute;valuations aux
&eacute;tudiants</b>Si le professeur a inclus l'&eacute;valuation par
les pairs pour l'atelier, les &eacute;tudiants qui ont soumis leur
travail ont alors acc&egrave;s aux travaux de leurs pairs pour qu'ils
puissent en faire l'&eacute;valuation. Les autres &eacute;tudiants
peuvent soumettre leur travail, mais <b>sans voir</b> les travaux des
autres. Dans cette phase, les &eacute;tudiants peuvent soumettre
plusieurs versions de leur travail, chaque version peut &ecirc;tre
corrig&eacute;e, le travail soumis de nouveau, le travail
recorrig&eacute;, et ainsi de suite.</p>
    <p>Le professeur peut s&eacute;parer la soumission du travail et
son &eacute;valuation par les pairs en deux phases distinctes. La
premi&egrave;re phase permet &agrave; tous les &eacute;tudiants de
soumettre leur travail avant une date d'&eacute;ch&eacute;ance. Par la
suite, tous les travaux ayant &eacute;t&eacute; re&ccedil;us, la phase
d'&eacute;valuation peut d&eacute;buter. Cette strat&eacute;gie rend
inutile la phase actuelle &laquo;&nbsp;Permettre les soumissions et les
&eacute;valuations aux &eacute;tudiants&nbsp;&raquo; puisqu'on va alors
de l'&eacute;tape &laquo;&nbsp;Permettre les soumissions&nbsp;&raquo;
&agrave; l'&eacute;tape &laquo;&nbsp;Permettre les
&eacute;valuations&nbsp;&raquo;.</p>
    <p>Par contre si le professeur ne d&eacute;sire pas cette
distinction, alors on utilise l'&eacute;tape actuelle o&ugrave; les
soumissions et les &eacute;valuations sont faites &agrave; la
m&ecirc;me &eacute;tape. Le professeur devrait ajuster le nombre de
travaux &agrave; corriger &agrave; 1 ou 2 pour permettre une meilleure
attribution des travaux (voir les param&egrave;tres de l'atelier pour
plus de d&eacute;tails). Notez cela entra&icirc;nera que certains
travaux seront corrig&eacute;s plus souvent par des
&eacute;tudiants-correcteurs et que d'autres moins souvent que la
majorit&eacute; des travaux. </p>
    <p>Lorsque son travail a &eacute;t&eacute; &eacute;valu&eacute; par
un pair, l'&eacute;tudiant peut alors consulter cette
&eacute;valuation. Il a le loisir de la commenter si le professeur a
activ&eacute; ce param&egrave;tre de l'atelier. De plus, le professeur
peut &eacute;valuer les &eacute;valuations faites par les
&eacute;tudiants-correcteurs et la note ainsi obtenue pourrait servir
au calcul de la note finale (voir l'aide sur le calcul de la note
finale).</p>
  </li>
  <li>
    <p><b>Permettre l'&eacute;valuation par les pairs</b> Dans cette
phase, les &eacute;tudiants peuvent continuer &agrave; corriger les
travaux de leurs pairs, mais ils ne peuvent soumettre leur travail ou
d'autres versions de leur travail. Les &eacute;tudiants qui n'ont pas
encore soumis leur travail et qui essaient de le faire verront un
message indiquant que cela n'est plus possible. Par cons&eacute;quent, <b>ils
ne pourront corriger de travaux de leurs pairs</b>.</p>
    <p>S'il le d&eacute;sire, le professeur peut continuer &agrave;
&eacute;valuer les &eacute;valuations des &eacute;tudiants-correcteurs
et les notes serviront aux calculs de la note finale. Dans beaucoup de
cas, cela n'est pas vraiment n&eacute;cessaire&nbsp;: voyez la phase
suivante. </p>
  </li>
  <li>
    <p><b>Calculer les notes finales</b> Une fois que
l'&eacute;ch&eacute;ance pour l'&eacute;valuation des travaux par les
&eacute;tudiants-correcteurs est atteinte, le professeur d&eacute;place
l'atelier &agrave; l'&eacute;tape suivante o&ugrave; les
&eacute;tudiants ne peuvent plus &eacute;valuer des travaux. Le
professeur peut, lui, compl&eacute;ter l'&eacute;valuation (1) des
&eacute;valuations de ses exemples faites par les &eacute;tudiants, (2)
des travaux des &eacute;tudiants et (3) des &eacute;valuations des
travaux faites par les &eacute;tudiants-correcteurs. Cette
derni&egrave;re &eacute;valuation n'est pas vraiment n&eacute;cessaire
si le nombre d'&eacute;valuation par les pairs de chaque travail est
suffisant, puisqu'alors les notes automatiquement accord&eacute;es
repr&eacute;sentant la qualit&eacute; des &eacute;valuations seront
repr&eacute;sentatives. </p>
    <p>Le professeur calcule les notes finales des &eacute;tudiants
lorsque toutes les &eacute;valuations sont termin&eacute;es. Ces notes
se comportent trois composantes&nbsp;: la note accord&eacute;e par le
professeur, la moyenne des notes accord&eacute;es par les pairs et une
note repr&eacute;sentant la qualit&eacute; des &eacute;valuations
faites par l'&eacute;tudiant-correcteur. Cette derni&egrave;re note
peut inclure une &laquo; note moyenne &raquo; entr&eacute;e par le
professeur en cons&eacute;quence des commentaires de l'&eacute;tudiant
dans ses &eacute;valuations. Le professeur accorde un poids &agrave;
chaque composante de la note avant que le calcul soit effectu&eacute;.</p>
  </li>
  <li>
    <p><b>Afficher les notes finales </b> La phase finale de l'atelier
permet aux &eacute;tudiants de voir leurs notes finales. Toutefois, le
professeur peut revenir &agrave; une &eacute;tape
pr&eacute;c&eacute;dente pour, par exemple, r&eacute;viser les poids
des composantes des notes. Les &eacute;tudiants verront alors les notes
r&eacute;vis&eacute;es.</p>
    <p>Les &eacute;tudiants et le professeur voient &eacute;galement un
tableau de la ligue qui d&eacute;nombre les meilleurs travaux produits
dans l'atelier. Ils sont affich&eacute;s selon les notes obtenues, le
meilleur travail &eacute;tant plac&eacute; au d&eacute;but du tableau.
Les notes dans ce tableau se composent des notes accord&eacute;es par
le professeur et de la moyenne des notes accord&eacute;es par les
pairs. Les notes sont pond&eacute;r&eacute;es selon les poids
accord&eacute;s &agrave; l'&eacute;tape pr&eacute;c&eacute;dente. </p>
  </li>
</ol>
<p>Le professeur peut &agrave; tout moment ouvrir <span
 style="font-weight: bold;">la page pour la gestion</span> de l'atelier
pour y voir l'&eacute;tat actuel de l'atelier et ainsi en suivre les
progr&egrave;s. On y retrouve :<br>
</p>
<ul>
  <li>la liste des exemples du professeur,</li>
  <li>la liste des &eacute;valuations par les &eacute;tudiants <br>
  </li>
  <ul>
    <li>des exemples du professeur, <br>
    </li>
    <li>de leur propre travail</li>
    <li>des travaux de leurs pairs,</li>
  </ul>
  <li>la liste des travaux soumis par les &eacute;tudiants. <br>
  </li>
</ul>
&Agrave; partir de cette page, le professeur peut &eacute;valuer et
r&eacute;&eacute;valuer les travaux, noter et renoter les
&eacute;valuations, effacer des travaux et des &eacute;valuations.
</body>
</html>
