<P ALIGN=CENTER><B>Kijelz&eacute;s form&aacute;ja</B></P>

<P>Ez a be&aacute;ll&iacute;t&aacute;s hat&aacute;rozza meg az egyes fogalmak megjelen&eacute;s&eacute;t a fogalomt&aacute;rban. Az alapbe&aacute;ll&iacute;t&aacute;s szerinti form&aacute;k a k&ouml;vetkez&#337;k:</p>
<blockquote>
<dl>
<dt><b>Egyszer&#369; sz&oacute;t&aacute;r</b>:</dt>
<dd>hagyom&aacute;nyos sz&oacute;t&aacute;ri forma k&uuml;l&ouml;n&aacute;ll&oacute; fogalmakkal. Szerz&#337; nincs megjelen&iacute;tve &eacute;s a csatolt &aacute;llom&aacute;nyok hivatkoz&aacute;sokk&eacute;nt l&aacute;that&oacute;k.</dd>
<dt><b>Folyamatos</b>:</dt>
<dd>a fogalmak egym&aacute;st k&ouml;vetik, csak a szerkeszt&#337; ikonok v&aacute;lasztj&aacute;k el &#337;ket egym&aacute;st&oacute;l.</dd>
<dt><b>Teljes, szerz&#337;vel egy&uuml;tt</b>:</dt>
<dd>F&oacute;rumszer&#369; kijelz&eacute;si forma, tartalmazza a szerz&#337; adatait is. A csatolt &aacute;llom&aacute;nyok hivatkoz&aacute;sokk&eacute;nt l&aacute;that&oacute;k.</dd>
<dt><b>Teljes, szerz&#337; n&eacute;lk&uuml;l</b>:</dt>
<dd>F&oacute;rumszer&#369; kijelz&eacute;si forma, mely nem tartalmazza a szerz&#337; adatait. A csatolt &aacute;llom&aacute;nyok hivatkoz&aacute;sokk&eacute;nt l&aacute;that&oacute;k.</dd>
<dt><b>Enciklop&eacute;dia</b>:</dt>
<dd>Ak&aacute;rcsak a teljes forma szerz&#337;vel egy&uuml;tt, de a csatolt k&eacute;pek a sorba besz&uacute;rva l&aacute;that&oacute;k.</dd>
<dt><b>GYIK</b>:</dt>
<dd>Gyakran feltett k&eacute;rd&eacute;sek megjelen&iacute;t&eacute;s&eacute;re haszn&aacute;lhat&oacute;. Automatikusan besz&uacute;rja a K&Eacute;RD&Eacute;S &eacute;s V&Aacute;LASZ szavakat a fogalom, ill. a meghat&aacute;roz&aacute;s hely&eacute;re.</dd>
</dl>
</blockquote>

<hr>
<p>A Moodle rendszergazd&aacute;ja az al&aacute;bbiak szerint hozhat l&eacute;tre &uacute;j form&aacute;kat:
<ol>
<li> Keres&eacute;s a mod/glossary/formats k&ouml;z&ouml;tt... az egyes l&eacute;tez&#337; form&aacute;k sz&aacute;mmal azonos&iacute;tott &aacute;llom&aacute;nya l&aacute;that&oacute;.
<li> M&aacute;soljuk &aacute;t ezek egyik&eacute;t &eacute;s nevezz&uuml;k el egy m&aacute;sik sz&aacute;mmal (ne feledj&uuml;k, hogy a 0 &eacute;s az 1 fenntartott azonos&iacute;t&oacute;k).
<li> Szerkessz&uuml;k ezt az &aacute;llom&aacute;nyt a saj&aacute;t form&aacute;nknak megfelel&#337;en (a PHP ter&uuml;let&eacute;n n&eacute;mi j&aacute;rtass&aacute;g sz&uuml;ks&eacute;ges).
<li> V&eacute;gezet&uuml;l sz&uacute;rjunk be egy &uacute;j fogalmat az egyes haszn&aacute;latban l&eacute;v&#337; nyelvi csomagokba <b>displayformatN</b> n&eacute;ven &eacute;s adjunk neki egy r&ouml;vid, de &eacute;rtelmezhet&#337; nevet.
</ol>
