<?PHP // $Id$ 
      // admin.php - created with Moodle 1.5 UNSTABLE DEVELOPMENT (2005011000)


$string['adminseesallevents'] = 'íÓÊØíÚ ÇáãÏÑÇÁ ãÚÇíäÉ ßá ÇáÇÍÏÇË';
$string['adminseesownevents'] = 'ÇáãÏÑÇÁ ãËá ÇáÇÎÑíä';
$string['blockinstances'] = 'ÍÇáÇÊ';
$string['blockmultiple'] = 'ãÊÚÏÏ';
$string['cachetext'] = 'ÚãÑ ÇáäÕ ÇáãÎÈÇÁ';
$string['calendarsettings'] = 'ÊŞæíã';
$string['change'] = 'ÊÛíÑ';
$string['confirmation'] = 'ÊÃßíÏ';
$string['confirmdeletedst'] = 'ÍóĞúİ ÇáãÓãøì ÇáãÚÏ ãÓÈŞÇğ  <strong>a$<strong/> ÓóíõÚØøáõ ÇáÊæŞíÊ ÇáÕíİí áßá ÇáãÓÊÎÏãíä áĞáã ÇáÅÚÏÇÏ ÇáãÓÈŞ. åĞÇ ÇáÊÛííÑ ãä ÇáãÍÊãá ÓíÄËÑ Úáì ÇÓíÚÇÈåã ááæŞÊ ÈÏæä Åí ÅäĞÇÑ. åá ÊÑÛÈ İí ÇáÃÓÊãÑÇÑ¿';
$string['confirmdeletedstdefault'] = '<strong>ÇáãÓãì ÇáãÚÏ ãÓÈŞÇğ $a ãÚãá Èå áÌãíÚ ãÓÊÎÏãí åĞÇ ÇáãæŞÚ!</strong> ÍĞİ åĞÇ ãä ÇáãÍÊãá ÓíÄËÑ Úáì ÇÓíÚÇÈåã ááæŞÊ ÈÏæä Åí ÅäĞÇÑ. åá ÊÑÛÈ İí ÇáÃÓÊãÑÇÑ¿';
$string['cronwarning'] = 'áã íÊã ÊÔÛíá cron.php ãÄÎÑÇğ (Úáì ÇáÃŞá ÎáÇá ÇáÜ 24 ÓÇÚÉ ÇáãÇÖíÉ) <br> ÅĞÇ áã Êßæä ŞÏ ÃÚÏÇÊ åĞå ÇáÎÏãÉ¡ ÇáÑÌÇÁ ãÑÇÌÚÉ ÊÚáíãÇÊ ÇáÊËÈíÊ¡ ÇáãæÌæÏÉ İí <em>Set up cron</em>';
$string['dstisapreference'] = 'ßá ãÓÊÎÏã íãßä áå Çä íÎÊÇÑ Åí ÅÚÏÇÏ ãÓÈŞ';
$string['dstisforcedto'] = 'ÃÌÈÑ ßá ÇáãÓÊÎÏãíä  ÇÓÊÎÏÇã';
$string['dstpresets'] = 'ÇáÃÚÏÇÏ ÇáãÓÈŞ ááæŞÊ ÇáÕíİí';
$string['editingdstpreset'] = 'ÍÑÑ ÇáÃÚÏÇÏ ÇáãÓÈŞ ááæŞÊ ÇáÕíİí';
$string['emptydstlist'] = 'áÇ íæÌÏ ÊÚÑíİ ãÓÈŞ ááÊæŞíÊ ÇáÕíİí. ÊÓÊØíÚ ÅÖÇİÉ æÇÍÏ ÈÇáäŞÑ Úáì ÒÑ ÇáÅÖÇİÉ.';
$string['errordstpresetactivateearlier'] = 'ÔåÑ ÇáÊäÔíØ íÌÈ Ãä íßæä ŞÈá ÔåÑ ÇáÊÚØíá';
$string['errordstpresetnameempty'] = 'áÇ íÌÈ ÊÑß ÇÓã ÇáÇÚÏÇÏ ÇáãÓÈŞ İÇÑÛÇğ';
$string['errordstpresetnameexists'] = 'íæÌÏ ÃÚÏÇÏ ãÓÈŞ íÍãá äİÓ  ÇáãÓãì';
$string['filteruploadedfiles'] = 'ÊäŞíÍ ÇáãáİÇÊ ÇáãÍãáå';
$string['helpadminseesall'] = 'åá íÓÊØíÚ ÇáãÏÑÇÁ ÑÄíÉ ßá ÇÍÏÇË ÇáÊŞæíã Ãã ÇáãÊÚáŞÉ Èåã İŞØ¿';
$string['helpcalendarsettings'] = 'ÃÚÏ ÇáÌæÇäÈ ÇáãÎÊáİÉ ááÊŞæíã æÇáÊÇÑíÎ / æŞÊ ÇáãÊÚáŞÉ ÈãæÏá.';
$string['helpdstforusers'] = 'åá íÓÊØíÚ ßá ãÓÊÎÏã ãä ÇÎÊíÇÑ ÃÚÏÇÏÇÊ ÇáÊæŞíÊ ÇáÕíİí ÇáÎÇÕ Èå¿';
$string['helpmanagedstpresets'] = 'ÃäŞÑ åĞÇ ÇáÒÑ áÅÖÇİÉ¡ ÊÍÑíÑ¡ æ ÍĞİ ÇáÃÚÏÇÏ ÇáãÓÈŞ ááÊæŞíÊ ÇáÕíİí ÇáãÊÇÍ İí åĞÇ ÇáãæŞÚ.';
$string['helpstartofweek'] = 'ãÇ åæ Çáíæã ÇáĞí íÈÏÇÁ ÈÉ ÇáÃÓÈæÚ İí ÇáÊŞæíã';
$string['helpupcominglookahead'] = 'ãÓÊŞÈáÇğ¡ ãÇ åæ ÚÏÏ ÇáÃíÇã ÇáÊí ÓíäÙÑÇáÊŞæíã ÎáÇáåÇáãÚÑİÉ ÇáÃÍÏÇË ÇáŞÇÏãÉ ÃİÊÑÇÖíÇğ¿';
$string['helpupcomingmaxevents'] = 'ÃİÊÑÇÖíÇğ¡ ßã (ÇáÍÏ ÇáÃŞÕì) ááÃÍÇË ÇáŞÇÏã ÇáÊí ÓÊÚÑÖ ááãÓÊÎÏã¿';
$string['helpweekenddays'] = 'Ãí ÇáÇíÇã ÓÊÚÇãá \"ßÚØáÉ ÇáÃÓÈæÚ\" æÇáÊí ÓÊÚÑÖ Èáæä ãÎÊáİ¿';
$string['managedstpresets'] = 'ÅÏÑÇ ÇÅÚÏÇÏ ÇáãÓÈŞ ááÊæŞíÊ ÇáÕíİí';
$string['nodstpresetsexist'] = 'ÏÚã ÇáÊæŞíÊ ÇáÕíİí ãÚØá áßá ÇáãÓÊÎÏãíä¡ æĞáß áÚÏã ÊÚÑíİ Ãí ÅÚÏÇÏ ãÓÈŞ ááÊæŞíÊ ÇáÕíİí. ÊÓÊØíÚ ÊÚÑíİ ÈÚÖ ÇáÅÚÏÇÏÇÊ ÇáãÓÈŞÉ ÈÇÓÊÎÏÇã ÇáÒÑ ÇáÊÇáí.';
$string['therewereerrors'] = 'ÊæÌÏ ÇÎØÇÁ İí ãÚáæãÇÊß';
$string['upgradelogs'] = 'áÅÏÇÁ æÙíİí ßÇãá¡ ÓÌáÇÊß ÇáŞÏíãÉ ÊÍÊÇÌ áÊÑŞíÉ <a href=\"$a\">ãÚáæãÇÊ ÅÖÇİíÉ</a>';
$string['upgradelogsinfo'] = 'áŞÏ Êã Úãá ÈÚÖ ÇáÊÛííÑÇÊö ãÄÎÑÇğ İí ØÑíŞóÉ ÊÎúÒõíä ÇáÓÌáÇÊö. áÊÊãßä ãä ÑÄíÉ ÓÌáÇÊß ÇáŞÏíãÉ áßá äÔÇØ íÊÓäì Úáíß ÊÑŞíÉ åĞå ÇáÓÌáÇÊ ÇáŞÏíãÉ. åĞÇ ÇáÃÌÑÇÁ ÓíÓÊÛÑŞ æŞÊ (Úáì ÓÈíá ÇáãËÇá ÚÏÉ ÓÇÚÇÊ) æãä Çáããßä Ãä Ãä íÈØÆ ŞÇÚÏÉ ÇáÈíÇäÇÊ ÅĞÇ ßÇä ÇáãæŞÚ ßÈíÑ. ÈãÌÑÏ ÇáÈÏÁ ÈåĞÇ ÇáÃÌÑÇÁ íÌÈ Úáíß ÊÑßÉ ÍÊì íäÊåí æĞáß (ÈÅÈúŞÇÁ äÇİĞÉö ÇáãÊÕİøÍó íóİúÊÍõ). áÇÊŞáŞ - ÃËäÇÁ åĞÇ ÇáÃÌÑÇÁ  ÓíÚãá ãæŞÚßó ÈÔßá Óáíã æáä íÊÃËÑ ÅÏÇÁ ÇáãÓÊÎÏãæä ááãæŞÚ ÃËäÇÁ åĞÇ ÇáÃÌÑÇÁ. <br /> <br /> åóáú ÊõÑíÏõ ÊóÑúŞöíÉ ÓÌáÇÊößó ÇáÂä¿';
$string['upgradesure'] = 'áŞÏ Êã ÇÓÊÈÏÇá ãáİÇÊ ãæÏá¡ æÇäÊ ÇáÂä Úáì æÔß ÊÑŞíÉ ãæŞÚß ÈÇáÃÕÏÑ
<p><b>a$<>/b<>/p
<p>áÇ ÊÓÊØíÚ ÇáÚæÏÉ Åáì ÇáÎáİ ÈãÌÑÏ ÇáÃäÊåÇÁ ãä åĞÇ ÇáÃÌÑÇÁ.</p>
<p>åá ÃäÊ ãÊÃßÏ ááŞíÇã ÈÚãíáÉ ÇáÊÑŞíÉ åĞå¿ </p>';
$string['upgradinglogs'] = 'ÊÑŞíÉ ÇáÓÌáÇÊ';

?>
