<?PHP // $Id$ 
      // auth.php - created with Moodle 1.3 development (2004042600)


$string['auth_dbdescription'] = 'ם׃Ê־ֿד ו׀ַ ַבֳ׃בזָ ּֿזב ָםַהַÊ ־ַּׁם בבÊֽÞÞ דה ױֹֽ ַ׃ד ַבד׃Ê־ֿד זßבדֹ ַבדׁזׁ. זÝם ַֽבֹ ַבֽ׃ַַָÊ ַבּֿםֹֿ ÝÞֿ םÊד ה׃־ ַבדÚבזדַÊ דה ַבֽÞזב ַבֳ־ׁל ֳםײַ זהÞבוַ ֵבל הÙַד Moodle.';
$string['auth_dbextrafields'] = 'ו׀ו ַבֽÞזב ַ־Êםַׁםֹ¡ זםדßהß דבֱ ָÚײ ֽÞזב ַבד׃Ê־ֿד Ýם הÙַד Moodle  ד׃ָÞַ ַָבדÚבזדַÊ דה <B>ֽÞזב ַבָםַהַÊ ַב־ַּׁםֹ</B> ַבÊם ÊÞזד ָÊֽֿםֿוַ והַ. <P>ֵ׀ַ ÊׁßÊ ו׀ו ַבֳדַßה ÝַׁÛֹ Ý׃זÝ םÊד ַ־Êםַׁ ַבֳזײַÚ ַבַÝÊַׁײםֹ.<P>זÝם ßב ַבֳֽזַב¡ Ý׃זÝ םÊדßה ַבד׃Ê־ֿד דה ÊÚֿםב ßב Êבß ַבֽÞזב ָÚֿ ַבֿ־זב.';
$string['auth_dbfieldpass'] = 'ַ׃ד ַבֽÞב ַבדװÊדב Úבל ßבדַÊ ַבדׁזׁ';
$string['auth_dbfielduser'] = 'ַ׃ד ַבֽÞב ַבדװÊדב Úבל ֳ׃דֱַ ַבד׃Ê־ֿדםה';
$string['auth_dbhost'] = 'ו׀ַ ַבַֽ׃ָ ם׃ÊײםÝ דׂזֿ ÞַÚֹֿ ַבָםַהַÊ.';
$string['auth_dbname'] = 'ַ׃ד ÞַÚֹֿ ַבָםַהַÊ ׀ַÊוַ';
$string['auth_dbpass'] = 'ßבדֹ ַבדׁזׁ ַבד״ַָÞֹ בַ׃ד ַבד׃Ê־ֿד ַבד׀ßזׁ';
$string['auth_dbpasstype'] = 'ֽֿרֿ ַבװרßב ַב׀ם ם׃Ê־ֿדו ֽÞב ßבדֹ ַב׃רׁ. ÊװÝםׁ MD5 דÝםֿ בבÊרזױםב Ê״ָםÞַÊ ַבזםָ ַבװרֶַÚֹ ַבֳ־ׁל דֻב PostNuke';
$string['auth_dbtable'] = 'ַ׃ד ַבּֿזב Ýם ÞַÚֹֿ ַבָםַהַÊ';
$string['auth_dbtitle'] = 'ַ׃Ê־ֿד ÞַÚֹֿ ָםַהַÊ ־ַּׁםֹ';
$string['auth_dbtype'] = 'הזÚ ÞַÚֹֿ ַבָםַהַÊ (ֳהÙׁ <A HREF=../lib/adodb/readme.htm#drivers>ADOdb documentation</A> בבדׂםֿ דה ַבÊÝַױםב';
$string['auth_dbuser'] = 'ַ׃ד ַבד׃Ê־ֿד דÚ ֽÞ ַבֿ־זב Úבל ÞַÚֹֿ ַבָםַהַÊ בבÞֱַֹׁ ÝÞ״';
$string['auth_emaildescription'] = 'םÊד ַבÊזֻםÞ Úַֹֿ Úָׁ ַבָׁםֿ ַבֵבßÊׁזהם¡ זוז ַבזײÚ ַבַÝÊַׁײם בֳ׃בזָ ַבÊזֻםÞ. ÝÚהֿדַ םÞזד ַבד׃Ê־ֿד ַָבÊזÞםÚ זַָ־Êםַׁ ַ׃ד ַבד׃Ê־ֿד זßבדֹ ַבדׁזׁ ַב־ַױֹ ָו םÊד ֵׁ׃ַב ׁ׃ַבֹ Êזßםֿםֹ ֵבל Úהזַהו ַבָׁםֿם. זםֽÊזם ַבָׁםֿ ַבֵבßÊׁזהם Úבל ַָׁ״ֹ ֲדהֹ Êִֿם ֵבל ױÝֹֽ ם׃Ê״םÚ ַבד׃Ê־ֿד דה ־בַבוַ Êזßםֿ ַװÊַׁßו. זÝם ַֽבֹ ַבֿ־זב Ýםדַ ָÚֿ םÊד ַבÊֽÞÞ דה ַ׃ד ַבד׃Ê־ֿד זßבדֹ ַבדׁזׁ ָדÞַָבÊוַ ַָבד־ׂהֹ Ýם ÞַÚֹֿ ָםַהַÊ הÙַד Moodle..';
$string['auth_emailtitle'] = 'ÊזֻםÞ םÊד Úה ״ׁםÞ ַבָׁםֿ ַבֵבßÊׁזהם';
$string['auth_imapdescription'] = 'ם׃Ê־ֿד ו׀ַ ַבֳ׃בזָ דׂזֿ IMAP בבÊֽÞÞ דה ױֹֽ ַ׃ד ַבד׃Ê־ֿד זßבדֹ ַבדׁזׁ.';
$string['auth_imaphost'] = 'Úהזַה דׂזֿ IMAP. ַ׃Ê־ֿד ׁÞד ַבָׁזÊזßזב בַ ַ׃ד ַבה״ַÞ.';
$string['auth_imapport'] = 'ׁÞד דהÝ׀ דׂזֿ IMAP . םßזה Ýם ַבÛַבָ 143 ֳז 993.';
$string['auth_imaptitle'] = 'ַ׃Ê־ֿד דׂזֿ IMAP';
$string['auth_imaptype'] = 'הזÚ דׂזֿ IMAP . דה ַבדדßה בדׂזַֿÊ IMAP ֳה Êßזה בֿםוַ ֳהזַÚ ד־ÊבÝֹ דה ַבÊזֻםÞ זַבÊÝַזײ.';
$string['auth_ldap_bind_dn'] = 'ֵ׀ַ ֳֿׁÊ ַ׃Ê־ַֿד זÙםÝֹ bind-user בבָֻֽ Úה ד׃Ê־ֿדםה Ýםדßהß ÊÚםםה ׀בß והַ¡ ßֳה Êֽֿֿ דֻבַ: \'cn=ldapuser,ou=public,o=org\'';
$string['auth_ldap_bind_pw'] = 'ßבדֹ דׁזׁ bind-user';
$string['auth_ldap_contexts'] = 'Þֶַדֹ ַב׃םַÞַÊ ַבדזּזֿ ָוַ ַבד׃Ê־ֿדםה¡ ֽםֻ םÝױב ָםה ßב ׃םַÞ זֲ־ׁ ָÝַױבֹ וß׀ַ: \'ou=users,o=org; ou=others,o=org\'';
$string['auth_ldap_create_context'] = 'בז דßרהÊ ֵהװֱַ ַבד׃Ê־ֿד ָÊֳßםֿ ַבָׁםֿ ַבֵבßÊׁזהםר, ֽֿרֿ ַב׃רםַÞ ֵהװֱַ ד׃Ê־ֿדזה . םָּ ֳה םßזה ו׀ַ ַב׃רםַÞ ד־ÊבÝ Úה ַבד׃Ê־ֿדםה ַבֲ־ׁםה בדהÚ ַבÞײַםַ ַבֳדהםרֹ . בַ ÊֽÊַּ בֵײַÝֹ ו׀ַ ַב׃רםַÞ ׃םַÞ ַבÜדÊÛםׁ(ldap_context-variable) דזֿב ׃םָֻֽ Úה ַבד׃Ê־ֿדםה דה ו׀ַ ַב׃רםַÞ ÊבÞֶַםרנַ ';
$string['auth_ldap_creators'] = 'Þֶַדֹ ַבּדַÚַÊ ַבÊל םץ׃תדףֽ בֳÚײֶַוַ ַבÞםַד ַָהװֱַ דהַוּ ַֿׁ׃םֹ ּֿםֹֿ. ֳÝױב ָםה ַבּדַÚַÊ ַבדÊÚֿרֹֿ ָÜ \";\" Úַֹֿ Úבל ַבװßב ַבÊַבם (cn=teachers,ou=staff,o=myorg)';
$string['auth_ldap_host_url'] = 'ֽֿֿ דײםÝ ָׁÊזßזב ַבֿ־זב Úבל ַבֿבםב ַב־ÝםÝ LDAPÝם  װßב Úהזַה ֵהÊׁהÊ דֻב \'ldap://ldap.myorg.com/\' ֳז \'ldaps://ldap.myorg.com/\' ';
$string['auth_ldap_memberattribute'] = 'ֽֿֿ ױÝֹ ַבÚײז ַבד׃Ê־ֿד¡ Úהֿדַ םהÊדם ַבד׃Ê־ֿדזה בדּדזÚֹ. Úַֹֿ \"Úײז\"';
$string['auth_ldap_search_sub'] = 'ײÚ Þםדֹ &lt;&gt; 0 ֵ׀ַ ֳֿׁÊ ֳה Êָֻֽ Úה ד׃Ê־ֿדםה דה ׃םַÞַÊ ÝׁÚםֹ.';
$string['auth_ldap_update_userinfo'] = 'Êֽֿםֻ דÚבזדַÊ ַבד׃Ê־ֿד (ַבַ׃ד ַבֳזב¡ ַבַ׃ד ַבֳ־םׁ¡ ַבÚהזַה¡ …) דה ָׁÊזßזב ַבֿ־זב Úבל ַבֿבםב ַב־ÝםÝ  LDAPֵבל הÙַד Moodle . ֳהÙׁ /auth/ldap/attr_mappings.php בבֽױזב Úבל דÚבזדַÊ Úה ַבÊ־״ם״';
$string['auth_ldap_user_attribute'] = 'ַבזױÝ ַבד׃Ê־ֿד בÊ׃דםֹ/ַבָֻֽ Úה ַבד׃Ê־ֿדםה¡ זÛַבַָ דַ םßזה \'cn\'.';
$string['auth_ldap_version'] = 'ֳױַֿׁ הÙַד ַבÜ LDAP ַבד׃Ê־ֿד Ýם ־ַֿדß';
$string['auth_ldapdescription'] = 'ו׀ַ ַבֳ׃בזָ םÞֿד ַבÊזֻםÞ Ýם דÞַָב דׂזֿ ־ַּׁם בָׁזÊזßזב ַבֿ־זב Úבל ַבֿבםב ַב־ÝםÝ LDAP.
ֵ׀ַ ßַה ßב דה ַ׃ד ַבד׃Ê־ֿד זßבדֹ ַבדׁזׁ ױֽםַֽ Ýֵה הÙַד Moodle םÞזד ֵָהװֱַ ֵֿ־ַב ד׃Ê־ֿד ּֿםֿ Ýם ÞַÚֹֿ ָםַהַÊו. זםדßה בו׀ו ַבזֹֽֿ ַבהד״םֹ Þֱַֹׁ ׃דַÊ ַבד׃Ê־ֿד דה ָׁזÊזßזב ַבֿ־זב Úבל ַבֿבםב ַב־ÝםÝ LDAP  זדבֱ ַבֽÞזב ַבד״בזָֹ Ýם הÙַד Moodle  . זבַ םֽÊַּ Úהֿ ַבֿ־זב בַֽÞַ ׃זל ֵבל ַבÊֽÞÞ דה ַ׃ד ַבד׃Ê־ֿד זßבדֹ ַבדׁזׁ.';
$string['auth_ldapextrafields'] = 'ו׀ו ַבֽÞזב ַ־Êםַׁםֹ¡ זםדßהß דבֱ ָÚײ ֽÞזב ַבד׃Ê־ֿד Ýם הÙַד Moodle  ד׃ָÞַ ַָבדÚבזדַÊ דה <B>ֽÞזב LDAP </B> ַבÊם ÊÞזד ָÊֽֿםֿוַ והַ. <P>ֵ׀ַ ÊׁßÊ ו׀ו ַבֽÞזב ÝַׁÛֹ Ýבה םÊד הÞב ֳם װםֱ דה ָׁזÊזßזב ַבֿ־זב Úבל ַבֿבםב ַב־ÝםÝ LDAP ¡ ָב םÊד ַ׃Ê־ַֿד ַבֳזײַÚ ַבַÝÊַׁײםֹ ַבדזּזֹֿ ָהÙַד Moodle.<P>זÝם ßב ַבֳֽזַב¡ Ý׃זÝ םÊדßה ַבד׃Ê־ֿד דה ÊÚֿםב ßב Êבß ַבֽÞזב ָÚֿ ַבֿ־זב.';
$string['auth_ldaptitle'] = 'ַ׃Ê־ֿד דׂזֿ LDAP';
$string['auth_manualdescription'] = 'םÚ״ב ו׀ַ ַבַ׃בזָ ּדםÚ ַב״ׁÞ ַבÊם Êדßה ַבד׃Ê־ֿדםה דה ַהװֱַ ֽ׃ַַָÊוד. ּדםÚ ַבֽ׃ַַָÊ בַ ָֿ ַה Êהװֱַ םֿזםַנ דה Þָב ַבדֿםׁ';
$string['auth_manualtitle'] = 'ַבֽ׃ַַָÊ ַבםֿזםֹ ÝÞ״';
$string['auth_multiplehosts'] = 'םדßה Êֽֿםֿ ַßֻׁ דה ד׃ÊײםÝ דזַÞÚ (host1.com, host2.net, host3.org)';
$string['auth_nntpdescription'] = 'ו׀ַ ַבֳ׃בזָ ם׃Ê־ֿד דׂזֿ ָׁזÊזßזב ַבװָßֹ בהÞב ַבֳ־ַָׁ NNTP בבÊֳßֿ דה ױֹֽ ַ׃ד ַבד׃Ê־ֿד זßבדֹ ַבדׁזׁ.';
$string['auth_nntphost'] = 'Úהזַה דׂזֿ ָׁזÊזßזב ַבװָßֹ בהÞב ַבֳ־ַָׁ NNTP. ַ׃Ê־ֿד ׁÞד ַבָׁזÊזßזב בַ ַ׃ד ַבה״ַÞ.';
$string['auth_nntpport'] = 'דהÝ׀ ַבדׂזֿ (119 וז ַבֳßֻׁ װםזÚַ)';
$string['auth_nntptitle'] = 'ַ׃Ê־ֿד דׂזֿ NNTP';
$string['auth_nonedescription'] = 'םדßה בבד׃Ê־ֿדםה ַבÊזÞםÚ ֻד ֵהװֱַ ֽ׃ַַָÊ ױֽםֹֽ Úבל ַבÝזׁ¡ ֿזה ַֹּֽ בבÊזֻםÞ Ýם דÞַָב דׂזֿ ־ַּׁם ֳז ֵבל ַבÊזßםֿ דה ־בַב ַבָׁםֿ ַבֵבßÊׁזהם. םהױֽ ַָבֽׁױ Úה ַ׃Ê־ַֿד ו׀ַ ַב־םַׁ - זÊֿםׁ ÚזַÞָ דװַßב ַבֽדַםֹ זַבֵַֹֿׁ ַבÊם Þֿ ÊהÊּ Úהו.';
$string['auth_nonetitle'] = 'בַ םזּֿ ÊזֻםÞ';
$string['auth_pop3description'] = 'ם׃Ê־ֿד ו׀ַ ַבֳ׃בזָ דׂזֿ ָׁÊזßזב דßÊָ ַבָׁםֿ3 POP3 בבÊֳßֿ דה ױֹֽ ַ׃ד ַבד׃Ê־ֿד זßבדֹ ַבדׁזׁ.';
$string['auth_pop3host'] = 'Úהזַה דׂזֿ ָׁÊזßזב דßÊָ ַבָׁםֿ3 POP3. ַ׃Ê־ֿד ׁÞד ַבָׁזÊזßזב בַ ַ׃ד ַבה״ַÞ.';
$string['auth_pop3port'] = 'דהÝ׀ ַבדׂזֿ (110 ום ַבֳßֻׁ װםזÚַ)';
$string['auth_pop3title'] = 'ַ׃Ê־ֿד דׂזֿ POP3';
$string['auth_pop3type'] = 'הזÚ ַבדׂזֿ. ֵ׀ַ ßַה דׂזֿß ם׃Ê־ֿד ֽדַםֹ ַבװוַֹֿ¡ Þד ַָ־Êםַׁ pop3cert.';
$string['auth_user_create'] = 'Êדßםה ֵהװֱַ ד׃Ê־ֿד';
$string['auth_user_creation'] = 'ם׃Ê״םÚ ַבד׃Ê־ֿדזה ַבּֿֿ ֳז (ַבדּוזבזה) ַהװֱַ ֽ׃ַַָÊ Úבל דױֿׁ ַבÊזֻםÞ ַב־ַּׁםר ז Êֳßםרֿ ַבÊ׃ּםב Úָׁ ָׁםֿ ֵבßÊׁזהםר . ֵ׀ַ ֳהÊ דßהÊ ו׀ו ַב־ַױםו, ֳ׀ה Ê׀ßרׁ ֳה ÊזÝרÞ ָםה ַב־םַַׁÊ ׀ַÊ ַבדׁßָֹ ַבדֽֿרֹֿ בֵהװֱַ ַבד׃Ê־ֿד ֳםײנַ';
$string['auth_usernameexists'] = 'ַבַ׃ד ַבד־Êַׁ דזּזֿ¡ ַבֱַּׁ ַ־Êםַׁ ַ׃ד ַ־ׁ';
$string['authenticationoptions'] = '־םַַׁÊ ַבÊזֻםÞ';
$string['authinstructions'] = 'והַ םדßהß ֵÚ״ֱַ ÊÚבםדַÊ בבד׃Ê־ֿדםה בֿםß ֽÊל םÚׁÝזַ ֳ׃דֱַ ַבד׃Ê־ֿדםה זßבדַÊ ַבדׁזׁ ַבÊם םÊÚםה Úבםוד ַ׃Ê־ַֿדוַ. ׃םÙוׁ ַבהױ ַב׀ם ÊÞזד ֵָֿ־ַבו והַ Úבל ױÝֹֽ ַבֿ־זב. ֵ׀ַ ÊׁßÊ ו׀ַ ַבדßַה ÝַׁÛַ Ýבה םÊד ״ַָÚֹ ֳםֹ ÊÚבםדַÊ.';
$string['changepassword'] = 'ÊÛםםׁ Úהזַה ßבדֹ ַבדׁזׁ';
$string['changepasswordhelp'] = 'והַ Ê׃Ê״םÚ ÊÚםםה ַבדזײÚ ַב׀ם םדßה בבד׃Ê־ֿדםה דה ־בַבו ַ׃Êַֿֿׁ ֳז ÊÛםםׁ ֳ׃דֱַ ַבד׃Ê־ֿדםה ֳז ßבדַÊ ַבדׁזׁ ַב־ַױֹ ָוד Ýם ַֽבֹ ה׃םַהוַ. ז׃זÝ םßזה ׀בß דÊַַֽ בבד׃Ê־ֿדםה דה ־בַב ׁׂ Ýם ױÝֹֽ ַבֿ־זב זױÝֹֽ ַבד׃Ê־ֿד ַב־ַױֹ ָוד. ֳדַ ֵ׀ַ ÊׁßÊ ו׀ַ ַבדßַה ־ַבםַ¡ Ýבה םÊד ״ַָÚֹ ַבׁׂ.';
$string['chooseauthmethod'] = 'ַ־Êׁ ֳ׃בזַָ בבÊזֻםÞ: ';
$string['guestloginbutton'] = 'ׁׂ ֿ־זב ַבײםÝ';
$string['instructions'] = 'ÊÚבםדַÊ';
$string['md5'] = 'ÊװÝםׁ MD5';
$string['plaintext'] = 'הױ Úַֿם';
$string['showguestlogin'] = 'םדßהß ֵÙוַׁ ֳז ֵ־Ýֱַ ׁׂ ֿ־זב ַבײםÝ Ýם ױÝֹֽ ַבֿ־זב.';

?>
