<?PHP // $Id$ 
      // block_glossary_random.php - created with Moodle 1.6 development (2005052400)


$string['addentry'] = 'ÃÖÝ ãÞÊÈÓÇÊß ÇáãÝÖáå';
$string['askaddentry'] = 'ÚäÏãÇ íÓÊØíÚ ÇáãÓÊÎÏãæä ãä ÅÖÇÝÉ ãÏÎáÇÊåã Åáì ÇáãÓÑÏ¡ ÃÙåÑ ÇáÑÇÈØ ãÚ åÐÇ ÇáäÕ.';
$string['askinvisible'] = 'ÚäÏãÇ áÇ íÓÊØíÚ ÇáãÓÊÎÏãæä ãä ÊÍÑíÑ Ãæ ãÔÇåÏÉ ÇáãÓÑÏ¡ ÃÙåÑ åÐÇ ÇáäÕ. (ÈÏæä ÑÇÈØ)';
$string['askviewglossary'] = 'ÚäÏãÇ íÓÊØíÚ ÇáãÓÊÎÏãæä ãÔÇåÏÉ ÇáãÓÑÏ ÈÏæä Ãä íÓÊØíÚæÇ ÅÖÇÝÉ ãÏÎáÇÊåã Åáì ÇáãÓÑÏ¡ ÃÙåÑ ÇáÑÇÈØ ãÚ åÐÇ ÇáäÕ.';
$string['blockname'] = 'ãÏÎá ãÓÑÏ ÚÔæÇÆí';
$string['intro'] = 'ÊÃßÏ ãä æÌæÏ ãÓÑÏ æÃÍÏ ÈãÏÎá æÃÍÏ Úáì ÇáÃÞá Ýí åÐÇ ÇáãäåÌ ÇáÏÑÇÓí¡ ÈÚÏ Ðáß íãßäß ÇáÞíÇã ÈÊÚÏíá ÇáÅÚÏÇÏÇÊ ÇáÊÇáíÉ';
$string['invisible'] = '(ÓíÊã ÇáÊÊÇÈÚ)';
$string['lastmodified'] = 'ÇáãÎá ÇáãÚÏá ãÄÎÑÇð';
$string['nextone'] = 'ÇáãÏÎá ÇáÊÇáí';
$string['noentriesyet'] = 'áÇ ÊæÌÏ ãÏÎáÇÊ ÈÚÏ Ýí ÇáãÓÑÏ ÇáãÎÊÇÑ';
$string['notyetconfigured'] = 'ÇáÑÌÇÁ ÅÚÏÇÏ åÐå ÇáßÊáÉ æÐáß ÈÇÓÊÎÏÇã ÃíÞæäÉ ÇáÊÍÑíÑ';
$string['notyetglossary'] = 'íÌÈ æÌæÏ ãÓÑÏ æÃÍÏ Úáì ÇáÃÞá áÊÊãßä ãä ÇáÇÎÊíÇÑ';
$string['random'] = 'ãÏÎá ÚÔæÇÆí';
$string['refresh'] = 'ÚÏÏ ÇáÇíÇã ÞÈá ÇÎÊíÇÑ ãÏá ÌÏíÏ';
$string['select_glossary'] = 'ÎÐ ÇáãÏÎáÇÊ ãä åÐÇ ÇáãÓÑÏ';
$string['showconcept'] = 'ÇÙåÑ ÇáãÝÇåíã (ÇáÚäÇæíä) áßá ãÏÎá';
$string['title'] = 'ÇáÚäæÇä';
$string['type'] = 'ßíÝ íÊã ÃÎíÇÑ ÇáãÏÎá ÇáÌÏíÏ';
$string['viewglossary'] = 'ÃÞÊÈÓÇÊ ÃÎÑì';
$string['whichfooter'] = 'ÊÓÊØíÚ ÚÑÖ ÑæÇÈØ ÅÌÑÇÁÇÊ ÇáãÓÑÏ ÐÇÊ ÇáÚáÇÞÉ ÈåÐå ÇáßÊáÉ. ÓÊÚÑÖ ÇáßÊáÉ ÝÞØ ÑæÇÈØ ÇáÅÌÑÇÁÇÊ ÇáããßäÉ áåÐÇ ÇáãÓÑÏ.';

?>
