<?PHP // $Id$ 
      // enrol_database.php - created with Moodle 1.5 UNSTABLE DEVELOPMENT (2005010100)


$string['dbhost'] = 'ÇÓã ãÖíÝ ÞÇÚÏÉ ÇáÈíÇäÇÊ';
$string['dbname'] = 'ÞÇÚÏÉ ÇáÈíÇäÇÊ ÇáãÍÏÏ ááÇÓÊÚãÇá';
$string['dbpass'] = 'ßáãÉ ÇáãÑæÑ ááÏÎæá Åáì ÇáÎÇÏã';
$string['dbtable'] = 'ÇáÌÏæá Ýí ÞÇÚÏÉ ÇáÈíÇäÇÊ';
$string['dbtype'] = 'äæÚ ÞÇÚÏÉ ÇáÈíÇäÇÊ';
$string['dbuser'] = 'ÇÓã ÇáãÓÊÎÏã ááÏÎæá Åáì ÇáÎÇÏã';
$string['description'] = 'ÊÓÊØíÚ ÇÓÊÎÏÇã ÞÇÚÏÉ ÈíÇäÇÊ ÎÇÑÌíÉ (ãä Ãí äæÚ) ááÊÍßã Ýí ÇáÊÓÌíá. íÝÊÑÖ Ãä ÞÇÚÏÉ ÈíÇäÇÊß ÇáÎÇÑÌíÉ ÊÊÖãä ÍÞá íÍÊæí ÊÚÑíÝÇáãäåÌ ÇáÏÑÇÓí æÍÞá íÍÊæí Úáì ÊÚÑíÝ ÇáãÓÊÎÏã. ÓÊÞÇÑä åÐå ÇáÍÞæá ãÚ ÌÏÇæá ÇáãäåÌ ÇáÏÑÇÓí æÇáãÓÊÎÏã ÇáÎÇÕÉ ÈÇáäÙÇã ';
$string['enrolname'] = 'ÞÇÚÏÉ ÈíÇäÇÊ ÎÇÑÌíÉ';
$string['localcoursefield'] = 'ÇÓã ÇáÍÞá ÇáãÓÊÎÏã Ýí ÌÏæá ÇáãäåÌ ÇáÏÑÇÓí ÇáÐí äÞæã ÈÇÓÊÎÏÇãÉ æÇáÐí íÌÈ Çä íÊØÇÈÞ ãÚ ÞÇÚÏÉ ÇáÈíÇäÇÊ ÇáÎÇÑÌíÉ (idnumber)';
$string['localuserfield'] = 'ÇÓã ÇáÍÞá ÇáãÓÊÎÏã Ýí ÌÏæá ÇáãÓÊÎÏã ÇáÐí äÞæã ÈÇÓÊÎÏÇãÉ æÇáÐí íÌÈ Çä íÊØÇÈÞ ãÚ ÇáÈíÇäÇÊ ÇáÎÇÑÌíÉ (idnumber)';
$string['remotecoursefield'] = 'ÇáÍÞá ÇáÐí äÊæÞÚ æÌæÏÉ Ýí ÞÇÚÏÉ ÇáÈíÇäÇÊ ÇáÎÇÑÌíÉ åæ ÊÚÑíÝ ÇáãäåÌ ÇáÏÑÇÓí (course ID) Ýí';
$string['remoteuserfield'] = 'ÇáÍÞá ÇáÐí äÊæÞÚ æÌæÏÉ Ýí ÞÇÚÏÉ ÇáÈíÇäÇÊ ÇáÎÇÑÌíÉ åæ ÊÚÑíÝ ÇáãÓÊÎÏã (user ID) Ýí';

?>
