<?PHP // $Id$ 
      // enrol_internal.php - created with Moodle 1.5 UNSTABLE DEVELOPMENT (2005010100)


$string['description'] = 'ו׀ַ ַבהדז׀ּ ַבַÝÊַׁײם בבÊ׃ּםב. םזּֿ ״ׁםÞÊםה בÊ׃ּםב ַב״בַָ Ýם דהוּ ַֿׁ׃ם דֽֿֿ.
<ul>
<li>ם׃Ê״םÚ ַבדÚבד ֳז ַבדֿםׁ דה Ê׃םּב ַב״בַָ ָ״ׁםÞֹ Úַֿםֹ ז׀בß Úה ״ׁםÞ ַבַָׁ״ ַבדזּזֿ Þֶַדֹ ַבֵַֹֿׁ ַֿ־ב ַבדהוּ ַבַֿׁ׃ם.</li>
<li>םדßה ֵײַÝֹ ßבדֹ דׁזׁ בßב דהוּ ַֿׁ׃ם Ê׃דל \"דÝÊַֽ ַבÊ׃ּםב\". ֳם װ־ױ םÚׁÝ ו׀ו ַבßבדֹ ם׃Ê״םÚ ֵײַÝֹ הÝ׃ו Ýם ַבדהוּ ַבַֿׁ׃ם.</li>
</ul>
';
$string['enrolname'] = 'Ê׃ּםב ַֿ־בם';

?>
