<?PHP // $Id$ 
      // enrol_paypal.php - created with Moodle 1.6 development (2005052400)


$string['business'] = 'ÚäæÇä ÈÑíÏß ÇáÅáßÊÑæäí áÍÓÇÈß Paypal ÇáÊÌÇÑí.';
$string['costorkey'] = 'ÇáÑÌÇÁ ÇÎÊíÇÑ ÃÍÏ ÇáØÑÞ ÇáÊÇáíÉ ááäÖãÇã.';
$string['description'] = 'æÍÏÉ (Paypal)ÊÓÇÚÏß Ýí ÅÚÏÇÏ ÇáãäÇåÌ ÇáÏÑÇÓíÉ ÇáãÏÝæÚÉ ÇáËãä. áæ ßÇäÊ ÞíãÉ Ãí ãäåÌ ÏÑÇÓí åí ÕÝÑ¡ áä íØáÈ ãä ÇáØáÇÈ áÏÝÚ ãÈáÛ ãÇáí ááãÔÇÑßÉ Ýí ÇáãäåÌ ÇáÏÑÇÓí. ÊÓØíÚ ÊÏíÏ ãÈáÛ ãÇáí áßá ÇáãæÞÚ ßãÈáÛ ÇÝÊÑÇÖí åäÇÁ¡ ÈÇáÅÖÇÝÉ Åáì ÅÚÏÇÏ ãÈáÛ ãÇáí áßá ãäåÌ ÏÑÇÓí Úáì ÍÏì åÐÇ ÇáÃÚÏÇÏ ÓíÊÌÇåá ÅÚÏÇÏ ãÈáÛ ÇáãæÞÚ.';
$string['enrolname'] = 'ÇáÊÈÑÚ';
$string['sendpaymentbutton'] = 'ÇÑÓá ÇáÞíãÉ ÇáãÏÝæÚÉ Úä ØÑíÞ ÇáÊÈÑÚ';

?>
