<?PHP // $Id$ 
      // survey.php - created with Moodle 1.2 development (2004012800)


$string['actual'] = 'İÚáí';
$string['actualclass'] = 'ÇáİÕá ÇáİÚáí';
$string['actualstudent'] = ' $aİÚáí';
$string['allquestions'] = 'ßá ÇáÃÓÆáÉ áßá ÇáÏÇÑÓíä ';
$string['allscales'] = 'ßá ÇáãæÇÒíä, ßá ÇáÏÇÑÓíä';
$string['alreadysubmitted'] = 'ÃäÊ ÈÇáİÚá ÓáãÊ ÇáÇÓÊÈíÇä';
$string['analysisof'] = 'ÊÍáíá áÜ $a';
$string['answers'] = 'ÅÌÇÈÇÊ';
$string['attls1'] = 'ÚäÏãÇ ÃŞæã ÈÊŞííã ßáÇã ÔÎÕ ãÇ İÅääí ÃåÊã ÈãŞÇáÊå ÃßËÑ ãä ĞÇÊå.';
$string['attls10'] = 'ÃÑì ãä ÇáÃåãíÉ ÈãßÇä Ãä ÃÍÊİÙ ÈÇáãæÖæÚíÉ ŞÏÑ ÇáÅãßÇä ÚäÏãÇ ÃŞæã ÈÊÍáíá ÔíÁ ãÇ.';
$string['attls10short'] = 'ÇáÇÍÊİÇÙ ÈÇáãæÖæÚíÉ';
$string['attls11'] = 'ÃÍÇæá ÇáÊİßíÑ ãÚ ÇáÂÎÑíä áÇ ãÎÇáİÊåã İí ÇáÑÃí.';
$string['attls11short'] = 'ÇáÊİßíÑ ãÚ ÇáÂÎÑíä';
$string['attls12'] = 'ÚäÏí ãÚÇííÑ ãÚíäÉ ÇÓÊÎÏãåÇ áÊŞííã ÇáÍæÇÑÇÊ.';
$string['attls12short'] = 'ÇÓÊÎÏÇã ãÚÇííÑ ááÊŞííã';
$string['attls13'] = 'Ããíá Åáì ãÍÇæáÉ İåã ÂÑÇÁ ÇáÂÎÑíä Ïæä ÊŞííãåÇ.';
$string['attls13short'] = 'ãÍÇæáÉ Çáİåã';
$string['attls14'] = 'ÃÍÇæá ÊÍÏíÏ äŞÇØ ÇáÖÚİ İí ÃÓÇáíÈ ÊİßíÑ ÇáÂÎÑíä İí ÓÈíá ãÓÇÚÏÊåã Úáì ÊæÖíÍ ÍæÇÑÇÊåã.';
$string['attls14short'] = 'ÊÍÏíÏ äŞÇØ ÇáÖÚİ';
$string['attls15'] = 'Ããíá Åáì æÖÚ äİÓí ãæÖÚ ÇáÂÎÑíä ÚäÏ ãäÇŞÔÉ ÃÍÏ ÇáŞÖÇíÇ ÇáÎáÇİíÉ áÃÊÚÑİ Úáì ÃÓÈÇÈ ÊİßíÑåã ÈÊáß ÇáØÑíŞÉ.';
$string['attls15short'] = 'ÃÖÚ äİÓí ãæÖÚ ÇáÂÎÑíä';
$string['attls16'] = 'íãßä Ãä íØáŞ ÇáÈÚÖ Úáì ÃÓáæÈí İí ÊÍáíá ÇáÃÔíÇÁ \'æÖÚ ÇáÃÔíÇÁ ÊÍÊ ÇáÇÎÊÈÇÑ\' áÃääí ÔÏíÏ ÇáÍÑÕ Úáì ÇáäÙÑ İí ßá ÇáÃÏáÉ.';
$string['attls16short'] = 'ÇÎÊÈÇÑ';
$string['attls17'] = 'ÃŞÏã ÇÓÊÎÏÇã ÇáãäØŞ æÇáÚŞá Úáì ÇÓÊÕÍÇÈ ÃİßÇÑí ÇáÔÎÕíÉ ÚäÏ Íá ÇáãÔßáÇÊ.';
$string['attls17short'] = 'ÃİÖá ÇáãäØŞ Ïæä ÓæÇå';
$string['attls18'] = 'íŞæÏäí ÇáÊÚÇØİ Åáì ÇáÊÈÕÑ İí ÇáÂÑÇÁ ÇáÊí ÊÎÇáİäí. ';
$string['attls18short'] = 'ÇáÊÈÕÑ ãä ÎáÇá ÇáÊÚÇØİ';
$string['attls19'] = 'ÚäÏãÇ ÃÕÇÏİ ÃäÇÓÇ ÊÈÏæ ÂÑÇÄåã ÛÑíÈÉ ÈÇáäÓÈÉ áí ÃÍÇæá ÌÇåÏÇ İÑÖ äİÓí Úáíåã áÃÑì ßíİ ÊÈäæÇ åĞå ÇáÂÑÇÁ.';
$string['attls19short'] = 'ÈĞá ÇáÌåÏ áİÑÖ ÇáäİÓ';
$string['attls1short'] = 'ÇáÊÑßíÒ Úáì ÌæÏÉ ÇáÍæÇÑ';
$string['attls2'] = 'ÃÍÈ ÇáÌÏá ãä ÃÌá ÇáÌÏá İÃÊÈäì ÇáÑÃí ÇáãäÇŞÖ áãÇ íŞæáå ÇáÂÎÑæä.';
$string['attls20'] = 'ÃŞÖí ÈÚÖ ÇáæŞÊ áÊÊÈÚ ÇáÎáá İí ÔíÁ ãÇ¡ ãËáÇ: ÃÊÊÈÚ ãæØä ÇáÚáÉ İí ÊÍáíá ÃÏÈí áã ÊÊã ãäÇŞÔÊå Úáì äÍæ æÇİ.';
$string['attls20short'] = 'ãæØä ÇáÚáÉ';
$string['attls2short'] = 'ÇáÌÏá ãä ÃÌá ÇáÌÏá';
$string['attls3'] = 'ÃÍÈ Ãä ÃÊÚÑİ Úáì ÇáÈíÆÇÊ ÇáÊí ÃÊí ãäåÇ ÇáÂÎÑæä æÚáì ÇáãæÇŞİ ÇáÊí ŞÇÏÊåã Åáì ÊÈäí ãÇ íÚÊäŞæä.';
$string['attls3short'] = 'ÈíÆÇÊ ÇáÂÎÑíä';
$string['attls4'] = 'Ãåã ãÇ íÚäíäí İí ÇáÏÑÇÓÉ åæ ÇáÊãßä ãä İåã ÇáÂÎÑíä ÇáĞíä íÎÊáİæä Úäí ßãÇ æßíİÇ.';
$string['attls4short'] = 'İåã ÇáÔÎÕíÇÊ ÇáÃÎÑì';
$string['attls5'] = 'ÃÍÓ Ãä ÃİÖá ÇáØÑŞ áÊÍŞíŞ ÇáĞÇÊ åæ ÇáÊİÇÚá ãÚ ãÌãæÚÇÊ ãÎÊáİÉ ãä ÇáÈÔÑ.';
$string['attls5short'] = 'ÇáÊİÇÚá ãÚ ãÎÊáİ ÇáÈÔÑ';
$string['attls6'] = 'ÇÓÊãÊÚ ÈÇáÇÓÊãÇÚ Åáì ÂÑÇÁ ÇáÂÎÑíä ãä Ğæí ÇáÎáİíÇÊ ÇáãÎÊáİÉ Úäí¡ İĞáß íÓÇÚÏäí Úáì İåã ÇÎÊáÇİ ÇáÑÄì áäİÓ ÇáÔíÁ .';
$string['attls6short'] = 'ÇÓÊãÊÚ ÈÇáÇÓÊãÇÚ Åáì ÇáÂÑÇÁ';
$string['attls7'] = 'ÃÑì Ãä ÈÇÓÊØÇÚÊí ÊŞæíÉ ãÑßÒí ãä ÎáÇá ÇáÌÏÇá ãÚ ÇáãÎÇáİ.';
$string['attls7short'] = 'ÇáÊŞæíÉ ãä ÎáÇá ÇáÌÏÇá';
$string['attls8'] = 'ÃåÊã ÏÇÆãÇ ÈãÚÑİÉ ÇáÏÇİÚ Åáì ãÇ íŞæáå ÇáÂÎÑæä æíÚÊŞÏæä.';
$string['attls8short'] = 'ãÚÑİÉ ÓÈÈ ãÇ íİÚáå ÇáÂÎÑæä';
$string['attls9'] = 'ÛÇáÈÇ ãÇ ÃäÎÑØ İí ÍæÇÑ ÚŞáí ãÚ ßÊÇÈ ÇáßÊÈ ÇáÊí ÃŞÑÃåÇ İí ãÍÇæáÉ ááæÕæá Åáì ÓÈÈ ãäØŞí áßæäåã áíÓæÇ Úáì ÕæÇÈ.';
$string['attls9short'] = 'ãÍÇæÑÉ ãÚ ÇáßÊÇÈ';
$string['attlsintro'] = 'ÇáÛÑÖ ãä åĞÇ ÇáÇÓÊÈíÇä åæ ãÓÇÚÏÊäÇ Úáì ÊŞííã ãæÇŞİß ÍíÇá ÇáÊİßíÑ æÇáÊÚáã¡ æáíÓ åäÇß ÃÓÆáÉ \'ÕæÇÈ\' Ãæ \'ÎØÃ\'¡ İäÍä áÇ íåãäÇ ÅáÇ ÇáÊÚÑİ Úáì ÑÃíß İŞØ¡ ÊÃßÏ ãä Ãä ÑÏæÏß Óæİ ÊÚÇãá ÈÃŞÕì ÏÑÌÉ ãä ÇáÓÑíÉ æáä ÊÄËÑ Úáì ÊŞííãß.';
$string['attlsm1'] = 'ÈÚÖ ÇáãæÇŞİ ÍíÇá ÇáÊİßíÑ æÇáÊÚáã';
$string['attlsm2'] = 'ÇáÊÚáã ÇáãÊÕá';
$string['attlsm3'] = 'ÇáÊÚáã ÇáãÓÊŞá';
$string['attlsmintro'] = 'İí äŞÇÔ...';
$string['attlsname'] = 'ATTLS (äÓÎÉ ĞÇÊ ÚÔÑíä ÈäÏÇ)';
$string['ciq1'] = 'İí Ãí áÍÙÉ ÎáÇá ÇáÏÑÓ ÔÚÑÊ ÇßËÑ ÊİÇÚáÇ ßãÊÚáã¿';
$string['ciq2'] = 'İí Ãí áÍÙÉ ÎáÇá ÇáÏÑÓ ÔÚÑÊ ÈÇäß ÇÈÚÏÊ ßãÊÚáã ¿';
$string['ciq3'] = 'ãÇåæ ÇáÚãá ÇáĞ æÌÏå İí ÇáãäÊÏíÇÊ ãä Ãí ÔÎÕ æÊÚÊÈÑÉ ÚãáÇ ãÓÇÚÏÇğ æãÚÒÒÇ ¿';
$string['ciq4'] = 'ãÇåæ ÇáÚãá ÇáĞ æÌÏå İí ÇáãäÊÏíÇÊ ãä Ãí ÔÎÕ æÊÚÊÈÑÉ ÚãáÇ ãÑÈßÇ æãÔæÔÇ¿';
$string['ciq5'] = 'ãÇ åæ ÇáãæŞİ ÇáĞí ÇÏåÔß ÇßËÑ¿';
$string['ciqintro'] = 'ÇËäÇÁ ÊİßíÑß İí ÇáÇÍÏÇË ÇáÍÇáíå İí ÇáÏÑÓ ÇÌÈ Úáì ÇáÇÓÆáå ÇáÊÇáíå';
$string['ciqname'] = 'ãæŞİ ãÍÑÌ';
$string['clicktocontinue'] = 'ÇÖÛØ åäÇ ááÇÓÊãÑÇÑ';
$string['clicktocontinuecheck'] = 'ÇÖÛØ åäÇ ááÇÎÊíÇÑ Ëã ÇáÇÓÊãÑÇÑ';
$string['colles1'] = 'ÃÑßÒ İí ÇáÊÚáã Úáì ŞÖÇíÇ Êåãäí.';
$string['colles10'] = 'ÃØáÈ ãä ÇáÏÇÑÓíä ÇáÂÎÑíä ÔÑÍ ÃİßÇÑåã';
$string['colles10short'] = 'ÃØáÈ ÊİÓíÑÇÊ';
$string['colles11'] = 'íØáÈ ãäí ÇáÏÇÑÓæä ÇáÂÎÑæä Ãä ÇÔÑÍ ÃİßÇÑí';
$string['colles11short'] = 'íØáÈ ãäí Ãä ÃæÖÍ';
$string['colles12'] = 'íÓÊÌíÈ ÇáÏÇÑÓæä ÇáÂÎÑæä áÃİßÇÑí';
$string['colles12short'] = 'íÓÊÌíÈ ÇáÏÇÑÓæä áí';
$string['colles13'] = 'íŞæã ÇáãÚáã ÈÅËÇÑÉ ÃİßÇÑí';
$string['colles13short'] = 'íŞæã ÇáãÚáã ÈÅËÇÑÉ ÇáÃİßÇÑ';
$string['colles14'] = 'íÔÌÚäí ÇáãÚáã Úáì ÇáãÔÇÑßÉ';
$string['colles14short'] = 'íŞæã ÇáãÚáã ÈÊÔÌíÚí';
$string['colles15'] = 'íÄÏí ÇáãÚáã äãæĞÌÇ ÌíÏÇ ááÍæÇÑ';
$string['colles15short'] = 'íÄÏí ÇáãÚáã äãæĞÌÇ ááÍæÇÑ';
$string['colles16'] = 'íŞÏã ÇáãÚáã äãæĞÌÇ äŞÏíÇ áÇÎÊÈÇÑ ÇáĞÇÊ';
$string['colles16short'] = 'íŞÏã ÇáãÚáã äãæĞÌÇ áÇÎÊÈÇÑ ÇáĞÇÊ';
$string['colles17'] = 'íÔÌÚäí ÇáÏÇÑÓæä Úáì ÇáãÔÇÑßÉ';
$string['colles17short'] = 'íÔÌÚäí ÇáÏÇÑÓæä';
$string['colles18'] = 'íËäí ÇáØáÇÈ Úáì ãÔÇÑßÊí';
$string['colles18short'] = 'ÇáØáÇÈ íËäæä Úáì';
$string['colles19'] = 'íŞÏÑ ÇáÏÇÑÓæä ãÔÇÑßÊí';
$string['colles19short'] = 'íŞÏÑäí ÇáÏÇÑÓæä';
$string['colles1short'] = 'ÇáÊÑßíÒ Úáì ÇáŞÖÇíÇ ÇáåÇãÉ';
$string['colles2'] = 'ãÇ ÃÊÚáãå íãËá ÃåãíÉ ÈÇáäÓÈÉ áÃÏÇÆí Çáãåäí.';
$string['colles20'] = 'íÊÚÇØİ ÇáÏÇÑÓæä ãÚ ãÌåæÏí áÃÊÚáã.';
$string['colles20short'] = 'íÊÚÇØİ ÇáÏÇÑÓæä';
$string['colles21'] = 'Ãİåã ÑÓÇÆá ÇáÏÇÑÓíä ÌíÏÇ';
$string['colles21short'] = 'Ãİåã ÇáÏÇÑÓíä';
$string['colles22'] = 'íİåã ÇáÏÇÑÓæä ÑÓÇÆáí ÌíÏÇ';
$string['colles22short'] = 'íİåãäí ÇáÏÇÑÓæä';
$string['colles23'] = 'Ãİåã ÑÓÇÆá ÇáãÚáã ÌíÏÇ';
$string['colles23short'] = 'Ãİåã ÇáãÚáã';
$string['colles24'] = 'íİåã ÇáãÚáã ÑÓÇÆáí ÌíÏÇ.';
$string['colles24short'] = 'ÇáãÚáã íİåãäí';
$string['colles2short'] = 'ãåã áÃÏÇÆí';
$string['colles3'] = 'ÃÚÑİ ßíİ ÃÍÓä ãä ÃÏÇÆí Çáãåäí.';
$string['colles3short'] = 'ÃÍÓä ãä ÃÏÇÆí';
$string['colles4'] = 'ãÇ ÃÊÚáãå íÑÊÈØ ÇÑÊÈÇØÇ æËíŞÇ ÈÃÏÇÆí Çáãåäí.';
$string['colles4short'] = 'áå ÕáÉ ÈÃÏÇÆí';
$string['colles5'] = 'ÃİßÑ ÈÔßá äŞÏí İíãÇ ÃÊÚáãå.';
$string['colles5short'] = 'ÃÊäÇæá ÊÚáíãí ÈÇáäŞÏ';
$string['colles6'] = 'ÃÊäÇæá ÃİßÇÑí ÈÇáäŞÏ.';
$string['colles6short'] = 'ÃäÊŞÏ ÃİßÇÑí';
$string['colles7'] = 'ÃİßÑ İí ÂÑÇÁ ÇáÏÇÑÓíä ÇáÂÎÑíä Úáì äÍæ äŞÏí.';
$string['colles7short'] = 'ÃÊäÇæá ÇáÏÇÑÓíä ÇáÂÎÑíä ÈÇáäŞÏ';
$string['colles8'] = 'ÃÊäÇæá ÇáÃİßÇÑ ÇáÊí ÃÌÏåÇ İí ÇáŞÑÇÁÇÊ ÈÇáäŞÏ';
$string['colles8short'] = 'ÃÊäÇæá ÇáŞÑÇÁÇÊ ÈÇáäŞÏ';
$string['colles9'] = 'ÃÔÑÍ ÃİßÇÑí ááÏÇÑÓíä ÇáÂÎÑíä';
$string['colles9short'] = 'ÃÔÑÍ ÃİßÇÑí';
$string['collesaintro'] = 'íßãä ÇáÛÑÖ ãä åĞÇ ÇáÇÓÊÈíÇä İí ÇáãÓÇÚÏÉ Úáì İåã ãÏì ßİÇÁÉ ÇáÏæÑ ÇáĞí íÄÏíå ÇáÊæÕíá ÇáãÈÇÔÑ áÊãßíäß ãä ÇáÊÚáã.
æíŞæã ßá ãä ÇáÃÑÈÚÉ æÚÔÑæä ÓÄÇáÇ ÊÇáíå ÈÓÄÇáß Úä ÊÌÑÈÊß ãÚ åĞå ÇáæÍÏÉ.ÇáÛÑÖ ãä åĞÇ ÇáÇÓÊÈíÇä åæ ãÓÇÚÏÊäÇ Úáì ÊŞííã ãæÇŞİß Í
íÇá ÇáÊİßíÑ æÇáÊÚáã¡ æáíÓ åäÇß ÃÓÆáÉ \'ÕæÇÈ\' Ãæ \'Î ØÃ\'¡ İäÍä áÇ íåãäÇ ÅáÇ ÇáÊÚÑİ Úáì ÑÃíß İŞØ¡ ÊÃßÏ ãä Ãä ÑÏæÏß Óæİ ÊÚÇãá ÈÃŞÕì ÏÑÌÉ ãä ÇáÓÑíÉ æáä ÊÄËÑ Úáì ÊŞííãß.
ÑÏæÏß ÇáãÊÃäíÉ Óæİ ÊÓÇÚÏäÇ Úáì ÊÍÓíä ÇáÚÑÖ ÇáãÈÇÔÑ áåĞå ÇáæÍÏÉ  ãÓÊŞÈáÇ.
ãÚ ÌÒíá ÇáÔßÑ';
$string['collesaname'] = 'COLLES (İÚáí)';
$string['collesapintro'] = 'íßãä ÇáÛÑÖ ãä åĞÇ ÇáÇÓÊÈíÇä İí ÇáãÓÇÚÏÉ Úáì İåã ãÏì ßİÇÁÉ ÇáÏæÑ ÇáĞí íÄÏíå ÇáÊæÕíá ÇáãÈÇÔÑ áÊãßíäß ãä ÇáÊÚáã. 
ãä ÎáÇá ÇáÃÓÆáÉ ÇáÊÇáíÉ æÚÏÏåÇ 24 ÓÄÇáÇ íØáÈ ãäß ãŞÇÑäÉ ÊÌÑÈÊß <B>ÇáãÃãæáÉ</B> (ÇáãËÇáíÉ) ãÚ ÊÌÑÈÊß <B> ÇáæÇŞÚíÉ </B> İí åĞå ÇáæÍÏÉ.
æáíÓ åäÇß ÃÓÆáÉ \'ÕæÇÈ\' Ãæ \'ÎØÃ\'¡ İäÍä áÇ íåãäÇ ÅáÇ ÇáÊÚÑİ Úáì ÑÃíß İŞØ¡ ÊÃßÏ ãä Ãä ÑÏæÏß Óæİ ÊÚÇãá ÈÃŞÕì ÏÑÌÉ ãä ÇáÓÑíÉ æáä ÊÄËÑ Úáì ÊŞííãß.
ÑÏæÏß ÇáãÊÃäíÉ Óæİ ÊÓÇÚÏäÇ Úáì ÊÍÓíä ÇáÚÑÖ ÇáãÈÇÔÑ áåĞå ÇáæÍÏÉ  ãÓÊŞÈáÇ.
ãÚ ÌÒíá ÇáÔßÑ';
$string['collesapname'] = 'COLLES (ÇáãÃãæá æÇáİÚáí)';
$string['collesm1'] = 'ÇáÕáÉ';
$string['collesm1short'] = 'ÇáÕáÉ';
$string['collesm2'] = 'ÇáÊİßíÑ ÇáãÊÃäí';
$string['collesm2short'] = 'ÇáÊİßíÑ ÇáãÊÃäí';
$string['collesm3'] = 'ÇáÊİÇÚá';
$string['collesm3short'] = 'ÇáÊİÇÚá';
$string['collesm4'] = 'ÏÚã ÇáãÚáã';
$string['collesm4short'] = 'ÏÚã ÇáãÚáã';
$string['collesm5'] = 'ÏÚã ÇáäÙíÑ';
$string['collesm5short'] = 'ÏÚã ÇáäÙíÑ';
$string['collesm6'] = 'ÊİÓíÑ';
$string['collesm6short'] = 'ÊİÓíÑ';
$string['collesmintro'] = 'İí åĞå ÇáæÍÏÉ ÇáãÈÇÔÑÉ...';
$string['collespintro'] = 'íßãä ÇáÛÑÖ ãä åĞÇ ÇáÇÓÊÈíÇä İí ÇáãÓÇÚÏÉ Úáì ãÚÑİÉ ãÇ íÍæÒ ÊŞÏíÑß İí ÚãáíÉ ÇáÊÚáã Úáì ÇáÅäÊÑäÊ.

ãä ÎáÇá ÇáÃÓÆáÉ ÇáÊÇáíÉ æÚÏÏåÇ 24 ÓÄÇáÇ ÊÓÃá Úä ÊÌÑÈÊß <B>ÇáãÃãæáÉ</B> (ÇáãËÇáíÉ) İí åĞå ÇáæÍÏÉ.

æáíÓ åäÇß ÃÓÆáÉ \'ÕæÇÈ\' Ãæ \'ÎØÃ\'¡ İäÍä áÇ íåãäÇ ÅáÇ ÇáÊÚÑİ Úáì ÑÃíß İŞØ¡ ÊÃßÏ ãä Ãä ÑÏæÏß Óæİ ÊÚÇãá ÈÃŞÕì ÏÑÌÉ ãä ÇáÓÑíÉ æáä ÊÄËÑ Úáì ÊŞííãß.
ÑÏæÏß ÇáãÊÃäíÉ Óæİ ÊÓÇÚÏäÇ Úáì ÊÍÓíä ÇáÚÑÖ ÇáãÈÇÔÑ áåĞå ÇáæÍÏÉ  ãÓÊŞÈáÇ.

ãÚ ÌÒíá ÇáÔßÑ.';
$string['collespname'] = 'COLLES (ÇáİÚáí)';
$string['done'] = 'Êã';
$string['download'] = 'ÊäÒíá';
$string['downloadexcel'] = 'ÊäÒíá ÇáÈíÇäÇÊ İí ÌÏæá ÈÕíÛÉ  ÅßÓá';
$string['downloadinfo'] = 'íãßäß ÊäÒíá ÇáÈíÇäÇÊ ÈÍÇáÊåÇ áåĞÇ ÇáÇÓÊÈíÇä ÈÔßá ãäÇÓÈ áÊÍáíáåÇ İí  ÅßÓá, ÃÓ Èí ÃÓÇÃÓ Ãæ Ãí ÈÑÇãÌ ÃÎÑì.';
$string['downloadtext'] = 'ÊäÒíá ÇáÈíÇäÇÊ İí ãÌÑÏ ãáİ äÕæÕ';
$string['editingasurvey'] = 'ÊÚÏíá ÇáÇÓÊÈíÇä';
$string['guestsnotallowed'] = 'áÇ íÓãÍ áÒæÇÑ áÊÓáíã ÇÓÊÈíÇä';
$string['helpsurveys'] = 'ãÓÇÚÏÉ İí ÃäæÇÚ ÇáÇÓÊÈíÇäÇÊ ÇáãÎÊáİÉ';
$string['howlong'] = 'ßã ãä ÇáæŞÊ ÃãÖíÊ İí ÅÊãÇã åĞÇ ÇáÇÓÊÈíÇä¿';
$string['howlongoptions'] = 'ÃŞá ãä ÏŞíŞÉ¡ 1-2 ÏŞíŞÉ¡ 2-3 ÏŞÇÆŞ¡ 3-4 ÏŞÇÆŞ¡ 4-5 ÏŞÇÆŞ¡ 5-10 ÏŞÇÆŞ¡ ÃßËÑ ãä 10 ÏŞÇÆŞ';
$string['ifoundthat'] = 'æÌÏÊ Ãä';
$string['introtext'] = 'äÕ ÇáãŞÏãÉ';
$string['ipreferthat'] = ' ÃİÖá Ãä';
$string['modulename'] = 'ÇÓÊÈíÇä';
$string['modulenameplural'] = 'ÇÓÊÈíÇäÇÊ';
$string['name'] = 'ÇÓã';
$string['newsurveyresponses'] = 'ÅÌÇÈÉ ÇÓÊÈíÇä ÌÏíÏ';
$string['nobodyyet'] = 'áÇ íæÌÏ ãä Ãßãá åĞÇ ÇáÇÓÊÈíÇä ';
$string['notdone'] = 'áã íÊã';
$string['notes'] = 'ÊÍáíáß æãáÇÍÙÇÊß ÇáÎÇÕÉ';
$string['othercomments'] = 'åá áÏíß ÊÚáíŞÇÊ ÃÎÑì¿';
$string['peoplecompleted'] = '$a Ãßãá ÇáäÇÓ åĞÇ ÇáÇÓÊÈíÇä ÇáÂä';
$string['preferred'] = 'íİÖá';
$string['preferredclass'] = 'ÇáİÕá ÇáãÃãæá';
$string['preferredstudent'] = '$a ãÃãæá';
$string['question'] = 'ÓÄÇá';
$string['questions'] = 'ÃÓÆáÉ';
$string['questionsnotanswered'] = 'áã íÊã ÇáÅÌÇÈÉ Úáì ÈÚÖ ÇáÃÓÆáÉ ĞÇÊ ÇáÎíÇÑÇÊ ÇáãÊÚÏÏÉ.';
$string['report'] = 'ÊŞÑíÑ ÇáÇÓÊÈíÇä';
$string['savednotes'] = 'ãáÇÍÙÇÊß ÍİÙÊ';
$string['scaleagree5'] = 'ÃÚÇÑÖ ÈÔÏÉ¡ ÃÚÇÑÖ ÈÚÖ ÇáÔíÁ,áÇ ÃÚÇÑÖ æáÇ ÃÊİŞ,ÃÊİŞ ÈÚÖ ÇáÔíÁ¡ ÇÊİŞ ÈÔÏÉ';
$string['scales'] = 'äØÇŞÇÊ';
$string['scaletimes5'] = 'İí ÇáÛÇáÈ áÇ¡ äÇÏÑÇ¡ ÃÍíÇäÇ¡ İí ÃßËÑ ÇáÃÍíÇä¡ ÊŞÑíÈÇ ÏÇÆãÇ';
$string['seemoredetail'] = 'ÇÖÛØ åäÇ áÊÑì ÊİÇÕíá ÃßËÑ';
$string['selectedquestions'] = 'ÇÎÊÑ ÓÄÇáÇ ãä ÇáäØÇŞ, ßá ÇáÏÇÑÓíä';
$string['summary'] = 'ãæÌÒ';
$string['surveycompleted'] = 'áŞÏ ÃßãáÊ åĞÇ ÇáÇÓÊÈíÇä.  ÇáÑÓã ÇáÈíÇäí íæÖÍ ãáÎÕ äÊÇÆÌß ãŞÇÑäÉ ÈÇáãÊæÓØ .';
$string['surveyname'] = 'ÇÓã ÇáÇÓÊÈíÇä';
$string['surveysaved'] = 'ÍİÙ ÇáÇÓÊÈíÇä';
$string['surveytype'] = 'äæÚ ÇáÇÓÊÈíÇä';
$string['thanksforanswers'] = 'ÔßÑÇ Úáì ÇáÅÌÇÈÉ Úáì ÇáÇÓÊÈíÇä, $a';
$string['time'] = 'ÇáæŞÊ';
$string['viewsurveyresponses'] = 'ãÚÇíäÉ $a ÑÏæÏ ÇáÇÓÊÈíÇä';

?>
