<p align="center"><strong>Relat&iacute;v URL-ek, m&eacute;dialej&aacute;tsz&oacute;k &eacute;s Hot Potatoes</strong></p>

<p><strong>Meghat&aacute;roz&aacute;sok</strong></p>

<dl>

	<dt><i>URL</i></dt>

	<dd>valamely internetes forr&aacute;s, p&eacute;ld&aacute;ul weboldal, k&eacute;p vagy hang&aacute;llom&aacute;ny c&iacute;me.</dd>

	<dt><i>abszol&uacute;t URL</i></dt>

	<dd>a &quot;http://&quot;-vel kezd&#337;d&#337; URL. Mindig ugyanarra a c&iacute;mre mutat.</dd>

	<dt><i>relat&iacute;v URL</i></dt>

	<dd>nem &quot;http://&quot;-vel kezd&#337;d&#337; URL.  Egy &quot;alapoldal&quot; abszol&uacute;t URL-j&eacute;vel kombin&aacute;lva 
	megadhat&oacute; a c&iacute;m abszol&uacute;t URL-je.</dd>

</dl>

<p><strong>Relat&iacute;v URL-ek Hot Potatoes tesztek eset&eacute;n</strong></p>

<p>Relat&iacute;v URL-ekkel k&eacute;nyelmesen megadhat&oacute;k Hot Potatoes tesztekhez k&eacute;pek, hangok &eacute;s vide&oacute;k, 
hiszen ezek felt&ouml;lt&eacute;s el&#337;tt megtekinthet&#337;k &eacute;s ellen&#337;rizhet&#337;k a helyi g&eacute;pen.
Amikor a Moodle-ban haszn&aacute;lni k&iacute;v&aacute;nja a multim&eacute;di&aacute;s &aacute;llom&aacute;nyokat, akkor azokat is 
fel kell t&ouml;lteni a Moodle megfelel&#337; k&ouml;nyvt&aacute;r&aacute;ba.</p>

<p>Biztons&aacute;gi okokb&oacute;l a Moodle nem enged&eacute;lyezi a kurzus&aacute;llom&aacute;nyokhoz val&oacute; k&ouml;zvetlen 
hozz&aacute;f&eacute;r&eacute;st, hanem egy programk&oacute;ddal ellen&#337;rzi, hogy az adott szem&eacute;ly beiratkozott-e a kurzusba. 
Emiatt azonban el&aacute;ll&iacute;t&oacute;dhatnak a tesztben l&eacute;v&#337; relat&iacute;v ugr&oacute;pontok.</p>

<p>A megold&aacute;s viszonylag egyszer&#369;: <font color="red"><strong>minden relat&iacute;v URL-t
&aacute;t kell alak&iacute;tani abszol&uacute;tt&aacute;, </strong></font> 
mire a teszt a b&ouml;ng&eacute;sz&#337;be bet&ouml;lt&#337;dik. A Hot Potatoes t&iacute;pus&uacute; tesztek eset&eacute;n ezt a Moodle 
elv&eacute;gzi, 
&iacute;gy a tartalomfejleszt&#337;knek nem kell ezzel a f&aacute;rads&aacute;gos &eacute;s k&ouml;nnyen elhib&aacute;zhat&oacute; 
feladattal bajl&oacute;dniuk. </p>

<p><strong>M&eacute;dialej&aacute;tsz&oacute;k Hot Potatoes tesztek eset&eacute;n </strong></p>

<p>Egyes m&eacute;dialej&aacute;tsz&oacute;k nem fogadj&aacute;k el azokat az &aacute;llom&aacute;nyokat, amelyeket kurzusv&eacute;d&#337; 
k&oacute;don kereszt&uuml;l kapnak. Ilyen esetben olyan lej&aacute;tsz&oacute;t kell haszn&aacute;lni, amely kompatibilis a Moodle-lal. 
Ez el&eacute;rhet&#337; a tesztben megadott lej&aacute;tsz&oacute; m&oacute;dos&iacute;t&aacute;s&aacute;val, vagy a Moodle annak 
elfogad&aacute;s&aacute;ra k&eacute;nyszer&iacute;t&eacute;s&eacute;vel a &quot;M&eacute;dialej&aacute;tsz&oacute;k elfogad&aacute;sa&quot; 
&quot;Igen&quot;-re &aacute;ll&iacute;t&aacute;s&aacute;val a teszt be&aacute;ll&iacute;t&aacute;sainak az oldal&aacute;n.</p>



