<p align="center"><strong>Jelent&eacute;s kiv&aacute;laszt&aacute;sa</strong></p>

<p>

	K&uuml;l&ouml;nf&eacute;le v&aacute;laszt&aacute;si lehet&#337;s&eacute;gek &eacute;s kimeneti form&aacute;k adhat&oacute;k meg a Hot Potatoes jelent&eacute;seihez.

</p>

<dl>

	<dt><strong>Kurzus kiv&aacute;laszt&aacute;sa (csak rendszergazd&aacute;k sz&aacute;m&aacute;ra)</strong></dt>

	<dd><strong>ez a kurzus</strong><br /> 

	A jelent&eacute;s a kurzus r&eacute;sztvev&#337;i szerint mutatja a v&aacute;laszokat</dd>

	<dd><strong>minden kurzusom</strong><br /> 

		A jelent&eacute;s r&eacute;sztvev&#337;nk&eacute;nt mutatja a v&aacute;laszokat a tesztet haszn&aacute;l&oacute; &ouml;sszes 
		olyan kurzus eset&eacute;n, amelyet &ouml;n tan&iacute;t. 

		T&ouml;bb kurzusban val&oacute; felhaszn&aacute;l&aacute;shoz a tesztet a port&aacute;l &aacute;llom&aacute;nyainak 
		a k&ouml;nyvt&aacute;r&aacute;ban kell elhelyezni.

		Ezzel a lehet&#337;s&eacute;ggel csak a rendszergazd&aacute;k &eacute;lhetnek.

	</dd>

	</dd>

</dl>

<dl>

	<dt><strong>Felhaszn&aacute;l&oacute;k kiv&aacute;laszt&aacute;sa</strong></dt>

	<dd><strong>Tanul&oacute;k</strong><br /> 

		A jelent&eacute;s a kurzust l&aacute;togat&oacute; tanul&oacute;k v&aacute;laszait mutatja. 

		A tan&aacute;r v&aacute;laszai nem jelennek meg a jelent&eacute;sben

	</dd>



	<dd><strong>Minden r&eacute;sztvev&#337;</strong><br /> 			

		A jelent&eacute;s tanul&oacute;nk&eacute;nt, tan&aacute;ronk&eacute;nt, tananyag&iacute;r&oacute;nk&eacute;nt &eacute;s 
		rendszergazd&aacute;nk&eacute;nt mutatja a v&aacute;laszokat.

		Ugyancsak tartalmazza az esetleges &quot;vend&eacute;g&quot;-felhaszn&aacute;l&oacute;k v&aacute;laszait is. 

	</dd>

</dl>

<dl>

	<dt><strong>Pontok kiv&aacute;laszt&aacute;sa</strong></dt>

	<dd><strong>legjobb pr&oacute;b&aacute;lkoz&aacute;s</strong><br /> 

	A jelent&eacute;s csak az egyes felhaszn&aacute;l&oacute;k legjobb pr&oacute;b&aacute;lkoz&aacute;sait tartalmazza</dd>



	<dd><strong>minden pr&oacute;b&aacute;lkoz&aacute;s</strong><br /> 

	A jelent&eacute;sben minden felhaszn&aacute;l&oacute; minden pr&oacute;b&aacute;lkoz&aacute;sa megjelenik</dd>

</dl>

<dl>

	<dt><strong>Kimeneti forma kiv&aacute;laszt&aacute;sa</strong></dt>

	<dd><strong>&Aacute;ttekint&eacute;s</strong><br /> 	

		Ez a jelent&eacute;s a teszttel kapcsolatos pr&oacute;b&aacute;lkoz&aacute;sokat sorolja f&ouml;l.

		A &quot;feladott&quot; pr&oacute;b&aacute;lkoz&aacute;sok szerepelnek benne, de a &quot;folyamatban 
		l&eacute;v&#337;&quot; pr&oacute;b&aacute;lkoz&aacute;sok nem jelennek meg.

		Szerepel benne az egyes felhaszn&aacute;l&oacute;k k&eacute;pe, neve &eacute;s legmagasabb pontsz&aacute;ma,
		tov&aacute;bb&aacute; az egyes pr&oacute;b&aacute;lkoz&aacute;sok id&#337;pontja &eacute;s id&#337;tartama. 
		A pr&oacute;b&aacute;lkoz&aacute;sok kiv&aacute;laszthat&oacute;k, sz&uuml;ks&eacute;g eset&eacute;n t&ouml;r&ouml;lhet&#337;k.

	</dd>

	<dd><strong>Egyszer&#369; statisztika</strong><br /> 	

		Ez a jelent&eacute;s a teszten v&eacute;grehajtott &ouml;sszes pr&oacute;b&aacute;lkoz&aacute;st tartalmazza.
		A &quot;feladott&quot; és a &quot;folyamatban 
		l&eacute;v&#337;&quot; jelz&eacute;s&#369; pr&oacute;b&aacute;lkoz&aacute;sok nem jelennek meg benne.
		Szerepel benne az egyes felhaszn&aacute;l&oacute;k neve &eacute;s legmagasabb pontsz&aacute;ma,
		tov&aacute;bb&aacute; az egyes pr&oacute;b&aacute;lkoz&aacute;sok sor&aacute;n az egyes k&eacute;rd&eacute;sekre adott pontsz&aacute;m.
		Emellett tartalmazza mind az egyes k&eacute;rd&eacute;sek, mind pedig a teljes teszt &aacute;tlagpontsz&aacute;m&aacute;t.
		A pr&oacute;b&aacute;lkoz&aacute;sok r&eacute;szletei Excel vagy sz&ouml;veg form&aacute;j&aacute;ban t&ouml;lthet&#337;k le.

	</dd>

	<dd><strong>R&eacute;szletes statisztika</strong><br /> 	
		Ez a jelent&eacute;s a teszten v&eacute;grehajtott &ouml;sszes pr&oacute;b&aacute;lkoz&aacute;st tartalmazza.
		A &quot;feladott&quot; és a &quot;folyamatban 
		l&eacute;v&#337;&quot; jelz&eacute;s&#369; pr&oacute;b&aacute;lkoz&aacute;sok nem jelennek meg benne.
		A jelent&eacute;s a k&ouml;vetkez&#337; t&aacute;bl&aacute;zatokb&oacute;l &aacute;ll:
		<ul>
			<li>
				a <strong>v&aacute;laszok t&aacute;bl&aacute;zata</strong>,  amely tartalmazza, hogy az egyes felhaszn&aacute;l&oacute;k 
				mik&eacute;nt v&aacute;laszoltak a teszten v&eacute;grehajtott egyes pr&oacute;b&aacute;lkoz&aacute;saik sor&aacute;n az egyes k&eacute;rd&eacute;sekre.
			</li>

 			<li>
				a <strong>t&eacute;teles elemz&eacute;s t&aacute;bl&aacute;zata</strong>, amely az egyes k&eacute;rd&eacute;sekre adott 
				v&aacute;laszokat &eacute;s azok gyakoris&aacute;g&aacute;t tartalmazza.
			</li>
		</ul>

		A jelent&eacute;s r&eacute;szletei Excel vagy sz&ouml;veg form&aacute;j&aacute;ban t&ouml;lthet&#337;k le.

	</dd>

</dl>

