<p align="center">
	<span style="font-weight: bold;">A jelent&eacute;s tartalma</span>
</p>
<p>
	A Hot Potatoes jelent&eacute;sei k&uuml;l&ouml;nf&eacute;le tartalommal k&eacute;sz&uuml;lhetnek.
</p>
<p><span style="font-weight: bold;">Jelent&eacute;st&iacute;pus kiv&aacute;laszt&aacute;sa</span></p>
<div class="indent"><p>	<span style="font-weight: bold;">&Aacute;ttekint&eacute;s</span></p>
<p>	Ez a jelent&eacute;s az adott teszt pr&oacute;b&aacute;lkoz&aacute;sait sorolja f&ouml;l.
		A &quot;felhagyott&quot; pr&oacute;b&aacute;lkoz&aacute;sokat kihagyja,
		de a &quot;folyamatban l&eacute;v&#337;k&quot; szerepelnek benne.

		Szerepel benne az egyes felhaszn&aacute;l&oacute;k k&eacute;pe &eacute;s neve, a tesztre kapott pontsz&aacute;m &eacute;s tal&aacute;lat,
		valamint az egyes pr&oacute;b&aacute;lkoz&aacute;sok id&#337;pontja &eacute;s tartama. 

		A pr&oacute;b&aacute;lkoz&aacute;sokat sz&uuml;ks&eacute;g eset&eacute;n kiv&aacute;laszthatja &eacute;s kit&ouml;r&ouml;lheti.
	</p>

<p><span style="font-weight: bold;">Egyszer&#369; statisztika</span><br /> 	
		Ez a jelent&eacute;s az adott teszt &ouml;sszes befejezett pr&oacute;b&aacute;lkoz&aacute;s&aacute;t sorolja f&ouml;l.

		A &quot;felhagyott&quot; és a &quot;folyamatban l&eacute;v&#337;&quot; 
		pr&oacute;b&aacute;lkoz&aacute;sok nem szerepelnek benne.

		Szerepel benne az egyes felhaszn&aacute;l&oacute;k k&eacute;pe &eacute;s neve, a tesztre kapott pontsz&aacute;m &eacute;s 
		az egyes pr&oacute;b&aacute;lkoz&aacute;sok során az egyes kédésekkel kapcsolatos tal&aacute;latok. 

		Emellett megadja az egyes k&eacute;rd&eacute;sekre &eacute;s az eg&eacute;sz tesztre az &aacute;tlagpontot.
	</p>


<p><span style="font-weight: bold;">R&eacute;szletes statisztika</span><br /> 	
		Ez a jelent&eacute;s a teszttel kapcsolatos &ouml;sszes befejezett pr&oacute;b&aacute;lkoz&aacute;s minden r&eacute;szlet&eacute;t tartalmazza.

		A &quot;felhagyott&quot; és a &quot;folyamatban l&eacute;v&#337;&quot; 
		pr&oacute;b&aacute;lkoz&aacute;sok nem szerepelnek benne.

		A jelent&eacute;s az al&aacute;bbi t&aacute;bl&aacute;zatokat tartalmazza:	</p>
		<ul>
			<li>
				a <a href="help.php?module=hotpot&file=responsestable.html">v&aacute;laszok t&aacute;bl&aacute;zata</a>, 
				amelyb&#337;l kider&uuml;l, hogyan v&aacute;laszoltak az egyes felhaszn&aacute;l&oacute;k pr&oacute;b&aacute;lkoz&aacute;saik 
				sor&aacute;n az egyes tesztk&eacute;rd&eacute;sekre.
			</li>
			<li>
				az <a href="help.php?module=hotpot&file=analysistable.html">elemz&eacute;si t&aacute;bl&aacute;zat</A>, amely felsorolja
				az egyes k&eacute;rd&eacute;sekre adott v&aacute;laszokat a gyakoris&aacute;gukkal egy&uuml;tt.
			</li>
		</ul>
<p><span style="font-weight: bold;">Kattint&aacute;sokr&oacute;l sz&oacute;l&oacute; jelent&eacute;s</span><br /> 
		Ez a jelent&eacute;s megmutatja az egyes tanul&oacute;knak a teszt megold&aacute;sa sor&aacute;n v&eacute;grehajtott 
		&ouml;sszes eg&eacute;rkattint&aacute;s&aacute;t.
		Ez a jelent&eacute;s igen terjedelmes lehet. Let&ouml;lt&eacute;se ut&aacute;n t&aacute;bl&aacute;zatkezel&#337;ben, pl. 
		Microsoft Excelben tekinthet&#337; meg.
		A jelentés oszlopainak részletei a 
		<a href="help.php?module=hotpot&file=clickreporttable.html">kattint&aacute;sok t&aacute;bl&aacute;zata</a>
		s&uacute;g&oacute;ban tekinthet&#337;k meg.</p>
</div>
<p><span style="font-weight: bold;">Kurzus kiv&aacute;laszt&aacute;sa</span></p>

<div class="indent"><p><span style="font-weight: bold;">Ez a kurzus</span><br />
		A jelent&eacute;s az adott kurzusban r&eacute;szt vev&#337;k v&aacute;laszait mutatja.
	</p>
<p> <span style="font-weight: bold;">Minden kurzusom<br />
		A jelent&eacute;s a tesztet haszn&aacute;l&oacute;, &Ouml;n &aacute;ltal tartott &ouml;sszes kurzus r&eacute;sztvev&#337;inek 
		a v&aacute;lasz&aacute;t tartalmazza. 
		T&ouml;bb kurzusban val&oacute; haszn&aacute;lathoz a tesztnek a <span style="font-weight: bold;">Port&aacute;l &aacute;llom&aacute;nyai</span> 
		k&ouml;nyvt&aacute;rban kell szerepelni.
		<span style="font-weight: bold;"><i>Ez a lehet&#337;s&eacute;g csak a port&aacute;l rendszergazd&aacute;i sz&aacute;m&aacute;ra el&eacute;rhet&#337;.</i></span>
	</p>
</div>

<p><span style="font-weight: bold;">Felhaszn&aacute;l&oacute;k kiv&aacute;laszt&aacute;sa</span></p>
<div class="indent">
	<p><span style="font-weight: bold;">Minden r&eacute;sztvev&#337;</span><br /> 			
      Ebben a jelent&eacute;sben a v&aacute;laszok tanul&oacute;k, tan&aacute;rok, kurzusfejleszt&#337;k &eacute;s 
		rendszergazd&aacute;k szerinti lebont&aacute;sban szerepelnek.
		Ha vannak, tartalmazza a &quot;vend&eacute;g&quot; felhaszn&aacute;l&oacute;k v&aacute;laszait is. </p> 
	<p><span style="font-weight: bold;">Tanul&oacute;k</span><br /> 
	A jelent&eacute;sben a v&aacute;laszok a kurzusba beiratkozott tanul&oacute;k szerinti bont&aacute;sban jelennek meg. 
		A jelent&eacute;s nem tartalmazza a tan&aacute;r v&aacute;laszait.
	</p>

	<p><span style="font-weight: bold;">Egyetlen tanul&oacute;</span><br />
    A jelent&eacute;s a leg&ouml;rd&uuml;l&#337; list&aacute;b&oacute;l kiv&aacute;lasztott egyetlen tanul&oacute; v&aacute;laszait mutatja.
	</p>
</div>
<p><span style="font-weight: bold;">Pontok kiv&aacute;laszt&aacute;sa</span></p>

<div class="indent">

	<p><span style="font-weight: bold;">Minden pr&oacute;b&aacute;lkoz&aacute;s</span><br /> 
	A jelent&eacute;s az egyes felhaszn&aacute;l&oacute;k &ouml;sszes pr&oacute;b&aacute;lkoz&aacute;s&aacute;val &ouml;sszef&uuml;gg&#337; 
	v&aacute;laszokat tartalmazza.</p>

	<p><span style="font-weight: bold;">Legjobb pr&oacute;b&aacute;lkoz&aacute;s</span><br /> 
	A jelent&eacute;sben csak az egyes felhaszn&aacute;l&oacute;k pr&oacute;b&aacute;lkoz&aacute;saira adott legmagasabb pontok szerepelnek.</p>

	<p><span style="font-weight: bold;">Els&#337; pr&oacute;b&aacute;lkoz&aacute;s</span><br /> 
	A jelent&eacute;sben csak az egyes felhaszn&aacute;l&oacute;k els&#337; pr&oacute;b&aacute;lkoz&aacute;sai szerepelnek.
	</p>

	<p><span style="font-weight: bold;">Utols&oacute; pr&oacute;b&aacute;lkoz&aacute;s</span><br /> 
	A jelent&eacute;sben csak az egyes felhaszn&aacute;l&oacute;k legutols&oacute; pr&oacute;b&aacute;lkoz&aacute;sai szerepelnek.
	</p>
</div>

