

<P>Sie k&ouml;nnen eine Abbildung von Ihrem Computer zu diesem Bediener hochladen, und diese Abbildung wird in den verschiedenen Pl&auml;tzen benutzt, um Sie darzustellen.<P>Aus diesem Grund sind die besten Bilder zu verwenden eine Nahaufnahme Ihres Gesichtes, aber Sie k&ouml;nnen jedes m&ouml;gliches Bild verwenden, das Sie m&ouml;gen.<P>Die Abbildung mu&szlig; im JPG- oder png-Format (IE, das die Namen normalerweise im jpg oder im png beenden) sein.<P>Sie k&ouml;nnen eine Abbildungsakte mit einer von vier Methoden erhalten:<OL>
<LI>Mit einer digitalen Kamera sind Ihre Fotos am wahrscheinlichsten bereits auf Ihrem Computer im rechten Format.<LI>Sie k&ouml;nnen einen Scanner benutzen, um eine gedruckte Fotographie abzulichten.  &Uuml;berpr&uuml;fen Sie au&szlig;er ihr wie JPG- oder png-Format.<LI>Wenn Sie k&uuml;nstlerisch sind, konnten Sie eine Abbildung mit einem Farbenprogramm zeichnen.<LI>Zuletzt k&ouml;nnen Sie Bilder vom Netz "stehlen".  <A  TARGET=google HREF="http://216.239.39.120/translate_c?hl=de&ie=iso-8859-1&oe=iso-8859-1&langpair=en%7Cde&u=http://images.google.com/&prev=/language_tools/"> http://images.google.com </A> ist ein gro&szlig;artiger Platz zum Suchen nach Bildern.  Sobald Sie ein finden, k&ouml;nnen Sie "Rechtklicken" auf ihnen mit der Maus und "au&szlig;er diesem Bild..." vom Men&uuml; zu w&auml;hlen (unterschiedliche Computer k&ouml;nnen etwas sich ver&auml;ndern).</OL>

<P>, um das Bild zu hochladen, klicken Sie "grasen" Taste auf dieser Redigierenseite und vorw&auml;hlen das Bild von Ihrer Festplatte an.<P>ANMERKUNG:  &Uuml;berpr&uuml;fen Sie, ob die Akte nicht gr&ouml;&szlig;er als die maximale verzeichnete Gr&ouml;&szlig;e ist, oder sie nicht Antriebskraft.<P>Dann Klicken "Update mein Profil" an der Unterseite - die Bildakte wird zu einem Quadrat geerntet und die Gr&ouml;&szlig;e neu bestimmt unten zu den Pixeln 100x100.<P>When you are taken back to your profile page, the image might not appear to have changed.  If this is so, just use the "Reload" button in your browser.
