

<P>Z.Z. bietet Moodle nur spezifische Arten von &Uuml;bersichten an (zuk&uuml;nftige Versionen erm&ouml;glichen Ihnen, Ihre Selbst zu verursachen).</P>

<P>Die vorhandenen &Uuml;bersichten sind als seiend besonders n&uuml;tzlich f&uuml;r das Auswerten online der erlernen Klimas gew&auml;hlt worden, die ein constructivistpedagogy verwenden.  Sie sind n&uuml;tzlich, bestimmte Tendenzen zu kennzeichnen, die unter Ihren Teilnehmern geschehen k&ouml;nnen.  (ein Papier zu sehen, in dem diese in einer ausf&uuml;hrlichen Analyse verwendet werden, sehen Sie:  <A  TARGET=paper HREF="http://216.239.39.120/translate_c?hl=de&ie=iso-8859-1&oe=iso-8859-1&langpair=en%7Cde&u=http://dougiamas.com/writing/herdsa2002&prev=/language_tools/"> http://dougiamas.com/writing/herdsa2002 </A>)</P>

<HR>
<P><B> COLLES - Lernen-Klimac&Uuml;bersicht Constructivist On-line-</B></P>
<UL>
  <p>Das COLLES enth&auml;lt die &ouml;konomischen 24 Aussagen, die in sechs Skalen gruppiert werden, von denen jede uns hilft, eine Schl&uuml;sselfrage &uuml;ber die Qualit&auml;t des on-line-Lernenklimas zu adressieren:</p>

<table BORDER="0" CELLSPACING="10" CELLPADDING="10">
  <tr> 
    <td valign=top>Bedeutung</td>
    <td>Ist das on-line-Lernen zur professionellen Praxis der Kursteilnehmer wie relevant?</td>
  </tr>
  <tr> 
    <td valign=top>Reflexion</td>

    <td>Online regt erlernen das kritische reflektierende Denken der Kursteilnehmer an?</td>
  </tr>
  <tr> 
    <td valign=top>Wechselwirkung</td>
    <td>In welchem Ausmass Kursteilnehmer, engagieren sich online in reichem educative dialogieren?</td>
  </tr>
  <tr> 
    <td valign=top>TutorcUnterst&uuml;tzung</td>

    <td>Wie gut erm&ouml;glichen Tutore Kursteilnehmern, teilzunehmen, an, online zu erlernen?</td>
  </tr>
  <tr> 
    <td valign=top>GleichcUnterst&uuml;tzung</td>
    <td>Ist und zur Verf&uuml;gung gestelltes on-line der Anregung Unterst&uuml;tzung durch Mitkursteilnehmer empfindlich?</td>
  </tr>
  <tr> 
    <td valign=top>Deutung</td>

    <td>Sind Kursteilnehmer und Tutore gutes sinnvoll von den jeder des anderen on-line-Kommunikationen?</td>
  </tr>
</table>

  <p>Die dynamische Ansicht des Lernens zu untermauern ist eine neue Theorie des Wissens:  Sozialconstructivism, das den Anf&auml;nger als aktives conceptualiser innerhalb eines sozial wechselwirkenden Lernenklimas schildert.  Sozialconstructivism ist ein epistemology, oder Weise des Wissens, in der Anf&auml;nger reflektierend zusammenarbeiten, Co-konstruieren neue understandings, besonders im Kontext der gegenseitigen Anfrage geerdet in ihrer pers&ouml;nlichen Erfahrung.</p>

  <p>Zentrale zu dieser Zusammenarbeit ist die Entwicklung der mitteilsamen Kompetenz der Kursteilnehmer d.h. die F&auml;higkeit, sich in der ge&ouml;ffneten und kritischen Darlegung mit dem Lehrer und den Gleichen zu engagieren.  Diese Darlegung wird durch eine empathic Lagebestimmung zum Konstruieren des wechselseitigen Verst&auml;ndnisses und eine kritische einstellung gegen&uuml;ber zugrundeliegenden Annahmen &Uuml;berpr&uuml;fens gekennzeichnet.</p>

  <p>Das COLLES ist entworfen worden, um Ihnen zu erm&ouml;glichen, den Umfang zu &uuml;berwachen, in dem Sie in der LageSIND, die wechselwirkende Kapazit&auml;t des World Wide Web f&uuml;r das Engagieren der Kursteilnehmer in der dynamischen Lernenpraxis auszunutzen.</p>

<P>(diese Informationen sind von der COLLES-Seite angepa&szlig;t worden.  Sie k&ouml;nnen mehr &uuml;ber COLLES und die Autoren von ihm an herausfinden:  <A  TARGET=paper HREF="http://216.239.39.120/translate_c?hl=de&ie=iso-8859-1&oe=iso-8859-1&langpair=en%7Cde&u=http://surveylearning.com/colles/&prev=/language_tools/"> http://surveylearning.com/colles/</A>)</P>
</UL>


<HR>
<P><B> ATTLS - Haltung zur Denken und Lernen&uuml;bersicht </B></P>
<UL>

<P>Die Theorie von ' Weisen des Wissens ', urspr&uuml;nglich vom Feld der Geschlechtforschung (Belenky et al., 1986) versieht uns mit einem &Uuml;bersichtswerkzeug, um die Qualit&auml;t der Darlegung innerhalb eines gemeinschaftlichen Klimas zu &uuml;berpr&uuml;fen.<P>Die einstellungen gegen&uuml;ber Denken und Lernen&uuml;bersicht (ATTLS) ist ein Instrument, das von Galotti et al. (1999) entwickelt wird um den Umfang zu messen, in dem eine Person ein ' verbundenes knower ' (CK) oder ein ' unterschiedliches knower ' ist (SK).<P>Leute mit h&ouml;heren CK-Kerben neigen, das Lernen erfreulicheres zu finden, und sind h&auml;ufig kooperativer, congenial und bereiter, auf den Ideen von anderen zu errichten, w&auml;hrend die mit h&ouml;heren SK-Kerben neigen, eine kritischere und argumentative Position zum Lernen zu nehmen.<P>Studien haben gezeigt, da&szlig; diese zwei Lernenarten von einander unabh&auml;ngig sind (Galotti et al., 1999;  Galotti et al., 2001).  Zus&auml;tzlich sind sie nur eine Reflexion von Lernenhaltung, Lernennicht kapazit&auml;ten oder intellektuelle Energie.<P><I> Belenky, M. F., Clinchy, B.-M., Goldberger, N. R. U. Tarule, J.-M. (1986).  Weisen der Frauen des Wissens:  Die Entwicklung von Selbst-, von Stimme und von Verstand.  Neues York:  Grundlegende B&uuml;cher, Inc..  </I></P>

<P><I> Galotti, K.-M., Clinchy, B.-M., Ainsworth, K., Lavin, B. U. Mansfield, A. F. (1999).  Eine neue Weise des Festsetzens von Weisen des Wissens:  Die einstellungen gegen&uuml;ber Denken und Lernen&uuml;bersicht (ATTLS).  GeschlechtcRollen, 40(9/10), 745-766.  </I></P>

<P><I> Galotti, K.-M., Reimer, R. L. U. Drebus, D. W. (2001).  Weisen des Wissens als Lernenarten:  LernencMagie mit einem Partner.  GeschlechtcRollen, 44(7/8), 419-436.  </I></P>


</UL>
