<p align="center"><b>Cat&eacute;gories de questions</b></p>

<p>Plut&ocirc;t que de conserver toutes vos questions dans une seule
grande liste, vous pouvez cr&eacute;er des cat&eacute;gories pour les g&eacute;rer
plus facilement. Vous construirez ainsi une banque de questions
class&eacute;e en plusieurs cat&eacute;gories, o&ugrave; chaque question peut &ecirc;tre
utilis&eacute;e plusieurs fois dans des tests diff&eacute;rents.</p>

<p>Vous devez donner un nom &agrave; chaque cat&eacute;gorie et fournir une
courte description. Vous pouvez cr&eacute;er autant de cat&eacute;gories que
vous le d&eacute;sirez. Vous pouvez aussi en supprimer, mais si la
cat&eacute;gorie que vous d&eacute;sirez effacer contient des questions, alors
vous devrez indiquer une cat&eacute;gorie o&ugrave; celles-ci doivent &ecirc;tre
d&eacute;plac&eacute;es.</p>

<p>Chaque cat&eacute;gorie peut &ecirc;tre &eacute;galement publi&eacute;e. La cat&eacute;gorie et
toutes ses questions sont alors disponibles dans tous les cours
de votre serveur Moodle, de sorte que d'autres professeurs
pourront employer vos questions dans leurs cours. Toutefois, il
est fortement recommand&eacute; d'utiliser cette option avec parcimonie,
car les cat&eacute;gories que vous aurez publi&eacute;es seront dans toutes les
listes de cat&eacute;gories de tous les cours&nbsp;! Supposons que 30
professeurs d&eacute;cident de publier seulement deux cat&eacute;gories chacun,
cela fait un total de 60 cat&eacute;gories qui s'ajoutent aux cat&eacute;gories
priv&eacute;es de chaque professeur... On recommande donc les fa&ccedil;ons de
faire suivantes&nbsp;:</p>

<ul> <li>Les cat&eacute;gories de questions ne devraient pas &ecirc;tre
syst&eacute;matiquement publi&eacute;es.</li> <li>On publie une cat&eacute;gorie pour
un temps tr&egrave;s court, par exemple, pour quelques heures ou pour
quelques jours, le temps que les autres professeurs puissent
r&eacute;cup&eacute;rer vos questions (on avise les professeurs concern&eacute;s de
faire vite&nbsp;!). Ensuite, on r&eacute;active l'attribut priv&eacute; de la
cat&eacute;gorie.</li> <li>Le nom de la cat&eacute;gorie devrait &ecirc;tre court de
fa&ccedil;on &agrave; ce que l'affichage de la page o&ugrave; se fait l'&eacute;dition des
tests puisse tenir sur un &eacute;cran.</li> </ul>

<p>Vous ne pouvez pas modifier les questions tir&eacute;es d'une
cat&eacute;gorie publi&eacute;e dans un autre cours &agrave; moins que vous soyez
aussi titulaire de ce cours.</p>

<p>Les questions tir&eacute;es d'une cat&eacute;gorie qui a &eacute;t&eacute; publi&eacute;e, mais
qui est par la suite devenue priv&eacute;e, sont encore disponibles dans
le test o&ugrave; elles ont &eacute;t&eacute; utilis&eacute;es. Les &eacute;tudiants peuvent donc
faire le test sans probl&egrave;me d'acc&egrave;s. Le professeur peut retirer
ces questions du test, mais ne pourra pas les ajouter de nouveau
puisque la cat&eacute;gorie sera alors priv&eacute;e.</p>