<p align="center"><b>Importation de questions</b></p>

<p>Cette fonction vous permet d'importer des questions &agrave; partir
de fichiers de texte externes, &agrave;l'aide d'un formulaire. Les
formats de fichiers suivants sont support&eacute;s&nbsp;:</p>

<p><b>Format GIFT</b></p>
<ul>
 <p>Le format GIFT est le plus complet des formats d'importation de
 questions disponible dans Moodle. Il a &eacute;t&eacute; con&ccedil;u pour permettre
 aux enseignants d'&eacute;crire simplement des questions dans in fichier
 texte. Il permet la saisie des questions &agrave; Choix multiples, Vrai-Faux,
 &agrave; R&eacute;ponse courte ou &agrave; R&eacute;ponse num&eacute;rique, ainsi que l'insertion de
 _____ pour le format Mot manquant. Les diff&eacute;rents types de questions
 peuvent &ecirc;tre m&eacute;lang&eacute;s dans un m&ecirc;me fichier texte, et le format permet
 &eacute;galement l'insertion de commentaires, titres de questions, feedbacks
 et pond&eacute;ration des points en %. Voici quelques exemples&nbsp;:</p>
 <pre>
 Quelle &eacute;tait la couleur de la jument blanche de
 Napol&eacute;on ?{~Verte ~Noire =Blanche}
 
 La jument blanche de Napol&eacute;on &eacute;tait {~verte =blanche ~noire}.
 
 La jument blanche de Napol&eacute;on &eacute;tait verte.{FALSE}
 
 Qui Napol&eacute;on a-t-il &eacute;pous&eacute; ?{=Marie-Louise =Jos&eacute;phine}
 
 Quelle est la date de naissance de Napol&eacute;on ?{#1769:5}
 </pre>
  <p align=right>Plus d'informations au sujet du format <a
  href="help.php?file=formatgift.html&amp;module=quiz">GIFT</a>.</p>
</ul>
  	 
<p><b>Format Aiken</b></p>
 <ul>
 <p>Le format Aiken format propose une fa&ccedil;on tr&egrave;s intuitive pour cr&eacute;er
 des questions &agrave; choix multiples de fa&ccedil;on lisible. Voici un exemple de
 ce format&nbsp;:</p>
 <pre>
 Lesquels parmi ces astres font partie du syst&egrave;me solaire ?
 A. La Voie Lact&eacute;e
 B. Sirius
 C. Les Pl&eacute;iades
 D. La com&egrave;te de Halley
 ANSWER: D
 </pre>
  <p align=right>Plus d'informations au sujet du format <a
  href="help.php?file=formataiken.html&amp;module=quiz">Aiken</a>.</p>
</ul>

<p><b>R&eacute;ponse int&eacute;gr&eacute;e au texte</b></p>
<ul>
  <p>Ce format supporte seulement des questions o&ugrave; la r&eacute;ponse est
  int&eacute;gr&eacute;e au texte et qu'un choix de r&eacute;ponses est propos&eacute;.
  Chaque r&eacute;ponse est pr&eacute;c&eacute;d&eacute;e d'un tilde (~), sauf la r&eacute;ponse
  correcte qui est pr&eacute;c&eacute;d&eacute;e d'un signe d'&eacute;galit&eacute; (=). Voici un
  exemple&nbsp;:</p>
  <blockquote>D&egrave;s que nous commen&ccedil;ons &agrave; explorer les parties de
  notre corps lorsque nous sommes enfant, nous devenons des
  &eacute;tudiants {=en anatomie et physiologie ~ en science ~ en
  r&eacute;flexologie}, et dans un sens, nous demeurons des &eacute;tudiants
  pour la vie.</blockquote>
  <p align="right">Plus d'informations au sujet du format <a
  href="help.php?file=formatmissingword.html&amp;module=quiz">&laquo;&nbsp;R&eacute;ponse
  int&eacute;gr&eacute;e au texte&nbsp;&raquo;</a></p>
</ul>

<p><b>Format AON</b></p>
<ul>
  <p>Ce format est identique au format pr&eacute;c&eacute;dent, sauf qu'apr&egrave;s
  l'importation des questions, toutes les questions &agrave; r&eacute;ponse
  courte sont converties en question d'appariements, par groupe de
  quatre. En outre, les r&eacute;ponses des questions &agrave; choix
  multiples sont plac&eacute;es al&eacute;atoirement.</p>
  <p>Ce type de question porte le nom d'une organisation qui a
  commandit&eacute; le d&eacute;veloppement de beaucoup de types de
  questions.</p>
</ul>

<p><b>Format BlackBoard</b></p>
<ul>
  <p>Ce module permet d'importer des questions enregistr&eacute;es dans le
  format &laquo;&nbsp;BlackBoard&nbsp;&raquo;. Il se fonde sur des fonctions XML
  incluses avec le serveur PHP utilis&eacute; par Moodle. </p>
  <p align="right">Plus d'informations au sujet du format <a
  href="help.php?file=formatblackboard.html&amp;module=quiz">&laquo;&nbsp;BlackBoard&nbsp;&raquo;</a></p>
</ul>

<p><b>Format Personnalis&eacute;</b></p>
<ul>
  <p>Si vous avez votre propre format que vous d&eacute;sirez importer,
  vous pouvez en programmer son importation en &eacute;ditant le fichier
  mod&egrave;le &laquo;&nbsp;mod/quiz/format/custom.php&nbsp;&raquo;. Le bout de programme
  requis est minimal puisqu'il n'a qu'&agrave; analyser le texte d'une
  question.</p>
  <p align="right">Plus d'informations au sujet du format <a
  href="help.php?file=formatcustom.html&amp;module=quiz">&laquo;&nbsp;personnalis&eacute;&nbsp;&raquo;</a></p>
</ul>

<p>D'autres formats sont &agrave; venir dans une prochaine version,
y compris WebCT, IMS QTI et tous les autres formats que les
utilisateurs de  Moodle voudront bien fournir&nbsp;!</p>