<p align="center"><b>Cr&eacute;ation d'une nouvelle question</b></p>

<p>Il existe dans Moodle de nombreux types de question pour
l'&eacute;laboration de vos tests&nbsp;:</p>

<p><b>Questions &agrave; choix multiples</b></p>

<p>Une question &agrave; choix multiples offre &agrave; l'&eacute;tudiant un choix de
r&eacute;ponses parmi lesquelles il devra choisir. La question peut
inclure une image. Il existe deux variantes &agrave; ce type de
question&nbsp;:</p>

<ul> <li>Une seule r&eacute;ponse est valide et donc tous les points
sont accord&eacute;s &agrave; celle-ci.</li> <li>Il y a plusieurs r&eacute;ponses
valides et les points sont partag&eacute;s entre les diff&eacute;rentes
r&eacute;ponses.</li> <p align="right"><a
href="help.php?file=multichoice.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions &agrave; choix multiples</a></p> </ul>

<p><b>Questions &agrave; r&eacute;ponse courte</b></p>

<p>Pour r&eacute;pondre &agrave; une question &agrave; r&eacute;ponse courte, l'&eacute;tudiant
saisit un mot ou une expression. L'enseignant peut permettre
plusieurs r&eacute;ponses possibles. On peut exiger de respecter la
casse ou non (lettres minuscules ou/et majuscules). On peut faire
afficher une image avec la question.</p>

<p align="right"><a
href="help.php?file=shortanswer.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions &agrave; r&eacute;ponses courtes</a></p>

<p><b>Questions &agrave; r&eacute;ponse num&eacute;rique</b></p>

<p>Les questions &agrave; r&eacute;ponse num&eacute;rique sont analogues aux questions
&agrave; r&eacute;ponse courte. La diff&eacute;rence r&eacute;side dans le fait que la
premi&egrave;re peut accepter la r&eacute;ponse fournie par l'&eacute;tudiant avec une
marge d'erreur. L'enseignant fournit la valeur minimale et la
valeur maximale de la plage des valeurs acceptables.</p>

<p align="right"><a
href="help.php?file=numerical.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions &agrave; r&eacute;ponse num&eacute;rique</a></p>

<p><b>Questions vrai ou faux</b></p>

<p>Ce type de question exige de la part de l'&eacute;tudiant une r&eacute;ponse
qui peut &ecirc;tre seulement &laquo;&nbsp;Vrai&nbsp;&raquo; ou &laquo;&nbsp;Faux&nbsp;&raquo;. On peut faire
afficher une image &agrave; la question.</p>

<p align="right"><a
href="help.php?file=truefalse.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions vrai ou faux</a></p>

<p><b>Questions d'appariement</b></p>

<p>L'&eacute;tudiant doit associer chaque proposition avec une des
r&eacute;ponses fournies. Une r&eacute;ponse correcte correspond &agrave; chaque
proposition. Toutes les propositions ont un m&ecirc;me poids dans le
calcul de la note de la question.</p>

<p align="right"><a
href="help.php?file=match.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions d'appariement</a></p>

<p><b>Questions Cloze &agrave; r&eacute;ponses int&eacute;gr&eacute;es</b></p>

<p>Ce type de question est tr&egrave;s flexible. Les questions se
composent d'un texte (en format Moodle) dans lequel on peut
int&eacute;grer des questions &agrave; choix multiples, &agrave; r&eacute;ponses courtes ou &agrave;
r&eacute;ponses num&eacute;riques. </p>

<p align="right"><a
href="help.php?file=multianswer.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions Cloze &agrave; r&eacute;ponses
int&eacute;gr&eacute;es</a></p>

<p><b>Questions d'appariement al&eacute;atoires</b></p>

<p>Pour l'&eacute;tudiant, cette question appara&icirc;t comme une question
d'appariement normale. En r&eacute;alit&eacute;, la question est construite au
hasard &agrave; partir des questions &agrave; r&eacute;ponses courtes.</p>

<p align="right"><a
href="help.php?file=randomsamatch.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions d'appariement
al&eacute;atoires</a></p>

<p><b>Questions al&eacute;atoires</b></p>

<p>Une question al&eacute;atoire est une question choisie au hasard
parmi toutes les questions de la cat&eacute;gorie de laquelle elle
provient. Les &eacute;tudiants n'auront pas tous la m&ecirc;me question.</p>

<p align="right"><a
href="help.php?file=random.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions al&eacute;atoires</a></p>

<p><b>Descriptions</b></p>

<p>Ce type de question n'en est pas vraiment un. Il sert &agrave;
afficher un bloc de texte &agrave; l'int&eacute;rieur d'un test sans
que l'&eacute;tudiant ait &agrave; r&eacute;pondre quoi que ce soit. On peut
l'utiliser pour donner des directives pour les questions qui
suivent.</p>

<p align="right"><a
href="help.php?file=description.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les descriptions</a></p>