<P ALIGN=CENTER><B>Criar uma Nova Quest&atilde;o</B></P>

<P>Voc&ecirc; pode adicionar diversos tipos de quest&atilde;o &agrave; categoria selecionada:</P>

<P><B>M&uacute;ltipla Escolha</B></P>
<UL>
<P>Em resposta a uma quest&atilde;o, deve ser feita uma escolha entre as repostas apresentadas. Existem dois tipos de configura&ccedil;&atilde;o para as respostas: reposta &uacute;nica ou resposta m&uacute;ltipla.
<p align=right><a href="help.php?file=multichoice.html&module=quiz">Mais detalhes sobre Quest&otilde;es com M&uacute;ltipla Escolha</a></p>
</UL>

<P><B>Resposta Breve</B></P>
<UL>
<P>Em resposta a uma quest&atilde;o, deve ser digitada uma palavra ou frase. Podem existir diversas respostas corretas, com valores de avalia&ccedil;&atilde;o diferentes. Pode ser considerada ou n&atilde;o a caixa (alta,baixa) do texto inserido como resposta.
</P>
<p align=right><a href="help.php?file=shortanswer.html&module=quiz">Mais detalhes sobre Quest&otilde;es com Resposta Breve</a></p>
</UL>

<P><B>Verdadeiro ou Falso</B></P>
<UL>
<P>Em resposta a uma quest&atilde;o, deve ser feita uma escolha entre duas respostas: Verdadeiro ou Falso.
</P>
<p align=right><a href="help.php?file=truefalse.html&module=quiz">Mais detalhes sobre Quest&otilde;es com Respostas Verdadeiro/Falso</a></p>
</UL>

<P><B>Quest&otilde;es de Associa&ccedil;&atilde;o</B></P>
<UL>
<P>Em uma lista de perguntas e respostas, cada resposta certa deve ser associada a uma &uacute;nica quest&atilde;o.
</P>
<p align=right><a href="help.php?file=match.html&module=quiz">Mais detalhes sobre Quest&otilde;es de Associa&ccedil;&atilde;o</a></p>
</UL>

<P><B>Quest&atilde;o Aleat&oacute;ria de Associa&ccedil;&atilde;o com Resposta Breve</B></P>
<UL>
<P>Do ponto de vista do usu&aacute;rio, &eacute; igual &agrave;s Quest&otilde;es de Associa&ccedil;&atilde;o.
A diferen&ccedil;a &eacute; que as quest&otilde;es s&atilde;o escolhidas automaticamente entre as perguntas da categoria indicada.
</P>
<p align=right><a href="help.php?file=randomsamatch.html&module=quiz">Mais detalhes sobre Quest&atilde;o Aleat&oacute;ria de Associa&ccedil;&atilde;o com Resposta Breve</a></p>
</UL>

<P><B>Quest&otilde;es Aleat&oacute;rias</B></P>
<UL>
<P>Uma  Quest&atilde;o Aleat&oacute;ria de um question&aacute;rio &eacute; escolhida automaticamente entre as perguntas da categoria indicada.
</P>
<p align=right><a href="help.php?file=random.html&module=quiz">Mais detalhes sobre Quest&otilde;es Aleat&oacute;rias</a></p>
</UL>

<P><B>Descri&ccedil;&atilde;o</B></P>
<UL>
<P>A descri&ccedil;&atilde;o &eacute; um texto de um question&aacute;rio que n&atilde;o &eacute; uma quest&atilde;o. Pode ser um texto descritivo ou narrativo, por exemplo, que ser&aacute; usado como refer&ecirc;ncia para as respostas de um grupo de quest&otilde;es.
</P>
<p align=right><a href="help.php?file=description.html&module=quiz">Mais detalhes sobre a Descri&ccedil;&atilde;o</a></p>
</UL>

