<p align="center"><strong>Adminisztr&aacute;ci&oacute;</strong></p>

<p>Ezen a k&eacute;perny&#337;n az els&#337; t&aacute;bl&aacute;zat alapj&aacute;n l&aacute;that&oacute;, hogyan t&ouml;rt&eacute;nik a leadott 
munk&aacute;k &aacute;tlagos pontsz&aacute;m&aacute;nak a kisz&aacute;m&iacute;t&aacute;sa. Az &aacute;tlagos pontsz&aacute;m k&eacute;t komponens 
s&uacute;lyozott &ouml;sszege.</p>
	
<ol><li>A tan&aacute;r pontsz&aacute;ma a tanul&oacute; saj&aacute;t munk&aacute;j&aacute;ra vonatkoz&oacute; (kezdeti) 
&eacute;rt&eacute;kel&eacute;s&eacute;re. Ezt nevezhetj&uuml;k "oszt&aacute;lyoz&oacute; pontsz&aacute;m"-nak. Ha a tanul&oacute; leadta 
munk&aacute;j&aacute;t, az &eacute;rt&eacute;kel&eacute;s fel&uuml;lb&iacute;r&aacute;l&aacute;s&aacute;ra nincs m&oacute;d. A 
tanul&oacute;t&oacute;l NEM k&eacute;rj&uuml;k, hogy munk&aacute;j&aacute;t minden egyes &uacute;jb&oacute;li lead&aacute;s alkalm&aacute;val 
&eacute;rt&eacute;kelje &uacute;jra. A tanul&oacute;i &eacute;rt&eacute;kel&eacute;sre adott pontsz&aacute;m fontos a tanul&oacute; 
teljes&iacute;tm&eacute;nye szempontj&aacute;b&oacute;l, de nincs akkora jelent&#337;s&eacute;ge, mint a munka (tan&aacute;r &aacute;ltali) 
&eacute;rt&eacute;kel&eacute;s&eacute;nek. &Aacute;ltal&aacute;ban v&eacute;ve kisebb s&uacute;lyt kell hozz&aacute;rendelni, mint...</li>
<li>A tan&aacute;r &aacute;ltal a tanul&oacute; munk&aacute;ira adott pontsz&aacute;m. Ezek az &eacute;rt&eacute;kel&eacute;sek 
&aacute;ltal&aacute;ban egy adott gyakorlati feladat f&#337; &eacute;rt&eacute;kel&eacute;si elem&eacute;t jelentik. Amikor a tanul&oacute;k 
egyn&eacute;l t&ouml;bb munk&aacute;t adhatnak le, a tan&aacute;r eld&ouml;ntheti, hogy a gyakorlatra adott v&eacute;gleges pontsz&aacute;mot a 
tanul&oacute; leadott munk&aacute;inak az &aacute;tlagpontsz&aacute;ma, vagy a tanul&oacute; legjobb leadott munk&aacute;j&aacute;nak a 
pontsz&aacute;ma alapj&aacute;n hat&aacute;rozza-e meg. </li></ol>

<p>Ezen k&eacute;t komponens s&uacute;lyoz&aacute;sa az adott feladat tekintet&eacute;ben megfelel&#337;nek v&eacute;lt m&oacute;don 
t&ouml;rt&eacute;nik. P&eacute;ld&aacute;ul a tan&aacute;r igen alacsony s&uacute;lyoz&aacute;ssal veheti figyelembe a (kezdeti) 
&eacute;rt&eacute;kel&eacute;si pontsz&aacute;mot (az oszt&aacute;lyoz&oacute; pontsz&aacute;mot), melyhez ak&aacute;r nulla s&uacute;lyt is 
rendelhet. Ebben az esetben a tanul&oacute;i pontsz&aacute;mot alapvet&#337;en vagy teljes m&eacute;rt&eacute;kben a leadott munk&aacute;ra adott 
pontsz&aacute;m hat&aacute;rozza meg. A k&eacute;t s&uacute;lyoz&aacute;si t&eacute;nyez&#337; a gyakorlat sor&aacute;n b&aacute;rmikor 
m&oacute;dos&iacute;that&oacute;, a Pontsz&aacute;m oldalon &eacute;s a V&eacute;gs&#337; pontsz&aacute;m list&aacute;n azonnal a 
m&oacute;dos&iacute;tott pontsz&aacute;m jelenik meg.</p>

<p>A m&aacute;sodik t&aacute;bl&aacute;zattal a ligat&aacute;bl&aacute;zat k&eacute;t opci&oacute;j&aacute;t lehet be&aacute;ll&iacute;tani. Ezt a 
t&aacute;bl&aacute;zatot a tanul&oacute;k (opcion&aacute;lisan) a feladat v&eacute;g&eacute;n tekinthetik meg. Ha a bejegyz&eacute;sek sz&aacute;ma 
null&aacute;n&aacute;l nagyobbra van be&aacute;ll&iacute;tva, akkor a t&aacute;bl&aacute;zat akkor jelenik meg a tanul&oacute; el&#337;tt, amikor a 
feladat megold&aacute;sa a v&eacute;gs&#337; szakaszba jutott. A m&aacute;sik opci&oacute; azt hat&aacute;rozza meg, hogy a tanul&oacute;k neve 
megjelenjen-e a t&aacute;bl&aacute;zatban. Ne feledje, hogy a tan&aacute;r &aacute;ltal l&aacute;tott ligat&aacute;bl&aacute;zatban ezen 
be&aacute;ll&iacute;t&aacute;st&oacute;l f&uuml;ggetlen&uuml;l a tanul&oacute;k nevei mindig megjelennek.</p>

<p>Az Adminisztr&aacute;ci&oacute; oldal emellett felt&uuml;nteti a tan&aacute;r leadott munk&aacute;it (a gyakorlat le&iacute;r&aacute;s&aacute;t), a
 tanul&oacute; saj&aacute;t munk&aacute;j&aacute;nak (kezdeti) &eacute;rt&eacute;kel&eacute;s&eacute;t &eacute;s a tanul&oacute; &aacute;ltal 
 leadott munk&aacute;kat. Ezek a t&aacute;bl&aacute;zatok adott esetben mindig &aacute;tnevezhet&#337;k, t&ouml;r&ouml;lhet&#337;k, 
 megtekinthet&#337;k vagy &uacute;jra&eacute;rt&eacute;kelhet&#337;k. Az oldalnak ezen a r&eacute;sz&eacute;n nyomon k&ouml;vetheti a 
 tanul&oacute; el&#337;rejut&aacute;s&aacute;t a gyakorlat eg&eacute;sze sor&aacute;n. </p>
