<P ALIGN=CENTER><B>Pontoz&aacute;si strat&eacute;gia</B></P>

<P>A csoportos feladat meglehet&#337;s rugalmass&aacute;got tesz lehet&#337;v&eacute; a haszn&aacute;lt pontoz&aacute;si s&eacute;m&aacute;t illet&#337;en.  Ez lehet:

<OL>
<LI><B>Nincs pontoz&aacute;s:</B>  Ilyen feladatt&iacute;pus eset&eacute;n a tan&aacute;r nem k&iacute;v&aacute;ncsi a tanul&oacute;t&oacute;l sz&aacute;rmaz&oacute; mennyis&eacute;gi &eacute;rt&eacute;kel&eacute;sre.  A tanul&oacute;k megjegyz&eacute;seket f&#369;znek a munk&aacute;khoz, de nem pontozz&aacute;k &#337;ket. Ugyanakkor a tan&aacute;r, ha k&iacute;v&aacute;nja, pontozhatja a tanul&oacute;i megjegyz&eacute;seket.  Ezek az "oszt&aacute;lyoz&oacute; pontsz&aacute;mok" k&eacute;pezik a tanul&oacute;k v&eacute;gs&#337; pontsz&aacute;m&aacute;nak az alapj&aacute;t.  Ha a tan&aacute;r nem pontozza a tanul&oacute;i &eacute;rt&eacute;kel&eacute;seket, akkor a feladat semmilyen v&eacute;gs&#337; pontsz&aacute;mot nem kap.
	
<LI><B>Akkumulat&iacute;v pontoz&aacute;s:</B>   Ez a pontoz&aacute;s alapt&iacute;pusa.  Ilyen feladatt&iacute;pus eset&eacute;n az egyes &eacute;rt&eacute;kel&eacute;sekre adott pontsz&aacute;m egy sor "&eacute;rt&eacute;kel&eacute;si elemb&#337;l" &aacute;ll &ouml;ssze.  Az egyes elemeknek a feladat valamely konkr&eacute;t szempontj&aacute;ra kell vonatkozniuk.  Jellemz&#337; esetben egy-egy feladathoz 5 - 15 megjegyz&eacute;si pontoz&aacute;si elemet kell hozz&aacute;rendelni, a t&eacute;nyleges sz&aacute;m a feladat m&eacute;ret&eacute;t&#337;l &eacute;s bonyolults&aacute;g&aacute;t&oacute;l f&uuml;gg.  Csoportt&aacute;rsi feladat eset&eacute;n megengedett egyetlen elem haszn&aacute;lata, &eacute;s hasonl&oacute; &eacute;rt&eacute;kel&eacute;s strat&eacute;gi&aacute;val ruh&aacute;zhat&oacute; fel, mint egy szok&aacute;sos Moodle-feladat. <P>Az elemek az al&aacute;bbi h&aacute;rom jellemz&#337;vel rendelkeznek:
<OL>
<LI>Az &eacute;rt&eacute;kel&eacute;si elemek LE&Iacute;R&Aacute;SA.  Ennek egy&eacute;rtelm&#369;en r&ouml;gz&iacute;teni kell, hogy a feladatot mely szempont szerint &eacute;rt&eacute;kelj&uuml;k.  Ha az &eacute;rt&eacute;kel&eacute;s min&#337;s&eacute;gi, c&eacute;lszer&#369; r&eacute;szletezni, mit tekint&uuml;nk kiv&aacute;l&oacute;nak, k&ouml;zepesnek, illetve gyeng&eacute;nek. 
	
<LI>Az &eacute;rt&eacute;kel&eacute;si elemek SK&Aacute;L&Aacute;JA.  Egy el&#337;re meghat&aacute;rozott sz&aacute;m&uacute; sk&aacute;la &aacute;ll rendelkez&eacute;sre.  Ezek az egyszer&#369; igen/nem jelleg&#369; sk&aacute;l&aacute;t&oacute;l a t&ouml;bbpontos sk&aacute;l&aacute;n kereszt&uuml;l a teljes sz&aacute;zal&eacute;kos sk&aacute;l&aacute;ig terjednek.  Minden elemnek megvan a maga sk&aacute;l&aacute;ja, amelynek igazodnia kell az adott elemhez kapcsol&oacute;d&oacute; lehets&eacute;ges vari&aacute;ci&oacute;k sz&aacute;m&aacute;hoz.  Ne feledj&uuml;k, hogy a sk&aacute;la NEM hat&aacute;rozza meg az elem fontoss&aacute;g&aacute;t az &aacute;tlagos pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;sa sor&aacute;n, azaz egy k&eacute;tpontos sk&aacute;l&aacute;nak azonos a "hat&aacute;sa", mint a 100 pontosnak, ha a megfelel&#337; elemek azonos s&uacute;llyal szerepelnek...

<LI>Az &eacute;rt&eacute;kel&eacute;si elemek S&Uacute;LYA.  Alaphelyzetben az elemek azonos fontoss&aacute;g&uacute;ak a feladat &aacute;tlagos pontsz&aacute;m&aacute;nak a kisz&aacute;m&iacute;t&aacute;sa sor&aacute;n.  Ez megv&aacute;ltoztathat&oacute;, ha a fontosabb elemekhez 1-n&eacute;l nagyobb, a kev&eacute;sb&eacute; fontosakhoz 1-n&eacute;l kisebb s&uacute;lyt rendel&uuml;nk.  A s&uacute;lyok m&oacute;dos&iacute;t&aacute;sa NEM befoly&aacute;solja a maxim&aacute;lis pontsz&aacute;mot, azt az &eacute;rt&eacute;ket ugyanis a csoportt&aacute;rsi feladathoz tartoz&oacute; 'maxim&aacute;lis pontsz&aacute;m' param&eacute;ter hat&aacute;rozza meg.  A s&uacute;lyok kaphatnak negat&iacute;v &eacute;rt&eacute;keket, ez k&iacute;s&eacute;rleti jelleggel alkalmazhat&oacute;.  </OL>

<LI><B>Hib&aacute;n alapul&oacute; pontoz&aacute;s:</B>  Ilyen feladatt&iacute;pus eset&eacute;n a leadott munka pontoz&aacute;sa igen/nem sk&aacute;la alapj&aacute;n t&ouml;rt&eacute;nik.  A pontsz&aacute;mot a "pontsz&aacute;mt&aacute;bl&aacute;zat " hat&aacute;rozza meg, amely megadja a "hib&aacute;k" sz&aacute;ma &eacute;s a javasolt pontsz&aacute;m k&ouml;z&ouml;tti &ouml;sszef&uuml;gg&eacute;st.  Egy feladatnak lehet p&eacute;ld&aacute;ul hat olyan l&eacute;nyeges eleme, amelynek jelen kell lennie. A pontsz&aacute;mt&aacute;bl&aacute;zat megadja a javasolt pontokat, ha mind jelen van, ha egy hi&aacute;nyzik k&ouml;z&uuml;l&uuml;k, ha kett&#337; stb.  Az egyes elemekhez sz&uuml;ks&eacute;g eset&eacute;n s&uacute;lyozott t&eacute;nyez&#337;k rendelhet&#337;k, amennyiben egyes elemek fontosabbak, mint a t&ouml;bbi.  A "hib&aacute;k" sz&aacute;ma a megl&eacute;v&#337; elemek s&uacute;lyozott &ouml;sszege.  Alaphelyzetben minden elem s&uacute;lya egy.  A pontoz&aacute;si t&aacute;bl&aacute;zat feltehet&#337;leg nem line&aacute;ris, a javasolt pontok egy t&iacute;z elemesb&#337;l &aacute;ll&oacute; feladat eset&eacute;n p&eacute;ld&aacute;ul alakulhatnak ekk&eacute;nt: 90%, 70%, 50%, 40%, 30%, 20%, 10%, 0%. Az &eacute;rt&eacute;kel&eacute;st v&eacute;gz&#337; az aj&aacute;nlott pontsz&aacute;mokat felfel&eacute; vagy lefel&eacute; viheti ak&aacute;r 20%-kal ahhoz, hogy kialak&iacute;tsa a leadott munka v&eacute;gs&#337; pontsz&aacute;m&aacute;t.
	
<LI><B>Krit&eacute;riumon alapul&oacute; pontoz&aacute;s:</B>  Ez a legegyszer&#369;bben pontozhat&oacute; &eacute;rt&eacute;kel&eacute;sfajta (j&oacute;llehet, nem sz&uuml;ks&eacute;gszer&#369;en a legegyszer&#369;bb a kialak&iacute;t&aacute;sa).  A leadott munk&aacute;k pontoz&aacute;sa egy sor krit&eacute;rium alapj&aacute;n t&ouml;rt&eacute;nik. Az &eacute;rt&eacute;kel&eacute;st v&eacute;gz&#337; kiv&aacute;lasztja, melyik meg&aacute;llap&iacute;t&aacute;s illik legjobban az adott munk&aacute;ra.  A pontsz&aacute;m meg&aacute;llap&iacute;t&aacute;sa a "krit&eacute;riumt&aacute;bl&aacute;zat" alapj&aacute;n t&ouml;rt&eacute;nik, amely minden egyes krit&eacute;riumhoz megadja a javasolt pontsz&aacute;mot. P&eacute;ld&aacute;ul kialak&iacute;that&oacute; egy olyan feladat, amely, mondjuk, &ouml;t krit&eacute;riumot mag&aacute;ban foglal&oacute; meg&aacute;llap&iacute;t&aacute;sra &eacute;p&uuml;l. Ez esetben az &eacute;rt&eacute;kel&eacute;st v&eacute;gz&#337;knek egyes &eacute;rt&eacute;kel&eacute;seikhez az &ouml;t meg&aacute;llap&iacute;t&aacute;s k&ouml;z&uuml;l ki kell v&aacute;lasztaniuk egyet.  A hib&aacute;n alapul&oacute; pontoz&aacute;shoz hasonl&oacute;an az &eacute;rt&eacute;kel&eacute;st v&eacute;gz&#337; az aj&aacute;nlott pontsz&aacute;mot a v&eacute;gs&#337; pontsz&aacute;mhoz viszony&iacute;tva legfeljebb  20%-kal m&oacute;dos&iacute;thatja.  <li><b>Rubrika</b> Hasonl&oacute; a krit&eacute;riumon alapul&oacute; pontoz&aacute;shoz, azzal a k&uuml;l&ouml;nbs&eacute;ggel, hogy t&ouml;bbsz&ouml;r&ouml;s krit&eacute;riumk&eacute;szletek haszn&aacute;lat&aacute;ra &eacute;p&uuml;l. Minden k&eacute;szlet egy meghat&aacute;rozott "kateg&oacute;ri&aacute;t" takar, melyhez legfeljebb &ouml;t meg&aacute;llap&iacute;t&aacute;s tartozhat. Az egyes k&eacute;szletekhez egyedi s&uacute;lyok rendelhet&#337;k, a pontsz&aacute;m pedig az egyes k&eacute;szletek pontjainak s&uacute;lyozott kombin&aacute;ci&oacute;ja. Ezen &eacute;rt&eacute;kel&eacute;st&iacute;pusn&aacute;l <b>nincs</b> be&aacute;ll&iacute;t&aacute;si (m&oacute;dos&iacute;t&aacute;si) lehet&#337;s&eacute;g. 
</OL>
</P>
