<p align="center"><strong>Gyakorlati feladat kezel&eacute;se</strong></p>

<p>A gyakorlati feladat valamivel bonyolultabb, mint a szok&aacute;sos feladat. H&aacute;rom l&eacute;p&eacute;sb&#337;l vagy 
szakaszb&oacute;l &aacute;ll. Ezek a k&ouml;vetkez&#337;k:
<ol>
<li><p><strong>Gyakorlat be&aacute;ll&iacute;t&aacute;sa</strong> A gyakorlat sor&aacute;n elv&eacute;gzett munka &eacute;rt&eacute;kel&eacute;se 
k&ouml;nnyebb, ha egy sor &eacute;rt&eacute;kel&eacute;si ELEM-re van lebontva. Ennek eredm&eacute;nyek&eacute;nt a feladat pontoz&aacute;sa 
kev&eacute;sb&eacute; lesz &ouml;nk&eacute;nyes &eacute;s a tanul&oacute;kat egyfajta kerettel l&aacute;tja el az &eacute;rt&eacute;kel&eacute;s 
elv&eacute;gz&eacute;s&eacute;hez.  Az &eacute;rt&eacute;kel&eacute;si elemek &ouml;ssze&aacute;ll&iacute;t&aacute;sa &eacute;s ennek 
megfelel&#337;en a pontoz&aacute;si &#369;rlap elk&eacute;sz&iacute;t&eacute;se a tan&aacute;r feladata.  (A r&eacute;szleteket l&aacute;sd az 
adott oldalon.)</p></li>
	
	<p>Ha az &eacute;rt&eacute;kel&eacute;si elemek be vannak &aacute;ll&iacute;tva, a tan&aacute;rnak egy Word-dokumentumot vagy egy 
	HTML-form&aacute;tum&uacute; &aacute;llom&aacute;nyt kell leadnia, amely le&iacute;rja a tanul&oacute;k &aacute;ltal elv&eacute;gzend&#337; 
	gyakorlatot vagy feladatot. Ezt az &aacute;llom&aacute;nyt l&aacute;tj&aacute;k a tanul&oacute;k a gyakorlat m&aacute;sodik szakasz&aacute;ban. </p>
	
	<p>Ha &uacute;gy akarj&aacute;k, a tan&aacute;rok elk&eacute;sz&iacute;thetnek egy sor hasonl&oacute; gyakorlatot - ism&eacute;t csak 
	Word-dokumentum vagy HTML-&aacute;llom&aacute;ny form&aacute;j&aacute;ban, majd felt&ouml;lthetik a gyakorlatok k&ouml;z&eacute;. Ne 
	feledje, hogy ezeknek a gyakorlatoknak eg&eacute;szen hasonl&oacute;nak kell lenni azon &eacute;rt&eacute;kel&#337; &#369;rlaphoz, amelyet 
	az &ouml;sszes ezen v&aacute;ltozathoz haszn&aacute;lnak. A tan&aacute;r a mintamunk&aacute;kat v&aacute;laszthat&oacute;an adja k&ouml;zre. 
	El&#337;fordulhat, hogy bizonyos feladatok eset&eacute;n ez nem is alkalmazhat&oacute;.</p>
	
<li><p><strong>Tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek &eacute;s munkalead&aacute;s enged&eacute;lyez&eacute;se</strong> A feladat ekkor 
nyitva &aacute;ll a tanul&oacute;k sz&aacute;m&aacute;ra. Ha a tan&aacute;r t&ouml;bb gyakorlatot &aacute;ll&iacute;t be, akkor a 
tanul&oacute;k k&uuml;l&ouml;nf&eacute;le gyakorlatokat l&aacute;tnak, ellenkez&#337; esetben az &ouml;sszes tanul&oacute; ugyanazt a gyakorlatot 
l&aacute;tja.</p>

<p>Miel&#337;tt a tanul&oacute;k leadhatn&aacute;k munk&aacute;ikat, ki kell t&ouml;lteni&uuml;k egy &eacute;rt&eacute;kel&#337; &#369;rlapot. 
Ha v&eacute;geztek az &eacute;rt&eacute;kel&eacute;s kit&ouml;lt&eacute;s&eacute;vel, megjelenik el&#337;tt&uuml;k a felt&ouml;lt&eacute;si 
&#369;rlap. A tanul&oacute;k &ouml;n&eacute;rt&eacute;kel&eacute;s&uuml;k alapj&aacute;n fel&uuml;lvizsg&aacute;lhatj&aacute;k munk&aacute;jukat. 
A tan&aacute;r l&aacute;tja a tanul&oacute;k (&ouml;n)&eacute;rt&eacute;kel&eacute;s&eacute;t &eacute;s egy &eacute;rt&eacute;kel&#337; &#369;rlapot, 
amelyen pontozhatja a tanul&oacute;k leadott munk&aacute;j&aacute;t. Ez egy  "dupla &eacute;rt&eacute;kel&#337; &#369;rlap". Ennek az &#369;rlapnak 
a v&eacute;g&eacute;n a tan&aacute;r megk&eacute;rheti a tanul&oacute;t, hogy ha akarja, ism&eacute;telten adja le a munk&aacute;j&aacute;t.</p>

<p>Ha a tanul&oacute; &uacute;gy d&ouml;nt, hogy &uacute;jb&oacute;l leadja a munk&aacute;j&aacute;t, akkor a tan&aacute;r &uacute;jb&oacute;l 
&eacute;rt&eacute;kelheti a munk&aacute;t. Ugyanez a v&aacute;laszthat&oacute;s&aacute;g teszi lehet&#337;v&eacute; a tan&aacute;r 
sz&aacute;m&aacute;ra, hogy nyomon k&ouml;vesse ennek az &uacute;jra leadott munka- &eacute;s &eacute;rt&eacute;kel&eacute;si ciklusnak a 
menet&eacute;t. Ha a tanul&oacute;k t&ouml;bb munk&aacute;t adhatnak le a gyakorlathoz, akkor a tan&aacute;rnak kell eld&ouml;ntenie, hogy a 
v&eacute;gs&#337; pontsz&aacute;m a tanul&oacute;k leadott munk&aacute;ira kapott maxim&aacute;lis pontsz&aacute;m&aacute;n, avagy az 
&aacute;tlagpontsz&aacute;m&aacute;n alapuljon-e. Ez az opci&oacute; b&aacute;rmikor m&oacute;dos&iacute;that&oacute; a gyakorlat folyam&aacute;n 
a gyakorlat friss&iacute;t&eacute;s&eacute;vel, melyet k&ouml;vet&#337;en annak hat&aacute;sa azonnal l&aacute;that&oacute;v&aacute; v&aacute;lik a 
Pontsz&aacute;m oldalon. </p>

<p>Amikor letelik a feladathoz tartoz&oacute; hat&aacute;rid&#337;, a tanul&oacute; leadhatja vagy &uacute;jb&oacute;l leadhatja a 
munk&aacute;j&aacute;t. A munka ilyenkor "k&eacute;sei" megjel&ouml;l&eacute;st kap. A munka megjelenik az &eacute;rt&eacute;kelend&#337; 
munk&aacute;k k&ouml;z&ouml;tt, &eacute;s a tan&aacute;r, ha &uacute;gy akarja, a szok&aacute;sos m&oacute;don &eacute;rt&eacute;kelheti a 
munk&aacute;t. A munk&aacute;k k&uuml;l&ouml;nf&eacute;le jegyz&eacute;keiben a lead&aacute;s d&aacute;tuma piros sz&iacute;nben l&aacute;tszik 
(mint ahogyan piros a leadott munka &oacute;ta eltelt id&#337;ben megjel&ouml;lt munk&aacute;k sor&aacute;ban is). Ha van pontoz&aacute;s, a 
k&eacute;s&#337;n leadott munka pontsz&aacute;ma piros sz&iacute;nben &eacute;s z&aacute;r&oacute;jelek k&ouml;z&ouml;tt l&aacute;tszik. Ezek a 
pontok <strong>nem</strong> haszn&aacute;latosak a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;n&aacute;l &eacute;s nem 
ker&uuml;lnek bele a Pontok oldalon l&eacute;v&#337; sz&aacute;m&iacute;t&aacute;sokba. A tan&aacute;r a 'k&eacute;sei' megjel&ouml;l&eacute;st 
&uacute;gy t&ouml;r&ouml;lheti, hogy &aacute;tmegy az Adminisztr&aacute;ci&oacute; oldalra &eacute;s r&aacute;kattint a megfelel&#337; ugr&oacute;pontra. 
Ekkor a munka beleker&uuml;l a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;ba. </p></li>
	
<li><p><strong>&Aacute;tlagos pontsz&aacute;m &eacute;s ligat&aacute;bl&aacute;zat megjelen&iacute;t&eacute;se</strong> A gyakorlat ezen 
utols&oacute; szakasz&aacute;ban a tanul&oacute;k l&aacute;thatj&aacute;k saj&aacute;t "v&eacute;gs&#337;" pontsz&aacute;mukat. A gyakorlat 
minden szakasz&aacute;ban (kiv&eacute;ve az els&#337; szakaszt) a pontok el&eacute;rhet&#337;ek a tanul&oacute;k sz&aacute;m&aacute;ra, ugyanakkor 
ezek csak "r&eacute;szleges" pontsz&aacute;mok, mivel kisz&aacute;m&iacute;t&aacute;suk az &eacute;ppen el&eacute;rhet&#337; 
&eacute;rt&eacute;kel&eacute;sen alapul.</p>
	
<p>Ebben az utols&oacute; szakaszban a tanul&oacute;k <strong>semmilyen</strong> tov&aacute;bbi munk&aacute;t nem adhatnak le. Gyakorlatilag a 
feladat lez&aacute;rul &eacute;s a tan&aacute;rnak lehet&#337;s&eacute;ge van arra, hogy a tanul&oacute;knak a legjobb leadott munk&aacute;k 
k&ouml;z&uuml;l p&eacute;ld&aacute;kat mutasson be...</p>
    
<p>A tanul&oacute; (&eacute;s a tan&aacute;r) ugyancsak megtekintheti a tanul&oacute;k leadott munk&aacute;j&aacute;nak a 
"ligat&aacute;bl&aacute;zat&aacute;t".  Itt a megjelen&iacute;t&eacute;s a pontsz&aacute;mok sorrendj&eacute;ben t&ouml;rt&eacute;nik, a legjobb 
leadott munka &aacute;ll az els&#337; helyen. A leadott munk&aacute;ra adott pontsz&aacute;m a tan&aacute;ri pontsz&aacute;m. Ha egy tanul&oacute; 
egyn&eacute;l t&ouml;bb munk&aacute;t adott le, csakis a legjobb munk&aacute;ja jelenik meg ebben a t&aacute;bl&aacute;zatban. Ha a 
t&aacute;bl&aacute;zatban szerepl&#337; t&eacute;telek sz&aacute;ma null&aacute;ra van &aacute;ll&iacute;tva, akkor ez a t&aacute;bl&aacute;zat nem 
jelenik meg.</p></li>
</ol>

<p>A tanul&oacute;i pontsz&aacute;m a tan&aacute;r &aacute;ltal a (kezdeti) &eacute;rt&eacute;kel&eacute;s&uuml;kre adott pontoz&aacute;s &eacute;s 
a munk&aacute;jukra adott tan&aacute;ri pontoz&aacute;s s&uacute;lyozott &aacute;tlaga. A k&eacute;t s&uacute;lyoz&aacute;si t&eacute;nyez&#337; 
kezdetben egyk&eacute;nt szerepel. Ezek a gyakorlat sor&aacute;n b&aacute;rmikor m&oacute;dos&iacute;that&oacute;k (az Adminisztr&aacute;ci&oacute; oldalon), 
mik&ouml;zben a tanul&oacute;k &eacute;s a tan&aacute;r &aacute;ltal l&aacute;tott pontok mindig az &eacute;ppen aktu&aacute;lis 
s&uacute;lyoz&aacute;si t&eacute;nyez&#337;ket mutatj&aacute;k.</p>
	
<p>A feladat b&aacute;rmely szakasz&aacute;ban a tan&aacute;r megnyithatja az "Adminisztr&aacute;ci&oacute;" oldalt. Ez jelzi a k&eacute;t s&uacute;lyoz&aacute;si 
t&eacute;nyez&#337; &eacute;ppen &eacute;rv&eacute;nyes &eacute;rt&eacute;keit &eacute;s m&oacute;dot ad a tan&aacute;rnak a 
m&oacute;dos&iacute;t&aacute;sukra. Felsorolja a tanul&oacute;i (saj&aacute;t munk&aacute;ra adott) &eacute;rt&eacute;kel&eacute;seket &eacute;s a 
tanul&oacute;k leadott munk&aacute;it. A tan&aacute;r ezt az oldalt haszn&aacute;lhatja a leadott 
munk&aacute;k &eacute;rt&eacute;kel&eacute;s&eacute;re &eacute;s &uacute;jb&oacute;li &eacute;rt&eacute;kel&eacute;s&eacute;re, az 
&eacute;rt&eacute;kel&eacute;sek pontoz&aacute;s&aacute;ra &eacute;s &uacute;jb&oacute;li pontoz&aacute;s&aacute;ra, itt t&ouml;r&ouml;lhet leadott 
munk&aacute;kat &eacute;s &eacute;rt&eacute;kel&eacute;seket, &eacute;s &aacute;ltal&aacute;ban v&eacute;ve ezen az oldalon k&ouml;vetheti nyomon a 
feladat menet&eacute;t.</p>

