<IMG VALIGN=absmiddle SRC="<?php echo $CFG->wwwroot?>/mod/exercise/icon.gif">&nbsp;<B>Gyakorlat</B>

<P>A gyakorlat egy egyszer&#369;, de hasznosan alkalmazhat&oacute; feladatfajta. A gyakorlatot a tan&aacute;r arra haszn&aacute;lja, hogy valamilyen konkr&eacute;t munka elv&eacute;gz&eacute;s&eacute;t k&eacute;rje a tanul&oacute;kt&oacute;l. Ez lehet egy essz&eacute; vagy jelent&eacute;s meg&iacute;r&aacute;sa, egy bemutat&oacute; elk&eacute;sz&iacute;t&eacute;se, vagy egy sz&aacute;ml&aacute;l&oacute;t&aacute;bl&aacute;zat kidolgoz&aacute;sa stb. Amikor egy tanul&oacute; befejezte a munk&aacute;t, lead&aacute;s el&#337;tt &ouml;nmag&aacute;nak &eacute;rt&eacute;kelnie kell a feladatot. Ha leadja, a tan&aacute;r mind a tanul&oacute;i &eacute;rt&eacute;kel&eacute;st, mind mag&aacute;t a munk&aacute;t &eacute;rt&eacute;kelheti. A tan&aacute;r visszajelz&eacute;st k&uuml;ldhet a tanul&oacute;nak &eacute;s megk&eacute;rheti, hogy jav&iacute;tson rajta, illetve - az adott esett&#337;l f&uuml;gg&#337;en - &uacute;jb&oacute;l leadhatja azt.</p>

<p>A gyakorlat elkezd&eacute;se el&#337;tt a tan&aacute;r be&aacute;ll&iacute;tja a gyakorlatot egy
<ol> <li> Word- vagy HTML-&aacute;llom&aacute;ny seg&iacute;ts&eacute;g&eacute;vel, amelyben bevezeti a gyakorlatot &eacute;s elmondja a tanul&oacute;knak, hogy mit kell elv&eacute;gezni&uuml;k. Ezt az &aacute;llom&aacute;nyt a tan&aacute;r felt&ouml;lti a gyakorlatba.
	
<li>Sz&ouml;vegelemek hozz&aacute;ad&aacute;sa &eacute;s opci&oacute;k kiv&aacute;laszt&aacute;sa az &eacute;rt&eacute;kel&#337; &#369;rlapon. Ezt az &#369;rlapot a tanul&oacute; &eacute;s a tan&aacute;r egyar&aacute;nt a gyakorlat sor&aacute;n elk&eacute;sz&uuml;lt munka &eacute;rt&eacute;kel&eacute;s&eacute;re haszn&aacute;lja. K&uuml;l&ouml;nf&eacute;le &eacute;rt&eacute;kel&eacute;st&iacute;pusok haszn&aacute;lat&aacute;ra van lehet&#337;s&eacute;g (l&aacute;sd a "pontoz&aacute;si strat&eacute;gi&aacute;ra" vonatkoz&oacute; s&uacute;g&oacute;t). </ol></p>
	
<p>Nagy oszt&aacute;lyokn&aacute;l el&#337;fordulhat, hogy a tan&aacute;r hasznosnak &iacute;t&eacute;li meg, ha a gyakorlat egyn&eacute;l t&ouml;bb v&aacute;ltozatban k&eacute;sz&uuml;l el. Ezek a v&aacute;ltozatok soksz&iacute;n&#369;bb&eacute; teszik a gyakorlatot &eacute;s biztos&iacute;tj&aacute;k, hogy a tanul&oacute;k egy-egy gyakorlatban k&uuml;l&ouml;nf&eacute;le feladatokat oldjanak meg. Ezeket a tanul&oacute;k v&eacute;letlenszer&#369;en, de bizonyos egyens&uacute;ly megtart&aacute;sa mellett kapj&aacute;k meg. Minden tanul&oacute; csak egy gyakorlatot kap, de adott oszt&aacute;lyon bel&uuml;l a v&aacute;ltozatok kioszt&aacute;sa k&ouml;r&uuml;lbel&uuml;l azonos m&oacute;don t&ouml;rt&eacute;nik. &Uuml;gyelj&uuml;nk arra, hogy a v&aacute;ltozatok lehet&#337;leg ne t&eacute;rjenek el egym&aacute;st&oacute;l t&uacute;lzott m&eacute;rt&eacute;kben, mivel minden v&aacute;ltozathoz ugyanaz az &eacute;rt&eacute;kel&#337; &#369;rlap haszn&aacute;latos.</p>

<p>Ha elk&eacute;sz&uuml;lt a gyakorlat le&iacute;r&aacute;sa &eacute;s megvan az &eacute;rt&eacute;kel&#337; &#369;rlap, a feladat megny&iacute;lik a tanul&oacute; el&#337;tt. A tanul&oacute;k megkapj&aacute;k a gyakorlat vagy a feladat le&iacute;r&aacute;s&aacute;t. Amikor v&eacute;geztek a gyakorlattal, &eacute;rt&eacute;kelni&uuml;k kell saj&aacute;t munk&aacute;jukat (az el&#337;re elk&eacute;sz&iacute;tett &eacute;rt&eacute;kel&#337; &#369;rlap seg&iacute;ts&eacute;g&eacute;vel), miel&#337;tt leadj&aacute;k munk&aacute;jukat a tan&aacute;rnak. Az &eacute;rt&eacute;kel&#337; &#369;rlapot a tanul&oacute;k ellen&#337;rz&#337; jegyz&eacute;kk&eacute;nt haszn&aacute;lhatj&aacute;k. Ha k&iacute;v&aacute;nj&aacute;k, a munka t&eacute;nyleges lead&aacute;sa el&#337;tt mind munk&aacute;jukat, mind az &eacute;rt&eacute;kel&eacute;st &aacute;tn&eacute;zhetik, amit feltehet&#337;leg aj&aacute;nlatos is megtenni&uuml;k!</p>
	
<p>Ha egy tanul&oacute; leadta a munk&aacute;j&aacute;t, akkor mind annak &eacute;rt&eacute;kel&eacute;se, mind maga a munka el&eacute;rhet&#337;v&eacute; v&aacute;lik a tan&aacute;r sz&aacute;m&aacute;ra. Az &eacute;rt&eacute;kel&eacute;sek pontozhat&oacute;k, &eacute;s haszn&aacute;lhat&oacute; egy sz&ouml;vegn&eacute;gyzet is a megjegyz&eacute;sek meg&iacute;r&aacute;s&aacute;ra. A tan&aacute;r az adott munk&aacute;hoz &uacute;gyszint&eacute;n hozz&aacute;f&eacute;rhet (kiindul&aacute;si pontk&eacute;nt a tanul&oacute;i &eacute;rt&eacute;kel&eacute;st haszn&aacute;lva fel) &eacute;s eld&ouml;ntheti, hogy megk&eacute;ri-e a tanul&oacute;t a munka jav&iacute;tott v&aacute;ltozat&aacute;nak a bek&uuml;ld&eacute;s&eacute;re, avagy sem.</p>
	
<p>Ha a tan&aacute;r &uacute;gy v&eacute;li, hogy a tanul&oacute; munk&aacute;ja jav&iacute;that&oacute;, akkor lehet&#337;s&eacute;get adhat neki arra, hogy &uacute;jb&oacute;l leadhassa a munk&aacute;t. Ebben az esetben a tan&aacute;r &uacute;jra&eacute;rt&eacute;keli a munk&aacute;t azon az &eacute;rt&eacute;kel&#337; &#369;rlapon, amely azokat a pontokat &eacute;s megjegyz&eacute;seket tartalmazza, amelyeket a tanul&oacute; kor&aacute;bbi leadott munk&aacute;j&aacute;hoz f&#369;ztek. Ennek megfelel&#337;en az &uacute;jra&eacute;rt&eacute;kel&eacute;s az &#369;rlap friss&iacute;t&eacute;s&eacute;t jelenti a tanul&oacute; &aacute;ltal fel&uuml;lvizsg&aacute;lt munka alapj&aacute;n, szemben a null&aacute;r&oacute;l val&oacute; &eacute;rt&eacute;kel&eacute;ssel.</p>
	
<p>Amikor letelik a gyakorlathoz rendelkez&eacute;sre &aacute;ll&oacute; hat&aacute;rid&#337;, a tanul&oacute;k folytathatj&aacute;k a munk&aacute;k lead&aacute;s&aacute;t. A munka viszont ilyenkor "k&eacute;sei" megjel&ouml;l&eacute;st kap. A tan&aacute;r sz&uuml;ks&eacute;g eset&eacute;n pontozhatja a munk&aacute;t &eacute;s visszajelz&eacute;st k&uuml;ldhet a tanul&oacute;nak. A k&eacute;s&#337;n leadott munk&aacute;ra kapott pontokat a rendszer visszatartja &eacute;s  <b>nem</b> haszn&aacute;lja fel a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;ra. Ha viszont b&aacute;rmilyen okb&oacute;l a tan&aacute;r egy k&eacute;sei munk&aacute;t norm&aacute;l munkak&eacute;nt k&iacute;v&aacute;n elfogadni, elt&ouml;r&ouml;lheti mell&#337;le a "k&eacute;sei" megjel&ouml;l&eacute;st, ha &aacute;tt&eacute;r az Adminisztr&aacute;tor oldalra, kikeresi a leadott munk&aacute;t &eacute;s r&aacute;kattint a megfelel&#337; ugr&oacute;pontra. Ekkor a munk&aacute;ra adott pont beleker&uuml;l a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;ba.</p> 
	
<p>Amikor megt&ouml;rt&eacute;nt az &ouml;sszes leadott munka pontoz&aacute;sa, a gyakorlat &aacute;tker&uuml;l a v&eacute;gs&#337; szakaszba. A tanul&oacute;k ezt k&ouml;vet&#337;en m&aacute;r nem adhatnak le munk&aacute;t. A tanul&oacute;k megtekinthetik v&eacute;gs&#337; pontsz&aacute;maikat a leadott munk&aacute;ikra kapott pontokkal egy&uuml;tt. A tanul&oacute; gyakorlatra kapott pontsz&aacute;ma a tan&aacute;rnak az &ouml;n&eacute;rt&eacute;kel&eacute;sre adott &eacute;s a tan&aacute;rnak a munk&aacute;ra adott pontsz&aacute;ma s&uacute;lyozott kombin&aacute;ci&oacute;j&aacute;b&oacute;l &aacute;ll el&#337;. (A tanul&oacute; &aacute;ltal adott pontsz&aacute;mot a rendszer <b>nem</b> haszn&aacute;lja fel.) Magukra a leadott munk&aacute;kra a pontsz&aacute;m a tan&aacute;ri &eacute;rt&eacute;kel&eacute;sb&#337;l alakul ki. A k&eacute;t ponthoz (az oszt&aacute;lyoz&oacute; pontsz&aacute;mhoz &eacute;s az adott munk&aacute;ra vonatkoz&oacute; t&eacute;nyleges pontsz&aacute;mhoz) tartoz&oacute; s&uacute;lyokat a feladat sor&aacute;n b&aacute;rmikor lehet m&oacute;dos&iacute;tani (a s&uacute;lyok be&aacute;ll&iacute;t&aacute;sa az Adminisztr&aacute;tor oldalon t&ouml;rt&eacute;nik).</p>
	
<p>Amikor a tan&aacute;r enged&eacute;lyezi a tanul&oacute;knak a munka &uacute;jb&oacute;li lead&aacute;s&aacute;t, a tan&aacute;rnak fontol&oacute;ra kell vennie, hogy mik&eacute;nt &aacute;ll&iacute;tja be azt az opci&oacute;t, amellyel szab&aacute;lyozza, mik&eacute;nt t&ouml;rt&eacute;nj&eacute;k a tanul&oacute; v&eacute;gs&#337; pontsz&aacute;m&aacute;nak a kisz&aacute;m&iacute;t&aacute;sa a t&ouml;bbsz&ouml;r&ouml;sen leadott munka alapj&aacute;n. Ez az opci&oacute; lehet&#337;v&eacute; teszi a tan&aacute;r sz&aacute;m&aacute;ra, hogy &aacute;tlagpontsz&aacute;mot vegyen figyelembe a tanul&oacute; leadott munk&aacute;j&aacute;val kapcsolatban, illetve a legjobb leadott munk&aacute;t. Ez az opci&oacute; b&aacute;rmikor megv&aacute;ltoztathat&oacute;, eredm&eacute;nye pedig azonnal megjelenik a pontokat tartalmaz&oacute; k&eacute;perny&#337;n.</p>

<p>A gyakorlat utols&oacute; szakasz&aacute;ban a tanul&oacute;k megtekinthetik a leadott munka "ligat&aacute;bl&aacute;zat&aacute;t" is. Ez a t&aacute;bl&aacute;zat azon leadott munk&aacute;k rendezett jegyz&eacute;k&eacute;t tartalmazza, melyeket tekintve a legmagasabb pontsz&aacute;mot el&eacute;rt munka van legf&ouml;l&uuml;l. Ha t&ouml;bb leadott munka van, a jegyz&eacute;ken egy adott tanul&oacute;nak csak a legjobb leadott munk&aacute;ja jelenik meg.</p>
	
