<p align=center><b>Tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek &uacute;jrapontoz&aacute;sa</b></p>

<p>Ez az ugr&oacute;pont minden tanul&oacute;i &eacute;rt&eacute;kel&eacute;s &quot;oszt&aacute;lyoz&oacute; pontsz&aacute;m&aacute;t&quot; pontozza &uacute;jra. 
&Aacute;ltal&aacute;ban ezt <b>nem</b> sz&uuml;ks&eacute;ges &uacute;jrafuttatni. 
Az &uacute;j tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek pontoz&aacute;sa automatikusan megt&ouml;rt&eacute;nik, miut&aacute;n a tan&aacute;r a tanul&oacute; adott munk&aacute;j&aacute;t &eacute;rt&eacute;kelte.</p>

<p>Ha viszont az oszt&aacute;lyoz&oacute; pontok t&uacute;ls&aacute;gosan magasnak vagy alacsonynak mutatkoznak,
 a tan&aacute;r sz&uuml;ks&eacute;gesnek l&aacute;thatja az &quot;&Eacute;rt&eacute;kel&eacute;sek &ouml;sszehasonl&iacute;t&aacute;sa&quot; 
 opci&oacute; m&oacute;dos&iacute;t&aacute;s&aacute;t (a feladat friss&iacute;t&eacute;s&eacute;vel).
  Ennek az opci&oacute;nak az alap&eacute;rt&eacute;ke a
    &quot;k&ouml;zepes&quot;. Ha az oszt&aacute;lyoz&oacute; pontok t&uacute;l magasak, akkor 
    a be&aacute;ll&iacute;t&aacute;s &quot;szigor&uacute;&quot; vagy  &quot;nagyon szigor&uacute;&quot; &eacute;rt&eacute;k&eacute;vel cs&ouml;kkenthet&#337;k a 
    pontsz&aacute;mok. Ha viszont a pontok t&uacute;l alacsonyak, az opci&oacute;  &quot; laza&quot; vagy &quot;nagyon laza&quot; &eacute;rt&eacute;kre &aacute;ll&iacute;t&aacute;s&aacute;val
    n&#337;ni fognak a pontsz&aacute;mok.</p>

<p>Ha az oszt&aacute;lyoz&oacute; pontok m&oacute;dos&iacute;t&aacute;s&aacute;ra van sz&uuml;ks&eacute;g, ehhez a l&eacute;p&eacute;sek a k&ouml;vetkez&#337;k:
    <ol>
    <li>A gyakorlathoz tartoz&oacute; &Eacute;rt&eacute;kel&eacute;sek &ouml;sszehasonl&iacute;t&aacute;s&aacute;t &uacute;j &eacute;rt&eacute;kkel kell friss&iacute;teni;</li>
    <li>&Aacute;t kell t&eacute;rni a gyakorlat adminisztr&aacute;ci&oacute;s oldal&aacute;ra &eacute;s kattintani kell a Tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek &uacute;jrapontoz&aacute;sa ugr&oacute;pontra.</li>
    </ol>
    Ekkor megjelennek az &uacute;j pontok. A folyamat biztons&aacute;gosan megism&eacute;telhet&#337;.</p>
