<P ALIGN=CENTER><B>Tipos de Materiais</B></P>

<P>As tipologias de materiais se distinguem em fun&ccedil;&atilde;o das carcteristicas t&eacute;nicas de inserimento dos dados e de acesso e visualiza&ccedil;&atilde;o dos mesmos na plataforma:

<P><B>Texto Simples</B> -  simplesmente digite o texto utilizando o formul&aacute;rio web.  
A formata&ccedil;&atilde;o autom&aacute;tica &eacute; similar &agrave;quela das mensagens enviadas ao forum.
<br><a href="help.php?file=text.html">Mais detalhes sobre formata&ccedil;&atilde;o autom&aacute;tica</a></p>

<P><B>Texto HTML</B> - para usu&aacute;rios esperientes.  N&atilde;o h&aacute; formata&ccedil;&atilde;o autom&aacute;tica. O c&oacute;digo HTML &eacute; escrito por voc&ecirc;.
<br><a href="help.php?file=html.html">Mais detalhes sobre Texto HTML</a></p>

<P><B>Refer&ecirc;ncia</B> - uma refer&ecirc;ncia liter&aacute;ria a um livro ou publica&ccedil;&atilde;o.

<P><B>Material arquivado no site</B> - visualiza os arquivos qu voc&ecirc; transferiu para o servidor do curso.
Veja a se&ccedil;&atilde;o "Arquivos".

<P><B>Endere&ccedil;o Web</B> - endere&ccedil;o URL de materiais arquivados em outros sites. 
Quando algu&eacute;m seleciona este link, o arquivo visualizado substitue a p&aacute;gina do curso.

<P><B>P&aacute;gina Web</B> - endere&ccedil;o URL de materiais arquivados em outros sites. 
Ao contr&aacute;rio do "Link Web", a "P&aacute;gina Web" &eacute; visualizada em um frame de uma p&aacute;gina do curso, integrada no ambiente.

<P><B>Programa</B> - um programa esterno que requer informa&ccedil;&otilde;es sobre o curso e o usu&aacute;rio. isto permite a troca de dados esntre a plataforma e outros programas.
<br><a href="help.php?file=program.html&module=resource">Mais detalhes sobre Programas</a></p>

<p><b>Texto Wiki</b> - um modo de formatar textos mais simples que o HTML, como nos seguintes exemplos:<br>
 *esta frase &eacute; visualizada em negrito* <br> 
 /esta frase &eacute; visualizada em it&aacute;lico/ <br>
<a href="help.php?file=wiki.html">Mais detalhes sobre texto Wiki</a></p>

