<p align="center"><b>Types de ressource</b></p>

<p>Les formats possibles pour les ressources sont l&eacute;gions.
Les diff&eacute;rents types de ressources d&eacute;terminent principalement
la mani&egrave;re dont on acc&egrave;de &agrave; leur contenu&nbsp;:</p>

<p><b>Fichier</b>&nbsp;: affiche un fichier que vous aurez
pr&eacute;alablement d&eacute;pos&eacute; dans les fichiers du cours.
Voir la section &laquo;&nbsp;Fichiers&nbsp;&raquo;.</p>

<p><b>Dossier</b>&nbsp;: affiche un dossier complet (ainsi que ses
sous-dossiers) de votre espace de fichiers. Les &eacute;tudiants peuvent
consulter et visualiser tous les fichiers &agrave; l'int&eacute;rieur de ce
dossier.</p>
  	 
<p><b>Page web (externe)</b>&nbsp;: un lien vers une page sur le web.
Lorsque quelqu'un cliquera sur cette ressource, il sera envoy&eacute; sur cette
page web, quittant ainsi Moodle (la page s'affichera dans la m&ecirc;me
fen&ecirc;tre, rempla&ccedil;ant le cours). Il est aussi possible de faire afficher la
page dans une nouvelle fen&ecirc;tre, laissant intacte celle du cours.</p>

<p><b>Page web (interne)</b>&nbsp;: un lien vers une page sur le web.
Comme le type pr&eacute;c&eacute;dent, ceci affichera une page web. En revanche,
la page sera affich&eacute;e dans un cadre du navigateur, comme si elle
faisait partie du cours.</p>

<p><b>Programme</b>&nbsp;: un programme externe utilisant comme param&egrave;tres
des informations sur l'utilisateur et le cours actuels,
fournies par Moodle. Des applications externes peuvent ainsi
coop&eacute;rer avec Moodle. Plus d'informations sur les ressources
<a href="help.php?file=program.html&amp;module=resource">Programme</a>.</p>

<p><b>R&eacute;f&eacute;rence</b>&nbsp;: une r&eacute;f&eacute;rence
bibliographique &agrave; un livre ou &agrave; un journal.</p>

<p><b>Texte</b>&nbsp;: le type le plus simple. Vous tapez ou de modifiez
le texte du document dans un formulaire que vous trouverez sur la page
suivante. Le texte que vous &eacute;crivez est automatiquement mis en forme,
de la m&ecirc;me fa&ccedil;on les messages post&eacute;s sur les forums.
Pour de l'aide sur la mise en forme de texte&nbsp;:
<?php helpbutton("text", get_string("helptext")) ?></p>

<p><b>Texte HTML</b>&nbsp;: pour les utilisateurs plus exp&eacute;riment&eacute;s.
Aucune mise en forme automatique n'est r&eacute;alis&eacute;e&nbsp;; vous devez 
la faire vous-m&ecirc;me en utilisant des balises HTML.</p>

<p><b>Texte Wiki</b>&nbsp;: permet plus de possibilit&eacute;s de formatage
que le type Texte, sans avoir besoin de conna&icirc;tre le langage HTML. Vous pouvez
taper du texte, mais aussi utiliser un large &eacute;ventail de possibilit&eacute;s
de formatage (par exemple, *ceci sera en gras*, /ceci sera en italique/)
pour obtenir facilement des mises en pages complexes. Plus d'informations
sur le <a href="help.php?file=wiki.html">Texte Wiki</a>.</p>

