<p align="center"><b>&#3591;&#3634;&#3609;&#3623;&#3636;&#3592;&#3633;&#3618;&#3648;&#3594;&#3636;&#3591;&#3626;&#3635;&#3619;&#3623;&#3592;&#3607;&#3637;&#3656;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3614;&#3610;&#3652;&#3604;&#3657;</b></p>
<p align="center"><b>Available surveys</b></p>
<p>&#3651;&#3609;&#3611;&#3633;&#3592;&#3592;&#3640;&#3610;&#3633;&#3609;&#3609;&#3637;&#3657; &#3617;&#3637;&#3591;&#3634;&#3609;&#3623;&#3636;&#3592;&#3633;&#3618;&#3648;&#3594;&#3636;&#3591;&#3626;&#3635;&#3619;&#3623;&#3592;&#3648;&#3585;&#3637;&#3656;&#3618;&#3623;&#3585;&#3633;&#3610;&#3617;&#3641;&#3648;&#3604;&#3636;&#3657;&#3621;&#3619;&#3629;&#3591;&#3619;&#3633;&#3610;&#3651;&#3609;&#3627;&#3621;&#3634;&#3618;&#3611;&#3619;&#3632;&#3585;&#3634;&#3619; (&#3648;&#3623;&#3629;&#3619;&#3660;&#3594;&#3633;&#3656;&#3609;&#3651;&#3609;&#3629;&#3609;&#3634;&#3588;&#3605;&#3592;&#3632;&#3648;&#3629;&#3639;&#3657;&#3629;&#3651;&#3627;&#3657;&#3607;&#3656;&#3634;&#3609;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3607;&#3635;&#3623;&#3636;&#3592;&#3633;&#3618;&#3586;&#3629;&#3591;&#3607;&#3656;&#3634;&#3609;&#3648;&#3629;&#3591;&#3652;&#3604;&#3657;)</p>
<p>&#3591;&#3634;&#3609;&#3623;&#3636;&#3592;&#3633;&#3618;&#3607;&#3637;&#3656;&#3606;&#3641;&#3585;&#3648;&#3621;&#3639;&#3629;&#3585;&#3617;&#3634;&#3609;&#3637;&#3657; &#3648;&#3629;&#3639;&#3657;&#3629;&#3611;&#3619;&#3632;&#3650;&#3618;&#3594;&#3609;&#3660;&#3651;&#3609;&#3585;&#3634;&#3619;&#3611;&#3619;&#3632;&#3648;&#3617;&#3636;&#3609;&#3626;&#3616;&#3634;&#3614;&#3649;&#3623;&#3604;&#3621;&#3657;&#3629;&#3617;&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3609;&#3649;&#3610;&#3610;&#3629;&#3629;&#3609;&#3652;&#3621;&#3609;&#3660;&#3607;&#3637;&#3656;&#3651;&#3594;&#3657;&#3649;&#3609;&#3623;&#3588;&#3623;&#3634;&#3617;&#3588;&#3636;&#3604;&#3605;&#3634;&#3617;&#3607;&#3620;&#3625;&#3599;&#3637; constructivist &#3591;&#3634;&#3609;&#3623;&#3636;&#3592;&#3633;&#3618;&#3648;&#3627;&#3621;&#3656;&#3634;&#3609;&#3637;&#3657;&#3648;&#3629;&#3639;&#3657;&#3629;&#3611;&#3619;&#3632;&#3650;&#3618;&#3594;&#3609;&#3660;&#3651;&#3609;&#3585;&#3634;&#3619;&#3649;&#3626;&#3604;&#3591;&#3649;&#3609;&#3623;&#3650;&#3609;&#3657;&#3617;&#3607;&#3637;&#3656;&#3629;&#3634;&#3592;&#3592;&#3632;&#3648;&#3585;&#3636;&#3604;&#3586;&#3638;&#3657;&#3609;&#3585;&#3633;&#3610;&#3609;&#3633;&#3637;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3586;&#3629;&#3591;&#3607;&#3656;&#3634;&#3609; (&#3607;&#3656;&#3634;&#3609;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3629;&#3656;&#3634;&#3609;&#3619;&#3634;&#3618;&#3591;&#3634;&#3609;&#3585;&#3634;&#3619;&#3623;&#3636;&#3592;&#3633;&#3618;&#3648;&#3594;&#3636;&#3591;&#3623;&#3636;&#3648;&#3588;&#3619;&#3634;&#3632;&#3627;&#3660;&#3629;&#3618;&#3656;&#3634;&#3591;&#3621;&#3632;&#3648;&#3629;&#3637;&#3618;&#3604;&#3652;&#3604;&#3657;&#3639;&#3633;&#3607;&#3637;&#3656; <a target="paper" href="http://dougiamas.com/writing/herdsa2002">http://dougiamas.com/writing/herdsa2002</a></p>
<p>&#3585;&#3634;&#3619;&#3626;&#3635;&#3619;&#3623;&#3592;&#3626;&#3616;&#3634;&#3614;&#3649;&#3623;&#3604;&#3621;&#3657;&#3629;&#3617;&#3651;&#3609;&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3609;&#3619;&#3641;&#3657;&#3629;&#3629;&#3609;&#3652;&#3621;&#3609;&#3660;&#3605;&#3634;&#3617;&#3649;&#3609;&#3623;&#3588;&#3636;&#3604; Constructivist (<b>COLLES - Constructivist On-Line Learning Environment Survey</b>)</p>
<p>COLLES &#3611;&#3619;&#3632;&#3585;&#3629;&#3610;&#3604;&#3657;&#3623;&#3618;&#3606;&#3657;&#3629;&#3618;&#3649;&#3606;&#3621;&#3591; 24 &#3611;&#3619;&#3632;&#3585;&#3634;&#3619; &#3595;&#3638;&#3656;&#3591;&#3592;&#3633;&#3604;&#3627;&#3617;&#3623;&#3604;&#3627;&#3617;&#3641;&#3656;&#3652;&#3604;&#3657;&#3648;&#3611;&#3655;&#3609; 6 &#3619;&#3632;&#3604;&#3633;&#3610; &#3649;&#3605;&#3656;&#3621;&#3632;&#3619;&#3632;&#3604;&#3633;&#3610;&#3594;&#3656;&#3623;&#3618;&#3651;&#3627;&#3657;&#3648;&#3619;&#3634;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3605;&#3633;&#3657;&#3591;&#3588;&#3635;&#3606;&#3634;&#3617;&#3627;&#3621;&#3633;&#3585;&#3648;&#3585;&#3637;&#3656;&#3618;&#3623;&#3585;&#3633;&#3610;&#3588;&#3640;&#3603;&#3616;&#3634;&#3614;&#3586;&#3629;&#3591;&#3626;&#3616;&#3634;&#3614;&#3649;&#3623;&#3604;&#3621;&#3657;&#3629;&#3617;&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3609;&#3619;&#3641;&#3657;&#3629;&#3629;&#3609;&#3652;&#3621;&#3609;&#3660; &#3604;&#3633;&#3591;&#3609;&#3637;&#3657;</p>
<p>&nbsp; </p>
<p>Currently, Moodle only offers specific types of surveys (future versions 
  will enable you to create your own).</p>
<p>The available surveys have been chosen as being particularly useful for 
evaluating online learning environments that use a constructivist pedagogy. 
They are useful to identify certain trends that may be happening among
your participants.

(To see a paper where these are used in a detailed analysis, see:  
<a target="paper" href="http://dougiamas.com/writing/herdsa2002">http://dougiamas.com/writing/herdsa2002</a>)</p>

<hr />
<p><b>COLLES - Constructivist On-Line Learning Environment Survey</b></p>
<ul>
  <p>The COLLES comprises an economical 24 statements grouped into six scales, 
    each of which helps us address a key question about the quality of the on-line 
    learning environment: </p>

<table border="0" cellspacing="10" cellpadding="10">
  <tr> 
    <td valign="top"><p>Relevance</p>
      <p>&#3626;&#3633;&#3617;&#3614;&#3633;&#3609;&#3608;&#3616;&#3634;&#3614;</p></td>
    <td><p>How relevant is on-line learning to students' professional practices? </p>
      <p>&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3609;&#3619;&#3641;&#3657;&#3629;&#3629;&#3609;&#3652;&#3621;&#3609;&#3660;&#3617;&#3637;&#3626;&#3633;&#3617;&#3614;&#3633;&#3609;&#3608;&#3616;&#3634;&#3614;&#3629;&#3618;&#3656;&#3634;&#3591;&#3652;&#3619;&#3585;&#3633;&#3610;&#3585;&#3634;&#3619;&#3613;&#3638;&#3585;&#3613;&#3609;&#3607;&#3634;&#3591;&#3629;&#3634;&#3594;&#3637;&#3614;&#3586;&#3629;&#3591;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;</p></td>
  </tr>
  <tr> 
    <td valign="top"><p>Reflection </p>
      <p>&#3585;&#3634;&#3619;&#3649;&#3626;&#3604;&#3591;&#3588;&#3623;&#3634;&#3617;&#3648;&#3627;&#3655;&#3609;</p></td>

    <td><p>Does on-line learning stimulate students' critical reflective thinking? </p>
      <p>&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3609;&#3619;&#3641;&#3657;&#3629;&#3629;&#3609;&#3652;&#3621;&#3609;&#3660;&#3585;&#3619;&#3632;&#3605;&#3640;&#3657;&#3609;&#3651;&#3627;&#3657;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3652;&#3604;&#3657;&#3649;&#3626;&#3604;&#3591;&#3588;&#3623;&#3634;&#3617;&#3588;&#3636;&#3604;&#3648;&#3627;&#3655;&#3609;&#3648;&#3594;&#3636;&#3591;&#3626;&#3619;&#3657;&#3634;&#3591;&#3626;&#3619;&#3619;&#3588;&#3660;&#3627;&#3619;&#3639;&#3629;&#3652;&#3617;&#3656;</p></td>
  </tr>
  <tr> 
    <td valign="top"><p>Interactivity</p>
      <p>&#3585;&#3634;&#3619;&#3611;&#3599;&#3636;&#3626;&#3633;&#3617;&#3614;&#3633;&#3609;&#3608;&#3660;</p></td>
    <td><p>To what extent do students engage on-line in rich educative dialogue? </p>
      <p>&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3617;&#3637;&#3626;&#3656;&#3623;&#3609;&#3619;&#3656;&#3623;&#3617;&#3651;&#3609;&#3610;&#3607;&#3626;&#3609;&#3607;&#3609;&#3634;&#3607;&#3634;&#3591;&#3585;&#3634;&#3619;&#3624;&#3638;&#3585;&#3625;&#3634;&#3629;&#3618;&#3641;&#3656;&#3651;&#3609;&#3619;&#3632;&#3604;&#3633;&#3610;&#3651;&#3604;      </p></td>
  </tr>
  <tr> 
    <td valign="top"><p>Tutor Support</p>
      <p>&#3585;&#3634;&#3619;&#3626;&#3609;&#3633;&#3610;&#3626;&#3609;&#3640;&#3609;&#3592;&#3634;&#3585;&#3588;&#3619;&#3641;</p></td>

    <td><p>How well do tutors enable students to participate in on-line learning? </p>
      <p>&#3588;&#3619;&#3641;&#3617;&#3637;&#3626;&#3656;&#3623;&#3609;&#3594;&#3656;&#3623;&#3618;&#3651;&#3627;&#3657;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3652;&#3604;&#3657;&#3617;&#3637;&#3626;&#3656;&#3623;&#3609;&#3619;&#3656;&#3623;&#3617;&#3651;&#3609;&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3609;&#3619;&#3641;&#3657;&#3629;&#3629;&#3609;&#3652;&#3621;&#3609;&#3660;&#3652;&#3604;&#3657;&#3604;&#3637;&#3617;&#3634;&#3585;&#3609;&#3657;&#3629;&#3618;&#3648;&#3614;&#3637;&#3618;&#3591;&#3651;&#3604;</p></td>
  </tr>
  <tr> 
    <td valign="top"><p>Peer Support </p>
      <p>&#3585;&#3634;&#3619;&#3626;&#3609;&#3633;&#3610;&#3626;&#3609;&#3640;&#3609;&#3592;&#3634;&#3585;&#3648;&#3614;&#3639;&#3656;&#3629;&#3609;</p></td>
    <td><p>Is sensitive and encouraging support provided on-line by fellow students? </p>
      <p>&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3652;&#3604;&#3657;&#3619;&#3633;&#3610;&#3585;&#3634;&#3619;&#3626;&#3609;&#3633;&#3610;&#3626;&#3609;&#3640;&#3609;&#3592;&#3634;&#3585;&#3648;&#3614;&#3639;&#3656;&#3629;&#3609;&#3619;&#3656;&#3623;&#3617;&#3594;&#3633;&#3657;&#3609;&#3651;&#3609;&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3609;&#3649;&#3610;&#3610;&#3629;&#3629;&#3609;&#3652;&#3621;&#3609;&#3660;&#3627;&#3619;&#3639;&#3629;&#3652;&#3617;&#3656;</p></td>
  </tr>
  <tr> 
    <td valign="top"><p>Interpretation </p>
      <p>&#3585;&#3634;&#3619;&#3605;&#3637;&#3638;&#3588;&#3623;&#3634;&#3617;</p></td>

    <td><p>Do students and tutors make good sense of each other's on-line communications?</p>
      <p>&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3649;&#3621;&#3632;&#3588;&#3619;&#3641;&#3617;&#3637;&#3588;&#3623;&#3634;&#3617;&#3619;&#3641;&#3657;&#3626;&#3638;&#3585;&#3607;&#3637;&#3656;&#3604;&#3637;&#3605;&#3656;&#3629;&#3585;&#3634;&#3619;&#3605;&#3636;&#3604;&#3605;&#3656;&#3629;&#3626;&#3639;&#3656;&#3629;&#3626;&#3634;&#3619;&#3619;&#3632;&#3627;&#3623;&#3656;&#3634;&#3591;&#3585;&#3633;&#3609;&#3604;&#3657;&#3623;&#3618;&#3623;&#3636;&#3661;&#3637;&#3661;&#3661;&#3661;&#3608;&#3637;&#3629;&#3629;&#3609;&#3652;&#3621;&#3609;&#3660;&#3627;&#3619;&#3639;&#3629;&#3652;&#3617;&#3656;</p></td>
  </tr>
</table>

  <p>&#3649;&#3609;&#3623;&#3588;&#3636;&#3604;&#3607;&#3637;&#3656;&#3626;&#3635;&#3588;&#3633;&#3597;&#3607;&#3634;&#3591;&#3604;&#3657;&#3634;&#3609;&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3609;&#3619;&#3641;&#3657;&#3651;&#3609;&#3611;&#3633;&#3592;&#3592;&#3640;&#3610;&#3633;&#3609;&#3588;&#3639;&#3629; social constructivism &#3595;&#3638;&#3656;&#3591;&#3623;&#3634;&#3591;&#3610;&#3607;&#3610;&#3634;&#3607;&#3586;&#3629;&#3591;&#3612;&#3641;&#3657;&#3648;&#3619;&#3637;&#3618;&#3609;&#3651;&#3627;&#3657;&#3648;&#3611;&#3655;&#3609;&#3612;&#3641;&#3657;&#3607;&#3637;&#3656;&#3626;&#3619;&#3657;&#3634;&#3591;&#3626;&#3633;&#3591;&#3585;&#3633;&#3611;&#3604;&#3657;&#3623;&#3618;&#3605;&#3609;&#3648;&#3629;&#3591;&#3592;&#3634;&#3585;&#3626;&#3616;&#3634;&#3614;&#3649;&#3623;&#3604;&#3621;&#3657;&#3629;&#3617;&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3609;&#3619;&#3641;&#3657;&#3607;&#3634;&#3591;&#3626;&#3633;&#3591;&#3588;&#3617; Social constructivism &#3648;&#3611;&#3655;&#3609;&#3649;&#3609;&#3623;&#3607;&#3634;&#3591;&#3585;&#3634;&#3619;&#3648;&#3619;&#3637;&#3618;&#3609;&#3619;&#3641;&#3657;&#3607;&#3637;&#3656;&#3612;&#3641;&#3657;&#3648;&#3619;&#3637;&#3618;&#3609;&#3619;&#3656;&#3623;&#3617;&#3649;&#3626;&#3604;&#3591;&#3588;&#3623;&#3634;&#3617;&#3588;&#3636;&#3604;&#3648;&#3627;&#3655;&#3609;&#3648;&#3614;&#3639;&#3656;&#3629;&#3585;&#3656;&#3629;&#3619;&#3656;&#3634;&#3591;&#3588;&#3623;&#3634;&#3617;&#3619;&#3641;&#3657;&#3588;&#3623;&#3634;&#3617;&#3648;&#3586;&#3657;&#3634;&#3651;&#3592;&#3651;&#3627;&#3617;&#3656;&#3654; &#3650;&#3604;&#3618;&#3648;&#3593;&#3614;&#3634;&#3632;&#3629;&#3618;&#3656;&#3634;&#3591;&#3618;&#3636;&#3656;&#3591;&#3651;&#3609;&#3610;&#3619;&#3636;&#3610;&#3607;&#3607;&#3637;&#3656;&#3585;&#3634;&#3619;&#3649;&#3626;&#3623;&#3591;&#3627;&#3634;&#3588;&#3623;&#3634;&#3617;&#3619;&#3641;&#3657;&#3609;&#3633;&#3657;&#3609;&#3617;&#3637;&#3614;&#3639;&#3657;&#3609;&#3600;&#3634;&#3609;&#3617;&#3634;&#3592;&#3634;&#3585;&#3611;&#3619;&#3632;&#3626;&#3610;&#3585;&#3634;&#3619;&#3603;&#3660;&#3626;&#3656;&#3623;&#3609;&#3605;&#3633;&#3623;&#3586;&#3629;&#3591;&#3612;&#3641;&#3657;&#3648;&#3619;&#3637;&#3618;&#3609;&#3648;&#3629;&#3591;</p>
  <p>&#3592;&#3640;&#3604;&#3624;&#3641;&#3609;&#3618;&#3660;&#3585;&#3621;&#3634;&#3591;&#3586;&#3629;&#3591;&#3585;&#3634;&#3619;&#3619;&#3656;&#3623;&#3617;&#3617;&#3639;&#3629;&#3609;&#3637;&#3657;&#3588;&#3639;&#3629;&#3614;&#3633;&#3602;&#3609;&#3634;&#3585;&#3634;&#3619;&#3588;&#3623;&#3634;&#3617;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3607;&#3634;&#3591;&#3604;&#3657;&#3634;&#3609;&#3585;&#3634;&#3619;&#3626;&#3639;&#3656;&#3629;&#3626;&#3634;&#3619;&#3586;&#3629;&#3591;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609; &#3609;&#3633;&#3656;&#3609;&#3585;&#3655;&#3588;&#3639;&#3629; &#3588;&#3623;&#3634;&#3617;&#3626;&#3634;&#3617;&#3634;&#3619;&#3606;&#3651;&#3609;&#3585;&#3634;&#3619;&#3617;&#3637;&#3626;&#3656;&#3623;&#3609;&#3619;&#3656;&#3623;&#3617;&#3651;&#3609;&#3585;&#3634;&#3619;&#3648;&#3611;&#3636;&#3604;&#3611;&#3619;&#3632;&#3648;&#3604;&#3655;&#3609;&#3649;&#3621;&#3632;&#3649;&#3626;&#3604;&#3591;&#3588;&#3623;&#3634;&#3617;&#3588;&#3636;&#3604;&#3648;&#3627;&#3655;&#3609;&#3648;&#3594;&#3636;&#3591;&#3626;&#3619;&#3657;&#3634;&#3591;&#3626;&#3619;&#3619;&#3588;&#3660;&#3607;&#3633;&#3657;&#3591;&#3585;&#3633;&#3610;&#3588;&#3619;&#3641;&#3649;&#3621;&#3632;&#3648;&#3614;&#3639;&#3656;&#3629;&#3609;&#3609;&#3633;&#3585;&#3648;&#3619;&#3637;&#3618;&#3609;&#3604;&#3657;&#3623;&#3618;&#3585;&#3633;&#3609; </p>
  <p>Underpinning the dynamic view of learning is a new theory of knowing: social 
    constructivism, which portrays the learner as an active conceptualiser within 
    a socially interactive learning environment. Social constructivism is an epistemology, 
    or way of knowing, in which learners collaborate reflectively to co-construct 
    new understandings, especially in the context of mutual inquiry grounded in 
    their personal experience. </p>
  <p>Central to this collaboration is the development of students' communicative 
    competence, that is, the ability to engage in open and critical discourse 
    with both the teacher and peers. This discourse is characterised by an empathic 
    orientation to constructing reciprocal understanding, and a critical attitude 
    towards examining underlying assumptions. </p>

  <p>The COLLES has been designed to enable you
    to monitor the extent to which you are able to exploit the interactive capacity 
    of the World Wide Web for engaging students in dynamic learning practices. </p>

<p>
(This information has been adapted from the COLLES page.  You can find out more about 
COLLES and the authors of it at: 
<a target="paper" href="http://surveylearning.com/colles/">http://surveylearning.com/colles/</a>)</p>
</ul>


<hr />
<p><b>ATTLS - Attitudes to Thinking and Learning Survey</b></p>
<ul>

<p>The theory of 'ways of knowing', originally from the field of gender research (Belenky et al., 1986) provides us with a survey tool to examine the quality of discourse within a collaborative environment. 

<p>The Attitudes Towards Thinking and Learning Survey (ATTLS) is an instrument developed by Galotti et al. (1999) to measure the extent to which a person is a 'connected knower' (CK) or a 'separate knower' (SK). 

<p>People with higher CK scores tend to find learning more enjoyable, and are often more cooperative, congenial and more willing to build on the ideas of others, while those with higher SK scores tend to take a more critical and argumentative stance to learning. 

<p>Studies have shown that these two learning styles are independent of each other (Galotti et al., 1999; Galotti et al., 2001). Additionally, they are only a reflection of learning attitudes, not learning capacities or intellectual power. 

<p><i>Belenky, M. F., Clinchy, B. M., Goldberger, N. R., & Tarule, J. M. (1986). Women's Ways of Knowing: The Development of Self, Voice, and Mind. New York: Basic Books, Inc. </i></p>

<p><i>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., & Mansfield, A. F. (1999). A New Way of Assessing Ways of Knowing: The Attitudes Towards Thinking and Learning Survey (ATTLS). Sex Roles, 40(9/10), 745-766.</i></p>

<p><i>Galotti, K. M., Reimer, R. L., & Drebus, D. W. (2001). Ways of knowing as learning styles: Learning MAGIC with a partner. Sex Roles, 44(7/8), 419-436.</i></p>


</ul>
