Repository: moodle/moodle
Catalog: auth/saml2/.extlib/simplesamlphp/modules/consentAdmin/locales/*/LC_MESSAGES/consentAdmin.po
Languages: nl

source: {consentAdmin:consentadmin:status_header}
nl: Toestemming Status

source: {consentAdmin:consentadmin:attributes_text}
nl: attributen

source: {consentAdmin:consentadmin:service_provider_header}
nl: Service Provider

source: {consentAdmin:consentadmin:removed}
nl: Toestemming Verwijderd

source: {consentAdmin:consentadmin:consentadmin_header}
nl: Toestemming Beheer

source: {consentAdmin:consentadmin:show}
nl: Bekijk

source: {consentAdmin:consentadmin:attribute_org}
nl: Organisatie

source: {consentAdmin:consentadmin:attribute_injected}
nl: Geïnjecteerd attibuut

source: {consentAdmin:consentadmin:show_hide_attributes}
nl: bekijk/verberg attributen

source: {consentAdmin:consentadmin:consentadmin_purpose}
nl: Het nut van de server is

source: {consentAdmin:consentadmin:hide}
nl: Verberg

source: {consentAdmin:consentadmin:sp_empty_description}
nl: (geen omschrijving)

source: {consentAdmin:consentadmin:service_providers_for}
nl: Service Providers voor

source: {consentAdmin:consentadmin:consentadmin_description2}
nl: <h3>Hoe verwijdert u toestemmingen</h3> Vinkt u het vakje af dat overeenkomt met de dienstverlener <h3>Links</h3> <ul> <li><a href="https://www.wayf.dk">Start</a> </li> <li><a href="https://www.wayf.dk/index.php/en/about-wayf/faq-frequently-asked-questions">FAQ</a> </li> </ul>

source: {consentAdmin:consentadmin:login}
nl: login

source: {consentAdmin:consentadmin:consentadmin_description1}
nl: Hier kunt u uw verleende toestemmingen voor dienstverleners bekijken en bewerken.

source: {consentAdmin:consentadmin:updated}
nl: Toestemming Bijgewerkt

source: {consentAdmin:consentadmin:unknown}
nl: Onbekend...

source: {consentAdmin:consentadmin:added}
nl: Toestemming Toegevoegd

source: {consentAdmin:consentadmin:attribute_id}
nl: Identiteit

source: Injected attribut
nl: Geïnjecteerd attibuut

source: Show
nl: Bekijk

source: Consent Added
nl: Toestemming Toegevoegd

source: Consent Administration
nl: Toestemming Beheer

source: Here you can view and edit your consent for the Service Providers.
nl: Hier kunt u uw verleende toestemmingen voor dienstverleners bekijken en bewerken.

source: Unknown ...
nl: Onbekend...

source: Identity
nl: Identiteit

source: The purpose of the service is
nl: Het nut van de server is

source: Hide
nl: Verberg

source: Service Providers for
nl: Service Providers voor

source: (name not specified)
nl: (naam niet opgegeven)

source: Consent Updated
nl: Toestemming Bijgewerkt

source: Consent status
nl: Toestemming Status

source: (no description)
nl: (geen omschrijving)

source: attributes
nl: attributen

source: <h3>How to delete your consent</h3> Uncheck the box corresponding to the service provider <h3>Links</h3> <ul> <li><a href="https://www.wayf.dk">Start</a> </li> <li><a href="https://www.wayf.dk/FAQ">FAQ</a> </li> </ul>
nl: <h3>Hoe verwijderdt u toestemmingen</h3> Vinkt u het vakje af dat overeenkomt met de dienstverlener <h3>Links</h3> <ul> <li><a href="https://www.wayf.dk">Start</a> </li> <li><a href="https://www.wayf.dk/index.php/en/about-wayf/faq-frequently-asked-questions">FAQ</a> </li> </ul>

source: Consent Removed
nl: Toestemming Verwijderd

source: show/hide attributes
nl: bekijk/verberg attributen

source: Organisation
nl: Organisatie
