<!-- $Id$ -->

<p align="center"><b>Utilisation de l'&eacute;diteur WYSIWYG</b></p>

<p>Lors de l'&eacute;dition des pages, cette option permet l'utilisation de l'&eacute;diteur WYSIWYG au lieu de simples zones de texte. Cet &eacute;diteur permet de formatter le texte et d'ajouter des liens ou des images de fa&ccedil;on simple.</p>

<p>L'&eacute;diteur est activ&eacute; en cochant la case &agrave; c&ocirc;t&eacute; de <b>Utiliser l'&eacute;diteur</b>. L'activation est propre &agrave; chaque &eacute;l&eacute;ment. Par exemple, si vous activez l'&eacute;diteur pour <b>R&eacute;ponse 1</b>, il ne sera pas actif pour tous les autres champs de r&eacute;ponses.</p>

<p>Si vous avez besoin de l'&eacute;diteur pour certains &eacute;l&eacute;ments de la page, cochez d'abord les cases <b>Utiliser l'&eacute;diteur</b> n&eacute;cessaires, puis faites r&eacute;afficher la page en cliquant sur le bouton <b>R&eacute;afficher la page</b> au bas de celle-ci.</p>

<p>Veuillez noter qu'il faut utiliser l'&eacute;diteur avec prudence. La plupart du temps, il n'y a aucun probl&egrave;me. Cependant, nous vous recommandons de <i>ne pas</i> l'utiliser pour les r&eacute;ponses aux <b>Questions &agrave; r&eacute;ponse courte</b> et aux <b>Questions num&eacute;riques</b>. L'&eacute;diteur peut en effet ajouter des balises HTML invisibles qui emp&ecirc;chent les comparaisons de s'effectuer correctement. En outre, le texte des <b>Descriptions</b> dans les tables de branchement est utilis&eacute; dans des boutons, et l&agrave; encore des probl&egrave;mes peuvent survenir avec des balises HTML invisibles. Il n'y a en revanche aucun probl&egrave;me avec les r&eacute;ponses qui ne sont utilis&eacute;es que pour l'affichage, comme celles des Questions &agrave; choix multiples.</p>

<p>Si vous suspectez un probl&egrave;me avec un des &eacute;l&eacute;ments, vous pouvez sans probl&egrave;me d&eacute;sactiver l'&eacute;diteur en d&eacute;cochant la case <b>Utiliser l'&eacute;diteur</b> ad&eacute;quate. Lorsque la page est r&eacute;affich&eacute;e, le texte brut est pr&eacute;sent&eacute; dans le champ et vous pouvez le modifier de fa&ccedil;on ad&eacute;quate. La seule activation ou d&eacute;sactivation de l'&eacute;diteur WYSIWYG ne modifie en rien le texte.</p>

<p>L'&eacute;tat de l'option <b>Utiliser l'&eacute;diteur</b> est enregistr&eacute; pour chaque &eacute;l&eacute;ment. Si vous d&eacute;sirez modifier la page, les &eacute;l&eacute;ments qui utilisaient l'&eacute;diteur seront &agrave; nouveau pr&eacute;sent&eacute; avec l'&eacute;diteur.</p>

<p>L'&eacute;diteur WYSIWYG est tr&egrave;s gourmand en ressources. Si vous n'avez pas besoin de l'utiliser pour certains &eacute;l&eacute;ments, il est beaucoup plus rapide d'utiliser des champs standard. Vous souffrirez en outre de moins d'erreurs.</p>