<?PHP // $Id$ 
      // admin.php - created with Moodle 1.5 ALPHA (2005042300)


$string['adminseesallevents'] = 'מנהלים רואים את כל הארועים';
$string['adminseesownevents'] = 'מנהלים רואים ארועים כמו משתמשים רגילים';
$string['blockinstances'] = 'מופעים';
$string['blockmultiple'] = 'מרובים';
$string['cachetext'] = 'משך התקפות של טקסט במטמון';
$string['calendarsettings'] = 'לוח שנה';
$string['change'] = 'שינוי';
$string['configallowcoursethemes'] = 'אם תאפשר זאת, ניתן להגדיר ערכת נושא לכל קורס. ערכת נושא ברמת קורס רומסת כל הגדרה אחרת (ערכת נושא ברמת אתר, משתמש או חיבור נוכחי) ';
$string['configallowemailaddresses'] = 'אם ברצונך להגביל את כל כתובות הדוא\"ל החדשות למתחמים מסויימים, אזי רשום אותם כאן מופרדים ע\"י רווחים. כתובות מכל מתחם אחר יידחו. למשל <strong>ourcollege.edu.au .gov.au</strong>';
$string['configallowunenroll'] = 'אם ערך שדה זה הוא \"כן\", אזי סטודנטים מורשים לבטל את רישומם לקורס בכל עת שירצו. אחרת, הם אינם מורשים לבטל רישום, ותהליך הביטול נשלט רק בידי מורים ומנהלים.';
$string['configallowuserblockhiding'] = 'האם אתה מרשה למשתמשים להציג/להסתיר בלוקים באתר? תכונה זו משתמש ב-Javascript ועוגיות כדי לזכור את המצב של כל בלוק הניתן להסתרה, ומשפיע רק על האופן בו המשתמש עצמו צופה באתר.';
$string['configallowuserthemes'] = 'אם תאפשר זאת, משתמשים יוכלו לבחור לעצמם ערכת נושא. ערכות נושא המוגדרות ע\"י משתמשים רומסות את ערכת הנושא המוגדרת ברמת האתר (אך לא את ערכת הנושא שהוגדרה ברמת הקורס, אם יש כזו).';
$string['configallusersaresitestudents'] = 'האם יש להתייחס לכל המשתמשים כתלמידים עבור פעילויות בדף הראשי של האתר? אם התשובה היא \"כן\", אזי כל חשבון משתמש מאושר יורשה להשתתף כתלמיד בפעילויות אלו. אם התשובה היא \"לא\", אזי רק משתמשים הרשומים לקורס אחד לפחות יורשו לטול חלק בפעילויות המופיעות בדף הראשי. רק מנהלים ומורים שקיבלו הרשאה מיוחדת יכולים להחשב כמורים עבור פעילויות אלו בדף הראשי.';
$string['configautologinguests'] = 'האם יש לחבר משתמשים כאורחים באופן אוטומטי כאשר נכנסים לקורס המתיר גישת אורחים?';
$string['configcachetext'] = 'עבור אתרים גדולים או אתרים המשתמשים במסנני טקסט, הגדרה זו יכולה לשפר את ביצועי המערכת. עותקי טקסטים יישמרו בצורתם המעובדת למשך הזמן המוגדר כאן. ערך קטן מדי עלול לגרום לתוצאה הפוכה ולפגוע בביצועים, בעוד שערך גדול מדי עלול לגרום להאטה משמעותית ברענון טקסטים (עם קישורים חדשים, כדוגמה).';
$string['configclamactlikevirus'] = 'התייחס לכל הקבצים כוירוסים';
$string['configclamdonothing'] = 'התייחס לכל הקבצים כתקינים';
$string['configclamfailureonupload'] = 'אם הגדרת את Clam לסריקת קבצים מועלים לאתר, אך התוכנה אינה מוגדרת כראוי או היא אינה מצליחה לפעול מכל סיבה שהיא (לרוב בגלל הגדרת נתיב לא תקין לקובץ ההרצה של התוכנה), כיצד יש להתנהג? אם תבחר להתייחס לכל הקבצים כוירוסים, הקבצים יועברו לאזור ההסגר או יימחקו. אם תבחר להתייחס לכל הקבצים כתקינים, הקבצים יועברו לספריית היעד כרגיל. בכל מקרה, המנבלים יקבלו הודעה שהפעלת Clam נכשלה. מומלץ לנקוט משנה זהירות אם תבחר להתייחס לכל הקבצים כוירוסים. ';
$string['configcountry'] = 'אם תגדיר מדינה בשדה זה, אזי מדינה זו תבחר כברירת מחדל עבור חשבונות משתמש חדשים. אם ברצונך לאלץ משתמשים לבחור מדינה, השאר שדה זה ללא ערך.';
$string['configdbsessions'] = 'אם מאופשרת, הגדרה זו תשתמש במסד הנתונים לשמור מידע אודות ההתחברויות הנוכחיות. דבר זה שימושי במיוחד עבור אתרים גדולים/עמוסים או אתרים הפועלים על אשכול שרתים. ברוב האתרים ניתן לנטרל ערך זה כדי לאלץ שימוש בהתקן האחסון (דיסק) של השרת. שים לב ששינוי ערך זה כעת יגרום לניתוק כל המשתמשים המחוברים כעת (כולל אותך).';
$string['configdebug'] = 'אם תאפשר הגדרה זו, אזי ערך המשתנה error_reporting של PHP יוגדל כך שיוצגו יותר הודעות שגיאה. הגדרה זו שימושית בעיקר למפתחים.';
$string['configdeleteunconfirmed'] = 'אם אתה משתמש באימות מבוסס דוא\"ל, זהו משך הזמן שבו המשתמש יוכל לאשר את החשבון החדש. אחרי פרק זמן זה, חשבונות ישנים שלא אומתו ימחקו מהמערכת.';
$string['configdenyemailaddresses'] = 'על מנת לחסום כתובות דוא\"ל ממתחמים מסויימים יש לרשום בשדה זה את רשימת המתחמים באותו אופן. כל מתחם אחר יאופשר. למשל <strong>hotmail.com yahoo.co.uk</strong>';
$string['configdigestmailtime'] = 'משתמשים הבוחרים לקבל מקבצי הודעות דוא\"ל יקבלו את המקבץ מדי יום. הגדרה זו קובעת באיזה יום בשבוע המקבץ יישלח (הרצת תהליך ה-cron אחרי שעה זו תגרום לשליחת המקבץ).';
$string['configdisplayloginfailures'] = 'הגדרה זו תציג למשתמשים נבחרים הודעות אודות נסיונות התחברות כושלים.';
$string['configenablerssfeeds'] = 'הגדרה זו תאפשר הזנות RSS ברחבי האתר. על מנת לאפשר הזנות RSS בכל מקום בו הדבר נתמך, עליך לאפשר הזנות RSS גם עבור כל מודול - גש להגדרות המודולים המופיעות באזור הגדרות ניהול.';
$string['configenablerssfeedsdisabled'] = 'לא זמין בגלל שהזנות RSS נוטרלו בכל האתר. לאפשור הזנות RSS, גש להגדרות משתנים המופיעות באזור הגדרות ניהול.';
$string['configerrorlevel'] = 'בחר את מספר הודעות האזהרה של PHP שברצונך לראות. ברירת המחדל הרגילה היא הערך המומלץ ברוב המקרים.';
$string['configextendedusernamechars'] = 'אפשר תכונה זו בכדי לאפשר לתלמידים להשתמש בכל תו שהוא בשם המשתמש שלהם (שים לב שההגדרה אינה משפיעה על השמות האמיתיים). ערך ברירת המחדל הוא להגביל שימוש בתוים אלפאנומריים בלבד בשמות משתמש';
$string['configfilterall'] = 'סנן את כל המחרוזות, כולל כותרות, סרגל ניווט וכו\'. תכונה זו שימושית כאשר משתמשים במסנן שפות מרובות, אחרת הגדרה זו תיצור עומס נוסף באתר ללא רווח כלשהו.';
$string['configfilteruploadedfiles'] = 'איפשור ערך זה תגרום ל-Moodle לעבד את כל קבצי הטקסט וקבצי HTML שהועלו בעזרת הפילטר לפני הצגתם.';
$string['configsectioninterface'] = 'ממשק';
$string['configsectionmail'] = 'דואר';
$string['configsectionmaintenance'] = 'תחזוקה';
$string['configsectionmisc'] = 'שונות';
$string['configsectionoperatingsystem'] = 'מערכת הפעלה';
$string['configsectionpermissions'] = 'הרשאות';
$string['configsectionsecurity'] = 'אבטחה';
$string['configsectionuser'] = 'משתמש';
$string['configvariables'] = 'משתנים';
$string['confirmation'] = 'אישור';
$string['edithelpdocs'] = 'ערוך מסמכי עזרה';
$string['editstrings'] = 'ערוך מחרוזות';
$string['filterall'] = 'סנן את כל המחרוזות';
$string['filteruploadedfiles'] = 'סנן את הקבצים המועלים';
$string['helpadminseesall'] = 'האם מנהלים יכולים לראות את כל הארועים בלוח השנה או רק את אלו המתייחסים אליהן?';
$string['helpcalendarsettings'] = 'הגדר מאפיינים שונים הקשורים ללוח השנה ותאריך/שעה';
$string['helpforcetimezone'] = 'אתה יכול לאפשר למשתמשים לבחור את אזור הזמן שלהם, או לאלץ אזור זמן כלשהו.';
$string['helpsitemaintenance'] = 'לשדרוגים ועבודות תחזוקה אחרות';
$string['helpstartofweek'] = 'באיזה יום השבוע מתחיל השבוע המוצג בלוח השנה? (בישראל - יום ראשון)';
$string['helpupcominglookahead'] = 'בהצגת ארועים קרובים, כמה ימים קדימה יש לחפש ארועים בלוח השנה?';
$string['helpupcomingmaxevents'] = 'כמה ארועים קרובים (ערך מקסימום) יש להציג למשתמשים כברירת מחדל?';
$string['helpweekenddays'] = 'אילו ימים בשבוע נחשבים כ\"סופשבוע\" ולכן יש להציגם בצבע אחר? (בישראל - ימי שישי ושבת)';
$string['importtimezones'] = 'עדכן את רשימת כל אזורי הזמן';
$string['importtimezonescount'] = '$a->count ערכים מיובאים מ-$a->source';
$string['importtimezonesfailed'] = 'לא נמצאו מקורות! (חדשות רעות)';
$string['nodstpresetsexist'] = 'תמיכת DST מנוטרלת עבור כל המשתמשים מאחר ולא נמצאו הגדרות DST מתאימות. יש באפשרותך להגדיר הגדרות מסויימות בעזרת הכפתור להלן.';
$string['optionalmaintenancemessage'] = 'הודעת תחזוקה אופציונלית';
$string['pleaseregister'] = 'אנא רשום את האתר שלך כדי להסיר כפתור זה';
$string['sitemaintenance'] = 'אתר זה עובר כרגע פעולות תחזוקה ואינו זמין';
$string['sitemaintenancemode'] = 'מצב תחזוקה';
$string['sitemaintenanceoff'] = 'מצב תחזוקה בוטל, וכעת האתר פועל שוב כרגיך';
$string['sitemaintenanceon'] = 'מצב תחזוקה מופעל כרגע באתר (רק מנהלים יכולים להתחבר לאתר)';
$string['sitemaintenancewarning'] = 'מצב תחזוקה מופעל כרגע באתר (רק מנהלים יכולים להתחבר לאתר). להחזרת האתר למצבו הרגיל, <a href=\"maintenance.php\">בטל את מצב התחזוקה</a>.';
$string['tabselectedtofront'] = 'בטבלאות עם לשוניות, האם יש למקם מקדימה את השורה עם התגית הנבחרת';
$string['therewereerrors'] = 'נמצאו שגיאות במידע שלך';
$string['timezoneforced'] = 'אילוץ זה נקבע ע\"י המנהל';
$string['timezoneisforcedto'] = 'אלץ את כל המשתמשים להשתמש';
$string['timezonenotforced'] = 'משתמשים יכולים לבחור את אזור הזמן שלהם';
$string['upgradeforumread'] = 'תכונה חדשה החל מגרסה 1.5 של Moodle מאפשרת למשתמשים לערוב אחרי הודעות שנקראו/לא נקראו בפורומים.<br />לאפשור תכונה זו עליך <a href=\"$a\">לעדכן את טבלאות מסד הנתונים</a>.';
$string['upgradelogs'] = 'להפעלת מלוא היכולות, הדוחות הישנים שלך צריכים להתעדכן. <a href=\"$a\"> מידע נוסף</a>';
$string['upgradelogsinfo'] = 'לאחרונה נעשו מספר שינויים לאופן שבו נשמרים הדוחות. על מנת לאפשר צפיה בדוחות הישנים בחלוקה לפי פעילות, יש לשדרג את הדוחות הישנים שלך. כתלות באתר, פעולה זו יכולה לקחת זמן רב (לדוגמא מספר שעות) ולצרוך הרבה משאבים מבסיס הנתונים של אתרים גדולים. מרגע שהתחלת תהליך זה, רצוי לתת לו לסיים (על ידי השארת חלון הדפדפן פתוח). אל תדאג - אתרך יהיה זמין למבקרים אחרים בזמן שהדוחות מתעדכנים.<br /><br /> האם אתה רוצה לעדכן את דוחותיך עכשיו?';
$string['upgradesure'] = 'קבצי ה-Moodle הישנים שלך שונו, וכעת תוכנת השרת שלך תעודכן באופן אוטומטי לגרסה זו:
<p><b>$a</b></p>
<p>מרגע ביצוע השדרוג לא תוכל לחזור לגרסה קודמת.</p>
<p>האם אתה בטוח ברצונך לשדרג את תוכנת השרת לגרסה זו?</p>';
$string['upgradingdata'] = 'משדרג מידע';
$string['upgradinglogs'] = 'משדרג דוחות';

?>
