<?PHP // $Id$ 
      // block_glossary_random.php - created with Moodle 1.5 ALPHA (2005042300)


$string['addentry'] = 'הוסף מונחים מועדפים משלך!';
$string['askaddentry'] = 'כאשר משתמשים יכולים להוסיף מונחים למילון, הצג קישור עם טקסט זה';
$string['askinvisible'] = 'כאשר משתמשים לא יכולים לערוך או לצפות במילון, הצג טקסט זה (ללא קישור)';
$string['askviewglossary'] = 'כאשר משתמשים יכולים לצפות במילון, אבל לא לערוך את המונחים, הצג קישור עם טקסט זה';
$string['blockname'] = 'מונח אקראי מהמילון';
$string['intro'] = 'עליך לוודא שהוגדר לפחות מילון אחד עם מונח אחד לפחות עבור קורס זה. לאחר מכן, תוכל לשנות את ההגדרות שלהלן';
$string['invisible'] = '(המשך יבוא)';
$string['lastmodified'] = 'המונח האחרון ששונה';
$string['nextone'] = 'המונח הבא';
$string['noentriesyet'] = 'עדיין אין מונחים במילון הנבחר.';
$string['notyetconfigured'] = 'אנא הגדר בלוק זה בעזרת סמל העריכה.';
$string['notyetglossary'] = 'לפחות מילון אחד חייב להיות מוגדר בכדי שתוכל לבחור.';
$string['random'] = 'מונח אקראי';
$string['refresh'] = 'ימים לפני בחירת מונח חדש';
$string['select_glossary'] = 'הצג מונחים ממילון זה';
$string['showconcept'] = 'הצג כותרת עבור כל מונח';
$string['title'] = 'כותרת';
$string['type'] = 'האופן בו נבחר מונח חדש';
$string['typehelp'] = '<b>המונח האחרון ששונה</b> יציג תמיד את המונח האחרון ששונה, ו<b>מונח אקראי</b> יציג מונח אקראי מהמילון שייבחר בכל פעם. האפשרות <b>המונח הבא</b> תאפשר צפייה בכל המונחים לפי הסדר. אפשרות זו שימושים במיוחד כאשר נקבע מספר ימים, מאחר וזה מאפשר ליישם <i>מונח השבוע</i> או <i>מונח היום</i> שכל אחד יכול לראות.';
$string['viewglossary'] = 'מונחים נוספים';
$string['whichfooter'] = 'יש באפשרותך להציג קישורים לפעולות של המילון שבלוק זה מקושר אליו. הבלוק יציג רק קישורים לפעולות שמאופשרות במילון.';

?>
