<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Encuestas disponibles</title>
</head>
<body>
<p align="center"><b>Encuestas disponibles</b></p>
<p>Actualmente s&oacute;lo disponemos de ciertas encuestas, en un
futuro usted
podr&aacute; crear las suyas propias.</p>
<p>Las encuestas incluidas fueron elegidas por ser particularmente
&uacute;tiles para la evaluaci&oacute;n de la educaci&oacute;n en
l&iacute;nea, as&iacute; como para identificar ciertas tendencias que
pueden estar d&aacute;ndose entre sus participantes.
</p>
<hr>
<p><b>COLLES - Constructivist On-Line Learning Environment Survey
(Encuesta sobre Ambiente Constructivista Educativo en L&iacute;nea)</b></p>
<ul>
  <p>El COLLES comprende 24 premisas agrupadas en seis escalas, cada
una de las cuales nos ayuda a formular una pregunta clave sobre la
calidad del ambiente educativo en l&iacute;nea:
  </p>
  <table cellpadding="10" cellspacing="10" border="0">
    <tbody>
      <tr>
        <td valign="top">Relevancia</td>
        <td>&iquest;Qu&eacute; tan importante es la educaci&oacute;n en
l&iacute;nea para la pr&aacute;ctica profesional de los estudiantes? </td>
      </tr>
      <tr>
        <td valign="top">Reflexi&oacute;n</td>
        <td>&iquest;La educaci&oacute;n en l&iacute;nea estimula el
pensamiento cr&iacute;tico reflexivo en los estudiantes? </td>
      </tr>
      <tr>
        <td valign="top">Interactividad</td>
        <td>&iquest;Qu&eacute; tanto se integran los estudiantes en el
di&aacute;logo educativo en l&iacute;nea? </td>
      </tr>
      <tr>
        <td valign="top">Soporte de profesores</td>
        <td>&iquest;Qu&eacute; tan bien habilitan los profesores a sus
alumnos para participar en la educaci&oacute;n en l&iacute;nea? </td>
      </tr>
      <tr>
        <td valign="top">Soporte de los colegas</td>
        <td>El soporte prove&iacute;do por los otros estudiantes,
&iquest;es sensible y estimulante? </td>
      </tr>
      <tr>
        <td valign="top">Interpretaci&oacute;n </td>
        <td>Los estudiantes y los profesores, &iquest;tienen un
apreciaci&oacute;n correcta del otro a trav&eacute;s de la
comunicaci&oacute;n en l&iacute;nea? </td>
      </tr>
    </tbody>
  </table>
  <p>Independientemente de la visi&oacute;n din&aacute;mica del
aprendizaje, es una nueva teor&iacute;a del conocimiento: el
constructivismo social, que asume al estudiante como un
conceptualizador activo dentro del ambiente de aprendizaje social
interactivo. Constructivismo social es una epistemolog&iacute;a, <b>o</b> una
forma de conocer, en la cual los estudiantes colaboran reflexivamente
para co-construir <b>nuevo entendimiento</b>, especialmente dentro del
contexto de la interrogaci&oacute;n mutua basada en su propia
experiencia.</p>
  <p>Para que se d&eacute; esta colaboraci&oacute;n es vital el
desarrollo de la capacidad de comunicaci&oacute;n, es decir, la
habilidad de integrarse en di&aacute;logo abierto y cr&iacute;tico con
sus compa&ntilde;eros y profesores. 

 Este di&aacute;logo se caracteriza por una
enf&aacute;tica orientaci&oacute;n a construir entendimiento
rec&iacute;proco, y por una actitud cr&iacute;tica frente a los
supuestos que subyacen bajo los ex&aacute;menes.</p>
  <p>El COLLES se ha dise&ntilde;ado para habilitarlo para monitorear
su capacidad de explotar la capacidad interactiva del Internet para
integrar estudiantes en un ambiente de pr&aacute;cticas educativas
din&aacute;micas.</p>
  <p>
(Esta informaci&oacute;n se ha adaptado de la p&aacute;gina del COLLES.
Si lo desea, puede encontrar m&aacute;s informaci&oacute;n en:
  <a href="http://surveylearning.com/colles/" target="paper">http://surveylearning.com/colles/</a>)</p>
</ul>
<hr>
<p><b>ATTLS - Attitudes to Thinking and Learning Survey (Encuesta de
Actitud <i>[sobre el]</i> Pensar y Aprender.)</b></p>
<ul>
  <p>La teor&iacute;a de las 'formas de conocer', originaria del campo
de la investigaci&oacute;n de g&eacute;nero (Belenky et al., 1986) nos
ofrece una herramienta para examinar la calidad del discurso dentro de
un ambiente de colaboraci&oacute;n.
  </p>
  <p>La Encuesta de Actitud sobre el Pensar y Aprender (ATTLS) es un instrumento desarrollado por Galiotti et
al. (1999) para medir cu&aacute;nto una persona es un 'conocedor
conectado' (CK, por sus siglas en ingl&eacute;s) o 'conocedor
desconectado' (SK).
  </p>
  <p>Las personas con un CK m&aacute;s alto tienden a disfrutar
m&aacute;s el aprendizaje, y a menudo cooperan m&aacute;s,
son congeniales, y tienen m&aacute;s libertad para construir sobre ideas ajenas,
mientras que aquellos con SK m&aacute;s altos tienden a tomar una
actitud de aprendizaje m&aacute;s cr&iacute;tica y argumentativa.
  </p>
  <p>Estudios han mostrado que estos dos estilos de aprendizaje son
independientes uno del otro (Galotti et al., 1999; Galotti et al., 2001).
Adem&aacute;s, s&oacute;lo son reflejo de actitudes al
aprendizaje, y no de
las capacidades para aprender ni de capacidades intelectuales.
  </p>
  <p><i>Belenky, M. F., Clinchy, B. M., Goldberger, N. R., &amp;
Tarule, J. M. (1986). Women's Ways of Knowing: The Development of Self,
Voice, and Mind. New York: Basic Books, Inc. </i></p>
  <p><i>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., &amp;
Mansfield, A. F. (1999). A New Way of Assessing Ways of Knowing: The
Attitudes Towards Thinking and Learning Survey (ATTLS). Sex Roles,
40(9/10), 745-766.</i></p>
  <p><i>Galotti, K. M., Reimer, R. L., &amp; Drebus, D. W. (2001). Ways
of knowing as learning styles: Learning MAGIC with a partner. Sex
Roles, 44(7/8), 419-436.</i></p>
</ul>
</body>
</html>
