<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
</head>
<body>
<div style="text-align: center;"><span style="font-weight: bold;">&Eacute;valuation
des attitudes objectives et empathiques dans les messages des forums</span><br>
</div>
<p>Chaque message peut &ecirc;tre &eacute;valu&eacute; en fonction d'un
bar&egrave;me bas&eacute; sur une th&eacute;orie qui traite de la
relation que l'apprenant entretient avec son entourage et ce qu'il doit
apprendre&nbsp;: il peut adopter une attitude empathique ou objective (<span
 style="font-weight: bold;">Theory of separate and connected knowing</span>).
Cette th&eacute;orie peut vous aider &agrave; voir les interactions
humaines sous un nouvel angle. Elle d&eacute;crit deux mani&egrave;res
diff&eacute;rentes que nous avons pour &eacute;valuer et pour nous
renseigner sur les choses que nous voyons et que nous entendons. Chacun
de nous peut employer alternativement ces deux attitudes ou les
employer toutes deux en m&ecirc;me temps, mais &agrave; des
degr&eacute;s divers, selon les situations. </p>
<p>D&eacute;crivons deux apprenants fictifs pour illustrer cette
fa&ccedil;on d'aborder les interactions humaines. Chacun adopte la
plupart du temps l'attitude qui les caract&eacute;rise&nbsp;:</p>
<ul>
  <li>S&eacute;bastien pr&eacute;f&egrave;re adopter une attitude <span
 style="font-weight: bold;">objective</span>, en ne faisant pas
intervenir ses sentiments et ses &eacute;motions. Dans une discussion,
lorsque ses id&eacute;es diff&egrave;rent de celles des autres, il aime
d&eacute;fendre les siennes en utilisant la logique pour pointer les
failles dans les arguments de ses interlocuteurs. Il est critique et
m&ecirc;me sceptique face &agrave; de nouvelles id&eacute;es &agrave;
moins qu'elles ne soient appuy&eacute;es par des faits
v&eacute;rifiables provenant de livres, de professeurs ou &agrave;
partir de ses propres exp&eacute;riences. <span
 style="font-weight: bold;">S&eacute;bastien ne s'investit donc pas
&eacute;motionnellement dans ce qu'il apprend et des autres; il est
tr&egrave;s d&eacute;tach&eacute;.</span></li>
  <li>Martine est d'abord <span style="font-weight: bold;">empathique </span>(sensible)
aux autres. Elle per&ccedil;oit facilement ce que les autres
ressentent. Tout naturellement, elle pr&eacute;f&egrave;re
&eacute;couter et poser des questions aux autres jusqu'&agrave; ce
qu'elle sente qu'elle comprend les choses de leur point de vue. Elle
apprend par le partage des exp&eacute;riences de ses interlocuteurs,
exp&eacute;riences qui ont men&eacute; &agrave; leurs apprentissages.
En parlant &agrave; d'autres, elle &eacute;vite la confrontation et
essaie souvent d'aider l'autre personne si elle en voit la
possibilit&eacute;, en utilisant des suggestions logiques<span
 style="font-weight: bold;">. Martine est tr&egrave;s sensible et
tr&egrave;s li&eacute;e au groupe et aux apprentissages</span>. </li>
</ul>
<p>Avez-vous remarqu&eacute; dans ces exemples que l'apprenant
d&eacute;tach&eacute; est masculin et que l'apprenant li&eacute; est
f&eacute;minin? Des &eacute;tudes ont prouv&eacute; statistiquement que
c'est le cas la plupart du temps. Toutefois, il faut comprendre que
nous nous d&eacute;pla&ccedil;ons tous entre ces deux
extr&eacute;mit&eacute;s en fonction des situations et de notre
cheminement personnel. Il est pr&eacute;f&eacute;rable que les
apprenants puissent adopter les deux attitudes face au groupe et
&agrave; ce qu'ils doivent apprendre. Ils pourront ainsi mieux
collaborer et &ecirc;tre plus efficaces dans leurs apprentissages. </p>
<p>On retrouve l'une ou l'autre de ces attitudes ou m&ecirc;me les deux
en m&ecirc;me temps dans les messages publi&eacute;s dans les forums.
Un &eacute;tudiant g&eacute;n&eacute;ralement tr&egrave;s sensible et
tr&egrave;s li&eacute; peut poster un message o&ugrave; il
d&eacute;montre une attitude inverse. Et vice versa. </p>
<p>On poursuit les buts suivants dans l'&eacute;valuation des messages
dans les forums avec le bar&egrave;me propos&eacute;&nbsp;:</p>
<ul>
  <li>D&eacute;velopper la capacit&eacute; &agrave; d&eacute;tecter les
attitudes de l'auteur du message.</li>
  <li>Fournir une r&eacute;troaction &agrave; chaque auteur de message
sur la fa&ccedil;on dont il est per&ccedil;u par les autres </li>
</ul>
<p>Ces r&eacute;troactions ne servent pas &agrave; l'&eacute;valuation
sommative des &eacute;tudiants, aucune note &eacute;tant
accord&eacute;e &agrave; celle-ci. Ils permettent d'am&eacute;liorer la
communication afin d'augmenter la collaboration et les apprentissages. </p>
<hr style="width: 100%; height: 2px;">
<p>Voici quelques r&eacute;f&eacute;rences sur des articles ou des
documents publi&eacute;s par les auteurs qui ont
d&eacute;velopp&eacute; cette th&eacute;orie:</p>
<ul>
  <li>Belenky, M.F., Clinchy, B.M., Goldberger, N.R., &amp; Tarule,
J.M. (1986). Women's ways of knowing: the development of self, voice,
and mind. New York, NY: Basic Books.</li>
  <li>Clinchy, B.M. (1989a). The development of thoughtfulness in
college women: Integrating reason and care. American Behavioural
Scientist, 32(6), 647-657.</li>
  <li>Clinchy, B.M. (1989b). On critical thinking &amp; connected
knowing. Liberal education, 75(5), 14-19.</li>
  <li>Clinchy, B.M. (1996). Connected and separate knowing; Toward a
marriage of two minds. In N.R. Goldberger, Tarule, J.M., Clinchy, B.M.
&amp;</li>
  <li>Belenky, M.F. (Eds.), Knowledge, Difference, and Power; Essays
inspired by &#8220;Women&#8217;s Ways of Knowing&#8221; (pp. 205-247). New York, NY:
Basic Books.</li>
  <li>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., &amp;
Mansfield, A. F. (1999). A New Way of Assessing Ways of Knowing: The
Attitudes Towards Thinking and Learning Survey (ATTLS). Sex Roles,
40(9/10), 745-766.</li>
  <li>Galotti, K. M., Reimer, R. L., &amp; Drebus, D. W. (2001). Ways
of knowing as learning styles: Learning MAGIC with a partner. Sex
Roles, 44(7/8), 419-436. <br>
  </li>
</ul>
</body>
</html>
