<p align="center"><b>Att ladda upp en bild</b></p>

<p>
Du kan ladda upp en bild fr&aring;n Din dator till den h&auml;r servern.
Denna bild kommer att anv&auml;ndas i olika sammanhang f&ouml;r att 
representera Dig.
</p>
<p>
Av den h&auml;r anledningen &auml;r det b&auml;st med en
n&auml;rbild p&aring; Ditt ansikte, men Du kan anv&auml;nda vilken bild Du vill.
</p><p>
Bilden m&aring;ste vara i JPG- eller PNG-format (dvs filnamnen slutar vanligtvis p&aring; .jpg eller .png).
</p><p>
Du kan skapa en bildfil med en av de fyra nedanst&aring;ende metoderna:
</p>
<ol>
<li>Du kan anv&auml;nda en digital kamera, vilket inneb&auml;r att Dina bilder
sannolikt redan finns i Din dator och i r&auml;tt format.</li>
<li>Du kan anv&auml;nda en scanner f&ouml;r att scanna en pappersbild.  
Se till att Du sparar den i JPG- eller PNG-format.</li>
<li>Om Du &auml;r konstn&auml;rligt lagd s&aring; kan Du kanske teckna en bild 
med hj&auml;lp av ett grafiskt program.</li>
<li>Slutligen kan Du 'stj&auml;la' bilder fr&aring;n webben. 
<a target="google" href="http://images.google.com/">http://images.google.com</a> 
&auml;r en superb plats att leta efter bilder p&aring;. N&auml;r Du v&auml;l har funnit
en kan Du 'h&ouml;gerklicka' p&aring; den med musen och v&auml;lja 'Spara bild' fr&aring;n
menyn. Det kan skilja sig lite fr&aring;n dator till dator hur man g&ouml;r.</li>
</ol>

<p>
F&ouml;r att ladda upp bilden ska Du klicka p&aring; 'Bl&auml;ddra'-knappen
p&aring; den h&auml;r sidan och v&auml;lja bilden fr&aring;n Din h&aring;rddisk.
</p><p>

OBS! F&ouml;rvissa Dig om att filen inte &auml;r st&ouml;rre an
den angivna maxstorleken, annars laddas den inte upp. 
</p><p>
Klicka sedan p&aring; 'Uppdatera profil' l&auml;ngst ner -
bilden kommer att formas om till en kvadrat och skalas ner till en storlek av 
100x100 pixlar.
</p><p>
N&auml;r Du kommer till Din personliga presentationssida kanske det visar sig att bilden inte
har &auml;ndrats. Om det skulle vara s&aring; beh&ouml;ver Du bara anv&auml;nda funktionen
'Ladda om sidan' i Din webbl&auml;sare.
