<p align="center"><b>Fr&aring;gor</b></p>

<p>
Ett bra s&auml;tt att hj&auml;lpa andra m&auml;nniskor att 
reflektera kring ett &auml;mne &auml;r att st&auml;lla fr&aring;gor
till dem. Om vi st&auml;lls inf&ouml;r en bra fr&aring;ga s&aring; 
blir det l&auml;ttare att samla information, utv&auml;rdera v&aring;ra 
hittillsvarande id&eacute;er och skapa nya.
</p>

<p>
Att st&auml;lla fr&aring;gor som &auml;r specifikt avsedda
att stimulera andras l&auml;rande kallas <i>Sokratiska fr&aring;gor</i>, efter
Sokrates i det antika Grekland.
</p>

<p>
Sokratiska fr&aring;gor kr&auml;ver att Du lyssnar mycket noga p&aring;
den Andre. Det hj&auml;lper Dig att bed&ouml;ma dennes behov och att formulera Din fr&aring;ga
p&aring; ett hj&auml;lpsamt, konstruktivt och p&aring; ett,  f&ouml;rhoppningsvis,
inte  konfronterande s&auml;tt.
</p>
<p>
H&auml;r &auml;r n&aring;gra exempel p&aring; den h&auml;r typen av fr&aring;gor:
</p>

<!--Hidden comment: Someday I will include a great example dialogue here -->

<h3>Klarg&ouml;rande fr&aring;gor</h3>
<ul>
  <li>Vad menar Du n&auml;r du s&auml;ger ______?</li>
  <li>Vilken &auml;r Din huvudpo&auml;ng?</li>
  <li>Hur kopplar Du  _____ till _____?</li>
  <li>Kan Du formulera det p&aring; n&aring;got annat s&auml;tt?</li>
  <li>F&aring; se om jag har f&ouml;rst&aring;tt Dig r&auml;tt; menar Du att _____ eller _____?</li>
  <li>Hur kopplar Du detta till v&aring;rt problem/diskussion/&auml;mne?</li>
  <li>Anna, kan Du summera i egna ord det som Richard sade? ... Richard, &auml;r det det h&auml;r Du menade?</li>
  <li>Kan Du ge mig ett exempel?</li>
  <li>Skulle _____ vara ett bra exempel p&aring; det?</li>
</ul>
<h3>Fr&aring;gor som testar antaganden</h3>
<ul>
  <li>Vad &auml;r det Du antar h&auml;r?</li>
  <li>Vad &auml;r det Anna antar?</li>
  <li>Vad skulle vi kunna anta ist&auml;llet?</li>
  <li>Du verkat utg&aring;r ifr&aring;n att _____. Har jag f&ouml;rst&aring;tt Dig r&auml;tt?</li>
  <li>Hela Ditt resonemang bygger p&aring; tanken att _____. Varf&ouml;r grundar Du Ditt resonemang p&aring; _____ ist&auml;llet f&ouml;r _____?</li>
  <li>Du verkar utg&aring; ifr&aring;n att _____. Hur f&ouml;rsvarar Du att Du tar det f&ouml;r givet?</li>
  <li>&Auml;r det alltid s&aring;? Varf&ouml;r tror Du att detta antagande g&auml;ller h&auml;r?</li>
  <li>Varf&ouml;r skulle man utg&aring; fr&aring;n det? </li>
</ul>
<h3>Fr&aring;gor som testar orsaker och bevis</h3>
<ul>
  <li>Kan Du f&ouml;rklara hur Du ser p&aring; orsakerna?</li>
  <li>P&aring; vilket s&auml;tt &auml;r detta m&ouml;jligt att till&auml;mpa p&aring; det h&auml;r fallet?</li>
  <li>Finns det n&aring;gon orsak att tvivla p&aring; detta bevis?</li>
  <li>Vem kan antas veta att detta &auml;r sant?</li>
  <li>Vad skulle Du s&auml;ga om n&aring;gon sade att ____?</li>
  <li>Kan n&aring;gon annan anf&ouml;ra bevis som st&ouml;djer den uppfattningen?</li>
  <li>Hur har Du resonerat f&ouml;r att komma fram till den slutsatsen?</li>
  <li>Hur kan vi ta reda p&aring; om detta &auml;r sant? </li>
</ul>
<h3>Fr&aring;gor om st&aring;nd/synpunkter och perspektiv </h3>
<ul>
  <li>Vad vill Du s&auml;ga med det?</li>
  <li>N&auml;r Du s&auml;ger att _____, vill Du d&aring; med det s&auml;ga att _____?</li>
  <li>Men, om det skulle intr&auml;ffa, vad skulle d&aring; i &ouml;vrigt intr&auml;ffa som en konsekvens av det? Varf&ouml;r?</li>
  <li>Vilken effekt skulle det f&aring;?</li>
  <li>Skulle det intr&auml;ffa med n&ouml;dv&auml;ndighet eller bara m&ouml;jligen/antagligen?</li>
  <li>Vad finns det f&ouml;r alternativ?</li>
  <li>Om _____ och _____ f&ouml;religger, vad skulle d&aring; ocks&aring; kunna vara sant?</li>
  <li>Om vi s&auml;ger att ____ &auml;r etiskt, vad inneb&auml;r det f&ouml;r _____? </li>
</ul>
<h3>Fr&aring;gor som testar implikationer and konsekvenser</h3>
<ul>
  <li>Hur kan vi ta reda p&aring; det?</li>
  <li>Vad grundar sig denna fr&aring;ga p&aring;?</li>
  <li>Skulle _____ st&auml;lla den h&auml;r fr&aring;gan p&aring; ett annat s&auml;tt?</li>
  <li>Hur skulle n&aring;gon kunna klara ut den h&auml;r fr&aring;gan?</li>
  <li>Kan vi &ouml;verhuvudtaget analysera denna fr&aring;ga i mindre best&aring;ndsdelar?</li>
  <li>&Auml;r den h&auml;r fr&aring;gan klar? F&ouml;rst&aring;r vi den?</li>
  <li>&Auml;r den h&auml;r fr&aring;gan l&auml;tt eller sv&aring;r att besvara? Varf&ouml;r?</li>
  <li>&Auml;r vi alla &ouml;verens om att detta &auml;r fr&aring;gan?</li>
  <li>Vilka andra fr&aring;gor m&aring;ste vi f&ouml;rst besvara innan vi kan besvara den h&auml;r fr&aring;gan?</li>
  <li>Hur skulle _____ beskriva &auml;mnet?</li>
  <li>Varf&ouml;r &auml;r den h&auml;r fr&aring;gan viktig?</li>
  <li>&Auml;r det h&auml;r den viktigaste fr&aring;gan, eller finns det en underf&ouml;rst&aring;dd fr&aring;ga?</li>
  <li>Kan Du se hur den h&auml;r fr&aring;gan skulle kunna vara kopplad till ________?</li>
</ul>

<hr />
<i>Fr&aring;gorna &auml;r inspirerade av Paul, R. (1993). Critical Thinking: How To Prepare Students for a Rapidly Changing World: Foundation for Critical Thinking, Santa Rosa, CA. </i>

<p align="right"><a href="help.php?file=writing.html">Mer info om att skriva</a></p>
<p align="right"><a href="help.php?file=reading.html">Mer info om att l&auml;sa</a></p>
