<p align="center"><b>Tillg&auml;ngliga enk&auml;ter</b></p>

<p>
F n erbjuder Moodle bara specifika typer av enk&auml;ter (i framtida versioner
kommer Du att kunna skapa Dina egna).
</p>

<p>
De tillg&auml;ngliga enk&auml;terna har valts ut f&ouml;r att de &auml;r s&auml;rskilt 
anv&auml;ndbara n&auml;r Du utv&auml;rderar webbaserade l&auml;romilj&ouml;er som 
utg&aring;r fr&aring;n social konstruktivism som pedagogisk teori.
De &auml;r bra p&aring; att visa p&aring; vissa trender som kan s&auml;ga intressanta
saker om Dina l&auml;rande.

(Om Du vill se en rapport d&auml;r dessa enk&auml;ter har anv&auml;nts
f&ouml;r en detaljerad analys s&aring; kan Du titta p&aring;:  
<a target="paper" href="http://dougiamas.com/writing/herdsa2002">http://dougiamas.com/writing/herdsa2002</a>)</p>
</p>
<hr />
<p><b>COLLES - Constructivist On-Line Learning Environment Survey - 
<br />
Konstruktivistiskt inriktad enk&auml;t ang en n&auml;tbaserad l&auml;romilj&ouml;</b></p>
<ul>
  <p>
  Enk&auml;ten COLLES inneh&aring;ller 24 p&aring;st&aring;enden som &auml;r 
  grupperade i sex skalor. Var och en av dessa skalor hj&auml;lper oss att
  st&auml;lla kritiska fr&aring;gor om en viss aspekt p&aring; kvaliteterna i 
  den n&auml;tbaserade l&auml;romilj&ouml;n:
    </p>

<table border="0" cellspacing="10" cellpadding="10">
  <tr> 
    <td valign="top"><b>Relevans</b></td>
    <td>
	Hur relevant &auml;r n&auml;tbaserat l&auml;rande f&ouml;r de l&auml;randes
	yrkespraktik?
    </td>
  </tr>
  <tr> 
    <td valign="top"><b>Reflektion</b> </td>
    <td>
	Stimulerar n&auml;tbaserat l&auml;rande de l&auml;randes reflektiva, kritiska t&auml;nkande?
    </td>
  </tr>
  <tr> 
    <td valign="top"><b>Interaktivitet</b> </td>
    <td>
	I vilken omfattning engagerar sig de l&auml;rande i en (pedagogiskt) rikt 
	utvecklande dialog? 
    </td>
  </tr>
  <tr> 
    <td valign="top"><b>Pedagogisk support</b></td>
    <td>
	Hur framg&aring;ngsrik &auml;r den pedagogiska supporten n&auml;r det g&auml;ller att
	st&ouml;dja de l&auml;rande i den n&auml;tbaserade l&auml;romilj&ouml;n?
	</td>
  </tr>
  <tr> 
    <td valign="top"><b>St&ouml;d fr&aring;n andra l&auml;rande</b> </td>
    <td>
	St&auml;ller de l&auml;rande upp med f&ouml;rst&aring;ndigt och uppmuntrande 
	st&ouml;d i den n&auml;tbaserade l&auml;romilj&ouml;n?
	 </td>
  </tr>
  <tr> 
    <td valign="top"><b>Tolkning</b></td>

    <td>
	Har de l&auml;rande och distansl&auml;rarna en god f&ouml;rst&aring;else av varandras
	s&auml;tt att kommunicera i den n&auml;tbaserade l&auml;romilj&ouml;n?
	</td>
  </tr>
</table>

  <p>
  Social konstruktivism utg&aring;r fr&aring;n en dynamisk uppfattning om l&auml;rande
  och det &auml;r en ny teori om vetande. S K beskriver den l&auml;rande som en person som,
  inom ramen f&ouml;r en interaktiv l&auml;romilj&ouml;, aktivt bildar begrepp. S K &auml;r en 
  epistemologi, eller ett s&auml;tt att veta (kunna), d&auml;r de l&auml;rande samarbetar medelst
  reflektivt t&auml;nkande i syfte att tillsammans konstruera nya s&auml;tt att uppfatta och f&ouml;rst&aring;,
  s&auml;rskilt i ett sammanhang d&auml;r de gemensamt utforskar n&aring;got som &auml;r grundat i 
  deras personliga erfarenhet.
 </p>

  <p>
  Grundl&auml;ggande f&ouml;r detta samarbete &auml;r att man utvecklar de l&auml;randes
  kommunikativa kompetens, dvs, f&ouml;rm&aring;gan att ge sig in i en &ouml;ppen och 
  kritisk diskurs b&aring;de med distansl&auml;raren och med de andra l&auml;rande.
  Denna diskurs karakteriseras av en empatisk inriktning gentemot att konstruera en
  &ouml;msesidig f&ouml;rst&aring;else och en kritisk attityd n&auml;r det g&auml;ller att
  unders&ouml;ka underliggande antaganden.
  </p>
  <p>
  COLLES har utformats f&ouml;r att g&ouml;ra det m&ouml;jligt f&ouml;r Dig
 att &ouml;vervaka i vilken omfattning Du kan utnyttja den interaktiva potentialen
 hos WWW f&ouml;r att f&aring; de l&auml;rande att engagera sig i dynamiska l&auml;roprocesser.
  </p>
<p>
Den h&auml;r informationen har l&aring;nats, fr&aring;n 'COLLES'-sidan, och anpassats.
Du kan hitta med information om COLLES och dess f&ouml;rfattare hos: 
<a target="paper" href="http://surveylearning.com/colles/">http://surveylearning.com/colles/</a>)</p>
</ul>


<hr />
<p><b>ATTLS - Attitudes to Thinking and Learning Survey
<br />
ATTLS - Enk&auml;t ang attityder kring t&auml;nkande och l&auml;rande
</b></p>


<p>
ATTLS &auml;r en teori om 's&auml;tt att veta (kunna)', och ett begrepp som ursprungligen utvecklats
inom genusteorin (Beleny et al., 1986). ATTLS har givit oss ett verktyg f&ouml;r enk&auml;ter 
som vi kan anv&auml;nda f&ouml;r att utforska kvaliteten p&aring; en diskurs inom ramen
f&ouml;r en samarbetsinriktad milj&ouml;.
</p>
<p>
Enk&auml;ten ang attityder kring t&auml;nkande och l&auml;rande &auml;r ett 
verktyg som utvecklats av Galotti et al. (1999) f&ouml;r att m&auml;ta i vilken 
utstr&auml;ckning en person &auml;r en 'socialt (empatiskt) inriktad vetare (kunskapshavare)'
eller en 'enskilt (rationellt) inriktad' s&aring;dan.
</p>
<p>
M&auml;nniskor med h&ouml;gre grad av 'socialt (empatisk)' inriktning tenderar att 
att uppfatta l&auml;rande som mer bel&ouml;nande och &auml;r mer samarbetsinriktade, 
l&auml;tta att ha att g&ouml;ra med och &auml;r mer intresserade av att bygga vidare p&aring; 
andras id&eacute;er &auml;n 'separat (rationellt)' inriktade m&auml;nniskor. De senare 
har &aring; andra sidan en mer kritisk och argumenterande inst&auml;llning till l&auml;rande.
</p>
<p>
Studier har visat att dessa tv&aring; olika inl&auml;rningsstilar &auml;r oberoende
av varandra. (Galotti et al., 1999; Galotti et al., 2001). D&auml;rtill reflekterar de
bara inst&auml;llningar till l&auml;rande, inte inl&auml;rningskapacitet eller intellektuell
f&ouml;rm&aring;ga.
</p>
<p><i>Belenky, M. F., Clinchy, B. M., Goldberger, N. R., & Tarule, J. M. (1986). Women's Ways of Knowing: The Development of Self, Voice, and Mind. New York: Basic Books, Inc. </i></p>
</p>
<p><i>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., & Mansfield, A. F. (1999). A New Way of Assessing Ways of Knowing: The Attitudes Towards Thinking and Learning Survey (ATTLS). Sex Roles, 40(9/10), 745-766.</i></p>
</p>
<p><i>Galotti, K. M., Reimer, R. L., & Drebus, D. W. (2001). Ways of knowing as learning styles: Learning MAGIC with a partner. Sex Roles, 44(7/8), 419-436.</i></p>
</p>


