<p align="center"><b>Att formatera text</b></p>
<p>
N&auml;r Du skriver text i Moodle s&aring; finns det ett flertal format 
som Du kan v&auml;lja f&ouml;r att formatera text p&aring;, beroende p&aring; vad Du kan
och vilken typ av webbl&auml;sare Du anv&auml;nder.
</p>
<p><b>
I vanliga fall kan Du bara l&aring;ta den h&auml;r inst&auml;llningen vara
och saker och ting b&ouml;r fungera ungef&auml;r som Du f&ouml;rv&auml;ntar Dig
</b>.
</p>
<p><b>1. Moodles autoformat</b></p>
</p>

<p>
Det h&auml;r formatet &auml;r b&auml;st n&auml;r Du anv&auml;nder
vanliga webbformul&auml;r f&ouml;r att skriva in n&aring;got (ist&auml;llet f&ouml;r
Richtext-redigeraren). Skriv bara in text som vanligt, som om Du skrev ett 
e-postmeddelande.
</p>
<p>
N&auml;r Du sparar text kommer Moodle att g&ouml;ra ett antal saker f&ouml;r att automatiskt
formatera texten &aring;t Dig.
</p>
<p>URL:er som t ex: 
   <a href="http://yahoo.com/">http://yahoo.com</a> eller t o m 
   <a href="http://www.yahoo.com/">www.yahoo.com</a> kommer att omvandlas till l&auml;nkar.
</p>
<p>
Dina radbrytningar &auml;ndras inte och tomma rader kommer att inleda nya stycken.
</p>
<p>Teckenkodade 'smilies' s&aring;som :-) kommer automatiskt att omvandlas till en grafisk bild.
</p>
<p>
Du kan t o m l&auml;gga in HTML-kod om Du vill och den kommer inte att &auml;ndras.
</p>
<p align="right"><a href="help.php?file=text.html">Mer info om Moodles autoformat</a></p>

<p><b>2. HTML format</b></p>
<p>
Det h&auml;r formatet utg&aring;r fr&aring;n att texten &auml;r ren HTML-kod.
Om Du anv&auml;nder en HTML-redigerare f&ouml;r att redigera texten s&aring; &auml;r detta
standardformatet - alla kommandon p&aring; verktygsraden skapar HTML &aring;t Dig.
</p>
<p>
&Auml;ven om Du inte anv&auml;nder Richtext-redigeraren s&aring; kan Du anv&auml;nda
HTML-kod i Din text och den b&ouml;r visas exakt s&aring; som Du har t&auml;nkt Dig.
</p>
<p>

Till skillnad fr&aring;n Moodles autoformat s&aring; sker ingen automatisk formatering.
<p align="right"><a href="help.php?file=html.html">Mer info om HTML i Moodle</a></p>
<p align=right><a href="help.php?file=richtext.html">Mer info om Richtext HTML-redigeraren</a></p>
<p><b>3. Rent textformat</b></p>

<p>
Detta format &auml;r bra n&auml;r Du beh&ouml;ver l&auml;gga in mycket HTML-kod
som Du vill ska visas precis s&aring; som Du har skrivit den.
</p>
<p>
Det &ouml;vers&auml;tter fortfarande teckenkodade 'smilies' och nya rader
men i &ouml;vrigt s&aring; &auml;ndras inte Din text.
</p>
<p><b>4. Wiki textformat</b></p>

<p>
Det h&auml;r formatet anv&auml;nder ett speciellt s&auml;tt att skriva in text
som kallas Wiki-format.
</p>
<p>
Detta format l&aring;ter Dig skriva in text som fortfarande ser v&auml;ldigt l&auml;sbar ut 
men den kan ocks&aring; automatiskt omvandlas till HTML-text med rubriker, listor och annan
komplex formatering.
</p>
<p align="right"><a href="help.php?file=wiki.html">Mer info om Wiki-formatet</a></p>


