<head>
    
<title>Futuro</title>
	
<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS">
    
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF">

<h1>Futuro</h1>
<blockquote>
  <p>Seg&uacute;n Moodle va madurando, su evoluci&oacute;n cada vez est&aacute; m&aacute;s
    influenciada por la comunidad de desarrolladores y usuarios. Una base de
    datos din&aacute;mica de
    nuevas funcionalidades y su estado puede consultarse en <a target="_top" href="http://moodle.org/bugs/">moodle.org/bugs</a>.
   Tus <a href="?file=credits.html">contribuciones</a> en la forma de ideas,
   c&oacute;digo, informaci&oacute;n de uso y promoci&oacute;n son absolutamente
   bienvenidas - consulta el <a href="?file=developer.html">Manual del Desarrollador</a> y
   los <a href="http://moodle.org/help" target="_top">foros de la comunidad</a> para
   m&aacute;s detalles.
   Tambi&eacute;n puedes pagar para que algunas funcionalidades se desarrollen
   m&aacute;s r&aacute;pidamente
   - consulta <a href="http://moodle.com/development/" target="_top">moodle.com/development</a> para
   m&aacute;s informaci&oacute;n y contacto. </p>
  <p>Aqu&iacute; est&aacute; nuestra visi&oacute;n actual sobre el futuro de
    Moodle, teniendo siempre en cuenta que todo est&aacute; sujeto a cambio dependiendo
    de los <a href="http://moodle.org/donations/" target="_blank">patrocinadores</a>    y
    de los <a href="/?file=credits.html">desarrolladores</a>. </p>
  <h3>Versi&oacute;n 1.5  - Febrero 2005</h3>
  <blockquote>
    <p>Esta versi&oacute;n se centrar&aacute; principalmente en los aspectos de visualizaci&oacute;n,
      haciendo Moodle completamente compatible con importantes est&aacute;ndares de
      accesibilidad web como  WAI
      (W3C), SENDA (UK) and Section 508 (US). </p>
    <p>El c&oacute;digo de visualizaci&oacute;n ser&aacute; compatible con XHTML Transitional 1.0,
      y el uso de CSS ha sido mejorado y extendido para brindar a los dise&ntilde;adores
      un control absoluto sobre la apariencia de sus sitios. Esta versi&oacute;n todav&iacute;a
      no utilizar&aacute; plantillas.</p>
    <p>Incluir&aacute; tambi&eacute;n una larga lista de nuevas funcionalidades como:</p>
    <ul>
     <li> Funcionalidad de Mensajer&iacute;a Instant&aacute;nea para comunicaciones directas.</li>
      <li>Grandes mejoras en el m&oacute;dulo Cuestionario, incluyendo: cuestionarios
        paginados con un numero de preguntas por p&aacute;gina, renovada interface de
        creaci&oacute;n de cuestionarios, categorias anidadas.</li>
      <li>Nuevo formato de bloques, permitiendo m&uacute;ltiples copias de blocks y
        una mejor configuraci&oacute;n de los mismos (los bloques antiguos desarrollados
        por terceros necesitar&aacute;n ser actualizados, mira los documentos en el
        dicectorio de los bloques).</li>
      <li>Integraci&oacute;n con LDAP ampliada, de tal forma que por LDAP se puede controlar
        la creaci&oacute;n de cursos, tareas por grupos, sincronizaci&oacute;n de usuarios,
        etc.</li>
      <li>Algunos campos del usuario pueden ser bloqueados por el administrador.</li>
      <li>Renovada funcionalidad de subida de ficheros con soporte para la detecci&oacute;n
        de virus autom&aacute;tica utilizando ClamAV.</li>
      <li> M&aacute;s efciente interface para los m&oacute;dulos Taller y Lecci&oacute;n.</li>
      <li> Nuevo filtro para convertir todos los textos suministrados por los
        usuarios a XHTML.</li>
      <li> M&oacute;dulo de autenticaci&oacute;n.</li>
      <li> Las sesiones pueden ser almacenadas en la base de datos (&uacute;til para
        clusters de Moodle).</li>
      <li>P&aacute;gina de aceptaci&oacute;n de pol&iacute;ticas del sitio para los usuarios.</li>
      <li>Muchas otras mejoras y problemas solucionados.</li>
    </ul>
  </blockquote>
  <h3>Versi&oacute;n 1.6 - mediados de 2005 </h3>
   <blockquote>
    <p>Mucha de las p&aacute;ginas principales en esta versi&oacute;n podr&aacute;n ser utilizadas
      utilizando plantillas HTML.</p>
    <p>Soporte para Blogs de usuarios (reemplazando a los Diarios).</p>
    <p>P&aacute;gina &quot;Mi Moodle&quot;</p>
    <p>Mejoras en la estructuraci&oacute;n y mantenimiento de flujo de los cursos.</p>
    <p>&nbsp;</p>
  </blockquote>
  <h3>Versi&oacute;n 2.0 - m&aacute;s adelante en 2005</h3>
  <blockquote>
    <p>Esta versi&oacute;n incluir&aacute; algunos excitantes desarrollos haciendo que Moodle
      est&eacute; m&aacute;s orientado al trabajo en red, con una evoluci&oacute;n natural de Moodle
      haciendo hincapi&eacute; en la colaboraci&oacute;n. M&aacute;s sobre esto aqu&iacute; m&aacute;s adelante.</p>
  </blockquote>
</blockquote>
<p align="CENTER">&nbsp;</p>
<p align="CENTER"><font size="1"><a href="." target="_top">Documentaci&oacute;n Moodle</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>
</body>
