<h2>A futuro</h2>

<p>Yo me he comprometido a continuar trabajando en Moodle y a

mantenerla abierta y libre. Estoy profundamente convencido de la

importancia de la educaci&oacute;n libre y del valor de la

ense&ntilde;anza, y Moodle es la mejor forma que tengo de contribuir a

esos ideales.</p>

<p>En la medida en que Moodle vaya ganando madurez, espero que su

direcci&oacute;n sea m&aacute;s influida por la comunidad de

desarrolladores y usuarios. Puede verse una base de datos que contiene

las caracter&iacute;sticas propuestas y su estado en <a

 href="http://bugs.moodle.org/" target="_top">bugs.moodle.org</a>.  

Su <a href="developer.html">contribuci&oacute;n</a> en forma de ideas,

c&oacute;digo, observaciones y promoci&oacute;n es muy bienvenida.</p>

<p>Hasta cerca del mes de abril de 2003, mi propia participaci&oacute;n

ir&aacute; descendiendo mientras termino mi tesis doctoral. Durante

este tiempo seguir&aacute; habiendo nuevas versiones, pero s&oacute;lo

contendr&aacute;n nuevas caracter&iacute;sticas menores y arreglos de

fallos. Tambi&eacute;n incluir&eacute; m&oacute;dulos y otro tipo de

c&oacute;digo desarrollado como contribuci&oacute;n por parte de otras

personas.</p>

<p>Tras este per&iacute;odo, m&aacute;s o menos para junio o julio de

2003, espero lanzar la versi&oacute;n 2.0 de Moodle que incluir&aacute;

nuevas e importantes caracter&iacute;sticas tales como:</p>

<ul>

  <li>Apoyo pedag&oacute;gico consistente tanto para profesores como

para alumnos.</li>

  <li>Apoyo para grupos y trabajo en grupo.</li>

  <li>Reescritura de toda la presentaci&oacute;n incorporando XML, XSL

y CSS para tener completa flexibilidad y compatibilidad con todos los

est&aacute;ndares actuales.</li>

  <li>Soporte b&aacute;sico para IMS y SCORM</li>

  <li>Varios nuevos m&oacute;dulos (chat, registro, etc.)</li>

  <li>Cualquier cosa que parezca importante en ese momento <abbr

 title="sonrisa">:-)</abbr></li>

</ul>

<p>Para entonces tambi&eacute;n estar&eacute; experimentando maneras de

conseguir que el desarrollo de Moodle sea m&aacute;s sostenible a largo

plazo. Esto podr&iacute;a incluir la oferta de servicios previo pago,

aunque el software en s&iacute; mismo seguir&aacute; siendo gratuito.</p>

<p style="text-align: center; font-size: 0.7em;">&nbsp;</p>

<p style="text-align: center; font-size: 0.7em;"><a href="."

 target="_top">Documentaci&oacute;n de Moodle</a></p>

<p style="text-align: center; font-size: 0.7em;">Version: $Id:

future.html,v 1.2 2003/01/28 03:06:52 moodler Exp $</p>