<head>
    
<title>Futuro</title>
	
<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS">
    
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF">

<h1>Futuro</h1>
<blockquote>
  <p>Seg&uacute;n Moodle va madurando, su evoluci&oacute;n cada vez est&aacute; m&aacute;s influenciada por
    la comunidad de desarrolladores y usuarios. Una base de datos din&aacute;mica de
    nuevas funcionalidades y su estado puede ser consultada en <a target=_top href="http://moodle.org/bugs/">moodle.org/bugs</a>.
   Tus <a href="?file=credits.html">contribuciones</a> en la forma de ideas,
   c&oacute;digo, informaci&oacute;n de uso y promoci&oacute;n son absolutamente bienvenidad - mira
   el <a href="?file=developer.html">Manual del Desarrollados</a> para m&aacute;s detalles.
   Tambi&eacute;n puedes pagar para que algunas funcionalidades se desarrollen m&aacute;s r&aacute;pidamente
   - mira <a href="http://moodle.com/development/" target="_top">moodle.com/development</a> para
   m&aacute;s informaci&oacute;n y contacto. </p>
  <p>Aqu&iacute; est&aacute; nuestra visi&oacute;n actual sobre el futuro de Moodle, teniendo siempre
    en cuenta que todo est&aacute; sujeto a cambio dependiendo de los patrocinadores
    y
    de los desarrolladores. </p>
  <h3>Versi&oacute;n 1.4 - 31 de Agosto</h3>
  <blockquote>
    <p>Esta versi&oacute;n incluir&aacute; muchas mejoras estructurales y la recodificaci&oacute;n
      de importantes partes de varios m&oacute;dulos. Tambi&eacute;n incluir&aacute; muchas mejoras
      en la interface. Algunas de sus principales caracter&iacute;sticas ser&aacute;n:</p>
    <ul>
      <li>Nueva estructura de <strong>Matriculaci&oacute;n</strong> que permitir&aacute;
        todo tipo de procesos autom&aacute;ticos de matriculaci&oacute;n. Incluir&aacute; un sistema
        de PayPal (para cursos no gatuitos) con acceso inmediato, uso de bases
        de datos externas, carga de ficheros generados desde otros sistemas y
        otros.</li>
      <li>Mejoras en la gesti&oacute;n de los <strong>Recursos</strong> con un
        nueva forma de creaci&oacute;n y mejor control de su visualizaci&oacute;n. Nuevos tipos
        de recursos pueden ser desarrollados como plugins.</li>
      <li>El m&oacute;dulo <strong>Cuestionario</strong> ha sido reprogramado
        y permitir&aacute; la creaci&oacute;n de nuevos tipos de preguntas como plugins. Un
        nuevo tipo de pregunta, llamado &quot;Pregunta Calculada&quot; permite presentar
        preguntas diferentes a cada estudiante.</li>
      <li>El m&oacute;dulo de <strong>Chat</strong> ahora soporta, de forma opcional,
        la instalaci&oacute;n de un servidor de chat especializado, lo que proporciona
        una respuesta inmediata para cientos de usuarios simult&aacute;neos.</li>
      <li>El m&oacute;dulo <strong>Glosario</strong> ha sido modificado para
        que resulte sencilla la creaci&oacute;n de nuevos formatos. </li>
      <li>La utilidad de <strong>Backup</strong> es capaz de traducir los contenidos
        (como los enlaces) mejor que nunca.</li>
      <li>El m&oacute;dulo <strong>SCORM</strong> soporta un n&uacute;mero m&aacute;s amplio
        de contenidos SCORM.</li>
      <li>Mejoras en la interface para a&ntilde;adir estudiantes, creadores de cursos
        y administradores.</li>
    </ul>
  </blockquote>
  <h3>Versi&oacute;n 1.5  - M&aacute;s adelante en 2004</h3>
  <blockquote>
    <p>Esta versi&oacute;n se centrar&aacute; principalmente en los aspectos de visualizaci&oacute;n,
      haciendo Moodle completamente compatible con importantes est&aacute;ndares de
      accesibilidad web como  WAI
      (W3C), SENDA (UK) and Section 508 (US). </p>
    <ul>
      <li> Reescritura completa de la &quot;capa&quot; de visualizaci&oacute;n, separando la presentaci&oacute;n
        de la l&oacute;gica de Moodle.</li>
      <li>Creaci&oacute;n de un sistema de plantillas que cumpla las especificaciones
        XHTML 1.0 de accesibilidad.</li>
      <li>Potente sistema de Hojas de Estilo en Cascada, dise&ntilde;adas para ser compatibles
        entre distintas plataformas.</li>
    </ul>
    <p>Como con cada una de las versiones de Moodle, tambi&eacute;n habr&aacute; un conjunto
      de nuevas funcionalidades y m&oacute;dulos desarrolladas por la Comunidad.</p>
  </blockquote>
  <h3>Versi&oacute;n 2.0</h3>
  <blockquote>
    <p>Esta versi&oacute;n incluir&aacute; algunos excitantes desarrollos haciendo que Moodle
      est&eacute; m&aacute;s orientado al trabajo en red, con una evoluci&oacute;n natural de Moodle
      haciendo incapi&eacute; en la colaboraci&oacute;n. M&aacute;s sobre esto aqu&iacute; m&aacute;s adelante.</p>
  </blockquote>
</blockquote>
<p align="CENTER">&nbsp;</p>
<p align="CENTER"><font size="1"><a href="." target="_top">Documentaci&oacute;n Moodle</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>
</body>
