<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
    <title>Documentación de Moodle: Instalación Básica</title>
	<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS" />
    <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
	<style type="text/css">
<!--
.style3 {color: #660000}
-->
    </style>
</head>

<body>
<h1>Instalación de Moodle</h1>
<h2>¡No se asuste! <img src="http://moodle.org/pix/s/smiley.gif" alt="Sonrisa" /></h2>
<blockquote>
<p>Esta guía explica cómo instalar Moodle por primera vez. Ahonda en detalles 
  de algunos de los pasos, con la finalidad de cubrir una amplia variedad de pequeñas 
  diferencias entre las opciones de los diversos servidores web, de manera que 
  este documento puede parecer largo y complicado. No se desanime por esto, &iexcl;normalmente 
  Moodle se instala en unos pocos minutos!</p>

<p>Si tiene dificultades, por favor lea este documento cuidadosamente, pues la mayoría de los problemas habituales están contestados aquí.
	Si aún así tiene problemas, puede buscar ayuda en 
	<a target="_blank" href="http://moodle.org/help">Ayuda de Moodle</a>.</p>
	<p>Otra opción es contactar con una <a target="_blank" href="http://moodle.com/hosting/">compañía de hosting</a> que pueda mantener Moodle por usted, de forma que pueda despreocuparse de todo esto y centrarse en la formación.
</p>
	<p>&nbsp;  </p>
<p>Secciones de este documento:</p>
<ol>
  <li><a href="#requirements">Requerimientos</a></li>
  <li><a href="#downloading">Descarga</a></li>
  <li><a href="#site">Estructura del sitio</a></li>
  <li><a href="#installer">Ejecutar el script de instalación para crear el archivo config.php</a>      <ul>
        <li><a href="#webserver">Comprobar la configuración del servidor web</a></li>
	<li><a href="#database">Crear una base de datos</a></li>	
  <li><a href="#data">Crear un directorio de datos</a></li>
  </ul>
    </li>
  <li><a href="#admin">Ir a la página de administración para continuar la configuración</a></li>
  <li><a href="#cron">Configurar el cron</a></li>
  <li><a href="#course">Crear un nuevo curso</a></li>
</ol>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="requirements"></a>1. Requerimientos</h3>
<blockquote>
  <p>Moodle está desarrollado principalmente en Linux usando Apache, MySQL y PHP 
    (también conocida como plataforma LAMP), aunque es probado regularmente 
    con PostgreSQL y en en los sistemas operativos Windows XP y Mac OS X y Netware 
    6.</p>

  <p>Los requerimientos de Moodle son los siguientes:</p>

  <ol>
    <li>Un servidor web. La mayoría de los usuarios usan <a href="http://www.apache.org/" target="_blank">Apache</a>, 
      pero Moodle debe funcionar bien en cualquier servidor web que soporte PHP, 
      como el IIS de las plataformas Windows.</li>
    <li>Una instalación de <a href="http://www.php.net/">PHP</a> en funcionamiento 
      (versión 4.1.0 o posterior). PHP 5 está soportado a partir de Moodle 1.4.</li>
    <li>Una base de datos: <a href="http://www.mysql.com/" target="_blank">MySQL</a> 
      o <a href="http://www.postgresql.org/" target="_blank">PostgreSQL</a>, 
      que están completamente soportadas y recomendadas para su uso con Moodle.</li>
  </ol>

  <p>La mayoría de los servicios de alojamiento web (hosting) soportan 
    todo esto por defecto. Si ha contratado los servicios de alguno de los pocos 
    servicios de alojamiento web que no soportan estas características 
    pregúnteles por qué, y considere la posibilidad de trasladar 
    su sistema a otro sitio.</p>
  <p>Si quiere instalar Moodle en su propio ordenador y todo esto le parece un 
    poco complicado, entonces vea nuestra guía para 
	<a href="http://moodle.org/doc/?file=installamp.html">Instalar Apache, MySQL 
    y PHP</a>. Le proporcionará instrucciones paso a paso para instalar estos programas  en las plataformas más utilizadas.</p>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="downloading"></a>2. Descarga</h3>
<blockquote>
<p>Existen dos formas de obtener Moodle, como un paquete comprimido y a

través de CVS. Esto se explica con detalle en la página de descarga en 
<a href="http://moodle.org/download/" target="_blank">http://moodle.org/download/</a></p>

  <p>Tras descargar y descomprimir el archivo, o actualizar los archivos vía CVS, 
    tendrá un directorio llamado &quot;moodle&quot;, que contiene varios archivos y carpetas.</p>

  <p>Puede o bien  colocar la carpeta completa en su directorio de documentos de 
    su servidor web, en cuyo caso el sitio estará localizado en <strong>http://suservidor.com/moodle</strong>, 
    o bien copiar todos los contenidos directamente en el directorio principal de 
    documentos del servidor web, en cuyo caso el sitio será simplemente <strong>http://suservidor.com</strong>.</p>
	<p>Si está descargando Moodle a su ordenador para después subirlo a su sitio web, normalmente es preferible subirlo todo como un solo archivo y descomprimirlo en el servidor. Incluso los paneles de control como Cpanel le permitien descomprimir archivos en el &quot;Administrador de Archivos&quot;.</p>
</blockquote>

<p>&nbsp;</p>
<h3 class="sectionheading"><a name="site"></a>3. Estructura del sitio</h3>
<blockquote>
<p>Puede saltarse sin problemas esta sección, pero en ella encontrará un breve resumen de los contenidos del directorio Moodle, para ayudarle a orientarse:</p>
  <blockquote>
    <table><tr>
      <td width="130" valign="top">config.php</td>
      <td valign="top">-</td>
      <td valign="top">
        contiene la configuración fundamental. Este archivo no viene con Moodle - usted lo creará. </td>
    </tr>
      <tr>
        <td valign="top">install.php</td>
        <td valign="top">-</td>
        <td valign="top">el script que ejecutará para crear el archivo config.php </td>
      </tr>
      <tr><td valign="top">version.php</td>
      <td valign="top">-</td>
      <td valign="top">
        define la versión actual del código de Moodle
      </td></tr>
      <tr><td valign="top">index.php</td>
      <td valign="top">-</td>
      <td valign="top">
        la página principal del sitio
      </td></tr></table>
<ul>
  <li>admin/ - Código para administrar todo el servidor.</li>
  <li>auth/ - Módulos para la autenticación de usuarios.</li>
  <li>blocks/ - Módulos para los pequeños bloques laterales contenidos en muchas páginas</li>
  <li>calendar/ - Código para manejar y mostrar eventos de calendario</li>
  <li>course/ - Código para presentar y gestionar los cursos.</li>
  <li>doc/ - Documentación de ayuda de Moodle. (Por ejemplo esta página).</li>
  <li>files/ - Código para presentar y gestionar los archivos cargados.</li>
  <li>lang/ - Textos en diferentes idiomas, un directorio por idioma.</li>
  <li>lib/ - Librerías del código fundamental de Moodle.</li>
  <li>login/ - Código para manejar las entradas y creación de cuentas.</li>
  <li>mod/ - Todos los módulos de los cursos de Moodle.</li>
  <li>pix/ - Gráficos genéricos del sitio.</li>
  <li>theme/ - Paquetes de temas/pieles para cambiar la apariencia del sitio.</li>
      <li>user/ - Código para mostrar y gestionar los usuarios.</li>
</ul>
<p>&nbsp;</p>
  </blockquote>
</blockquote>
    <h3 class="sectionheading"><a name="installer" id="installer"></a>4. Ejecutar el script de instalaci&oacute;n para crear config.php</h3>
    <blockquote>
      <p>Para ejecutar el script de instalaci&oacute;n (install.php), solo tiene que acceder a la direcci&oacute;n URL de su instalaci&oacute;n Moodle usando un navegador web, o simplemente acceder a <strong>http://suservidor/install.php</strong> directamente. </p>
      <p>(El instalador tratar&aacute; de establecer una sesi&oacute;n de cookies. Si se encuentra con una ventana de aviso en su navegador, aseg&uacute;rese de aceptar esa cookie). </p>
      <p>Moodle detectar&aacute; la configuraci&oacute;n necesaria y le guiar&aacute; a trav&eacute;s de algunas pantallas para ayudarle a crear el archivo de configuraci&oacute;n llamado <strong>config.php. </strong>Al final del proceso, Moodle intentar&aacute; escribir el archivo en el lugar apropiado, pero si esto no fuera posible puede presionar un bot&oacute;n para bajarlo desde el instalador y desp&uacute;es subirlo dentro del directorio principal de Moodle en el servidor.</p>
      <p>Al mismo tiempo, el instalador comprobar&aacute; las caracter&iacute;sticas de su servidor y le sugerir&aacute; c&oacute;mo resolver cualquier problema. Para la mayor&iacute;a de las cuestiones habituales estas sugerencias deber&iacute;an ser suficientes, pero si se queda atascado, mire abajo para encontrar m&aacute;s informaci&oacute;n sobre algunas cuestiones comunes que le deber&iacute;an permitir poder continuar.</p>
      <p>&nbsp;</p>
</blockquote>
    <blockquote>
      <h3 class="sectionheading"><a name="webserver" id="webserver"></a>4.1 Configuraci&oacute;n general del servidor web</h3>
      <blockquote>
        <p>Lo primero de todo, aseg&uacute;rese de que su servidor web est&aacute; configurado para usar index.php como p&aacute;gina inicial (quiz&aacute; adem&aacute;s de index.html, default.htm, etc.).</p>
        <p>En Apache, esto se hace usando un par&aacute;metro DirectoryIndex en su archivo httpd.conf. Habitualmente aparece de esta forma:</p>
        <blockquote>
          <pre><strong>DirectoryIndex</strong> index.php index.html index.htm </pre>
        </blockquote>
        <p>S&oacute;lo aseg&uacute;rese de que index.php est&aacute; en la lista (y preferiblemente al principio de la lista, por razones de eficiencia).</p>
        <p>En segundo lugar, <b>si est&aacute; utilizando Apache 2</b>, deber&iacute;a de habilitar la variable <i>AcceptPathInfo</i>, la cual permite que se puedan pasar argumentos a los scripts como http://servidor/archivo.php/arg1/arg2. Esto es esencial para permitir v&iacute;nculos relativos entre sus recursos, y tambi&eacute;n proporciona una mejora de rendimiento en la utilizaci&oacute;n de su sitio web Moodle. Puede habilitar &eacute;sto a&ntilde;adiendo estas l&iacute;neas a su archivo httpd.conf:</p>
        <blockquote>
          <pre><strong>AcceptPathInfo</strong> on </pre>
        </blockquote>
        <p>En tercer lugar, Moodle necesita tener activada una determinada configuraci&oacute;n en su instalaci&oacute;n PHP para funcionar. <b>En la mayor&iacute;a de ellas ya ser&aacute;n las opciones de configuraci&oacute;n establecidas por defecto.</b> Sin embargo, algunos servidores PHP (y algunas de las versiones m&aacute;s recientes de PHP) pueden tener una configuraci&oacute;n diferente. Estas opciones se definen en el archivo de configuraci&oacute;n de PHP (normalmente llamado php.ini):</p>
        <blockquote>
          <pre>magic_quotes_gpc = 1    (preferible pero no necesario)
magic_quotes_runtime = 0    (necesario)
file_uploads = 1
session.auto_start = 0
session.bug_compat_warn = 0
        </pre>
        </blockquote>
        <p>Si no tiene acceso a los archivos httpd.conf o php.ini en su servidor, o tiene Moodle en un servidor con otras aplicaciones que requieren una configuraci&oacute;n diferente, no se preocupe, a&uacute;n puede normalmente sobrepasar -OVERRIDE- la configuraci&oacute;n por defecto. </p>
        <p>Para hacer esto, necesita crear un archivo llamado <b>.htaccess</b> en el directorio principal de Moodle que contenga l&iacute;neas como las que siguen. Esto solo funciona en servidores Apache y &uacute;nicamente cuando Overrides ha sido permitido en la configuraci&oacute;n principal. </p>
        <blockquote>
          <pre>
DirectoryIndex index.php index.html index.htm

&lt;IfDefine APACHE2>
     <b>AcceptPathInfo</b> on
&lt;/IfDefine>

php_flag magic_quotes_gpc 1
php_flag magic_quotes_runtime 0
php_flag file_uploads 1
php_flag session.auto_start 0
php_flag session.bug_compat_warn 0</pre>
        </blockquote>
        <p>Tambi&eacute;n puede hacer cosas como definir el tama&ntilde;o m&aacute;ximo para los archivos subidos: </p>
        <blockquote>
          <pre>
LimitRequestBody 0
php_value upload_max_filesize 2M
php_value post_max_size 2M
        </pre>
        </blockquote>
        <p>Lo m&aacute;s f&aacute;cil es copiar el archivo de ejemplo localizado en <strong>lib/htaccess</strong> y editarlo para adecuarlo a sus necesidades. Contiene adem&aacute;s m&aacute;s instrucciones. Por ejemplo, en un int&eacute;rprete de comandos de Unix: </p>
        <blockquote>
          <pre>cp lib/htaccess .htaccess</pre>
    </blockquote>
  </blockquote>
<p>&nbsp;</p>
<h3 class="sectionheading"><a name="database"></a>4.2 Crear una base de datos</h3>

  <blockquote>
  <p>Necesitar&aacute; crear una base de datos vac&iacute;a (por ejemplo "moodle") en su sistema de base de datos, junto con un usuario especial (por ejemplo "moodleuser") que tenga acceso a esa base de datos (y s&oacute;lo a esa base de datos). Si quisiera podr&iacute;a usar el usuario &quot;root&quot;, pero esto no es recomendable en un sistema en producci&oacute;n: si los hackers  descubren la contrase&ntilde;a todo su sistema de base de datos estar&iacute;a en peligro, en vez de s&oacute;lo una base de datos.</p>
  <p>Si est&aacute; utilizando un servicio de hosting, probablemente tendr&aacute; un panel de control que le permitir&aacute; crear su base de datos.</p>
  <p>El sistema <strong>Cpanel</strong> es uno de los m&aacute;s populares entre ellos. Para crear una base de datos con  Cpanel:</p>
  <ol>
    <li>Haga click en el icono &quot;<strong>Bases de datos MySQL</strong>&quot;.</li>
    <li>Escriba &quot;moodle&quot; en el campo base de datos y haga  click en &quot;<strong>A&ntilde;adir Base de Datos</strong>&quot;.</li>
    <li> Escriba un usuario y contrase&ntilde;a  (no uno que use en cualquier sitio) en el campo respectivo y haga  click en &quot;<strong>A&ntilde;adir Usuario</strong>&quot;.</li>
    <li> Ahora utilice el bot&oacute;n &quot;<strong>A&ntilde;adir Usuario a la Base de Datos</strong>&quot; para dar a esta nueva cuenta de usuario &quot;<strong>TODOS</strong>&quot; los derechos en la nueva base de datos.</li>
    <li>Note que el nombre de usuario y el nombre de la base de datos pueden estar prefijados por su nombre de cuenta en  su Cpanel. Cuando introduzca esta informaci&oacute;n en el instalador de  Moodle utilice los nombres completos.</li>
  </ol>
  <p>Si tiene acceso a la l&iacute;nea de comandos de  Unix puede hacer estas mismas cosas escribiendo comandos. </p>
  <p>Ejemplo de l&iacute;neas de comando para MySQL:</p>
  <pre>   # mysql -u root -p
   > CREATE DATABASE moodle; 
   > GRANT SELECT,INSERT,UPDATE,DELETE,CREATE,DROP,INDEX,ALTER ON moodle.* 
           TO moodleuser@localhost IDENTIFIED BY 'yourpassword'; 
   > quit 
   # mysqladmin -p reload<br />
</pre>
  <p>Ejemplo de l&iacute;neas de comando para PostgreSQL: </p>
  <pre>   # su - postgres<br />   &gt; psql -c "create user moodleuser createdb;" template1<br />   &gt; psql -c "create database moodle;" -U moodleuser template1<br />   &gt; psql -c "alter user moodleuser nocreatedb;" template1<br />
</pre>
</blockquote>
  <p>&nbsp;</p>
<h3 class="sectionheading"><a name="data"></a>4.3 Crear un directorio de datos</h3>
<blockquote>
<p>Moodle también necesita algo de espacio en su disco duro para

almacenar los archivos que vayan a ser cargados, tales como la

documentación de los cursos y las fotos de los usuarios.</p>
<p>El instalador de Moodle intenta crear este directorio pero si no puede hacerlo tendr&aacute; que crearlo usted manualmente. </p>
<p>Por seguridad, es mejor que este directorio NO sea accesible directamente desde la web. La manera m&aacute;s sencilla de conseguir esto es simplemente colocarlo FUERA del directorio web, pero en caso  de que no pueda hacerlo as&iacute;, prot&eacute;jalo creando un archivo <span>.htaccess</span> en el directorio de datos que contenga la siguiente l&iacute;nea:</p>
<blockquote>
  <pre>deny from all</pre>
</blockquote>
<p>Para asegurarse de que Moodle puede guardar los archivos subidos en ese directorio, revise que el servidor web (por ejemplo Apache) tiene permiso de lectura, escritura y ejecuci&oacute;n en ese directorio. </p>
<p>En las m&aacute;quinas Unix, esto significa establecer que el due&ntilde;o del directorio sea algo como "nobody" o "apache" y dar a ese usuario permiso de lectura, escritura y ejecuci&oacute;n.</p>
<p>En los sistemas Cpanel puede usar el &quot;Administrador de Archivos&quot; para encontrar la carpeta, hacer click en ella y escoger &quot;Cambiar Permisos&quot;. En la mayor&iacute;a de los servidores compartidos, probablemente necesitar&aacute; restringir el acceso a archivos a su "grupo" (para evitar que otros clientes del mismo servidor web puedan ver o cambiar sus archivos), pero deber&aacute; proporcionar acceso completo de lectura/escritura a cualquiera  (lo que permitir&aacute; al servidor web acceder a sus archivos). </p>
<p>Hable con el administrador de 
  su servidor si tiene algún problema al establecer esto de forma segura. En concreto, algunos sitios que usan una caracter&iacute;stica de PHP conocida como &quot;Safe Mode&quot; pueden requerir que el administrador cree este directorio de la forma adecuada para usted. </p>
<p>&nbsp;</p>
</blockquote>
</blockquote>
<h3 class="sectionheading"><a name="admin" id="admin"></a>5. Ir a la p&aacute;gina de administraci&oacute;n para continuar la configuraci&oacute;n</h3>

<blockquote>
  <p>Una vez que el archivo <strong>config.php</strong> ha sido correctamente creado en el paso anterior, al intentar acceder a la p&aacute;gina principal de su sitio se encontrar&aacute; con la p&aacute;gina &quot;administraci&oacute;n&quot; para continuar con el resto de la  configuraci&oacute;n.</p>
  <p>La primera vez que acceda a esta p&aacute;gina de administraci&oacute;n, se le presentar&aacute; el acuerdo de licencia  GPL con el cual debe estar de acuerdo antes de continuar con la instalaci&oacute;n.</p>
  <p>En este momento, Moodle empezar&aacute; configurando la base de datos y creando las tablas para guardar los datos. En primer lugar, se crean las principales tablas de la base de datos. Deber&iacute;a ver una serie de sentencias  SQL seguidas por mensajes de estado (en verde o rojo) parecidas a &eacute;stas:</p>
  <blockquote>
    <p>CREATE TABLE course ( id int(10) unsigned NOT NULL auto_increment, category int(10) unsigned NOT NULL default '0', password varchar(50) NOT NULL default '', fullname varchar(254) NOT NULL default '', shortname varchar(15) NOT NULL default '', summary text NOT NULL, format tinyint(4) NOT NULL default '1', teacher varchar(100) NOT NULL default 'Teacher', startdate int(10) unsigned NOT NULL default '0', enddate int(10) unsigned NOT NULL default '0', timemodified int(10) unsigned NOT NULL default '0', PRIMARY KEY (id)) TYPE=MyISAM</p>
    <p><font color="#006600">SUCCESS</font></p>
  </blockquote>
  <p>...y as&iacute; sucesivamente, seguidas por: <font color="#006600">Main databases set up successfully.</font> </p>
  <blockquote>
    <p class="style3">Si no ve &eacute;sto, debe de haber alg&uacute;n problema con la base de datos o con las opciones de configuraci&oacute;n establecidas en config.php. Compruebe que  PHP no est&aacute; configurado como "Safe Mode" (a veces las empresas de hosting tienen esta restricci&oacute;n activada). Usted puede comprobar las variables  PHP creando un peque&ntilde;o archivo conteniendo <strong>&lt;?php phpinfo() ?&gt;</strong> ll&aacute;melo phpinfo.php y &aacute;bralo en un navegador. Compruebe &eacute;sto y pruebe esta p&aacute;gina de nuevo.</p>
  </blockquote>
  <p>Baje hasta el final de la p&aacute;gina y presione el enlace &quot;Continuar&quot;.</p>
  <p>Ahora usted deber&iacute;a ver un formulario en el que puede definir m&aacute;s variables de configuraci&oacute;n para su instalaci&oacute;n, tales como el idioma por defecto, el <span

 lang="en" xml:lang="en">servidor</span> <abbr title="Simple Mail Transfer Protocol">SMTP</abbr> y cosas por el estilo. No se preocupe demasiado de tener todo correcto ahora, siempre podr&aacute; volver y editar &eacute;sto m&aacute;s adelante usando la interfaz de administraci&oacute;n. Despl&aacute;cese hasta la parte de abajo de la p&aacute;gina y seleccione el enlace "Guardar cambios".</p>
  <blockquote>
    <p class="style3">      
    <p>Si (y s&oacute;lo si) usted se encuentra atascado en esta p&aacute;gina o en la siguiente, incapaz de continuar, entonces su servidor probablemente tiene lo que  llamamos el problema de la referencia defectuosa (&quot;buggy referrer&quot;). Esto es f&aacute;cil de arreglar: s&oacute;lo tiene que desactivar la opci&oacute;n &quot;secureforms&quot;<em></em> del formulario, luego intente de nuevo entrar en la p&aacute;gina.</p>
  </blockquote>    
<p>A continuaci&oacute;n ver&aacute; m&aacute;s p&aacute;ginas con multitud de mensajes de estado a medida que se configuran todas las tablas requeridas por los diferentes m&oacute;dulos de Moodle. Como antes, deber&iacute;an ser todos <font color="#006600">verdes</font>.</p>
    <p>Baje hasta el final de la p&aacute;gina y presione el enlace &quot;Continuar&quot;.</p>
    <p>La siguiente p&aacute;gina es un formulario en el que usted puede definir par&aacute;metros para su sitio Moodle y la p&aacute;gina principal, tales como el nombre, formato, descripci&oacute;n y ese tipo de cosas. Rell&eacute;nelo (siempre podr&aacute; volver y cambiar &eacute;sto despu&eacute;s) y luego haga clic en "Guardar cambios".</p>
    <p>Finalmente, se le pedir&aacute; que cree un usuario administrador de m&aacute;ximo nivel para el futuro acceso a la p&aacute;gina de administraci&oacute;n. Rellene los detalles con su propio nombre, direcci&oacute;n de correo electr&oacute;nico, etc. y haga clic en "Guardar cambios". No todos los campos son obligatorios, pero si olvida rellenar un campo importante se le avisar&aacute;.</p>
    <p style="padding-left: 9em; padding-right: 9em;"><strong>Aseg&uacute;rese de recordar el nombre de usuario y contrase&ntilde;a que ha elegido para la cuenta de la administraci&oacute;n, ya que ser&aacute;n necesarias para acceder a la p&aacute;gina de administraci&oacute;n en el futuro.</strong></p>
	<blockquote>
    <p class="style3">(Si por alguna raz&oacute;n se interrumpe su instalaci&oacute;n, o hay un error del sistema de alg&uacute;n tipo que le impida entrar usando la cuenta de admininstrador, normalmente podr&aacute; entrar usando el usuario &quot;<strong>admin</strong>&quot;, con contrase&ntilde;a &quot;<strong>admin</strong>&quot;.) 
	</blockquote>
	     <p>Una vez conseguido esto usted puede volver a la p&aacute;gina principal de su sitio. &Eacute;sta contiene una serie de enlaces dispuestos en un men&uacute; que aparece en la parte izquierda de la p&aacute;gina (estos elementos tambi&eacute;n aparecen en una p&aacute;gina aparte de Administraci&oacute;n). &Eacute;stos elementos s&oacute;lo son visibles para usted ya que ha entrado como el usuario administrador. Toda su gesti&oacute;n de administraci&oacute;n puede desde ahora hacerse desde este men&uacute;, como por ejemplo:</p>
    <ul>
      <li>Crear y borrar cursos</li>
      <li>Crear y editar cuentas de usuario</li>
      <li>Administrar cuentas de profesores</li>
      <li>Cambiar opciones del sitio, como temas, etc.</li>
    </ul>
    <p>&iexcl;Pero a&uacute;n no ha concluido la instalaci&oacute;n! Hay a&uacute;n una cosa muy importante por hacer  (vea la pr&oacute;xima secci&oacute;n acerca del  cron). </p>
</blockquote>
<div style="padding-left: 3em;">
  <p>&nbsp;</p>
</div>

<h3 class="sectionheading"><a name="cron"></a>6. Configurar el cron &iexcl;IMPORTANTE! </h3>

<div style="padding-left: 3em;">

<p>Algunos módulos de Moodle requieren revisiones continuas para

llevar a cabo determinadas tareas. Por ejemplo, Moodle necesita revisar los foros de

discusión para poder enviar copias de los mensajes a las

personas que están suscritas.</p>

  <p>El script que hace todo esto está en el directorio <span>admin</span>, y 
    se llama <span>cron.php</span>. Sin embargo, no puede funcionar por sí mismo, 
    de manera que usted tiene que establecer un mecanismo en el que este script 
    se ejecute regularmente (<abbr title="Ejemplo">por ejemplo</abbr>, cada cinco 
    o diez minutos). Esto proporciona una se&ntilde;al de manera que el script pueda 
    llevar a cabo funciones en determinados períodos definidos para cada módulo.</p>

  <p>Tenga en cuenta que la máquina que ejecuta el cron <strong>no tiene que ser 
    necesariamente la misma en la que está ejecutando Moodle</strong>. Por ejemplo, 
    si usted tiene un servicio de alojamiento web limitado que no tiene cron, 
    usted puede elegir ejecutar el cron en otro servidor o en su ordenador personal. 
    Lo que importa es que el archivo <span>cron.php</span> sea llamado regularmente.</p>

  <p>La carga de este script no es muy alta, así que un intervalo de 5 
    minutos es razonable generalmente, pero si ésto le preocupa, puede 
    reducir el periodo de tiempo a  15 minutos o incluso 30 
    minutos. Es mejor no establecer un intervalo de tiempo demasiado largo, ya que 
    el retrasar el envío de mensajes de correo puede reducir la actividad 
    del curso.</p>
  <p>Primero, pruebe que el script funcione directamente desde su navegador:</p>

<blockquote>

  <pre>http://ejemplo.com/moodle/admin/cron.php</pre>

</blockquote>

<p>Ahora, usted necesita establecer alguna manera de ejecutar el script

automática y regularmente.</p>
<p><b>En Windows</b></p>
<blockquote>
  <p>La forma m&aacute;s sencilla es usar este peque&ntilde;o paquete <a href="http://moodle.org/download/modules/moodle-cron-for-windows.zip" title="Click to download this package (150k)" target="_blank"><strong>moodle-cron-for-windows.zip</strong></a> que lo hace todo de una forma muy f&aacute;cil instalando un peque&ntilde;o servicio Windows. Ejec&uacute;telo y olv&iacute;dese de &eacute;l.</p>
</blockquote>
<p><strong>En servicios de hospedaje web</strong></p>
<blockquote>
  <p> Su panel de control puede tener una p&aacute;gina web que le permita establecer este proceso de cron. Por ejemplo, en el sistema Cpanel, busque un bot&oacute;n llamado &quot;Tareas de Cron&quot;. Ah&iacute; podr&aacute; establecer los mismos comandos Unix que aparecen m&aacute;s abajo. </p>
</blockquote>
<h4> Usando la l&iacute;nea de comandos en Unix </h4>
<blockquote>
  <p>Hay diferentes programas de l&iacute;nea de comandos que puede usar para llamar a la p&aacute;gina desde la l&iacute;nea de comandos. Puede que no todos ellos est&eacute;n  disponibles en un determinado servidor.</p>
  <p>Por ejemplo, puede usar una utilidad  Unix como  'wget':</p>
  <blockquote>
    <pre>wget -q -O /dev/null http://example.com/moodle/admin/cron.php</pre>
  </blockquote>
  <p>Observe en este ejemplo que la salida se elimina (en /dev/null).</p>
  <p>Es lo mismo usando lynx:</p>
  <blockquote>
    <pre>lynx -dump http://ejemplo.com/moodle/admin/cron.php &gt; /dev/null</pre>
  </blockquote>
  <p>Como alternativa puede usar una versi&oacute;n de PHP compilada para ejecutarse desde la l&iacute;nea de comandos. La ventaja de hacer esto es que las entradas a su servidor web no se llenan con constantes solicitudes a <span>cron.php</span>. La desventaja es que necesitar&aacute; tener acceso a una versi&oacute;n de l&iacute;nea de comandos de PHP.</p>
  <blockquote>
    <pre>/opt/bin/php /web/moodle/admin/cron.php
    </pre>
  </blockquote>
</blockquote>
    <h4>Usando el programa &quot;crontab&quot; en Unix </h4>
    </blockquote>
  </blockquote>
<blockquote>
  <p> Todo lo que  Cpanel hace es proporcionar una interfaz  web a una utilidad  Unix conocida como  &laquo;crontab&raquo;. Si dispone de l&iacute;nea de comandos, puede establecer el  &laquo;crontab&raquo; usted mismo usando el comando:</p>
  <blockquote>
    <pre>crontab -e</pre>
    <p>y a&ntilde;adiendo una l&iacute;nea como la siguiente:</p>
    <blockquote>
      <pre>*/5 * * * * wget -q -O /dev/null http://example.com/moodle/admin/cron.php</pre>
    </blockquote>
    <p>Normalmente, el comando &quot;crontab&quot; le enviar&aacute; al editor 'vi'. Se entra en &quot;modo de inserci&oacute;n&quot; presionando &quot;i&quot;, despu&eacute;s teclee la l&iacute;nea de arriba, luego salga del modo de inserci&oacute;n presionando ESC. Se guardan los cambios y se sale tecleando &quot;:wq&quot;, se puede salir tambi&eacute;n sin guardar usando &quot;:q!&quot; (sin las comillas).</p>
  </blockquote>
</blockquote>
<h4>&nbsp;</h4>

<h3 class="sectionheading"><a name="course"></a>7. Crear un nuevo curso</h3>

  <p>Ahora que Moodle está funcionando de manera apropiada, puede crear un curso.</p>

<p>Seleccione "Crear un nuevo curso" desde la página "Admin" (o

desde los enlaces de administración en la página

principal).</p>

<p>Rellene el formulario, prestando especial atención al formato

del curso. En este momento no tiene que preocuparse demasiado por los

detalles, pues todo puede ser cambiado después por el profesor.</p>

  <p>Presione "Guardar cambios", aparecerá un nuevo formulario en el que puede 
    asignar profesores al curso. Desde este formulario sólo pueden añadirse cuentas 
    de usuarios existentes, si necesita una cuenta para un profesor debe pedirle 
    al profesor que cree su cuenta él mismo (vea la página de entradas) 
    o créela usted utilizando la opción "Añadir nuevo usuario" en la página 
    Admin.</p>

  <p>Una vez hecho esto, el curso está listo para ser

personalizado y puede accederse al mismo a través del enlace

"Cursos" en la página principal.</p>

<p>Para obtener más detalles sobre la creación de cursos,

vea el "<a href="./?file=teacher.html">Manual del Profesor</a>"</p>

</blockquote>
<p>&nbsp;</p>

<p align="center"><font size="1"><a href="." target="_top">Documentación de Moodle</a></font></p>
<p align="center"><font size="1">Version: $Id: install.html,v 1.16 2005/02/09 
  16:33:56 moodler Exp $</font></p>

</body>
</html>
