<head>

<title>Moodle Docs: notas sobre la versión actual</title>

<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS">

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

<style type="text/css">
<!--       dt {font-family: "Trebuchet MS", Verdana, Arial, Helvetica, sans-serif; font-weight: bold;}
       dd {margin-bottom:1em;}
-->
</style>
</head>

<body bgcolor="#FFFFFF">
<h1>Notas sobre versiones</h1>

<h3> Nuevo en Moodle 1.3.3  (16 de Julio de 2004)</h3>
<ul>
  <dl>
    <dt>Actualizaciones:</dt>
    <dd>
      <ul>
        <li>La librería ADOdb ha sido actualizada a una versión compatible con PHP 5.0.</li>
        <li>Mejoras en la detección y comprobación de URLs en los backups.</li>
      </ul>
    </dd>
    <dt>Problemas resueltos:</dt>
    <dd> 
      <ul>
        <li>Una posible vulnerabilidad relacionada con los argumentos del archivo help.php ha sido solucionada.</li>
        <li>Una posible vulnerabilidad relacionada con los ajustes de los lenguajes ha sido solucionada.</li>
        <li>Mejoras para la edición de las cadenas con comillas en los lenguajes.</li>
        <li>Pequeños problemas en el glosario has sido solventados.</li>
        <li>Diferentes mejoras en el módulo Scorm.</li>
      </ul>
    </dd>
  </dl>
</ul>

<br />

<h3> Nuevo en Moodle 1.3.2  (9 de Julio de 2004)</h3>
<ul>
  <dl>
    <dt>Actualizaciones:</dt>
    <dd>
      <ul>
        <li>El m&oacute;dulo SCORM ahora est&aacute; incluido en la distribuci&oacute;n.</li>
        <li>Algunos nuevos lenguajes (Malayo, Estonio).</li>
        <li>Muchos otros lenguajes est&aacute;n actualizados a la 1.3.x.</li>
      </ul>
    </dd>
    <dt>Problemas resueltos:</dt>
    <dd>
      <ul>
        <li>Una posible vulnerabilidad en la p&aacute;gina inicial de algunos servidores Moodle funcionando con algunas versiones de PHP antiguas ha sido solucionado. Si est&aacute;s utilizando una versi&oacute;n de PHP anterior a la 4.3, ser&iacute;a una buena idea que actualizaras a esta versi&oacute;n de Moodle.</li>
        <li>Importantes modificaciones en la l&oacute;gica de los foros cuando son utilizados para actividades en grupo.</li>
        <li>Los perfiles de los profesores-editores son visibles, incluso para grupos separados de una clase.</li>
        <li>Las l&iacute;neas de t&iacute;tulo en los informes de actividad reciente en lenguajes multi-byte ya no son partidas por la funci&oacute;n de ruptura de l&iacute;neas.</li>
        <li>Unos pocos problemas relacionados con la exportaci&oacute;n/importaci&oacute;n de glosarios han sido solucionados.</li>
        <li>La utilidad de backup controla mejor los archivos temporales.</li>
        <li>Solucionados otros  peque&ntilde;os problemas aqu&iacute; y all&iacute;.</li>
      </ul>
    </dd>
  </dl>
</ul>

<br />

<h3> Nuevo en Moodle 1.3.1  (4 de Junio de 2004)</h3>
<ul>
  <dl>
    <dt>Problemas resueltos:</dt>
    <dd>
      <ul>
        <li>Algunos c&oacute;digos HTML que afectaban a la estabilidad del editor
          HTML bajo IE6 en algunas p&aacute;ginas han sido solucionados.</li>
        <li>Algunos problemas en las opciones de auto-v&iacute;nculo en los filtros
          arreglados.</li>
        <li>Modificada la barra de navegaci&oacute;n (utilizando el car&aacute;cter &raquo;).</li>
        <li>Los archivos de Flash ahora tienen su propio icono.</li>
        <li>La inclusi&oacute;n de enlaces al curso en el editor HTML ha sido
          corregida.</li>
        <li>El bloque de enlaces a las secciones ahora mantiene el &quot;focus&quot;.</li>
        <li>Los archivos del sitio ahora respetan la configuraci&oacute;n &quot;forcelogin&quot;.</li>
        <li>La actualizaci&oacute;n de bloques sin base de datos funciona.</li>
        <li>Actualizaciones en los lenguajes.</li>
      </ul>
    </dd>
  </dl>
</ul>

<br />

<h3> Nuevo en Moodle 1.3  (25 de Mayo de 2004)</h3>
<ul>
  <dl>
    <dt>Principales nuevas caracter&iacute;sticas:</dt>
    <dd>
      <ul>
        <li>Nueva utilidad de <strong>Calendario</strong> (gracias a
          Jon Papaioannou y la <a target="_blank" href="http://www.sch.gr/">Greek
          School Network</a>!).</li>
        <li>Nueva utilidad de <strong>Bloques</strong>, permitiendo que los bloques
          sean incluidos y movidos por la p&aacute;gina del curso (gracias a
          Jon Papaioannou, Eloy Lafuente y otros!).</li>
        <li>Nuevo sistema de difusi&oacute;n <strong>RSS </strong> permite a los
          Foros y a los Glosarios (y m&aacute;s adelante, a otros m&oacute;dulos)
          publicar v&iacute;a RSS  (Gracias,
          Eloy!).</li>
        <li><strong>El filtro multimedia</strong> ahora soporta la inclusi&oacute;n
          de ficheros Quicktime, Flash, y Windows Media.</li>
        <li>Un nuevo filtro de <strong>Nombres de las Actividades </strong> enlazar&aacute;
          autom&aacute;ticamente con otras actividades del curso cuando su nombre es
          mencionado.</li>
      </ul>
    </dd>
    <dt>Otras nuevas caracter&iacute;sticas:</dt>
    <dd>
      <ul>
        <li>Un nuevo tipo de recursos (llamado &quot;Directorio&quot;) mostrar&aacute; un
          directorio entero de ficheros (incluyendo subdirectorios).</li>
        <li>Los recuros que son archivos (subidos o p&aacute;ginas web) ahora muestran
          un icono distintivo en la p&aacute;gina principal del curso.</li>
        <li>La mayor parte de los enlaces HTML internos en los foros y en los
          recursos se mantienen durante la copia de seguridad y restauraci&oacute;n
          de cursos.</li>
        <li>Es posible pasar argumentos HTTP a ficheros en las secci&oacute;n de &quot;Archivos&quot;.
          Esto permite a&ntilde;adir algunos detalles HTML y Flash en los recursos.</li>
        <li>$CFG-&gt;forceloginforprofiles puede ser definido para evitar que
          los usuarios invitados puedan ver los perfiles de los usuarios del
          sitio (Google incluido).</li>
        <li>Cuando el acceso de Google est&aacute; activado, la p&aacute;gina de traducci&oacute;n
          de Google funciona tambi&eacute;n.</li>
        <li>Las sesiones son ahora almacenadas de forma privada en el directorio
          de datos de Moodle - esto hace que Moodle funcione mejor en clusters
          y soluciona algunos problemas de expiraci&oacute;n de sesiones en servidores
          web compartidos.</li>
        <li>Las im&aacute;genes de los usuarios puedens ser borradas f&aacute;cilmente desde
          la p&aacute;gina de edici&oacute;n del usuario.</li>
        <li>Las charlas del Chat aparecen ahora en los registros de Moodle.</li>
        <li>Las secciones ocultas de los cursos ahora pueden ser ocultadas competamente
          a los estudiantes (preferencia de curso).</li>
        <li>Mejoras en el texto dentro de gr&aacute;ficos para algunos lenguajes distintos
          del Ingl&eacute;s, utilizando tipograf&iacute;as Unicode.</li>
        <li>Mejorada la p&aacute;gina de configuraci&oacute;n de Escalas, as&iacute; como el uso de
          las mismas en sitios con m&aacute;s de un lenguaje.</li>
        <li>Todos los estudiantes pueden ser desmatriculados utilizando un bot&oacute;n
          (en la p&aacute;gina de Estudiantes).</li>
        <li>Los suscriptores de los foros ahora pueden, de forma manual, ser
          suscritos o no en grupos.</li>
        <li>Mejor uso de algunos caracteres europeos en nombres de ficheros y
          de usuarios.</li>
        <li>Los avisos de una tarea oculta no son enviados por correo electr&oacute;nico
          hasta que la tarea es mostrada.</li>
        <li>A&ntilde;adido mejor soporte para la importaci&oacute;n de cuestionarios desde
        Blackboard.</li>
        <li>El gui&oacute;n cron de PHP ahora puede ser ejecutado como un binario.</li>
        <li>El editor HTML ha sido mejorado enormemente.</li>
        <li>La p&aacute;gina por defecto de actividad reciente es ahora calculada desde
          el &uacute;ltimo acceso al curso (o dos d&iacute;as, lo que sea m&aacute;s reciente). Anteriormente
          era calculada desde la &uacute;ltima conexi&oacute;n al sitio.</li>
        <li>Los correos electr&oacute;nicos de confirmaci&oacute;n ahora son en formato HTML
          y texto, para evitar que se &quot;rompa&quot; el enlace de confirmaci&oacute;n.</li>
        <li><b>Nuevos  lenguajes</b>: Farsi, Lituano, &quot;Noruego Primary School&quot;,
          versi&oacute;n Unicode  del Chino Tradicional.</li>
      </ul>
    </dd>
    <dt>Problemas resueltos:</dt>
    <dd>
      <ul>
        <li>Cientos de peque&ntilde;os fallos han sido solucionados en todas partes,
          generalmente mejorando la apariencia y la robustez de Moodle.</li>
        <li>Como siempre, si encuentras alg&uacute;n fallo, por favor <a href="http://moodle.org/bugs/">env&iacute;alo
            a nuestro Sistema de Bugs</a>!</li>
      </ul>
      <p>&nbsp;</p>
    </dd>
    <dt><font size="+1">Por &uacute;ltimo, no olvides echar un vistazo al alguno de
        los <a href="http://moodle.org/download/modules/" target="_blank">muchos
        m&oacute;dulos opcionales en desarrollo</a>,
        incluyendo el m&oacute;dulo SCORM, el m&oacute;dulo Wiki, el m&oacute;dulo Hot Potatoes
        y otras muchas innovaciones.</font></dt>
  </dl>
</ul>

<p><br />
</p>
<h3> Nuevo en Moodle 1.2.1 (25 de Marzo de 2004)</h3>
<ul>
  <dl>
    <dt>Varios problemas menores resueltos:</dt>
    <dd>
      <ul>
        <li>Corregidos algunos problemas que causaban que los gr&aacute;ficos de las
          encuestas no se mostraran en algunas circustancias.</li>
        <li>Mejorada la seguridad del gui&oacute;n cron.</li>
        <li>Arreglada la importaci&oacute;n de cuestionarios de WebCT para que funcione
          con im&aacute;genes, respuestas cortas y caracteres de escape.</li>
        <li>Arreglado el formateo en el editor al incluir enlaces.</li>
        <li>Evitado que el glosario incluya enlaces de nombres de actividades
          que ya son enlaces.</li>
        <li>Arreglados algunos c&aacute;lculos de fechas y horas si el usuario no est&aacute;
          presente.</li>
        <li>Caracteres como:( en el c&oacute;digo Javascript en HTML filtrado, ya no
          es convertido a sus emoticones equivalentes.</li>
        <li>Mejorada la seguridad de los foros de discusi&oacute;n simple cuando la
          variable de configuraci&oacute;n &quot;secureforms&quot; est&aacute; activada.</li>
        <li>Las preguntas de elecci&oacute;n m&uacute;ltiple, por defecto utilizan
          un formato de respuesta &uacute;nica correcto.</li>
        <li>Los invitados ya no pueden ver las direcciones de correo electr&oacute;nico
          de los participantes si &quot;mostrar solo a participantes del curso&quot; ha
          sido selecionado por el usuario.</li>
        <li>El administrador principal es ahora la entrada menor en la tabla
           user_admins, en vez del administrador con el id menor.</li>
        <li>Modificado el filtro de archivos MP3 para mejorar el brillo del bot&oacute;n
          de reproducci&oacute;n en pantallas oscuras.</li>
        <li>Correcciones y mejoras en muchos lenguajes.</li>
      </ul>
    </dd>
  </dl>
</ul>

<br />


<h3> Nuevo en Moodle 1.2 (20 de Marzo de 2004)</h3>
<ul>
  <dl>
    <dt>Principales nuevas caracter&iacute;sticas:</dt>
    <dd>
      <ul>
        <li>Nuevo soporte para grupos en los cursos (con muchas opciones).</li>
        <li><strong>Filtros de texto</strong> que permiten procesar los textos
          de Moodle, incluyendo el <strong>enlazado
            autom&aacute;tico</strong>, <strong>soporte
          matem&aacute;tico</strong>, <strong>contenido multi-lenguaje</strong> y
          una infinidad de posibilidades.</li>
        <li>Un nuevo, y fant&aacute;stico, nuevo <strong>m&oacute;dulo  Glossario</strong> (gracias a Williams
          Castillo) que proporciona muchas formas de construir actividades de
          aprendizaje basadas en la recopilaci&oacute;n de definiciones.</li>
        <li>Un nuevo, y genial, <strong>m&oacute;dulo  Lecci&oacute;n</strong> (gracias
          a  Ray Kingdon!) que permite crear, de forma sencilla, caminos de contenido
          activo con rutas alternativas y soporte para preguntas de elecci&oacute;n
          m&uacute;ltiple.</li>
        <li>Un nuevo <strong>modulo  Etiqueta</strong> que permite introducir
          HTML a medida en la p&aacute;gina principal del curso.</li>
        <li>Un mejorado <strong>editor WYSIWYG</strong>,  m&aacute;s r&aacute;pido y con compatible
          con m&aacute;s plataformas que el anterior.</li>
        <li>Las <strong>copias de seguridad autom&aacute;ticas</strong> pueden
          ser programadas por el administrador para todos los cursos de una vez.</li>
      </ul>
    </dd>
    <dt>Cursos:</dt>
    <dd>
      <ul>
        <li>Las actividades pueden tener sangrias en la visualizaci&oacute;n del curso,
          permitiendo estructurarlas mejor.</li>
        <li>Un nuevo informe para la Actividad Reciente que hace mucho m&aacute;s sencillo
          saber qu&eacute; ha sucedido recientemente.</li>
        <li>Un nuevo bot&oacute;n de registros en cada actividad enlaza con la p&aacute;gina
          de registros para mostrar la informaci&oacute;n por actividad.</li>
        <li>El bot&oacute;n de restauraci&oacute;n est&aacute; siempre activo.</li>
        <li>Mejorada la vista de &quot;&iacute;ndice&quot; de todas las actividades.</li>
        <li>Mejoras en la p&aacute;gina de participantes, incluyendo paginaci&oacute;n y b&uacute;squedas
          por iniciales.</li>
        <li>Los ficheros descargados en formato Excel son ahora m&aacute;s compatibles
          con distintos Sistemas Operativos.</li>
        <li>Mejorado el control de errores al a&ntilde;adir/modificar una actividad.</li>
        <li>La caja de b&uacute;squedas ya nunca recibe el focus de forma autom&aacute;tica
          (causaba ciertos problemas en cursos largos).</li>
        <li>Opci&oacute;n de auto-desmatricularse para los alumnos en la p&aacute;gina principal
          del curso.</li>
        <li>Opci&oacute;n de cambio de contrase&ntilde;a para los alumnos en la p&aacute;gina principal
          del curso.</li>
        <li>Los alumnos pueden tener permitida la visualizaci&oacute;n de sus propios
          informes de actividad (definido a nivel de curso).</li>
        <li>Los profesores pueden ver los ficheros del curso para insertar im&aacute;genes
          con el nuevo editor.</li>
        <li>Nueva imagen que representa una caja vac&iacute;a utilizada al mover actividades.</li>
        <li>Los accesos son ahora grabados por curso, para que el listado de
          participantes tenga mas sentido.</li>
        <li>La barra de navegaci&oacute;n de actividades tiene ahora botones para ir
          a las actividades anterior y siguiente.</li>
        <li>Las fechas de los ficheros eran incorrectas en algunos sistemas -
          ha sido arreglado.</li>
        <li>Los usuarios antiguos de chat ya no se muestran en la actividad reciente.</li>
      </ul>
    </dd>
    <dt>Administraci&oacute;n del sitio:</dt>
    <dd>
      <ul>
        <li>Solucionado un importante problema de seguridad para evitar que los
          profesores accedan a Moodle como profesores si los administradores
          eran estudiantes en su curso.</li>
        <li>Nueva variable &quot;forcelogin&quot;  permite forzar a los usuarios
          a hacer un login antes de que pueden ver cualquier cosa del sitio.</li>
        <li>Nueva variable &quot;opentogoogle&quot;  permite a Google y a los
          usuarios entrando desde Google, acceder directamente como invitados.</li>
        <li>Nueva variable &quot;timezone&quot; permite definir una franja horaria
          por defecto para todo el sitio.</li>
        <li>Nueva variable &quot;deleteunconfirmed&quot; especifica el tiempo
          que se esperar&aacute; para que una cuenta sea confirmada antes de proceder
          a su borrado.</li>
        <li>Nueva variable &quot;allowunenroll&quot; activa y desactiva la posibilidad
          de que los alumnos puedan desmatricularse por s&iacute; mismos de los cursos.</li>
        <li>Nueva variable &quot;fullnamedisplay&quot; permite ignorar el formato
          de los nombres completos de los usuarios para que los alumnos puedan
          ver &quot;nombre apellidos&quot;, &quot;apellidos nombre&quot; o &quot;nombre&quot;.</li>
        <li>Los usuarios, de forma individual, pueden tener su correo electr&oacute;nico
          desactivado por un profesor o administrador (&uacute;til para evitar direcciones
          de correo incorrectas que generan muchos correos devueltos).</li>
        <li>El tama&ntilde;o de env&iacute;o de ficheros al sitio puede ser controlado en todo
          Moodle utilizando &quot;maxbytes&quot;.
          Hay un l&iacute;mite del sitio (restringido a valores inferiores a los l&iacute;mites
          propios de PHP), que es el tope para los limites de curso, que son
          el tope para los l&iacute;mites de las actividades.</li>
        <li>Las cookies de Moodle pueden ser personalizadas (ayuda al correr
          muchos Moodles en un servidor).</li>
        <li>Incluido un gui&oacute;n para analizar el rendimiento de la base de datos
          (admin/dbperformance.php).</li>
        <li>Incluido un gui&oacute;n para comprobar la compatibilidad de un servidor
          con Moodle (lib/compatible.php)</li>
        <li>Si esiste un fichero llamado &quot;cronextra.php&quot; en el directorio definido
          por la variable &quot;$CFG-&gt;dataroot&quot;, &eacute;ste es tambi&eacute;n ejecutado.
          Esto permite a los sitios tener algunas propiedades de mantenimiento
          &quot;especiales&quot;.</li>
        <li>Los formatos de curso son ahora mucho m&aacute;s como plugins, en directorios
          separados.</li>
        <li>Los usuarios pueden ser cargados desde ficheros de texto.</li>
        <li>Si $CFG-&gt;disableuserimages est&aacute; definida(en config.php) entonces,
          las im&aacute;genes de los usuarios no pueden ser cambiadas.</li>
        <li>Si $CFG-&gt;admineditalways est&aacute; definido, entonces el administrador
          puede editar cualquier mensaje en cualquier momento.</li>
        <li>Si $CFG-&gt;filterall est&aacute; definido, entonces incluso las cosas m&aacute;s
          peque&ntilde;as, como los t&iacute;tulos de los foros y los nombre de las actividades
          son filtrados.</li>
        <li>Incluido soporte para usuarios de demostraci&oacute;n restringidos (por
          ejemplo el Profesor Demo en Moodle.org) - los nombres de los usuarios
          pueden ser a&ntilde;adidos a la lista de los nombres en config.php, por ejemplo
          $CFG-&gt;restrictusers = 'teacher,fred';</li>
      </ul>
    </dd>
    <dt>Themes:</dt>
    <dd>
      <ul>
        <li>Soluci&oacute;n de problemas para que Internet Explorer utilice la hoja
          de estilos de una manera m&aacute;s robusta.</li>
        <li>Cambio y mejoras varias en los temas - <strong>los temas personales
        necesitan ser actualizados!</strong></li>
      </ul>
    </dd>
    <dt>Traducciones:</dt>
    <dd>
      <ul>
        <li>Nuevos  lenguajes: Gallego y Lituano.</li>
        <li>Mejorado el interfaz de edici&oacute;n de lenguajes - ahora permite elegir
          el lenguaje actual y la edici&oacute;n de ficheros por separdo.</li>
        <li>La lista de los nombres de los paises puede ser traducida, as&iacute; como
          los botones del editor, los nombres de los emoticones y los tama&ntilde;os
          de los ficheros (Mb, Gb etc.).</li>
        <li>Los paquetes de los lenguajes pueden definir la direcci&oacute;n por defecto
          (de izquierda a derecha o viceversa).</li>
        <li>Los paquetes de los lenguajes pueden definir el orden en el que los
          nombres de los usuarios ser&aacute; mostrado.</li>
        <li>Los ficheros de los lenguajes ahora est&aacute;n escritos utilizando un
          c&oacute;digo PHP m&aacute;s eficiente.</li>
        <li>Por fin se has eliminado todos los saltos de l&iacute;nea que produc&iacute;an
          errores en algunos ficheros de lenguajes.</li>
        <li>Los cursos pueden &quot;forzar&quot; un lenguaje para todos los alumnos.</li>
      </ul>
    </dd>
    <dt>Copia de Seguridad / Restauraci&oacute;n:</dt>
    <dd>
      <ul>
        <li>Las copias de seguridad autom&aacute;ticas pueden ser programadas por el
          administrador para todos los cursos a la vez.</li>
        <li>Los registros son restaurados completamente.</li>
        <li>Todoslos usuarios necesarios son incluidos ahora en las copias de
          seguridad (incluso si los alumnos no est&aacute; matriculados).</li>
        <li>Solucionados varios problemas e incluidas distintas mejoras menores.</li>
      </ul>
    </dd>
    <dt>Filtros de texto y formateo:</dt>
    <dd>
      <ul>
        <li>Avido: Los nuevos filtros de texto incrementar&aacute;n la carga de tu servidor,
          particularmente cuando se trata de filtros complicados. Util&iacute;zalos
          con cuidado.</li>
        <li>El nuevo <strong>filtro del  glosario</strong> puede crear enlaces
          a entradas del glosario, buscand concordancias por todo Moodle.</li>
        <li>El nuevo<strong> filtro TeX</strong> puede convertir c&oacute;digo TeX en
          cualquier sitio de Moodle a notaci&oacute;n matem&aacute;tica
          (imagen GIF generada). Existe tambi&eacute;n <strong>un filtro de &aacute;lgebra</strong> con
          un formato de entrada m&aacute;s sencillo (parecido a las calculadoras).</li>
        <li>El nuevo <strong>filtro censor</strong> puede ser activado para filtrar
          palabra malsonantes.</li>
        <li>El nuevo <strong>filtro  multilenguaje</strong> permite que los textos
          sean introducidos en m&uacute;ltiples lenguajjes, y solo el que concuerde
          con el del usuario, ser&aacute; mostrado.</li>
        <li>La etiqueta &lt;nolink&gt; puede ser utilizada para evitar el auto-enlazado
          de los textos de Moodle.</li>
        <li>Ampliado el soporte de etiquetas, incluyendo &lt;acronym&gt; and
          todas las etiquetas &lt;math&gt;.</li>
        <li>Algunas partes donde el texto no era filtrado de forma correcta (problema
          de seguridad) han sido corregidas.</li>
      </ul>
    </dd>
    <dt> API del desarrollador:</dt>
    <dd>
      <ul>
        <li>Una nueva gu&iacute;a del c&oacute;digo est&aacute; disponible.</li>
        <li>Una nueva gu&iacute;a de filosof&iacute;a est&aacute; disponible ;-)</li>
        <li>Mejoras en las plantillas de todos los m&oacute;dulos.</li>
        <li>Los m&oacute;dulos pueden especificar ahora la versi&oacute;n m&iacute;nima de Moodle
          con la que son compatibles.</li>
        <li>Los guiones pueden decidir imprimir print_header() cuando la p&aacute;gina
          en XML puro.</li>
        <li>Cualquier m&oacute;dulo puede almacenar preferencias del usuario que son
          recordadas entre sesiones.</li>
      </ul>
    </dd>
    <dt>Chats</dt>
    <dd>
      <ul>
        <li>Las sesiones del chat pueden ser borradas.</li>
        <li>Los chats programados muestran la franja horaria para ser m&aacute;s claros.</li>
      </ul>
    </dd>
    <dt>Foros:</dt>
    <dd>
      <ul>
        <li>Las preferencias de visualizaci&oacute;n de los foros son recordadas entre
          sesiones.</li>
        <li>El enlace &quot;Mostrar padre&quot; en todos los mensajes permite
          una navegaci&oacute;n m&aacute;s r&aacute;pida.</li>
        <li>Los mensajes individuales pueden ser ahora referenciados en cualquier
          parte de Moodle, gracias a los cambios introducidos en la forma de
          calcular las URLs.</li>
        <li>Mejoras en el funcionamiento del cron, as&iacute; como registro de errores
          de correo.</li>
        <li>Solo se muestra el bot&oacute;n de volorar cuando hay usuarios con los que
          hacerlo.</li>
        <li>Mejorado, de forma significativa, el formato de los correos HTML.</li>
        <li>Al responder a un mensaje, un resumen del mensaje es mostrado.</li>
        <li>Al utilizar el editor HTML para enviar un mensajje, algunas opciones
          ya nos son mostradas.</li>
      </ul>
    </dd>
    <dt>Diarios:</dt>
    <dd>
      <ul>
        <li>Las preguntas del diario pueden utilizar ahora el editor HTML.</li>
        <li>Solucionados algunos problemas con la valoraci&oacute;n de los diarios.</li>
      </ul>
    </dd>
    <dt>Cuestionarios:</dt>
    <dd>
      <ul>
        <li>Las preguntas y las categor&iacute;as pueden ser editadas sin necesidad
          de editar un cuestionario.</li>
        <li>Todas las preguntas pueden soportar cualquiera de los formatos de
          texto de Moodle.</li>
        <li>Nuevo formato de importaci&oacute;n: <strong>Formato GIFT</strong>          (es
          el nuevo formato por defecto)</li>
        <li>Nuevo formato de importaci&oacute;n: <strong>Course Test Manager</strong></li>
        <li>Nuevo formato de importaci&oacute;n: <strong>Formato WebCT</strong> </li>
        <li>Nuevo formato de importaci&oacute;n: <strong>Forma Aiken</strong> </li>
        <li>Las preguntas de respuesta corta ahora pueden utilizar comodines
          para concordancias.</li>
        <li>Las im&aacute;genes ahora funcionan para preguntas de otras categor&iacute;as
          p&uacute;blicas.</li>
        <li>Modificado el informe de actividad para mostrar m&aacute;s informaci&oacute;n y
        permitir el borrado de intentos.</li>
        <li>Incluido un nuevo informe para el an&aacute;lisis estad&iacute;sitco de los cuestionarios.</li>
        <li>Todas las preguntas pueden tener hasta 10 respuestas cada una.</li>
        <li>Los men&uacute;s de la edici&oacute;n de cuestionarios, ya no necesitan el bot&oacute;n
          &quot;continuar&quot;, son lanzados autom&aacute;ticamente (solo seleccionalos del meu)</li>
        <li>Corregido un probema que hac&iacute;a que el rec&aacute;culo de algunos cuestionarios
          con preguntas aleatorias.</li>
        <li>Corregido un problema que hac&iacute;a que la copia de seguridad de cursos
          con cuestionarios conpreguntas aleatorias no fuera ejecutada continuuamente.          </li>
        <li>Muchos otros peque&ntilde;os errores.</li>
      </ul>
    </dd>
    <dt>Recursos:</dt>
    <dd>
      <ul>
        <li>Los profesores pueden visualizar los ficheros de forma m&aacute;s directa
          al crear recursos de archivo subido.</li>
        <li>Nuevas variables para permitir una URL, una p&aacute;gina de
          b&uacute;squeda unos ajustes de  ventana flotante por defecto.</li>
        <li>Los archivos subidos tambi&eacute;nn pueden aparecer en ventanas flotantes.</li>
        <li>Visualizaci&oacute;n mucho mejor de las ventanas flotantes al acceder desde
          la bara de navegaci&oacute;n.</li>
        <li>Los ficheros MP3 pueden ser reproducidos internamente.</li>
        <li>Los ficheros de video (Media player, Quicktime) est&aacute;n &quot;incrustados&quot;
          mediante plugins internos.</li>
      </ul>
    </dd>
    <dt>Talleres:</dt>
    <dd>
      <ul>
        <li>Cambios en el sitema de valoraci&oacute;n cruzada.</li>
        <li>Nueva fase de valoraci&oacute;n.</li>
        <li>Nuevas opciones para la tabla de liga.</li>
      </ul>
    </dd>
    <dt>Miscellaneous</dt>
    <dd>
      <ul>
        <li>Moodle ignora cualquier carpeta que Frontpage haya podido a&ntilde;adir
          (_vti_cnf).</li>
        <li>Transici&oacute;n HTML -&gt; XHTML en muchos sitios.</li>
        <li>Soluci&oacute;n a muchos problemas con bases de datos diferentes de MySQL.</li>
        <li>Unas cuantas cadenas que estaban fijas en el c&oacute;digo ahora son traducibles.</li>
        <li>Los datos de los usuarios son borrados correctamente.</li>
        <li>Solucionados problemas an incrustar Moodle en un frame (por ejemplo
          en Postnuke).</li>
        <li>Mejoras en el modo Wiki.</li>
        <li>El administrador ya no puede editar cuentas externas.</li>
        <li>Los usuarios de Qmail pueden utilizar&quot;qmail&quot; en la variable
          &quot;smtphosts&quot; para obtener mejores resultados.</li>
        <li>Varios m&eacute;todos para redirigir implementados, para evitar varios bugs
          de los navegadores.</li>
        <li>Peque&ntilde;as mejoras en la visualizaci&oacute;n de calificaciones.</li>
        <li>Nuevos campos pueden ser editados por el estudiante, como el departamento
          y la instituci&oacute;n, y son exportados en el fichero Excel de calificaciones.</li>
        <li>Cuando un alumno es a&ntilde;adido como profesor, autom&aacute;ticamente es desmatriculado
          como alumno.</li>
        <li>Actualizado ADOdb (librer&iacute;a de comunicaci&oacute;n con la base de datos).</li>
      </ul>
    </dd>
  </dl>
</ul>
<hr>

<center>
  <p>
<a href="./?file=releaseold.html">Informaci&oacute;n de versiones antiguas</a>
</p>
</center>
<p>&nbsp;</p>
<p align="CENTER"><font size="1"><a href="../doc/" target="_top">Documentaci&oacute;n
      de
Moodle</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>
