<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<!-- Traducci&oacute;n al espa&ntilde;ol: Emmanuelle Guti&eacute;rrez y Restrepo (emmanuelle@sidar.org) y Claudio Tavares (claudio@enlaceacademico.com-->
</head>
<body>
<h2>Actualizaci&oacute;n de Moodle</h2>
<p>Moodle est&aacute; dise&ntilde;ado para actualizarse limpiamente
desde una versi&oacute;n preliminar a cualquiera posterior.</p>
<p>Al actualizar una instalaci&oacute;n de Moodle debe seguir estos
pasos:</p>
<h3>1. Copia de respaldo de datos importantes</h3>
<div style="padding-left: 3em;">
<p>Aunque no es estrictamente necesario, es siempre una buena idea
hacer una copia de respaldo de cualquier sistema de producci&oacute;n
antes de hacer una actualizaci&oacute;n importante, para el caso de que
tenga que volver a la versi&oacute;n antigua por cualquier
raz&oacute;n. De hecho, es una buena idea automatizar su servidor para
que haga copias de respaldo (<span lang="en">backup</span>) diariamente
de la instalaci&oacute;n de Moodle, de manera que pueda saltarse estos
pasos.</p>
<p>Hay tres &aacute;reas que necesitan ser salvaguardadas:</p>
<h4>1. El directorio del software de Moodle en s&iacute;</h4>
<p>Haga una copia separada de estos archivos antes de hacer la
actualizaci&oacute;n, de manera que pueda recuperar su <span>config.php</span>
y de cualquier m&oacute;dulo que haya a&ntilde;adido como temas,
idiomas, etc.</p>
<h4>2. Su directorio de datos.</h4>
<p>Aqu&iacute; es donde reside el contenido subido (como los recursos
de los cursos y las tareas de los estudiantes) as&iacute; que de todas
maneras es muy importante tener una copia de respaldo de estos
archivos. Algunas veces la actualizaci&oacute;n puede mover o renombrar
directorios dentro de su directorio de datos.</p>
<h4>3. Su base de datos</h4>
<p>La mayor&iacute;a de las actualizaci&oacute;nes de Moodle
alterar&aacute;n las tablas de la base de datos, a&ntilde;adiendo o
cambiando campos. Cada base de datos tiene formas diferentes de hacer
la copia de respaldo. Una manera de hacer una copia de respaldo de una
base de datos MySQL es 'descargarla' en una simple archivo SQL. El
siguiente ejemplo muestra los comandos en Unix para descargar la base
de datos llamada "moodle":</p>
<p
 style="padding-left: 3em; font-family: 'Courier New',Courier,monospace;">mysqldump
moodle &gt; moodle-backup-2002-10-26.sql</p>
<p>Tambi&eacute;n puede usar la opci&oacute;n "Manage        
Database" la interfaz Web de Moodle para hacer lo mismo en cualquier
plataforma.</p>
<p>&nbsp;</p>
</div>
<h3>2. Instalar el nuevo software de Moodle</h3>
<div style="padding-left: 3em;">
<h4>Usar un archivo descargado</h4>
<p>No sobreescriba una antigua instalaci&oacute;n a menos que
est&eacute; seguro de lo que est&aacute; haciendo... algunas veces los
archivos antiguos peuden causar problemas a la nueva
instalaci&oacute;n. La mejor manera es renombrar el directorio actual
de Moodle, y luego descomprimir el nuevo archivo de Moodle en la
antigua localizaci&oacute;n.</p>
	
<p
 style="padding-left: 3em; font-family: 'Courier New',Courier,monospace;">mv
moodle moodle.backup<br>
tar xvzf moodle-1.0.6.tgz</p>
<p>A continuaci&oacute;n, copie su config.php y cualquier otra
modificaci&oacute;n,&nbsp;<em lang="en"></em>como los temas
personalizados:</p>
<p
 style="padding-left: 3em; font-family: 'Courier New',Courier,monospace;">cp
moodle.backup/config.php moodle<br>
cp -pr moodle.backup/theme/mytheme moodle/theme/mytheme</p>
<h4>Uso del <abbr title="Concurrent Versions System" lang="en">CVS</abbr></h4>
<p>Si usted est&aacute; usando el <abbr
 title="Concurrent Versions System" lang="en">CVS</abbr>, s&oacute;lo
tiene que ir al directorio ra&iacute;z de Moodle y actualizar los
nuevos archivos:</p>
<p
 style="padding-left: 3em; font-family: 'Courier New',Courier,monospace;">cvs
update -dP</p>
<p>Aseg&uacute;rese de usar el par&aacute;metro "d" para crear nuevos
directorios si es necesario, y el par&aacute;metro "P" para cortar los
directorios vac&iacute;os.</p>
<p>Si usted ha estado editando archivos de Moodle, mire atentamente los
mensajes para detectar posibles conflictos. Todos sus temas
personalizados y <em lang="en">plugins</em> no est&aacute;ndar
estar&aacute;n intactos.</p>
<p>&nbsp;</p>
</div>
<h3>3. Concluir la actualizaci&oacute;n</h3>
<div style="padding-left: 3em;">
<p>El &uacute;ltimo paso es poner en funcionamiento el proceso de
actualizaci&oacute;n dentro de Moodle.</p>
<p>Para hacerlo, vaya a la <a href="../admin/index.php" target="_top">p&aacute;gina
de <span>admin</span> de su instalaci&oacute;n</a>.</p>
<p
 style="padding-left: 3em; font-family: 'Courier New',Courier,monospace;">http://example.com/moodle/admin</p>
<p>No importa si usted ha entrado como administrador o no.</p>
<p>Moodle detecta autom&aacute;ticamente la actualizaci&oacute;n y
lleva a cabo todas las actualizaciones necesarias de las bases de datos
y archivos de sistema. Si hay algo que no puede hacerse por s&iacute;
mismo (caso muy raro) entonces aparecer&aacute; un mensaje
dici&eacute;ndole lo que necesita hacer.<br>
<br>
Suponiendo que todo vaya bien (que no aparezca ning&uacute;n mensaje de
error) entonces &iexcl;puede comenzar a usar su nueva versi&oacute;n de
Moodle y disfrutar de sus nuevas caracter&iacute;sticas!</p>
<p>Si tiene problemas con la actualizaci&oacute;n, visite <a
 href="http://moodle.com/" target="_top">moodle.com</a> y colcoque un
mensaje en el <a href="http://moodle.com/mod/forum/view.php?id=28"
 target="_top">Foro de ayuda con la instalaci&oacute;n</a>.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
</div>
<p style="text-align: center; font-size: 0.7em;"><a href="."
 target="_top">Moodle Documentation</a></p>
<p style="text-align: center; font-size: 0.7em;">Version: $Id:
upgrade.html,v 1.2 2003/01/28 03:06:52 moodler Exp $</p>
</body>
</html>
