<P align="center">
	<B>URLs relativas, reproductores multimedia y Hot Potatoes</B></P>
<P><B>Definiciones</B></P>
<DL>
	<DT><I>URL</I></DT>
	<DD>la direcci&oacute;n de un recurso en Internet: una  p&aacute;gina web, im&aacute;genes o archivos de sonidos.</DD>
	<DT><I>URL absoluta </I></DT>
	<DD>una URL que comineza con &quot;http://&quot; se denomina  URL absoluta. Sea cual sea el sitio d&oacute;nde se utilice, simepre har&aacute; referencia al mismo recurso destino.</DD>
	<DT><I> URL relativa</I></DT>
	<DD>una URL que no comienza con &quot;http://&quot; se denomina URL relativa. Puede combinarse con la URL absoluta de una p&aacute;gina &quot;origen&quot;, para obtener la URL absoluta de un recurso destino.</DD>
</DL>
<P><B>Relative URLs in Hot Potatoes quizzes</B></P>
<P>Las URLs relativas consituyen una forma adecuada de especficar im&aacute;genes, sonidos y v&iacute;deos en un ejercicio de Hot Potatoes, ya que permiten que el ejercicio pueda ser visualizado y realizado en un disco local del PC, antes de publicarlo o subirlo a un  sitio Moodle. Cuando el ejerciico elaboado con Hot Potatoes se publica (se sube) en el sitio Moodle, deben subirse tambi&eacute;n los archivos multimedia para qu est&eacute;n disponibles cunado el ejercicio sea administrado a trav&eacute;s de Moodle.</P>
<P>Por razones de seguridad,  Moodle no permite el acceso directo a los archivos del curso. Todas las peticiones de archivos de un determnado curso pasan a trav&eacute;s de un script que hace de guardian, este script verifica que la persona que solicita el archivo est&aacute; inscrita en el curso. Sin embargo, este mencanismo puede provocar la rotura de los enlaces relativos incluidos en el ejercicio, ya que las reglas habituales para obtener una URL absoluta a partir de una URL relativa no funcionan.</P>
<P>La soluci&oacute;n es bastante simple: <FONT color="red"><B>todas las URLs  relativas deber&aacute;n convertirse en URLs absolutas</B></FONT> para cunado el ejercicio sea visualizado en el navegador. En el caso de los ejercicios de Hot Potatoes, las  URLs ser&aacute;n convertidas por Moodle, por tanto, los creadores de contenidos no tendr&aacute;n que preocuparse de esta tediosa tar&eacute;a y que, en muchas ocasiones, produce errores.</P>
<P><B>Reproductores Multimedia en los ejercicios de Hot Potatoes quizzes </B></P>
<P>Algunos reproductores multimedia no acceptan el archivo multimedia si viene a trav&eacute;s del script guardian de los archivos del curso. En este caso, es necesario sustituir dicho reproductor multimedia por otro que se sepa que es compatible con Moodle. Usted puede hacer esto por su cuenta modificando la referencia al reproductor multimedia en el ejercicio o puede obligar a Moodle a hacerlo configurando la opci&oacute;n &quot;Forzar complementos multimedia&quot; a &quot;S&iacute;&quot; en la p&aacute;gina de configuraci&oacute;n de ejercicio del m&oacute;dulo de Hot Potatoes.</P>
<P>&nbsp;</P>
