<P ALIGN=CENTER><B>Fazer Perguntas</B></P>
<P>Um bom modo para ajudar outras pessoas a refletirem sobre um assunto &eacute; fazer uma pergunta. Uma pergunta bem feita pode nos ajudar a organizar a informa&ccedil;&atilde;o, avaliar as nossas id&eacute;ias atuais e criar novas id&eacute;ias.</P>
<P>Fazer perguntas com o objetivo espec&iacute;fico de ajudar o processo de aprendizagem &eacute; um m&eacute;todo conhecido como <I>Socratic questioning</I>, express&atilde;o que se refere a S&oacute;crates, da Gr&eacute;cia antiga.</P>
<P>Quando voc&ecirc; usar quest&otilde;es socr&aacute;ticas, &eacute; preciso ouvir com aten&ccedil;&atilde;o o interlocutor para avaliar e compor as frases em modo construtivo e, preferivelmente, n&atilde;o antag&ocirc;nico.
<P>Eis, aqui, alguns exemplos:</P>
<!--Hidden comment: Someday I will include a great example dialogue here -->
<h3>Perguntas de esclarecimento</h3>
<ul>
  <li>O que voc&ecirc; quer dizer quando afirma que ______?</li>
  <li>Qual &eacute; o ponto crucial?</li>
  <li>Qual &eacute; a rela&ccedil;&atilde;o entre _____ e _____?</li>
  <li>Voc&ecirc; pode explicar isto de uma outra maneira?</li>
  <li>Vejamos se entendi o seu ponto de vista; voc&ecirc; quer dizer _____ ou _____?</li>
  <li>Qual &eacute; a rela&ccedil;&atilde;o entre isto e o nosso problema/discuss&atilde;o/argumento?</li>
  <li>Maria, voc&ecirc; pode resumir com as suas palavras o que o Ricardo disse? ... Ricardo, era isto o que voc&ecirc; queria dizer?</li>
  <li>Pode me dar um exemplo?</li>
  <li>_____ seria um bom exemplo disso?</li>
</ul>
<h3>Perguntas que verificam suposi&ccedil;&otilde;es</h3>
<ul>
  <li>Qual &eacute; a sua suposi&ccedil;&atilde;o aqui?</li>
  <li>Qual &eacute; a suposi&ccedil;&atilde;o de Maria?</li>
  <li>O que poder&iacute;amos supor em vez disto?</li>
  <li>Parece que voc&ecirc; sup&otilde;e _____. Entendi corretamente?</li>
  <li>Todo o seu discurso depende da ideia de que _____. Porque voc&ecirc; baseou a sua hip&oacute;tese em _____ em vez de em _____?</li>
  <li>Parece que voc&ecirc; sup&otilde;e que _____. Como voc&ecirc; explica a avalia&ccedil;&atilde;o disto como ponto pac&iacute;fico ?</li>
  <li>&Eacute; sempre assim?  Porque voc&ecirc; acha que esta suposi&ccedil;&atilde;o &eacute; pertinente?</li>
  <li>Porque algu&eacute;m partiria desta suposi&ccedil;&atilde;o? </li>
</ul>
<h3>Perguntas que verificam evid&ecirc;ncias e linhas de racioc&iacute;nio</h3>
<ul>
  <li>Voc&ecirc; pode explicar a sua linha de racioc&iacute;nio?</li>
  <li>Como isso se aplica a este caso?</li>
  <li>Existe uma raz&atilde;o para duvidar desta evid&ecirc;ncia?</li>
  <li>Quem pode saber que isto &eacute; verdade?</li>
  <li>O que voc&ecirc; diria a algu&eacute;m que afirmasse que ____?</li>
  <li>Mais algu&eacute;m pode apresentar evid&ecirc;ncias a favor deste ponto de vista?</li>
  <li>Como voc&ecirc; chegou a esta conclus&atilde;o?</li>
  <li>Como podemos descobrir se isto &eacute; verdade? </li>
</ul>
<h3>Perguntas sobre pontos de vista ou perspectivas </h3>
<ul>
  <li>Em que implica esta afirma&ccedil;&atilde;o?</li>
  <li>Quando voc&ecirc; diz _____, voc&ecirc; subentende _____?</li>
  <li>Mas se isto acontecesse, quais seriam os outros resultados? Porque?</li>
  <li>Quais seriam os efeitos disto?</li>
  <li>Isto aconteceria necessariamente ou &eacute; apenas uma possibilidade?</li>
  <li>Qual &eacute; uma alternativa?</li>
  <li>Se _____ e _____ s&atilde;o verdadeiros, o que mais poderia s&ecirc;-lo?</li>
  <li>Se dissermos que ____ &eacute; etico, o que podemos dizer de _____? </li>
</ul>
<h3>Perguntas que verificam implica&ccedil;&otilde;es e consequ&ecirc;ncias </h3>
<ul>
  <li>Como podemos descobrir isto?</li>
  <li>Qual &eacute; a suposi&ccedil;&atilde;o desta pergunta?</li>
  <li>_____ elaboraria esta quest&atilde;o em modo diverso?</li>
  <li>Como algu&eacute;m poderia esclarecer esta quest&atilde;o?</li>
  <li>&Eacute; poss&iacute;vel subdividir esta quest&atilde;o?</li>
  <li>Esta pergunta &eacute; clara? Entendemos isto?</li>
  <li>Esta pergunta &eacute; f&aacute;cil ou dif&iacute;cil de responder? Porque?</li>
  <li>Todos n&oacute;s concordamos que esta &eacute; a quest&atilde;o?</li>
  <li>Para responder esta pergunta, quais outras perguntas temos que responder primeiro?</li>
  <li>Como _____ definiria este problema?</li>
  <li>Porque esta quest&atilde;o &eacute; importante?</li>
  <li>Esta &eacute; a pergunta mais importante ou existe uma outra quest&atilde;o na qual esta se baseia?</li>
  <li>Voc&ecirc; pode ver a rela&ccedil;&atilde;o disto com ________?</li>
</ul>
<HR>
<FONT SIZE=1><I>Quest&otilde;es adaptadas de Paul, R. (1993). Critical Thinking: How To Prepare Students for a Rapidly Changing World: Foundation for Critical Thinking, Santa Rosa, CA. </I></FONT>
<P ALIGN=RIGHT><a href="help.php?file=writing.html">Mais detalhes sobre Reda&ccedil;&atilde;o</a></P>
<P ALIGN=RIGHT><a href="help.php?file=reading.html">Mais detalhes sobre Leitura</a></P>
