<P ALIGN=CENTER><B>Formata&ccedil;&atilde;o de Texto</B></P>

<P>Para formatar textos, voc&ecirc; pode escolher entre algumas op&ccedil;&otilde;es, dependendo do seu navegador e da sua experi&ecirc;ncia.

<P><B>1. Formato Autom&aacute;tico</B></P>

<UL>
<P>Esta op&ccedil;&atilde;o &eacute; a mais indicada quando voc&ecirc; usar formul&aacute;rios Web para escrever o texto (em vez de usar o editor HTML).  Escreva o texto como se voc&ecirc; estivesse redigindo uma email.

<P>Quando voc&ecirc; gravar o texto, a formata&ccedil;&atilde;o ser&aacute; autom&aacute;tica.    
<A HREF="http://yahoo.com/">http://yahoo.com</A> ou ainda 
   <A HREF="http://www.yahoo.com/">www.yahoo.com</A> ser&atilde;o convertidas em links.
<P>O alinhamento vai ser mantido e linhas deixadas em branco ser&atilde;o interpretadas como in&iacute;cio de novos par&aacute;grafos.
<P>Emoticons (carinhas) como :-) ser&atilde;o convertidos automaticamente em seus equivalentes gr&aacute;ficos.
<P>Voc&ecirc; tamb&eacute;m pode incluir c&oacute;digo HTML, se quiser.
<p align=right><a href="help.php?file=text.html">Mais detalhes sobre a Formata&ccedil;&atilde;o Autom&aacute;tica</a></p>
</UL>


<P><B>2. Formato HTML</B></P>

<UL>
<P>Esta op&ccedil;&atilde;o pressup&otilde;e que o texto seja editado com o uso de c&oacute;digo HTML. Esta &eacute; a op&ccedil;&atilde;o predefinida quando se usa o editor HTML - os instrumentos do editor produzem c&oacute;digo HTML para voc&ecirc;.

<P>Mesmo se n&atilde;o estiver usando o editor, voc&ecirc; pode inserir codigo HTML no texto para obter o resultado desejado. Neste caso, n&atilde;o ocorre nenhuma formata&ccedil;&atilde;o autom&aacute;tica.
<p align=right><a href="help.php?file=html.html">Mais detalhes sobre o uso de HTML</a></p>
<p align=right><a href="help.php?file=richtext.html">Mais detalhes sobre o editor HTML</a></p>
</UL>


<P><B>3. Formato TEXT</B></P>

<UL>
<P>Este formato &eacute; &uacute;til quando voc&ecirc; quiser usar c&oacute;digo HTML escrito por voc&ecirc; mesmo, para ser visualizado exatamente como voc&ecirc; o escreveu.

<P>O texto s&oacute; ser&aacute; retocado nos casos de visualiza&ccedil;&atilde;o de 'carinhas' e interrup&ccedil;&otilde;es de linhas.
</UL>


<P><B>4. Formato Wiki</B></P>
<UL>
<P>Este formato usa marcadores no texto para fazer uma convers&atilde;o autom&aacute;tica em HTML.

<p align=right><a href="help.php?file=wiki.html">Mais detalhes sobre o uso do Formato Wiki</a></p>
</UL>

