<p align="center"><b>Escrever Textos com Formato Wiki</b></p>

<p>O formato Wiki usa elementos marcadores do texto que ser&atilde;o convertidos em XHTML quando visualizados. Voc&ecirc; n&atilde;o precisa aprender o HTML para usar o Wiki e o uso de marcadores &eacute; intuitivo. Esta pode ser uma boa alternativa para quem n&atilde;o sabe programar HTML mas quer controlar a formata&ccedil;&atilde;o.
</p>

<p>Voc&ecirc; deve digitar textos simples e adicionar <em>caracteres especiais</em> como marcadores para a formata&ccedil;&atilde;o.</p>

<h3> Formata&ccedil;&atilde;o a n&iacute;vel de bloco de texto</h3>

<p>Par&aacute;grafos s&atilde;o separados por almenos uma linha em branco.
Para formatar par&aacute;grafos adicione um dos seguintes caracteres especiais antes do primeiro car&aacute;ter da primeira linha do bloco seguido por um espa&ccedil;o...
</p>

<table>
  <tr><th>Caracteres</th><th>Tipo de Bloco</th></tr>
  <tr><td>Nenhum car&aacute;cter</td><td>Par&aacute;grafo comum</td></tr>
  <tr><td>&gt;</td><td>Cita&ccedil;&atilde;o</td></tr>
  <tr><td>Space</td><td>Texto Preformatado (Monospaced)</td></tr>
  <tr><td>%</td><td>Texto Preformatado <em>e</em> Wiki s&atilde;o ignorados</td></tr>
  <tr><td>!#</td><td>T&iacute;tulo - o s&iacute;mbolo # deve ser substituido por um n&uacute;mero (1-6) que corresponde ao tamanho (1 &eacute; o maior)</td></tr>
  <tr><td>Q.</td><td>Quest&atilde;o - estilo especial para melhorar a visualiza&ccedil;&atilde;o de textos com perguntas/respostas.</td></tr>
  <tr><td>A.</td><td>Resposta -  estilo especial para melhorar a visualiza&ccedil;&atilde;o de textos com perguntas/respostas.</td></tr>
</table>

<h3>Listas</h3>

<p>Para formatar listas simples basta digitar um car&aacute;ter especial no in&iacute;cio de cada linha, seguido por um espa&ccedil;o.
O fim da lista &eacute; uma linha em branco. As listas podem ser aninhadas e podem ser de tipos diversos. Veja, a seguir, os tipos de listas...</p>

<table>
  <tr><th>Caracteres</th><th>Tipo de lista</th></tr>
  <tr><td>*</td><td>Listas n&atilde;o ordenadas (bullet )</td></tr>
  <tr><td>#</td><td>Listas ordenadas (1,2,3 etc)</td></tr>
  <tr><td>:</td><td>Lista de defini&ccedil;&otilde;es, defini&ccedil;&atilde;o</td></tr>
  <tr><td>;</td><td>Lista de defini&ccedil;&otilde;es, texto</td></tr>
</table>  

<p>Exemplo de listas aninhadas:</p>
<p><pre>
  * primeiro bullet
  * segundo bullet
  ## linha aninhada 1
  ## linha aninhada 2
  * terceiro bullet
</pre></p>
<p>Resultado:
<ul><li>primeiro bullet</li>
  <li>segundo bullet</li>
  <ol><li>linha aninhada 1</li>
    <li>linha aninhada 2</li></ol>
  <li>terceiro bullet
</ul></p>

<h3>Formata&ccedil;&atilde;o de trechos de frases</h3>

<p>Voc&ecirc; pode usar os marcadores para formatar trechos de frases com um estilo mas a formata&ccedil;&atilde;o n&atilde;o se estende a outras linhas.
Eis os estilos...</p>

<table>
  <tr><th>Exemplo</th><th>Exemplo</th><th>Formata&ccedil;&atilde;o</th></tr>
  <tr><td>*hello world*</td><td><strong>hello world</strong></td><td>Strong ou Bold</td></tr>
  <tr><td>/hello world/</td><td><em>hello world</em></td><td>Emphasis ou Italics</td></tr>
  <tr><td>+hello world+</td><td><ins>hello world</ins></td><td>Inserted text</td></tr>
  <tr><td>-hello world-</td><td><del>hello world</del></td><td>Deleted ou Strikethrough</td></tr>
  <tr><td>hello ~world~</td><td>hello <sub>world</sub></td><td>Subscript</td></tr>
  <tr><td>hello ^world^</td><td>hello <sup>world</sup></td><td>Superscript</td></tr>
  <tr><td>"hello world"</td><td><q>hello world</q></td><td>Quoted</td></tr>
  <tr><td>%hello world%</td><td><code>hello world</code></td><td>Code ou Monospaced</td></tr>
  <tr><td>@hello world@</td><td><cite>hello world</cite></td><td>Cite</td></tr>
</table>  

<h3>Acr&ocirc;nimos</h3>

<p>Para indicar um acr&ocirc;nimo, escreva este acr&ocirc;nimo usando letras mai&uacute;sculas, seguidas pela descri&ccedil;&atilde;o entre par&ecirc;ntesis, sem esp&ccedil;os entre o acr&ocirc;nimo e os par&ecirc;ntesis. Exemplo...
</p>

<p>HTML(Hypertext Markup Language) <br />   <acronym title="Hypertext Markup Language">HTML</acronym></p>

<h3>Links</h3>

<p>O endere&ccedil;o URL deve ser inserido no texto seguido (sem espa&ccedil;os) pelo texto a ser visualizado (entre par&ecirc;ntesis). Exemplo: </em>http://www.google.com/(Search Now)</em> ser&aacute; visualizado como  
<a href="http://www.google.com/">Search Now</a>.</p>

<p>Links a emails tamb&eacute;m podem ser inseridos , por exemplo:</p>
<p>nobody@example.com(Test User) ser&aacute; visualizado como 
<a href="mailto:nobody@example.com">Test User</a></p>

<h3>Links a m&oacute;dulos da plataforma</h3>

<p>Para identificar o n&uacute;mero do ID de um m&oacute;dulo plataforma, procure no final do endere&ccedil;o do m&oacute;dulo o trecho:  ?id=nn . Com este trecho e o nome do m&oacute;dulo voc&ecirc; pode criar um link direto, usando a seguinte sintaxe: </p>

<p>ModuleName:nn(Texto Visualizado)</p>
<p>ex. <em>resource:36(Nova p&aacute;gina)</em>   <em>forum:10(V&aacute; ao F&oacute;rum)</em></p>

<h3>Links a imagens</h3>

<p>Para inserir imagens em textos com formato Wiki voc&ecirc; deve enviar antes a imagem ao servidor da plataforma e depois anotar o endere&ccedil;o/percurso do arquivo. A sintaxe &eacute;:</p>

<p>/<em>..percurso do arquivo..</em>(texto alt)</p>

<p>por exemplo,  /mypics/graphic.jpg(Staff picture)</p>

<h3>Convers&atilde;o autom&aacute;tica</h3>

<p>Muitas instru&ccedil;&otilde;es comuns s&atilde;o convertidas automaticamente em XHTML. As principais s&atilde;o as seguintes...</p>

<ul>
  <li>links HTTP s&atilde;o convertidos em links ativos
  <li> ..., (R), (TM), (C), 1/4, 1/2, 3/4 s&atilde;o convertidos nos caracteres correspondentes
  <li> nr x nr &eacute; convertido em sinal de multiplica&ccedil;&atilde;o
  <li>Uma linha que come&ccedil;a com 4 h&iacute;fens &eacute; convertida em linha horizontal
</ul>  

<h3>Controle ortogr&aacute;fico (Experimental)</h3>

<p>Para ativar a funcionalidade de controle ortogr&aacute;fico, insira provisoriamente a seguinte frase no texto. 

<pre>
!SPELL:language_code:language_variant

Exemploss:
!SPELL:en:british
!SPELL:sp
</pre>

<p>"language_code" deve ser substituido pelo c&oacute;digo que corresponde ao idioma utilizado ( EN, FR etc), "language_variant" &eacute; opcional e pode ser  "american", "british", or "canadian" se o idioma for EN.</p>

<p>Todas as palavras "suspeitas" ser&atilde;o evidenciadas e  algumas sugest&otilde;es para a corre&ccedil;&atilde;o ser&atilde;o visualizadas, sobrepondo o ponteiro do mouse a estas palavras.</p>

<p><em>NOTA: o controle ortogr&aacute;fico usa PSPELL. Se os dicion&aacute;rios necess&aacute;rios n&atilde;o forem instalados no seu server, o controle ortogr&aacute;fico n&atilde;o vai funcionar. A plataforma Windows n&atilde;o &eacute; compat&iacute;vel com esta funcionalidade.
</em></p>
