<p align="center"><b>Komponenter i en uppgift</b></p>

<p>
F&ouml;r att underl&auml;tta betygss&auml;ttningen b&ouml;r en Workshop-uppgift
ha ett rimligt antal 'komponenter' att bedöma/värdera/betygssätta. Varje komponent
b&ouml;r t&auml;cka n&aring;gon viktig aspekt av uppgiften. 
<br /><br />
I normalfallet kommer
en uppgift att best&aring; av 5 till 15 komponenter som ska 
kommenteras och f&aring; ett betyg eller ett omd&ouml;me i n&aring;gon form.
Hur m&aring;nga det blir i det enskilda fallet beror p&aring; hur komplex och omfattande
uppgiften &auml;r. Du kan skapa en uppgift som best&aring;r av bara en komponent och 
som har en strategi f&ouml;r bed&ouml;mning/v&auml;rdering/betygss&auml;ttning
som liknar den i standardmodulen f&ouml;r uppgifter i Moodle.
</p>	
<p>
De typer av komponenter som beror p&aring; strategin f&ouml;r hur uppgiften betygss&auml;tts/f&aring;r ett omd&ouml;me
&auml;r f&ouml;ljande:

<p><b>Inte betygssatt</b> 
<br />
Komponenterna &auml;r beskrivningar av aspekter p&aring; uppgiften.
Bed&ouml;maren/v&auml;rderaren/betygss&auml;ttaren ombeds att kommentera
dessa aspekter. Liksom f&ouml;r alla strategierna f&ouml;r att s&auml;tta betyg/avge omd&ouml;men
s&aring; finns det ocks&aring; ett utrymme f&ouml;r allm&auml;nna kommentarer.
</p>	
<b>Ackumulerande betygss&auml;ttning.</b>
<br /> 
Komponenterna har f&ouml;ljande tre egenskaper:
<ol>
<li>
BESKRIVNINGEN av komponenten. Den b&ouml;r klart uttala vilken aspekt av uppgiften
det &auml;r som ska bedömas/värderas/betygssättas. Om bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen
&auml;r kvalitativ s&aring; b&ouml;r Du ange vad som ska anses vara utm&auml;rkt, medel och svagt.
<br /><br />
</li>	
<li>
SKALAN f&ouml;r komponenten. Det finns ett antal f&ouml;rdefinierade skalor.
De har en vidd fr&aring;n enkla 'Ja/Nej'-skalor, via flerpo&auml;ngsskalor till
en skala f&ouml;r upp till 100%. Varje komponent har sin egen skala som Du b&ouml;r v&auml;lja
i syfte att spegla alla de variationer som &auml;r m&ouml;jliga f&ouml;r den komponenten.
L&auml;gg m&auml;rke till att skalan INTE avg&ouml;r komponentens betydelse n&auml;r 
det &ouml;vergripande betyget/omd&ouml;met ska ber&auml;knas. En tv&aring;po&auml;ngsskala
har samma betydelse som en hundrapo&auml;ngsskala om de tv&aring; komponenterna har samma viktade
v&auml;rde...
<br /><br />
</li>
<li>
Det VIKTADE V&Auml;RDET av komponenten. Som standardval har alla komponenter samma
betydelse n&auml;r det &ouml;vergripande betyget/omd&ouml;met f&ouml;r uppgiften
ska ber&auml;knas. Detta kan Du &auml;ndra genom att ange ett l&auml;gre v&auml;rde f&ouml;r 
mindre viktiga komponenter och ett h&ouml;gre f&ouml;r dem som &auml;r viktigare. Om Du
&auml;ndrar de VIKTADE V&Auml;RDENA s&aring; f&ouml;r&auml;ndras inte maxbetyget. Det v&auml;rdet
best&auml;ms av det maxbetyg som Du anger f&ouml;r uppgiften p&aring; 'peer'-niv&aring;.
Du kan &auml;ven ange negativa VIKTADE V&Auml;RDEN. Detta &auml;r en experimentell egenskap.
</li>
</ol>
<p><b>Betyg/omd&ouml;men utifr&aring;n en skala av m&ouml;jliga felaktigheter/brister.</b> 
<br />
I normalfallet kommer komponenterna att beskriva vissa element eller aspekter som m&aring;ste
ing&aring; i uppgiften. Bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen g&ouml;rs utifr&aring;n 
huruvida dessa element och aspekter &auml;r beaktade eller inte. 
<br /><br />
Som distansl&auml;rare m&aring;ste Du
i betygs/omd&ouml;mestabellen ange vilka betyg/omd&ouml;men som ska g&auml;lla om alla &auml;r beaktade,
om en eller tv&aring; saknas osv. Om vissa element &auml;r viktigare &auml;n andra s&aring; kan de viktas
h&ouml;gre &auml;n andra. Den &ouml;vergripande 'felr&auml;kningen' utg&ouml;rs av en viktad summa av
element som saknas. Bed&ouml;maren/v&auml;rderaren/betygss&auml;ttaren kan alltid g&ouml;ra mindre justeringar
betr&auml;ffande dessa f&ouml;reslagna betyg/omd&ouml;men. 
</p>
<p><b>Betyg/omd&ouml;men i enlighet med kriterier.</b>
<br />
Komponenterna kommer att erbjuda ett antal kritererier f&ouml;r olika niv&aring;er. Dessa kriterier
kan anv&auml;ndas f&ouml;r att rangordna uppgiftsl&ouml;sningar. 
Kriterierna kan vara <i>kumulativa</i> som (fortl&ouml;pande samlar till en helhet) 
eller ocks&aring; kan de vara frist&aring;ende i och f&ouml;r att bed&ouml;mas/v&auml;rderas var f&ouml;r sig.
Bed&ouml;maren/v&auml;rderaren/betygss&auml;ttaren m&aring;ste avg&ouml;ra  vilka kriterier som 
b&auml;st passar in p&aring; det aktuella arbete som ska bed&ouml;mas/v&auml;rderas/betygss&auml;ttas.
<br /><br />
Som distansl&auml;raren m&aring;ste Du ocks&aring; relatera varje kriterium till ett f&ouml;reslaget betyg.
Bed&ouml;maren/v&auml;rderaren/betygss&auml;ttaren kan alltid g&ouml;ra mindre justeringar
betr&auml;ffande dessa f&ouml;reslagna betyg/omd&ouml;men. 
</p>

<p><b>Betyg/omd&ouml;men i enlighet med 'rubriker'.</b> 
<br />
Detta liknar ovanst&aring;ende men det finns mer &auml;n ett kriterium. Antalet
kriterier anger Du i parametrarna f&ouml;r uppgiften. Inom varje kriterium kan
det finnas p&aring;st&aring;enden som kan gradera upp till 5 olika niv&aring;er. 
I en viss uppgift kan antalet niv&aring;er variera fr&aring;n kriterium till kriterium.
N&auml;r Du anger ett kriterium s&aring; signalerar en niv&aring; d&auml;r det saknas ett 
p&aring;st&aring;ende att det h&auml;r &auml;r den sista niv&aring;n. P&aring; s&aring; s&auml;tt kan
en del kriterier ha tv&aring;, tre eller upp till fem niv&aring;er. Kriteriernas v&auml;rden kan viktas.
Niv&aring;erna bed&ouml;ms som 0, 1, 2, 3, eller 4. Betyget/omd&ouml;met f&ouml;r bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen
&auml;r en viktad summa av dessa resultat.
</p>