<p align="center"><b>Att s&auml;tta betyg/avge omd&ouml;men p&aring; 'peer'-niv&aring;</b></p>

<p>
F&ouml;r att underl&auml;tta betygs&auml;ttning/omd&ouml;men av uppgifter p&aring; 
'peer'-niv&aring; s&aring; &auml;r dessa uppgifter uppdelade i komponenter
som ska bedömas/värderas/betygssättas.
</p> <p>
Varje komponent t&auml;cker en specifik
aspekt p&aring; uppgiften.
<br /> Beroende p&aring; vilken typ av uppgift det &auml;r 
ska Du:</p>
<ol>
<li>
skriva in ett betyg/omd&ouml;me genom att klicka p&aring; r&auml;tt knapp eller v&auml;lja
ett passande tal fr&aring;n den utf&auml;llbara menyn.
<br /> <br /> 
</li>
	
<li>
skriva in en motivering  till varf&ouml;r Du l&auml;mnade ett visst betyg/omd&ouml;me. 
Det g&ouml;r Du i boxen f&ouml;r &aring;terkoppling. Om Du tycker att detta &auml;r uppenbart
s&aring; beh&ouml;ver Du inte fylla i n&aring;gonting. L&auml;gg dock m&auml;rke till
att distansl&auml;raren kan titta p&aring; Din bed&ouml;mning/v&auml;rdering/betygss&auml;ttning
och ifr&aring;gas&auml;tta den om Du inte har l&auml;mnat n&aring;gon motivering.
</li>
</ol>

<p>
I en del typer av bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar
blir Du ombedd att avg&ouml;ra om vissa delar i uppgiftsl&ouml;sningen 
finns med eller inte. I andra ska Du ta st&auml;llning till vilka p&aring;st&aring;enden
som b&auml;st st&auml;mmer in p&aring; uppgiftsl&ouml;sningen i fr&aring;ga.
N&auml;r det g&auml;ller b&aring;da dessa typer av uppgifter kan Du anpassa 
betyget/omd&ouml;met lite om Du tycker att det &auml;r l&auml;mpligt.
</p>
<p>
Den sista boxen i det h&auml;r formul&auml;ret l&aring;ter Dig l&auml;mna en allm&auml;n
kommentar till arbetet. Den ska visa att Din bed&ouml;mning/v&auml;rdering/betygss&auml;ttning
&auml;r rimlig. Den b&ouml;r vara artig och s&aring; konstruktiv som m&ouml;jligt. 
Din bed&ouml;mning/v&auml;rdering/betygss&auml;ttning kommer att visas f&ouml;r den 
som har skickat in uppgiften.
</p>
<p>
Du har en viss begr&auml;nsad tid p&aring; Dig, i normalfallet 30 minuter, f&ouml;r att 
reflektera &ouml;ver vad Du har skrivit och eventuellt revidera det. N&auml;r den tiden 
&auml;r ute kommer den person som vars arbete Du har bed&ouml;mt/v&auml;rderat/betygssatt
att f&aring; ett e-postmeddelande om det. Efter det kan Du inte &auml;ndra n&aring;gonting.
</p>
