<p align="center"><b>Att hantera en uppgift av typen Workshop</b></p>

<p> En uppgift av typen Workshop &auml;r mer komplex &auml;n en vanlig uppgift.
	Den innefattar ett antal steg eller faser. Dessa &auml;r:</p>

<ol>
<li><p><b>Att arrangera uppgiften</b><br /> Bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen av 
uppgiften b&ouml;r delas upp i ett antal KOMPONENTER. Detta g&ouml;r betygss&auml;ttningen av uppgiften
mindre godtycklig och f&ouml;rser studenten/eleven/deltagaren/den l&auml;rande med en modell f&ouml;r hur uppgiften 
ska genomf&ouml;ras. Det &auml;r distansl&auml;rarens sak att arrangera komponenterna f&ouml;r bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen
och att skapa kriterier f&ouml;r detta i n&aring;gon form. (Se &auml;ven den sidan f&ouml;r mer detaljer)</p>
	
	<p>N&auml;r komponenterna f&ouml;r bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen &auml;r arrangerade
	s&aring; kommer distansl&auml;raren normalt sett att skicka in en liten upps&auml;ttning exempel p&aring; 
	uppgiftsl&ouml;sningar.
	Detta &auml;r &ouml;vningsmaterial som studenterna/eleverna/deltagarna/de l&auml;rande
	kan bed&ouml;ma/v&auml;rdera/betygss&auml;tta innan de b&ouml;rjar arbeta med sina egna uppgifter.
	Dessa exempel b&ouml;r emellertid bed&ouml;mas /v&auml;rderas/betygss&auml;ttas av distansl&auml;raren
	innan de blir tillg&auml;ngliga f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande. D&aring; har
    distansl&auml;raren n&aring;got att j&auml;mf&ouml;ra studenternas/elevernas/deltagarnas/de l&auml;randes
	bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar med.</p>
	
	<p>Denna inskickning av exempel p&aring; uppgiftsl&ouml;sningar &auml;r valfri och 
	och det kanske inte alltid &auml;r l&auml;mpligt att ha med detta.
	</p></li>
	
<li><p><b>Till&aring;t studenterna/eleverna/deltagarna/de l&auml;rande att skicka in sina uppgiftsl&ouml;sningar</b><br />
Uppgiften &auml;r nu &ouml;ppnad f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande.
Om distansl&auml;raren har skickat in exempel p&aring; uppgiftsl&ouml;sningar s&aring; m&aring;ste var och en 
bed&ouml;ma/v&auml;rdera/betygss&auml;tta ett angivet antal av dessa.
N&auml;r n&aring;gon v&auml;l har gjort det d&aring; kan de skicka in sin egen uppgiftsl&ouml;sning.
Om det inte finns n&aring;gra exempel s&aring; kan man skicka in utan dr&ouml;jsm&aring;l.
</p>

<p>F&ouml;rdelen med att v&auml;lja fasen f&ouml;r inskickning &auml;r att man d&aring; kan samla ett antal
inskickade uppgiftsl&ouml;sningar. N&auml;r de allt eftersom kommer in s&aring; kan man man arrangera
en b&auml;ttre arbetsf&ouml;rdelning. Om man v&auml;ljer att ha uppgiften i fasen 
&quot;Till&aring;t inskickning och bed&ouml;mning/v&auml;rdering/betygss&auml;ttning&quot; direkt efter 
fasen &quot;Att arrangera uppgiften&quot; (vilket &auml;r m&ouml;jligt) s&aring; kommer de studenter/elever/deltagare/l&auml;rande
som skickar in sina uppgiftsl&ouml;sningar tidigt att ha (andras) tidiga uppgiftsl&ouml;sningar att
bed&ouml;ma/v&auml;rdera/betygss&auml;tta och de som l&auml;mnar in sent kommer att f&aring; arbeta med att bed&ouml;ma/v&auml;rdera och betygss&auml;tta
sent inl&auml;mnade uppgiftsl&ouml;sningar. Om Du l&auml;gger in en &quot;f&ouml;rdr&ouml;jning&quot; f&ouml;re bed&ouml;mning/v&auml;rdering/betygss&auml;ttning
p&aring; 'peer'-niv&aring; s&aring; kommer det att minska ovanst&aring;ende problem.</p>

	<p>
	N&auml;r en student/elev/deltagare/l&auml;rande skickar in en uppgiftsl&ouml;sning kan Du som distansl&auml;rare, 
	om Du s&aring; &ouml;nskar, bed&ouml;ma/v&auml;rdera/betygs&auml;tta den. Detta betyg/omd&ouml;me kan r&auml;knas in i det &ouml;vergripande
	slutbetyget/slutomd&ouml;met. Dessa bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar kan Du g&ouml;ra i
	faserna f&ouml;r inskickning och f&ouml;r bed&ouml;mning/v&auml;rdering/betygss&auml;ttning.</p></li>
	
<li><p><b>Till&aring;t studenterna/eleverna/deltagarna/de l&auml;rande att skicka in sina uppgiftsl&ouml;sningar
och g&ouml;ra sina bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar av andras arbeten</b><br />
Om bed&ouml;mning/v&auml;rdering/betygss&auml;ttning p&aring; 'peer'-niv&aring; ing&aring;r i uppgiften 
s&aring; visas nu andras inskickade uppgiftsl&ouml;sningar f&ouml;r bed&ouml;mning/v&auml;rdering/betygss&auml;ttning f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande.
Innan n&aring;gon har skickat in sin egen uppgiftl&ouml;sning s&aring; f&aring;r denne <b>inte</b> se de andras inskickade arbeten.
I den h&auml;r fasen &auml;r det till&aring;tet att skicka in, att skicka in reviderade uppgiftsl&ouml;sningar och att bed&ouml;ma/v&auml;rdera/betygss&auml;tta
samtidigt.</p>

    <p>Som distansl&auml;rare kanske Du vill dela upp inskickning av den egna uppgiftsl&ouml;sningen 
	och bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen av den p&aring; 'peer'-niv&aring;
	i tv&aring; separata faser. Dvs, alla m&aring;ste skicka in sina uppgiftsl&ouml;sningar innan n&aring;gon f&aring;r p&aring;b&ouml;rja 
	bed&ouml;mning/v&auml;rdering/betygss&auml;ttning p&aring; 'peer'-niv&aring;.
	I det fallet anv&auml;nds inte den h&auml;r fasen alls. Uppgiften g&aring;r direkt fr&aring;n  &quot;Till&aring;t inskickning&quot; till 
	&quot;Till&aring;t bed&ouml;mning/v&auml;rdering/betygss&auml;ttning&quot;. Det h&auml;r g&ouml;r det m&ouml;jligt f&ouml;r Dig som distansl&auml;rare
	att l&auml;gga in en stopptid f&ouml;r inskickade arbeten. Efter den stopptiden s&aring; flyttas uppgiften &ouml;ver till 
    fasen &quot;Till&aring;t bed&ouml;mning/v&auml;rdering/betygss&auml;ttning&quot; .</p>

<p>Om Du som distansl&auml;rare inte vill har en s&aring;dan tydlig uppdelning av uppgiften, d&aring; anv&auml;nder
uppgiften denna fas. De g&aring;nger det &auml;r till&aring;tet med b&aring;de inskickning och bed&ouml;mning/v&auml;rdering/betygss&auml;ttning
s&aring; b&ouml;r Du &ouml;verv&auml;ga att st&auml;lla in Tilldelningen av uppgiftsl&ouml;sningar till EN (eller m&ouml;jligen TV&Aring;) f&ouml;r att
tilldelningen ska g&aring;r smidigt (se hj&auml;lpsidan f&ouml;r detta alternativ om Du vill ha mer detaljer). L&auml;gg m&auml;rke
till att om Du g&ouml;r det s&aring; kommer det att inneb&auml;ra att <b>n&aring;gra </b> uppgiftsl&ouml;sningar kommer att 
bed&ouml;mas/v&auml;rderas/betygss&auml;ttas p&aring; 'peer'-niv&aring; fler g&aring;nger och n&aring;gra f&auml;rre
&auml;n huvuddelen av uppgiftsl&ouml;sningarna.</p>
	
	<p>N&auml;r n&aring;gon har gjort en bed&ouml;mning/v&auml;rdering/betygss&auml;ttning s&aring; de andra p&aring; kursen se 
	den. Den som har skickat in uppgiftsl&ouml;sningen kan kommentera bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen
	om det alternativet &auml;r aktiverat i uppgiften. </p></li>

<li><p><b>Till&aring;t bed&ouml;mning/v&auml;rdering/betygss&auml;ttning av studenter/elever/deltagare/l&auml;rande</b><br />
I den h&auml;r fasen forts&auml;tter 	bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen p&aring; 'peer'-niv&aring; men
det &auml;r inte till&aring;tet att skicka in n&aring;gra uppgiftsl&ouml;sningar, som inneb&auml;r att man uppdaterar sin l&ouml;sning
De som inte har skickat in n&aring;gon uppgiftsl&ouml;sning f&aring;r inte l&auml;ngre g&ouml;ra det och de f&aring;r heller <b>inte</b> se, eller 
bed&ouml;ma/v&auml;rdera/betygss&auml;tta de andras uppgiftsl&ouml;sningar.</p></li>
	
<li><p><b>Visning av slutbetygen/slutomd&ouml;mena</b><br />
Den avslutande fasen i uppgiften g&aring;r Du in i n&auml;r Du vill l&aring;ta studenterna/eleverna/deltagarna/de l&auml;rande
att f&aring; se sina betyg/omd&ouml;men i detalj.  Det &auml;r l&auml;tt att kontrollera de enskilda bed&ouml;mningarna/v&auml;rderingarna/betygss&auml;ttningarna
som bidrar till slutbetyget/omd&ouml;met f&ouml;r varje inskickad uppgiftsl&ouml;sning.</p>

<p>Studenterna/eleverna/deltagarna/de l&auml;rande (och Du som distansl&auml;rare) kan (som ett m&ouml;jligt alternativ) f&aring; se en 
&quot;Rangordningstabell &quot; f&ouml;r inskickade uppgiftsl&ouml;sningar. Dessa listas i en s&aring;dan ordning att det h&ouml;gsta betyget/omd&ouml;met
presenteras l&auml;ngst upp i tabellen.</p></li>
</ol>

<p>
I alla faser av uppgiften kan Du som distansl&auml;rare &ouml;ppna sidan f&ouml;r &quot;Administration&quot;.
Den visar vad som hittills har h&auml;nt med uppgiften. Den listar distansl&auml;rarens exempel p&aring; inskickade 
uppgiftsl&ouml;sningar, studenternas/elevernas/deltagarnas/de l&auml;randes bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar 
(av distansl&auml;rarens exempel, av sina egna uppgiftsl&ouml;sningar och av de andras) samt alla inskickade uppgiftsl&ouml;sningar.
Som distansl&auml;rare kan Du anv&auml;nda den h&auml;r sidan till att bed&ouml;ma/v&auml;rdera/betygss&auml;tta inskickade uppgiftsl&ouml;sningar (&auml;ven f&ouml;rnya detta)
och &ouml;verhuvudtaget f&ouml;lja uppgiftens progression.</p>

