<p align="center"><b>Att hantera en Workshop-uppgift</b></p>

<p>En Workshop-uppgift &auml;r mer komplex &auml;n en 
vanlig uppgift. Den innefattar ett antal steg eller faser.
<br /><br />
De &auml;r som f&ouml;ljer:
</p>

<ol>
<li><b> Att utforma uppgiften</b><br /> 
    Du b&ouml;r bryta ner bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen av uppgiften
	i ett antal komponenter. Detta g&ouml;r betygs&auml;ttningen mindre godtycklig och 
	studenterna/eleverna/deltagarna/de l&auml;rande f&aring;r ramar och villkor f&ouml;r sina
	bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar. 
	<br /><br />
	Din roll som distansl&auml;rare
	&auml;r att utforma och formulera komponenterna och p&aring; s&aring; s&auml;tt skapa
	en mall f&ouml;r  bed&ouml;mning/v&auml;rdering/betygss&auml;ttning.
    (Se den sidan f&ouml;r mer detaljer)
	<br /><br />
	Tillsammans med komponenterna b&ouml;r Du normalt sett skicka in ett litet antal
	exempel p&aring; arbeten som studenterna/eleverna/deltagarna/de l&auml;rande kan 
	bed&ouml;ma/v&auml;rdera/betygss&auml;tta innan de b&ouml;rjar f&ouml;rbereda sina egna
	uppgiftsl&ouml;sningar. Dessa exempel b&ouml;r Du emellertid bed&ouml;ma/v&auml;rdera/betygss&auml;tta
	innan Du g&ouml;r uppgiften tillg&auml;nglig f&ouml;r dem. D&aring; har Du tillg&aring;ng till provexempel p&aring; 'svar' n&auml;r Du ska recensera
	deras bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar
    av dessa exempel (som produceras i n&auml;sta fas).
	<br /><br />
	Denna inskickning av exempel &auml;r valfri och ibland kanske det inte l&auml;mpar sig
	att anv&auml;nda denna metod.
    <br /><br />
	</li>

<li><b> Till&aring;t studenterna/eleverna/deltagarna/de l&auml;rande att skicka in uppgiftsl&ouml;sningar.</b>
<br /> 
       Du ser  nu till att uppgiften blir tillg&auml;nglig f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande. 
	   Om Du har producerat exempel p&aring; uppgiftsl&ouml;sningar s&aring; ger Du 
	   studenterna/eleverna/deltagarna/de l&auml;rande i uppgift att bed&ouml;ma/v&auml;rdera/betygss&auml;tta
	   en del av dessa. N&auml;r n&aring;gon av dem har klarat av detta s&aring; f&aring;r denne
	   skicka in sin egen uppgiftsl&ouml;sning. Om Du inte har publicerat n&aring;gra exempel s&aring; 
	   kan studenterna/eleverna/deltagarna/de l&auml;rande skicka in sina egna l&ouml;sningar utan dr&ouml;jsm&aring;l.
	  <br /><br />
	N&auml;r n&aring;gon skickar in ett arbete s&aring; kan Du som distansl&auml;rare
	bed&ouml;ma/v&auml;rdera/betygss&auml;tta det om Du vill. Detta betyg/omd&ouml;me kan 
	r&auml;knas in i slutbetyget/det slutliga omd&ouml;met. Dessa bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar
    kan Du g&ouml;ra antingen fortl&ouml;pande under sj&auml;lva processen eller 
	efter uppgiftens stoppdatum/tid.
		<br /><br />
	</li>
	
<li><b>Bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar</b>
<br /> 
Anta att det ing&aring;r bed&ouml;mning/v&auml;rdering/betygss&auml;ttning p&aring; 
'peer'-niv&aring; i uppgiften. D&aring; kommer de studenter/elever/deltagare/l&auml;rande
som har skickat in arbeten att f&aring; se arbeten som de andra studenterna/eleverna/deltagarna/l&auml;rande 
har gjort och dessa ska de bed&ouml;ma/v&auml;rdera/betygss&auml;tta.
<br /><br />
Som distansl&auml;rare kan det h&auml;nda att Du vill dela upp inskickningen av arbetena
och bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen p&aring; 'peer'-niv&aring; av dem 
i tv&aring; olika steg eller faser. Alla m&aring;ste d&aring; skicka in sina arbeten innan
n&aring;gon f&aring;r b&ouml;rja bed&ouml;ma/v&auml;rdera/betygss&auml;tta andras arbeten.
Detta &auml;r egentligen inte n&ouml;dv&auml;ndigt. Dessa tv&aring; processer kan p&aring;g&aring; samtidigt.
N&auml;r de &ouml;verlappar p&aring; det s&auml;ttet b&ouml;r Du som distansl&auml;rare &ouml;verv&auml;ga att
st&auml;lla in 'Over Allocation Level' till 'ETT', eller m&ouml;jligen 'TV&Aring;'
s&aring;  'the allocations' ska fortl&ouml;pa smidigt (se sidan Administration f&ouml;r mer detaljer).
<br /><br />
L&auml;gg m&auml;rke till att detta kommer att leda till att en del inskickade arbeten kommer
att bed&ouml;mas/v&auml;rderas/betygss&auml;ttas fler g&aring;nger och andra f&auml;rre &auml;n 
genomsnittet.
<br /><br />
N&auml;r n&aring;gon har gjort en bed&ouml;mning/v&auml;rdering/betygs&auml;ttning s&aring; 
kan den vars arbete denne har bed&ouml;mt/v&auml;rderat/betygssatt se vad denne har gjort och skrivit.
Den som har skickat in arbetet kan kommentera bed&ouml;mningen/v&auml;rderingen/betygs&auml;ttningen
om det alternativet &auml;r aktiverat p&aring; just den uppgiften.
<br /><br />
Som distansl&auml;rare kan Du (om Du s&aring; &ouml;nskar men det &auml;r ofta on&ouml;digt) s&auml;tta betyg p&aring;/avge omd&ouml;men 
om dessa  bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar
p&aring; 'peer'-niv&aring; och dessa resultat kan f&ouml;lja med i processen fram tills dess
slutbetygen/de slutliga omd&ouml;mena ska ber&auml;knas.
<br /><br />
</li>

<li><b>Att ber&auml;kna slutbetygen/de slutliga omd&ouml;mena</b> 
<br />
Efter det att slutdatumet/tiden har passerat s&aring; flyttar Du som distansl&auml;rare
uppgiften till n&auml;sta steg. D&aring; kan studenterna/eleverna/deltagarna/de l&auml;rande inte
g&ouml;ra n&aring;gonting mer. Du kan nu, om Du vill, komplettera betygen/omd&ouml;mena 
f&ouml;r de bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar som har gjorts av exemplen och
och de inskickade arbetena. Du kan ocks&aring; g&ouml;ra detta med de bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar
som har gjorts p&aring; 'peer'-niv&aring;. 
<br /><br />
Detta &auml;r INTE n&ouml;dv&auml;ndigt eftersom
, om det det finns ett tillr&auml;ckligt stort antal bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar
f&ouml;r varje inskickat arbete, s&aring; kan vars och ens prestation avseende att s&auml;tta betyg/avge omd&ouml;men
fastst&auml;llas genom att Du j&auml;mf&ouml;r med de relativa resultaten (medel).
<br /><br />
N&auml;r betygen/omd&ouml;mena &auml;r klara s&aring; ber&auml;knar Du slutbetygen/omd&ouml;mena.
<br />
Dessa grundar sig i regel p&aring; tre komponenter:
<br /><br />
<ul>
<li>Ditt betyg/omd&ouml;me som distansl&auml;rare</li>
<li>medelbetyget/omd&ouml;met p&aring; 'peer'-niv&aring;</li>
<li>studenternas/elevernas/deltagarnas/de l&auml;randes
prestationer avseende att s&auml;tta betyg/avge omd&ouml;men</li> 
</ul> 
<br />
I den sista komponenten kan det ing&aring; ett
'medelbetyg f&ouml;r betygss&auml;ttning' som Du som distansl&auml;rare har avgivit i f&ouml;rh&aring;llande till
till en students/elevs/deltagares/l&auml;randes kommentar. Dessa tre komponenter har f&aring;tt
olika viktningar av Dig innan slutbetygen/omd&ouml;mena ber&auml;knas.
<br /><br />
</li>

<li><b>Att visa slutbetygen/de slutliga omd&ouml;mena</b>
<br />
I den sista fasen av uppgiften s&aring; kan Du visa studenterna/eleverna/deltagarna/de l&auml;rande
deras slutbetyg/slutliga omd&ouml;men. Om Du vill s&aring; kan Du g&aring; tillbaka
i processen och &auml;ndra/modifiera t ex viktningarna i ber&auml;kningen av 
slutbetygen/de slutliga omd&ouml;mena. De reviderade slutbetygen/slutliga omd&ouml;mena
kan Du d&auml;refter offentligg&ouml;ra f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande.
<br /><br />
De (och distansl&auml;raren) f&aring;r ocks&aring; se tabellen f&ouml;r rangordning av 
studenternas/elevernas/deltagarnas/de l&auml;randes inskickade arbeten. De listas med det
bidrag som har f&aring;tt det h&ouml;gsta betyget f&ouml;rst. H&auml;r grundar sig betyget/omd&ouml;met
p&aring; en kombination av distansl&auml;rarens betyg/omd&ouml;me och medel av betygen/omd&ouml;mena
p&aring; 'peer'-niv&aring; (om det finns s&aring;dana). Den viktning som anv&auml;nds &auml;r den 
som har angivits i en tidigare fas.
</li>
</ol>

<p>
N&auml;r som helst under processen med uppgiften kan Du som distansl&auml;rare g&aring; till 
sidan 'Administration'. Den visar det aktuella l&auml;get i processen. 
<br /><br />
Den visar:  
<ul>
<li>Dina exempel p&aring; inskickade arbeten (om Du har bidragit med s&aring;dana)</li>
<li>studenternas/elevernas/deltagarnas/de l&auml;randes
bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar (av Dina exempel, av sina egna arbeten
och av andra studenters/elevers/deltagares/l&auml;randes bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar)
</li>
<li>studenternas/elevernas/deltagarnas/ de l&auml;randes inskickade arbeten.</li>
<br /><br />
</ul>
Som distansl&auml;rare kan Du anv&auml;nda den h&auml;r sidan f&ouml;r att:
<ol></ol>
<li>bed&ouml;ma och revidera
Dina bed&ouml;mningar
<li>s&auml;tta betyg och avge omd&ouml;men
<li>revidera detta n&auml;r det g&auml;ller</li>
bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar
<li> ta bort inskickade arbeten och 
bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar</li>
<li>&ouml;vervaka processen med uppgiften</li>
</ol>
</p>
