<p align="center"><b>Antal bed&ouml;mare/v&auml;rderare/betygss&auml;ttare p&aring; 'peer'-niv&aring;</b></p>
<p>
En uppgift som f&aring;r ett betyg/omd&ouml;me p&aring; 'peer'-niv&aring; kommer i normalfallet att 
bed&ouml;mas/v&auml;rderas/betygss&auml;ttas 
av 3 till 8 personer. 
</p><p>
Det inneb&auml;r att varje student/elev/deltagare/l&auml;rande
kommer att f&aring; i uppgift att s&auml;tta betyg p&aring;/avge omd&ouml;men om 
s&aring; m&aring;nga arbeten (3--8) som andra studenter/elever/deltagare/l&auml;rande har producerat.
</p><p>
Ju st&ouml;rre uppgiften &auml;r (till inneh&aring;llet), desto mindre b&ouml;r antalet vara.
Annars blir det f&ouml;r mycket arbete f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande.
</p><p>
Var och en av dem b&ouml;r dock f&aring; se tillr&auml;ckligt m&aring;nga exempel f&ouml;r att f&aring;
insikt om vad som &auml;r skillnaden mellan ett v&auml;lgjort och ett mediokert arbete.
F&ouml;r att det ska vara m&ouml;jligt att, p&aring; ett meningsfullt s&auml;tt, bed&ouml;ma/v&auml;rdera/betygs&auml;tta 
studenternas/elevernas/deltagarnas/de l&auml;randes prestationer avseende att s&auml;tta betyg/avge omd&ouml;men
s&aring; &auml;r det dessutom b&auml;ttre ju st&ouml;rre antalet &auml;r.
Du f&aring;r knappast ett giltigt utfall om var och en bara s&auml;tter betyg p&aring;/avger omd&ouml;me om 
tre, fyra arbeten.
</p><p>
Om det finns tillr&auml;ckligt m&aring;nga inskickade arbeten (tio eller fler)
kommer systemet att se till att var och en f&aring;r tillg&aring;ng till &aring;tminstone ett 'bra' och &aring;tminstone ett
'svagt' arbete. Detta kan emellertid bara ske om Du som distansl&auml;rare har satt betyg p&aring;/avgivit 
omd&ouml;men om arbetena INNAN Du ser till att studenterna/eleverna/deltagarna/de l&auml;rande 
f&aring;r i uppgift att bed&ouml;ma/v&auml;rdera/betygss&auml;tta dem p&aring; 
'peer'-niv&aring;.
</p><p>
Som distansl&auml;rare beh&ouml;ver Du dock INTE s&auml;tta betyg p&aring;/avge omd&ouml;men om 
alla inskickade arbeten. Det r&auml;cker med ett urval.
Din betyg/omd&ouml;men beh&ouml;ver INTE heller vara slutbetyg/slutliga omd&ouml;men. 
Prelimin&auml;ra s&aring;dana duger bra.

L&auml;gg dock m&auml;rke till att om alternativet 'Visa distanl&auml;rarens betyg' &auml;r 
aktiverat s&aring; kommer dessa att visas f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande
n&auml;r fasen f&ouml;r inskickning av arbeten &auml;r slut.
</p>
<p>
Antalet bed&ouml;mare/v&auml;rderare/betygss&auml;ttare p&aring; 'peer'-niv&aring;
kan vara '0'. Is&aring;fall blir det antingen en uppgift f&ouml;r sj&auml;lvbed&ouml;mning,
om det alternativet &auml;r aktiverat, eller en vanlig l&auml;rarbed&ouml;md uppgift.
</p>
