<?PHP // $Id$ 
      // admin.php - created with Moodle 1.3.1 + (2004052501)


$string['cachetext'] = 'Тривалість оперативної пам\'яті тексту';
$string['filteruploadedfiles'] = 'Фільтр завантажених файлів';
$string['upgradelogs'] = 'Удосконалені/модернізовані логи. 
Для повного виконання функцій Ваші старі логи потрібно модернізувати / удосконалити. Більше інформації.';
$string['upgradelogsinfo'] = 'Інформація про удосконалені/модернізовані логи.
Нещодавно змінився спосіб збереження логів. Щоб мати доступ до усіх старих логів в перактивній базі, Ваші старі логи потрібно удосконалити/модернізувати. Залежно від Вашого сайту це може зайняти багато часу (декілька годин) та буде оподатковано за базою даних великих сайтів. Якщо процес розпочався, завершіть його (вікно браузера повинно бути відкритим). Не хвилюйтеся - Ваш сайт буде доступним для інших людей під час удосконалення / модернізації логів. Ви хочете удосконалити/модернізувати Ваші логи зараз?
';
$string['upgradinglogs'] = 'Удосконалення/модернізація логів';

?>
