<p align="center"><b>Caratteristiche di una Lezione</b></p>
<ol>
<li>Una lezione &egrave; composta da pi&ugrave; <b>pagine</b> ed eventualmente da <b>tabelle di diramazione</b>.
<li>Una pagina contiene del <b>contenuto</b> e normalmente termina con una <b>domanda</b> da cui la definizione <b>Pagina di domanda</b>.
<li>Per le Domande Testo, non ci sono risposte, ma solo un punteggio, una replica e un salto pagina.
<li>Ogni risposta pu&ograve; essere associata a un breve testo che viene mostrato se la risposta &egrave; stata scelta. Questo testo si chiama <b>Replica</b>.
<li>Associato con ogni risposta c'&egrave; un <b>salto</b>. Il salto pu&ograve; essere relativo - a questa pagina, alla pagina seguente - o assoluto - specificando una delle pagine nella lezione o la fine della lezione.
<li>Per default, la prima risposta salta alla <b>pagina seguente</b> nella lezione. Le risposte successive saltano alla stessa pagina, cio&egrave;, allo studente &egrave; mostrata ancora la stessa pagina, se non sceglie la prima risposta. Se si &egrave; gi&agrave; creato un cluster di domande con una fine del cluster, e la domanda &egrave; all'interno di esso, si pu&ograve; scegliere di saltare a una Domanda (casuale) non vista del cluster. Questa opzione non sar&agrave; mostrata se non si &egrave; in un cluster. Si pu&ograve; sempre aggiungere a delle domande un cluster con una fine del cluster.
<li>La pagina seguente &egrave; determinata dall'<b>ordine logico</b> della lezione. Questo &egrave; l'ordine delle pagine come sono viste dal docente. Questo ordine pu&ograve; essere modificato spostando le pagine all'interno della lezione.
<li>La lezione ha anche un <b>ordine di navigazione</b>. Questo &egrave; l'ordine delle pagine come sono viste dagli studenti. Questo &egrave; determinato dai salti specificati per le singole risposte &egrave; pu&ograve; essere molto diverso dall'ordine logico. (Se i salti <i>non</i> sono cambiati dai loro valori di default, i due tipi di ordine sono strettamente correlati.)  docente ha la possibilit&agrave; di controllare l'ordine di navigazione.
<li>Quando vengono mostrate agli studenti, <b>le risposte sono normalmente mescolate</b>. Cio&egrave; la prima risposta dal punto di vista del docente, non necessariamente sar&agrave; la prima risposta nella lista mostrata agli studenti. (Inoltre, ogni volta che lo stesso set di risposte &egrave; visualizzato, queste appariranno probabilmente in un ordine diverso.) F&agrave; eccezione l'insieme di risposte nelle domande a corrispondenza, in questo caso le risposte sono mostrate nello stesso ordine definito dal docente. 
<li>Il numero di risposte pu&ograve; variare da pagina a pagina. Per esempio, &egrave; possibile che alcune pagine terminano con una domanda del tipo Vero/Falso, mentre altre hanno domande con una risposta corretta e, per esempio, tre sbagliate. 
<li>E' possibile impostare una pagina senza alcuna risposta. Agli studenti sar&agrave; mostrato un pulsante <b>Continua</b> invece del set di risposte mescolate.
<li>Se l'opzione di valutazione non &egrave; attiva, ai fini del calcolo della valutazione di default delle lezioni, le risposte <b>corrette</b> sono quelle che saltano alla pagina <i>seguente</i> rispetto a quella corrente, secondo l'ordine logico. Le risposte <b>errate</b> sono quelle che o saltano alla <i>stessa</i> pagina o saltano alla pagina <i>precedente</i> rispetto a quella corrente, secondo l'ordine logico. Cos&igrave;, se i salti <i>non</i> sono cambiati, la prima risposta &egrave; una risposta corretta, mentre le altre sono risposte errate.
<li>Se l'opzione di valutazione &egrave; attiva, la valutazione stessa di una risposta &egrave; determinata dal punteggio associato alla risposta e il punteggio totale ottenuto determina la frazione di punteggio totale della lezione, fino al massimo del 100%.</li>
<li>Le domande possono avere pi&ugrave; di una risposta corretta. Per esempio, se due risposte saltano alla stessa pagina, allora ogni risposta &egrave; da considerare corretta. (Anche se la pagina di destinazione mostrata agli studenti &egrave; la stessa, le repliche mostrate per arrivare a quella pagina possono anche essere differenti per le due risposte.)
<li>Nella visualizzazione della lezione per  docente, le risposte corrette hanno delle etichette risposta sottolineate.
<li>Le <b>Tabelle di diramazione</b> sono semplici pagine che hanno un insieme di link ad altre pagine della lezione. Tipicamente una Lezione pu&ograve; iniziare con una tabella di diramazione che funziona come un <b>Sommario</b> della lezione stessa.
<li>Ogni link in una tabella di diramazione ha due componenti, una descrizione e il titolo della pagina cui saltare.
<li>Una tabella di diramazione di fatto divide la lezione in un insieme di <b>rami</b> (o sezioni). Ogni ramo contiene un insieme di pagine (probabilmente tutte relative allo stesso argomento). La fine di un ramo &egrave; normalmente evidenziata da una pagina <b>Fine Ramo</b>. Questa &egrave; una pagina speciale che, per default, fa tornare indietro alla tabella di diramazione. (Il salto di &quot;ritorno&quot; in una pagina di fine ramo pu&ograve; essere cambiato, se richiesto, modificando la pagina.) 
<li>In una lezione ci possono essere <b>pi&ugrave; tabelle di diramazione</b>. Per esempio, una lezione pu&ograve; essere utilmente strutturata in modo tale che argomenti specialistici sono sotto-rami rispetto ai rami del soggetto principale.
<li>E' importante dare agli studenti un <b>modo per terminare la lezione</b>. Questo pu&ograve; essere fatto includendo un link <b>Fine della lezione</b> nella tabella di diramazione principale. Questo permette di saltare alla pagina (fittizia) Fine della lezione. Un'altra opzione per l'ultimo ramo della lezione (qui &quot;ultimo&quot; &egrave; usato nel senso dell'ordine logico) &egrave; semplicemente continuare fino alla fine della lezione, cio&egrave; senza la necessit&agrave; di terminare con una pagina di fine ramo.</li>
<li>Se l'opzione di valutazione non &egrave; attiva, quando una lezione include una o pi&ugrave; tabelle di diramazione &egrave; consigliabile impostare il parametro <b>Minimo numero di domande</b> a un valore ragionevole. Questo determina il numero minimo di pagine viste quando la valutazione &egrave; calcolata. Senza questo parametro uno studente potrebbe visitare un singolo ramo della lezione, rispondere correttamente a tutte le sue domande e terminare la lezione col massimo del punteggio.
Se l'opzione di valutazione &egrave; attiva, uno studente &egrave; valutato in base al numero di punti ottenuti come percentuale dei punti totali della lezione.</li>
<li>Inoltre se l'opzione di valutazione non &egrave; attiva, quando &egrave; presente una tabella di diramazione uno studente ha la possibilit&agrave; di rivisitare lo stesso ramo anche pi&ugrave; di una volta. Comunque, il voto &egrave; calcolato usando il numero di <i>uniche</i> domande risposte. Per cui rispondere pi&ugrave; volte alle stesse domande <i>non</i> aumenta il voto finale. (Di fatto, &egrave; vero il contrario, il voto finale si abbassa poich&eacute; il numero di pagine viste, che sta a denominatore nel calcolo del voto, include le ripetizioni.) Per dare agli studenti un'idea di massima del loro progresso nella lezione, vengono loro mostrati dettagli sul numero di domande cui hanno risposto correttamente, sul numero di pagine viste, e sul voto corrente su ogni pagina della tabella di diramazione.
Se l'opzione di valutazione &egrave; attiva, uno studente pu&ograve; rivedere una domanda se il percorso di navigazione lo permette, e riguadagnare i punti per quella domanda, se il numero di tentativi permessi &egrave; maggiore di 1. Per impedire questo, impostare i tentativi ammessi a 1.
<li>La <b>fine della lezione</b> &egrave; raggiunta sia saltando esplicitamente alla sua pagina finale sia saltando alla pagina successiva dalla ultima pagina (logica) della lezione.
Con l'opzione di valutazione disattivata, quando si raggiunge la fine della lezione, lo studente riceve un messaggio di congratulazioni e il voto ottenuto.
Il voto &egrave; dato da (numero di domande correttamente risposte / numero di pagine viste) * valore della lezione.
Con l'opzione di valutazione attivata, il voto &egrave; costituito dal punteggio ottenuto come percentuale dei punti totali previsti
(per esempio, 3 punti ottenuti in una lezione che vale 3 punti = 100% di 3 punti)
<li>Se la fine della lezione <i>non</i> &egrave; stata raggiunta, quando lo studente ritorna a quella lezione gli viene data la <b>scelta di ricominciare</b> dall'inizio o di riprendere la lezione dal punto in cui aveva dato l'ultima risposta corretta.
<li>Per una lezione che permette la ripresa,  docente ha la possibilit&agrave; di scelta tra la votazione migliore ottenuta o quella media, nella <b>determinazione del voto finale</b> della lezione. Questa valutazione &egrave; mostrata, per esempio, nella pagina dei Risultati.
<li><b>Pagine cluster</b>: un cluster rappresenta un insieme di domande dal quale una o pi&ugrave; di queste possono essere scelte casualmente. I cluster dovrebbero essere completati con una pagina di Fine Cluster per ottenere i migliori effetti (altrimenti verr&agrave; assunta la pagina di Fine Lezione anche come Fine Cluster). Le domande di un cluster sono scelte casualmente selezionando &quot;Domanda non vista di un cluster&quot; nella definizione del &quot;Salto a&quot;. Le domande di un cluster possono sia saltare a un Fine Cluster per uscire, o saltare a un'altra domanda non vista del cluster, o saltare a qualunque altra pagina della lezione. Questo permette di creare, nell'ambito delle lezioni, scenari con elementi casuali.
</ol>
