<p align="center"><b>Importer des fichiers &laquo;&nbsp;Course
Test Manager&nbsp;&raquo;</b></p>

<p>Course Test Manager est un logiciel en fin de vie de
l'entreprise Course Technology. Il n'est plus
d&eacute;velopp&eacute;, car il a &eacute;t&eacute;
remplac&eacute; par un autre produit appel&eacute; ExamView.
Cependant aucun moyen n'a mis &eacute;t&eacute; &agrave;
disposition pour permettre de transf&eacute;rer les tests CTM
vers d'autres format de tests. C'est la raison d'&ecirc;tre de ce
module.</p>

<p>Pour importer des questions depuis CTM, votre machine Windows
doit avoir CTM install&eacute; et avoir acc&egrave;s aux fichiers
de donn&eacute;es MS Access sur cette machine. Deux fichiers de
donn&eacute;es sont requis&nbsp;:</p>

<ul>

<li>System.mda - ce fichier est situ&eacute; dans le dossier
principal de votre installation de CTM. Dans le jargon de MS
access, il est nomm&eacute; la &laquo;&nbsp;System
Database&nbsp;&raquo;.</li>

<li>ctm.mdb - c'est la base de donn&eacute;es contenant les
questions. Il y a une telle base de donn&eacute;es pour chaque
cours install&eacute; dans CTM. Ce fichier est situ&eacute; dans
un dossier au niveau imm&eacute;diatement inf&eacute;rieur de
votre dossier CTM.</li>

</ul>

</p>Le processus d'importation est quelque peu diff&eacute;rent,
selon que vous utilisez Moodle sous Windows ou Linux. Dans tous
les cas, il vous faudra une machine Windows (Windows 200 ou XP)
sur le m&ecirc;me r&eacute;seau que votre machine Moodle pour
h&eacute;berger les bases de donn&eacute;es Access durant
l'importation des questions.</p>

<p>L'importation sera plus facile sur un Moodle tournant sous
<b>Windows</b>. Les &eacute;tapes sont les suivantes&nbsp;:</p>

<ol>

<li>Envoyer le fichier system.mda dans Moodle &agrave; l'aide du
gestionnaire de fichiers, dans n'importe quel cours. Moodle le
trouvera de toute fa&ccedil;on.</li>

<li>Cr&eacute;er un nouveau test et s&eacute;lectionnez
&laquo;&nbsp;Importer les questions d'un fichier&nbsp;&raquo;.
Choisissez votre fichier ctm.mdb comme fichier &agrave;
t&eacute;l&eacute;charger. Si vous n'abez pas fait d'erreurs, une
page s'affichera vous demandant de choisir la
sous-cat&eacute;gorie des questions &agrave; importer de la base
de donn&eacute;es. Cette &eacute;tape est n&eacute;cessaire, car
bon nombre de tests CTM comportent beaucoup de questions en
diff&eacute;rentes cat&eacute;gories.</li>

</ol>

<p>L'importation sur un Moodle tournant sous <b>Linux</b>
requiert un logiciel suppl&eacute;mentaire appel&eacute; <a
href="http://odbcsock.sourceforge.net/" target="_new"><b>ODBC
Socket Server</b></a>. Afin d'importer des questions CTM sur
Linux, vous devez d'abord t&eacute;l&eacute;charger et installer
ce petit programme sur le syst&egrave;me Windows
h&eacute;bergeant les bases de donn&eacute;es CTM. <b>Ne suivez
pas</b> les instructions d'installation donn&eacute;es dans ODBC
Socket Server Installation. Elles sont plus compliqu&eacute;es
que n&eacute;cessaires&nbsp;! Suivez plut&ocirc;t les
&eacute;tapes suivantes&nbsp;:</p>

<ol>

<li>D&eacute;compactez et installez sur la machine Windows le
fichier que vous avez t&eacute;l&eacute;charg&eacute; sur <a
href="http://odbcsock.sourceforge.net/" target="_new">ce
site</a>.</li>

<li>Copier l'ex&eacute;cutable ODBCSocketServer.exe dans un
dossier, par exemple votre dossier syst&egrave;me
(vraisemblablement C:\WINNT\ ou C:\Windows) ou dans votre dossier
Program Files.</li>

<li>Installez le ODBC Socket Server comme un Service sur le
syst&egrave;me Windows avec la commande&nbsp;:<br />

<b>&lt;chemin du fichier ci-dessus&gt;ODBCSocketServer.exe
/Service</b><br />

Vous pouvez faire cela en tapant la commande depuis le menu
D&eacute;marrer-&gt;Commande... ou une fen&ecirc;tre
terminal.</li>

<li>Ouvrez le Service Manager soit depuis le menu
D&eacute;marrer-&gt;Settings-&gt;Control
Panels-&gt;Administrative Tools-&gt;Services ou en cliquant avec
le bouton droit de la souris sur <b>Mon ordinateur</b>, en
s&eacute;lectionnant <b>Administrer</b>, puis en choisissant
<b>Services et Applications-&gt;Services</b>. Le Gestionnaire de
Services est aussi accessible en tapant <b>services.msc</b>
depuis le menu D&eacute;marrer-&gt;Commande...</li>

<li>Dans le Gestionnaire de Services, cliquez avec le bouton
droit de la souris sur ODBC Socket Server et s&eacute;lectionnez
&laquo;&nbsp;D&eacute;marrer&nbsp;&raquo;. Le statut devrait
changer en indiquant que le service a d&eacute;marr&eacute;.
Apr&egrave;s l'importation, vous pourrez arr&ecirc;ter ou
d&eacute;sactiver compl&egrave;tement ce service.</li>

<li>Assurez-vous que les fichiers system.mda et ctm.mdb sont bien
sur la machine et que le pilote MS Access ODBC est
install&eacute; (c'est le cas dans une installation standard de
Windows). Vous pouvez v&eacute;rifier cela en ouvrant
&laquo;&nbsp;Sources de donn&eacute;es&nbsp;&raquo; dans les
Outils d'Administration, sur l'onglet &laquo;&nbsp;Pilotes
&raquo;. Vous allez devoir indiquer o&ugrave; CTM est
install&eacute; et l'endroit o&ugrave; sont les fichiers
system.mda et ctm.mdb ou d'autres bases de donn&eacute;es que
vous d&eacute;sirez importer. Prenez note des chemins
d'acc&egrave;s complets de ces fichiers, ainsi que de l'adresse
IP ou du nom de cette machine Windows. Ces informations seront
utilis&eacute;es lors de l'importation.</li>

<li>Vous pouvez maintenant importer les questions
d&eacute;sir&eacute;es dans Moodle. Cr&eacute;er un nouveau test
et s&eacute;lectionnez &laquo;&nbsp;Importer les questions d'un
fichier&nbsp;&raquo;. <b>&Agrave; PARTIR D'ICI LE PROCESSUS EST
DIFF&Eacute;RENT SOUS LINUX -</b> VOUS DEVEZ SP&Eacute;CIFIER UN
NOM DE FICHIER BIDON POUR D&Eacute;MARRER LE PROCESSUS
D'IMPORTATION. CE FICHIER BIDON <b>NE SERA EN FAIT PAS
IMPORT&Eacute;</b>, IL S'AGIT SEULEMENT D'UN EMPLACEMENT QUI VOUS
PERMETTRA DE SP&Eacute;CIFIER LES INFORMATIONS DU SERVEUR
WINDOWS. Une page s'affichera ensuite o&ugrave; vous pouvez taper
l'adresse IP ou le nom du serveur Windows ainsi que les chemins
des diff&eacute;rents fichiers que vous avez relev&eacute;s
&agrave; l'&eacute;tape pr&eacute;c&eacute;dente. Tapez ces
informations et cliquez sur &laquo;&nbsp;Connexion au
serveur&nbsp;&raquo;. Si aucune erreur n'a &eacute;t&eacute;
faite, un autre formulaire vous permettra de choisir la
sous-cat&eacute;gorie des questions &agrave; importer de la base
de donn&eacute;es. Cette &eacute;tape est n&eacute;cessaire, car
bon nombre de tests CTM comportent beaucoup de questions en
diff&eacute;rentes cat&eacute;gories. SI VOUS ARRIVEZ ICI SANS
MESSAGE D'ERREUR, VOTRE SERVEUR EST CONFIGUR&Eacute; CORRECTEMENT
ET VOUS COMMENCEZ &Agrave; IMPORTER DES QUESTIONS DANS
MOODLE&nbsp;!</li>

</ol>

<p>Si vous avez obtenu des messages d'erreur durant ce processus,
les informations suivantes vous seront peut-&ecirc;tre utiles. Le
serveur ODBC Socket utilise le port 9628 et &eacute;change une
requ&ecirc;te XML avec une table de r&eacute;sultats &agrave; la
requ&ecirc;te XML. La classe d'importation balaie ce XML et
l'utilise comme un requ&ecirc;te locale pour effectuer
l'importation.</p>