<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=windows-1252">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1  (Win32)">
	<META NAME="CREATED" CONTENT="20040229;15133616">
	<META NAME="CHANGED" CONTENT="20040229;15155056">
</HEAD>
<BODY LANG="fr-CA" DIR="LTR">
<P ALIGN=CENTER><B>Cr&eacute;ation d'une nouvelle question</B></P>
<P>Il existe dans Moodle de nombreux types de question pour
l'&eacute;laboration de vos questionnaires&nbsp;:</P>
<P><B>Question &agrave; choix multiples</B></P>
<P>Une question &agrave; choix multiples offre &agrave; l'&eacute;tudiant
un choix de r&eacute;ponses parmi lesquelles il devra choisir. La
question peut inclure une image. Il existe deux variantes &agrave; ce
type de question&nbsp;:</P>
<UL>
	<LI><P STYLE="margin-bottom: 0cm">Une seule r&eacute;ponse est
	valide et donc tous les points sont accord&eacute;s &agrave;
	celle-ci. 
	</P>
	<LI><P>Il y a plusieurs r&eacute;ponses valides et les points sont
	partag&eacute;s entre les diff&eacute;rentes r&eacute;ponses. 
	</P>
	<P ALIGN=RIGHT><A HREF="./help.php%3Ffile=multichoice.html&amp;module=quiz">Informations
	suppl&eacute;mentaires sur les questions &agrave; choix multiples</A></P>
</UL>
<P><B>Question &agrave; r&eacute;ponse courte</B></P>
<P>Pour r&eacute;pondre &agrave; une question &agrave; r&eacute;ponse
courte, l'&eacute;tudiant entre un mot ou une expression. Le
professeur peut inclure plusieurs r&eacute;ponses possibles. On peut
exiger de respecter la casse ou pas (lettres minuscules ou/et
majuscules). On peut inclure une image avec la question. 
</P>
<P ALIGN=RIGHT><A HREF="./help.php%3Ffile=shortanswer.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions &agrave; r&eacute;ponses
courtes</A></P>
<P><B>Question &agrave; r&eacute;ponse num&eacute;rique</B></P>
<P>La question &agrave; r&eacute;ponse num&eacute;rique a l'apparence
d'une question &agrave; r&eacute;ponse courte. La diff&eacute;rence
r&eacute;side dans le fait que la premi&egrave;re peut accepter la
r&eacute;ponse fournie par l'&eacute;tudiant avec une marge d'erreur.
Le professeur fournit la valeur minimale et la valeur maximale de la
plage des valeurs acceptables. 
</P>
<P ALIGN=RIGHT><A HREF="./help.php%3Ffile=numerical.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions &agrave; r&eacute;ponse
num&eacute;rique</A></P>
<P><B>Question Vrai ou faux</B></P>
<P>Ce type de question exige de la part de l'&eacute;tudiant une
r&eacute;ponse qui peut &ecirc;tre seulement VRAI ou FAUX. On peut
ajouter une image &agrave; la question. 
</P>
<P ALIGN=RIGHT><A HREF="./help.php%3Ffile=truefalse.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions Vrai ou faux</A></P>
<P><B>Question &agrave; appariements</B></P>
<P>L'&eacute;tudiant doit associer chaque proposition avec une des
r&eacute;ponses fournies. Une r&eacute;ponse correcte correspond &agrave;
chaque proposition. Toutes les propositions ont un m&ecirc;me poids
dans le calcul de la note pour la question. 
</P>
<P ALIGN=RIGHT><A HREF="./help.php%3Ffile=match.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions &agrave; appariements</A></P>
<P><B>Question &agrave; appariements &agrave; partir de questions &agrave;
r&eacute;ponse courte</B></P>
<P>Pour l'&eacute;tudiant, cette question appara&icirc;t comme une
question &agrave; appariements. En r&eacute;alit&eacute;, la question
est construite au hasard &agrave; partir des questions &agrave;
r&eacute;ponses courtes. 
</P>
<P ALIGN=RIGHT><A HREF="./help.php%3Ffile=randomsamatch.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions &agrave; appariements &agrave;
partir de questions &agrave; r&eacute;ponse courte</A></P>
<P><B>Question &agrave; r&eacute;ponses incorpor&eacute;es</B></P>
<P>Ce type de question est tr&egrave;s flexible. Les questions se
composent d'un texte (dans le format de Moodle) auquel on peut
incorporer des r&eacute;ponses &agrave; choix multiples, des r&eacute;ponses
courtes ou des r&eacute;ponses num&eacute;riques. 
</P>
<P ALIGN=RIGHT><A HREF="./help.php%3Ffile=multianswer.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les questions &agrave; r&eacute;ponses
incorpor&eacute;es</A></P>
<P><B>Question al&eacute;atoire</B></P>
<P>Une question al&eacute;atoire est une question choisie au hasard
parmi toutes les questions de la cat&eacute;gorie de laquelle elle
provient. Les &eacute;tudiants n'auront pas tous la m&ecirc;me
question. 
</P>
<P ALIGN=RIGHT><A HREF="./help.php%3Ffile=random.html&amp;module=quiz">Questions
al&eacute;atoires </A>
</P>
<P><B>Description</B></P>
<P>Ce type de question n'en est pas vraiment un. Il sert &agrave;
afficher un bloc de texte &agrave; l'int&eacute;rieur d'un
questionnaire sans que l'&eacute;tudiant ait &agrave; r&eacute;pondre
quoi que ce soit. On peut l'utiliser pour donner des directives pour
les questions qui suivent. 
</P>
<P ALIGN=RIGHT><A HREF="./help.php%3Ffile=description.html&amp;module=quiz">Informations
suppl&eacute;mentaires sur les descriptions</A></P>
</BODY>
</HTML>