<?PHP // $Id$ 
      // admin.php - created with Moodle 1.5 UNSTABLE DEVELOPMENT (2004100800)


$string['cachetext'] = 'משך התקפות של טקסט במטמון';
$string['filteruploadedfiles'] = 'סנן את הקבצים המועלים';
$string['parentlanguage'] = 'en';
$string['thischarset'] = 'ISO-8859-I';
$string['thisdirection'] = 'rtl';
$string['thislanguage'] = '&#1506;&#1489;&#1512;&#1497;&#1514;';
$string['upgradelogs'] = 'להפעלת מלוא היכולות, הדוחות הישנים שלך צריכים להתעדכן. <a href=\"$a\"> מידע נוסף</a>';
$string['upgradelogsinfo'] = 'לאחרונה נעשו מספר שינויים לאופן שבו נשמרים הדוחות. על מנת לאפשר צפיה בדוחות הישנים בחלוקה לפי פעילות, יש לשדרג את הדוחות הישנים שלך. כתלות באתר, פעולה זו יכולה לקחת זמן רב (לדוגמא מספר שעות) ולצרוך הרבה משאבים מבסיס הנתונים של אתרים גדולים. מרגע שהתחלת תהליך זה, רצוי לתת לו לסיים (על ידי השארת חלון הדפדפן פתוח). אל תדאג - אתרך יהיה זמין למבקרים אחרים בזמן שהדוחות מתעדכנים.<br /><br /> האם אתה רוצה לעדכן את דוחותיך עכשיו?';
$string['upgradesure'] = 'קבצי ה-Moodle הישנים שלך שונו, וכעת תוכנת השרת שלך תעודכן באופן אוטומטי לגרסה זו:
<p><b>$a</b></p>
<p>מרגע ביצוע השדרוג לא תוכל לחזור לגרסה קודמת.</p>
<p>האם אתה בטוח ברצונך לשדרג את תוכנת השרת לגרסה זו?</p>';
$string['upgradinglogs'] = 'משדרג דוחות';

?>
