<!-- Traducci&oacute;n al espa&ntilde;ol: Emmanuelle Guti&eacute;rrez y Restrepo (emmanuelle@sidar.org) -->
<p style="text-align: center;"><strong>M&oacute;dulos de actividades</strong></p>

<p>Esta plataforma contiene varios m&oacute;dulos de actividades.</p>

<dl>
	<dt><img src="<?=$CFG->wwwroot?>/mod/forum/icon.gif" alt="Foros">&nbsp;<strong>Foros</strong></dt>

<dd style="padding-top: 1em; padding-left: 3em; padding-bottom: 1em;">Este m&oacute;dulo puede ser el m&aacute;s importante, dado que es en el que tienen lugar la mayor parte de los debates. Los foros se pueden estructurar de diferentes maneras, y pueden incluir calificaciones.
Los mensajes se pueden ver de varias formas y pueden incluir archivos adjuntos.
Al suscribirse a un foro, los participantes autom&aacute;ticamente recibir&aacute;n copias de cada mensaje en su buz&oacute;n de correo electr&oacute;nico.
El tutor puede imponer a sus alumnos la suscripci&oacute;n a un determinado foro.</dd>

<dt>
<img src="<?=$CFG->wwwroot?>/mod/journal/icon.gif" alt="Diario">&nbsp;<strong>Diarios</strong>
</dt>

<dd style="padding-top: 1em; padding-left: 3em; padding-bottom: 1em;">Este m&oacute;dulo supone una actividad de reflexi&oacute;n muy importante. El tutor
propone a los alumnos reflexionar sobre diferentes temas, y los estudiantes
pueden responder y modificar sus respuestas a trav&eacute;s del tiempo. Esta respuesta es privada
y s&oacute;lo puede ser vista por el tutor, quien puede responder y calificar cada vez. Suele ser buena idea tener una actividad de este tipo por semana.</dd>


<dt><img src="<?=$CFG->wwwroot?>/mod/resource/icon.gif" alt="Recursos">&nbsp;<strong>Recursos</strong></dt>

<dd style="padding-top: 1em; padding-left: 3em; padding-bottom: 1em;">Los recursos son contenidos, informaci&oacute;n que el tutor quiere que vean sus alumnos.
Pueden ser documentos preparados y subidos al servidor, p&aacute;ginas editadas directamente
en la plataforma o p&aacute;ginas externas que aparecer&aacute;n dentro del curso.</dd>



<dt><img src="<?=$CFG->wwwroot?>/mod/assignment/icon.gif" alt="Tareas">&nbsp;<strong>Tareas</strong></dt>

<dd style="padding-top: 1em; padding-left: 3em; padding-bottom: 1em;">Las tareas permiten a los profesores asignar actividades a los estudiantes, que consisten en preparar contenidos digitales (de cualquier tipo) que el alumno podr&aacute; subir al servidor.</dd>



<dt><img src="<?=$CFG->wwwroot?>/mod/quiz/icon.gif" alt="Cuestionarios">&nbsp;<strong>Cuestionarios</strong></dt>

<dd style="padding-top: 1em; padding-left: 3em; padding-bottom: 1em;">
Este m&oacute;dulo permite que el profesor dise&ntilde;e y plantee cuestionarios. Estos
cuestionarios pueden ser: de m&uacute;ltiple opci&oacute;n, verdadero/falso y de respuestas cortas.
Estos cuestionarios se guardan en la base de datos, por lo que pueden ser
reutilizados dentro del mismo curso o incluso entre diferentes cursos.
Los cuestionarios pueden permitir m&uacute;ltiples intentos. Cada intento se marca
autom&aacute;ticamente y el profesor puede decidir si mostrar la calificaci&oacute;n y/o las
respuestas correctas a los alumnos una vez concluido el cuestionario. Adem&aacute;s, este m&oacute;dulo
incluye herramientas para la calificaci&oacute;n autom&aacute;tica.
</dd>


<dt><img src="<?=$CFG->wwwroot?>/mod/choice/icon.gif" alt="Consultas">&nbsp;<strong>Consultas</strong></dt>

<dd style="padding-top: 1em; padding-left: 3em; padding-bottom: 1em;">Las consultas son muy sencillas: el profesor hace una pregunta y determina
ciertas opciones, de las cuales los alumnos elegir&aacute;n una.
Es &uacute;til como sondeo r&aacute;pido para estimular la reflexi&oacute;n sobre alg&uacute;n tema, para permitir alg&uacute;n tipo de votaci&oacute;n en el grupo o a efectos de investigaci&oacute;n.</dd>


<dt><img src="<?=$CFG->wwwroot?>/mod/survey/icon.gif" alt="Encuestas">&nbsp;<strong>Encuestas</strong></dt>

<dd style="padding-top: 1em; padding-left: 3em; padding-bottom: 1em;">El m&oacute;dulo de encuestas proporciona una serie de instrumentos probados para estimular el aprendizaje en ambientes &quot;online&quot;.
Los profesores pueden utilizar este m&oacute;dulo para aprender sobre sus alumnos y reflexionar sobre su pr&aacute;ctica educativa.</dd>


</dl>