<!-- Traducci&oacute;n al espa&ntilde;ol: Claudio Tavares. Adaptación para la versión es_es Antonio J. Navarro Vergara (anavarro@sextaisla.com) -->
<p style="text-align: center;"><strong>C&oacute;mo cargar una imagen</strong></p>
<p>Ud. puede subir una imagen de su ordenador al servidor, y esta imagen se
utilizar&aacute; en varios lugares para identificarlo.</p>
<p>Por este motivo, las mejores im&aacute;genes suelen ser una foto de su cara, pero
puede utilizar la imagen que desee.</p>
<p>La imagen debe estar en formato JPG o PNG (lo que significa que el nombre de la imagen terminar&aacute; en .jpg o en .png).</p>
<p>Puede colocar una imagen utilizando uno de estos cuatro m&eacute;todos:</p>
<ol>
<li>Utilizando una c&aacute;mara digital es muy sencillo, dado que sus fotos seguramente ya estar&aacute;n en el formato correcto en su ordenador.</li>
<li>Utilizando un &quot;scanner&quot; para digitalizar una fotograf&iacute;a impresa. Aseg&uacute;rese de guardar la imagen en formato JPG o PNG.</li>
<li>Si <abbr title="usted">Ud.</abbr> es una artista, puede dibujar una imagen utilizando alg&uacute;n programa de dise&ntilde;o.</li>
<li>Finalmente, tambi&eacute;n puede conseguir en la red una imagen que lo identifique.
<p><a href="http://images.google.com/" target="google">http://images.google.com</a>
es un excelente lugar para buscar im&aacute;genes. Una vez encontrada, coloque el cursor sobre la misma y pulsando el bot&oacute;n derecho del rat&oacute;n elija la opci&oacute;n &quot;Guardar imagen como&quot; (diferentes sistemas operativos pueden usar procedimientos ligeramente diferentes).</p></li>
</ol>
<p>Para subir la imagen, haga clic en el bot&oacute;n &quot;Examinar&quot; en esta p&aacute;gina y seleccione la imagen en su disco duro.</p>
<p>IMPORTANTE: Aseg&uacute;rese de no colocar una imagen que exceda el tama&ntilde;o
m&aacute;ximo permitido, en bites, pues no se cargar&aacute;.</p>
<p>Luego haga clic en &quot;Actualizar informaci&oacute;n personal&quot;, abajo del todo. Si la imagen es mayor a 100 x 100 pixels se cortar&aacute; en forma de cuadrado y se redimensionar&aacute; a 100 x 100 pixels.</p>
<p>Cuando termine de cambiar su imagen es posible que no vea el cambio, si eso sucede actualice la p&aacute;gina (oprimiendo F5 o el bot&oacute;n actualizar).</p>