<!-- Traducci&oacute;n al espa&ntilde;ol: Claudio Tavares. Adaptación para la versión es_es Antonio J. Navarro Vergara (anavarro@sextaisla.com) -->

<p style="text-align: center;"><strong>Encuestas disponibles</strong></p>

<p>Actualmente, Moodle s&oacute;lo dispone de determinados tipos de encuestas (en futuras versiones usted podr&aacute; crear las suyas propias).</p>

<p>Las encuestas incluidas se han elegido por ser particularmente &uacute;tiles para la evaluaci&oacute;n de entornos de aprendizaje <em>online</em> que siguen una pedagog&iacute;a <em>constructivista</em>, as&iacute; como, para identificar ciertas tendencias que pueden estar d&aacute;ndose entre sus participantes. (Puede leerse un documento, en ingl&eacute;s, en el que &eacute;stas se analizan en detalle en: <a href="http://dougiamas.com/writing/herdsa2002" target="paper">http://dougiamas.com/writing/herdsa2002</a>)</p>

<hr title="separa la introducci&oacute;n de la definici&oacute;n de tipos de encuesta.">

<p><strong>COLLES - Constructivist On-Line Learning Environment Survey (Encuesta sobre Entorno de Aprendizaje Constructivista en l&oacute;nea)</strong></p>

  <p>El COLLES comprende 24 premisas breves agrupadas en seis escalas, cada una de las cuales nos ayuda a formular una pregunta clave sobre la calidad del entorno de aprendizaje en l&iacute;nea:</p>

<dl>
	<dt>Relevancia</dt>
    <dd style="padding-left: 2em; padding-bottom: 1em; padding-top: 1em;">&iquest;Cu&aacute;n importante es la educaci&oacute;n online para la pr&aacute;ctica profesional de los estudiantes?</dd>

   <dt>Reflexi&oacute;n</dt>
    <dd style="padding-left: 2em; padding-bottom: 1em; padding-top: 1em;">&iquest;La educaci&oacute;n online estimula el pensamiento cr&iacute;tico reflexivo en los
estudiantes?</dd>

    <dt>Interactividad</dt>
    <dd style="padding-left: 2em; padding-bottom: 1em; padding-top: 1em;">&iquest;Hasta qu&eacute; punto los estudiantes en l&iacute;nea se involucran en un di&aacute;logo educativo enriquecedor?</dd>

    <dt>Apoyo de tutores</dt>
    <dd style="padding-left: 2em; padding-bottom: 1em; padding-top: 1em;">&iquest;C&oacute;mo de bien facilitan los profesores a sus alumnos participar en el aprendizaje en l&iacute;nea?</dd>

    <dt>Ayuda entre colegas</dt>
   <dd style="padding-left: 2em; padding-bottom: 1em; padding-top: 1em;">&iquest;Se proporcionan apoyo en l&iacute;nea, sensible y alentador, entre compa&ntilde;eros?</dd>

    <dt>Interpretaci&oacute;n</dt>

   <dd style="padding-left: 2em; padding-bottom: 1em; padding-top: 1em;">Los estudiantes y los profesores, &iquest;tienen un apreciaci&oacute;n correcta el uno del otro a trav&eacute;s de la comunicaci&oacute;n en l&iacute;nea?</dd>

</dl>

  <p>Apuntalando la visi&oacute;n din&aacute;mica del aprendizaje, se trata de una nueva teor&iacute;a del conocimiento: el constructivismo social, que asume al estudiante como un	conceptualizador activo dentro de un entorno de aprendizaje social interactivo. Constructivismo social es una epistemolog&iacute;a, una forma de conocer, en la que los estudiantes colaboran reflexivamente para co-construir nuevas comprensiones, especialmente dentro del contexto de la interrogaci&oacute;n mutua basada en su propia experiencia.</p>

  <p>Para que se d&eacute; esta colaboraci&oacute;n es vital el desarrollo de la capacidad
	de comunicaci&oacute;n, es decir, la habilidad de integrarse en un di&aacute;logo abierto y cr&iacute;tico tanto con los estudiante como con los profesores. Este di&aacute;logo se caracteriza por una orientaci&oacute;n emp&aacute;tica para construir un entendimiento rec&iacute;proco, y por una actitud cr&iacute;tica al examinar asunciones supuestas.</p>

  <p>El COLLES se ha dise&ntilde;ado para permitirle monitorizar su capacidad de
	explotar la capacidad interactiva de la Web para integrar a los estudiantes en pr&aacute;cticas din&aacute;micas de aprendizaje.</p>

<p>(Esta informaci&oacute;n se ha adaptado de la p&aacute;gina del COLLES. Si lo desea, puede encontrar m&aacute;s informaci&oacute;n en:
<a href="http://surveylearning.com/colles/" target="paper">http://surveylearning.com/colles/</a>)</p>


<hr title="Separa la explicaci&oacute;n de COLLES de la de ATTLS">

<p><strong>ATTLS - Attitudes to Thinking and Learning Survey (Encuesta de Actitud para Pensar y Aprender).</strong></p>


<p style="padding-left: 3em;">La teor&iacute;a de las &quot;formas de conocer&quot;, originaria del campo de la investigaci&oacute;n de g&eacute;nero (Belenky et al., 1986) nos ofrece una herramienta para examinar la calidad del discurso dentro de un ambiente colaborativo.</p>

<p style="padding-left: 3em;">La Encuesta de Actitud para Pensar y Aprender (ATTLS) es un instrumento
desarrolado por Galiotti et al. (1999) para medir hasta qu&eacute; punto una persona es un &quot;conocedor conectado&quot; (CK, por sus siglas en ingl&eacute;s: <span lang="en">connected knowe</span>) o un &quot;conocedor separado&quot; (SK: <span lang="en">separate knower</span>).</p>

<p style="padding-left: 3em;">Las personas con una puntuaci&oacute;n de CK m&aacute;s alta tienden a disfrutar m&aacute;s el aprendizaje, y a menudo
son m&aacute;s cooperativas, simp&aacute;ticas y m&aacute;s dispuestas a construir sobre las ideas de los otros,
mientras que aquellos con altas puntuaciones en SK tienden a tomar una actitud hacia el aprendizaje m&aacute;s cr&iacute;tica y argumentativa.</p>

<p style="padding-left: 3em;">Diversos estudios han mostrado que estos dos estilos de aprendizaje son independientes el uno del otro (Galotti et al., 1999; Galotti et al., 2001). Adem&aacute;s, s&oacute;lo son reflejo de actitudes frente al aprendizaje, y no capacidades para aprender o poderes intelectuales.</p>

<p style="padding-left: 3em;"><em lang="en">Belenky, M. F., Clinchy, B. M., Goldberger, N. R., & Tarule, J. M. (1986). Women's Ways of Knowing: The Development of Self, Voice, and Mind. New York: Basic Books, Inc.</em></p>

<p style="padding-left: 3em;"><em lang="en">Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., & Mansfield, A. F. (1999). A New Way of Assessing Ways of Knowing: The Attitudes Towards Thinking and Learning Survey (ATTLS). Sex Roles, 40(9/10), 745-766.</em></p>

<p style="padding-left: 3em;"><em lang="en">Galotti, K. M., Reimer, R. L., & Drebus, D. W. (2001). Ways of knowing as learning styles: Learning MAGIC with a partner. Sex Roles, 44(7/8), 419-436.</em></p>
