<p align="center"><strong>Pontok</strong></p>
<p>Els&#337; megtekint&eacute;skor a napl&oacute; norm&aacute;l vagy egyszer&#369; m&oacute;dban jelenik meg. 
Minden tanul&oacute; l&aacute;tszik, pontozott t&eacute;teleik pontsz&aacute;maival &eacute;s ezek &ouml;sszes&iacute;t&eacute;s&eacute;vel. </p> 
<ul>
<li>A tanul&oacute;kat rendezhetj&uuml;k vezet&eacute;knev&uuml;k vagy keresztnev&uuml;k szerint a tanul&oacute;i oszlop bal vagy jobb oldal&aacute;ra
kattintva. Kezdetben a napl&oacute; vezet&eacute;kn&eacute;v szerint rendez.
</li>
<li>A tanul&oacute;k nevei olyan ugr&oacute;pontok, melyekr&#337;l csak a tanul&oacute;k neve 
&eacute;s pontjai &eacute;rhet&#337;k el. Ez hasznosnak bizonyul olyan esetben, amikor egy tanul&oacute; vel&uuml;nk egy&uuml;tt n&eacute;zi a napl&oacute;t,
mi pedig szeretn&eacute;nk a t&ouml;bbi tanul&oacute; pontjait el&#337;tte rejtve tartani.</li>
<li>A fel&uuml;l l&eacute;v&#337; gombbal Excel-t&aacute;bl&aacute;zatot vagy tabul&aacute;torokkal elv&aacute;lasztott 
sz&ouml;veges &aacute;llom&aacute;nyt k&eacute;sz&iacute;thet&uuml;nk, melyeket let&ouml;lthet&uuml;nk a 
sz&aacute;m&iacute;t&oacute;g&eacute;p&uuml;nkre.
</li>
<li>A kijelz&eacute;sben a fejl&eacute;cen norm&aacute;l (alapbe&aacute;ll&iacute;t&aacute;s szerinti) &uuml;zemm&oacute;dban a 'Pontsz&aacute;mok' 
jelenik meg. Ellenkez&#337; esetben a r&eacute;szletes be&aacute;ll&iacute;t&aacute;sok bekapcsol&aacute;sa eset&eacute;n a pillanatnyi 
kateg&oacute;ria neve lesz l&aacute;that&oacute;.
</li>
<li>K&ouml;z&eacute;pen l&aacute;tszanak az adott kurzus lepontozott t&eacute;telei (r&eacute;szletes &uuml;zemm&oacute;d eset&eacute;n csak egy kateg&oacute;ria).
A  lepontozott t&eacute;telek neveivel lehet az adott t&eacute;tel be&aacute;ll&iacute;t&aacute;saira ugrani.
</li>
<li>A feladatokt&oacute;l (r&eacute;szletes &uuml;zemm&oacute;d eset&eacute;n a kateg&oacute;ri&aacute;t&oacute;l) jobbra 
egy &ouml;sszes&iacute;t&#337; oszlop l&aacute;that&oacute;. Ennek fejl&eacute;c&eacute;t&#337;l jobbra tal&aacute;lhat&oacute; k&eacute;t 
ny&iacute;l, melyekkel a tanul&oacute;k &ouml;sszeredm&eacute;nyei n&ouml;vekv&#337; vagy cs&ouml;kken&#337; sorrendbe rendezhet&#337;k.
</li>
<li>Az &ouml;sszes&iacute;t&#337; fejl&eacute;ct&#337;l (r&eacute;szletes &uuml;zemm&oacute;d eset&eacute;n az egyes 
kateg&oacute;ri&aacute;kt&oacute;l) jobbra van egy 'statisztikai' ugr&oacute;pont, amely az oszt&aacute;ly &ouml;sszeredm&eacute;nye 
alapj&aacute;n ad statisztik&aacute;t.
</li>
</ul>
<p>A napl&oacute; be&aacute;ll&iacute;t&aacute;sainak m&oacute;dos&iacute;t&aacute;sa. A m&oacute;dos&iacute;tand&oacute; 
be&aacute;ll&iacute;t&aacute;shoz az ugr&oacute;pont id&eacute;z&#337;jelek k&ouml;z&ouml;tt l&aacute;tszik. Tov&aacute;bbi inform&aacute;ci&oacute; 
&eacute;s s&uacute;g&oacute; az egyes k&eacute;perny&#337;k&ouml;n olvashat&oacute;.</p>
<ul>
	<li><h3>Alap:</h3>
                <ul>
			<li>R&eacute;szletes &uuml;zemm&oacute;d bekapcsol&aacute;sa: &quot;Preferenci&aacute;k be&aacute;ll&iacute;t&aacute;sa&quot; </li>
			<li>Oszlopfejl&eacute;cek ism&eacute;tl&#337;d&eacute;s&eacute;nek m&oacute;dos&iacute;t&aacute;sa: &quot;Preferenci&aacute;k be&aacute;ll&iacute;t&aacute;sa&quot;</li>
		</ul>
                </li>
	<li><h3>R&eacute;szletes:</h3>
		<ul>
			<li>Kijelzend&#337; oszlopok be&aacute;ll&iacute;t&aacute;sa: "Preferenci&aacute;k be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>&Ouml;sszpontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;nak a be&aacute;ll&iacute;t&aacute;sa: "Preferenci&aacute;k be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>Mely kateg&oacute;ri&aacute;khoz tartozzon a lepontozott t&eacute;tel: "Kateg&oacute;ri&aacute;k be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>Feladatok plafonj&aacute;nak be&aacute;ll&iacute;t&aacute;sa: "Kateg&oacute;ri&aacute;k be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>Pontozott t&eacute;tel k&uuml;l&ouml;n pontoz&aacute;s&uacute;k&eacute;nt val&oacute; be&aacute;ll&iacute;t&aacute;sa: "Kateg&oacute;ri&aacute;k be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>Kateg&oacute;ria hozz&aacute;ad&aacute;sa: "Kateg&oacute;ri&aacute;k be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>Kateg&oacute;ria t&ouml;rl&eacute;se: "Kateg&oacute;ri&aacute;k be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>Pontoz&aacute;si s&uacute;lyok be&aacute;ll&iacute;t&aacute;sa: "S&uacute;lyok be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>A legalacsonyabb X pont kihagy&aacute;sa egy kateg&oacute;ri&aacute;b&oacute;l: "S&uacute;lyok be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>Jutalompontok hozz&aacute;ad&aacute;sa egy kateg&oacute;ri&aacute;hoz: "S&uacute;lyok be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>Kateg&oacute;ri&aacute;k elrejt&eacute;se napl&oacute; megjelen&iacute;t&eacute;s&eacute;b&#337;l vagy sz&aacute;m&iacute;t&aacute;sb&oacute;l: "S&uacute;lyok be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>A pontoz&aacute;si sk&aacute;la &eacute;s a pontoz&aacute;si bet&#369;k be&aacute;ll&iacute;t&aacute;sa: "Pontoz&aacute;si bet&#369;k be&aacute;ll&iacute;t&aacute;sa"</li>
			<li>Tanul&oacute;k kirekeszt&eacute;se feladatokb&oacute;l: &quot;Kiv&eacute;telek pontoz&aacute;sa"</li>
		</ul></li>
</ul>