<p align="center"><strong>S&uacute;ly</strong></p>
<p>Itt adhat&oacute;k meg egy kateg&oacute;ria pontoz&aacute;si s&uacute;lyai &eacute;s itt hagyhat&oacute; ki
a legalacsonyabb X sz&aacute;m&uacute; feladat a pontsz&aacute;m&iacute;t&aacute;sb&oacute;l, tov&aacute;bb&aacute; plusz pontokat 
adhat egy kateg&oacute;ri&aacute;hoz, valamint elrejthet egy kateg&oacute;ri&aacute;t a pontsz&aacute;mok 
megjelen&iacute;t&eacute;s&eacute;b&#337;l &eacute;s a sz&aacute;m&iacute;t&aacute;sb&oacute;l.</p>

<ul>
<li>S&uacute;ly: lehet&#337;v&eacute; teszi a pontsz&aacute;mok kateg&oacute;ri&aacute;nk&eacute;nti s&uacute;lyoz&aacute;s&aacute;t. 
A s&uacute;ly azt a sz&aacute;zal&eacute;kot jelenti, amellyel egy kateg&oacute;ria az &ouml;sszes pontsz&aacute;mhoz hozz&aacute;j&aacute;rul. 
Az &ouml;sszes pontsz&aacute;m alul z&ouml;ld sz&iacute;nnel l&aacute;tszik, ha az &ouml;sszes kateg&oacute;ria s&uacute;lyai egy&uuml;ttesen 
100-at adnak ki, egy&eacute;bk&eacute;nt pedig piros sz&iacute;n&#369;. </li>

<li>A legalacsonyabb X kihagy&aacute;sa: 
itt adhat&oacute; meg, h&aacute;ny legalacsonyabb eredm&eacute;ny maradjon ki egy 
tanul&oacute; pontsz&aacute;m&aacute;nak a kisz&aacute;m&iacute;t&aacute;s&aacute;b&oacute;l.
Egy kateg&oacute;ri&aacute;n bel&uuml;l minden &ouml;sszpontsz&aacute;m &eacute;rt&eacute;k&eacute;nek azonosnak kell lenni,
ellenkez&#337; esetben az eredm&eacute;ny megj&oacute;solhatatlan.</li>

<li>Plusz pontok: olyan pontok ad&aacute;s&aacute;ra ny&uacute;jt lehet&#337;s&eacute;get, amelyek nem befoly&aacute;solj&aacute;k 
az adott kateg&oacute;ria &ouml;sszpontsz&aacute;m&aacute;t. Ezzel a kev&eacute;ss&eacute; m&eacute;lt&aacute;nyos k&eacute;rd&eacute;seken 
m&oacute;dos&iacute;that, illetve k&ouml;zel&iacute;theti a k&eacute;rd&eacute;seket egym&aacute;shoz.
A m&oacute;dos&iacute;t&aacute;s minden tanul&oacute;t egyform&aacute;n &eacute;rint. Ha csak egyes tanul&oacute;kat 
k&iacute;v&aacute;n ily m&oacute;don jutalmazni, adjon hozz&aacute; egy &uacute;j pontozott t&eacute;telt &eacute;s a 
Kateg&oacute;ri&aacute;k be&aacute;ll&iacute;t&aacute;s&aacute;n&aacute;l v&aacute;lassza a k&uuml;l&ouml;n pontot.</li>

<li>Rejtett: a n&eacute;gyzet bejel&ouml;l&eacute;sekor a kateg&oacute;ri&aacute;t kiz&aacute;rja a 
megjelen&iacute;t&eacute;sb&#337;l &eacute;s a pontsz&aacute;m&iacute;t&aacute;sb&oacute;l. &Iacute;gy egyszer&#369;en el&eacute;rhet&#337;, hogy 
a napl&oacute;ba csak akkor ker&uuml;ljenek bele egyes t&eacute;telek, ha megt&ouml;rt&eacute;nt a pontoz&aacute;suk.
Mivel a kateg&oacute;ri&aacute;ba nem sorolt pontozott t&eacute;telek automatikusan a &quot;Besorolatlanok&quot; k&ouml;z&eacute; ker&uuml;lnek,
a "Besorolatlan" kateg&oacute;ria rejtettre &aacute;ll&iacute;t&aacute;s&aacute;val el&eacute;rhet&#337;, hogy a pontoz&aacute;s menet&eacute;nek 
megfelel&#337;en a t&eacute;teleket b&aacute;rmely kateg&oacute;ri&aacute;ba sorolja, &eacute;s &iacute;gy a 
tanul&oacute;k sz&aacute;m&aacute;ra l&aacute;that&oacute;v&aacute; v&aacute;lj&eacute;k a pontsz&aacute;muk.</li>
</ul>