
<P ALIGN=CENTER><B>Formatar text</B></P>

<P>Quan escriviu text a Moodle podeu escollir entre diferents tipus de format 
  depenent de les vostres habilitats i del tipus de navegador que useu. 
<P><B>Normalment si deixeu les opcions als valors per defecte us sortir&agrave; el 
  text tal com desitgeu</B>.

<P><B>1. Autoformat</B></P>

<UL>
  <p>Aquest &eacute;s el millor format quan feu servir els formularis web per 
    entrar dades en lloc de l'editor en text enriquit HTML. Nom&eacute;s cal que 
    escriviu normalment com si estigu&eacute;ssiu enviant un correu.</p>
  <p>Quan deseu el text Moodle formatar&agrave; autom&agrave;ticament el text 
    per v&oacute;s.</p>
  <p>Per exemple, les URL com ara <a href="http://yahoo.com/">http://yahoo.com</a> 
    o <a href="http://www.yahoo.com/">www.yahoo.com</a> es convertiran en enlla&ccedil;os.</p>
  <p>Es mantindran els salts de l&iacute;nia i les l&iacute;nies en blanc serviran 
    per comen&ccedil;ar un nou par&agrave;graf.</p>
  <p>Les emoticones com ara :-) es convertiran autom&agrave;ticament en llurs 
    equivalents gr&agrave;fics.</p>
  Fins i tot podeu introduir codi HTML, si aix&iacute; ho desitgeu, i es mantindr&agrave;. 
  <P>&nbsp; 
  <p align=right><a href="help.php?file=text.html">Més informació sobre l'autoformat 
    de Moodle</a></p>
</UL>


<P><B>2. Format HTML </B></P>

<UL>
  <p>Aquest format pressuposa que el text &eacute;s tot codi HTML. Si esteu usant 
    un editor d'HTML per editar el text aquest &eacute;s el format per defecte 
    i tots els comandaments de la barra d'eines produiran codi HTML per v&oacute;s.</p>
  <p>Encara que no useu l'editor en text enriquit HTML podeu utilitzar codi HTML 
    al text i es mostrar&agrave; exactament com voleu.</p>
  <p>A difer&egrave;ncia de l'autoformat aqu&iacute; no hi ha formatatge autom&agrave;tic.</p>
  <P ALIGN=RIGHT> 
    <? helpbutton("html", get_string("helphtml")) ?>
    M&eacute;s informaci&oacute; sobre HTML</P>
  <P ALIGN=RIGHT> 
    <? helpbutton("richtext", get_string("helprichtext")) ?>
    M&eacute;s informaci&oacute; sobre l'editor en text enriquit HTML</P>
</UL>


<P><B>3. Format de text pla</B></P>

<UL>
  <P>Aquest format &eacute;s &uacute;til quan necessiteu incloure gran quantitat 
    de codi o d'HTML que voleu que es mostri exactament tal com l'heu escrit. 
  <p>Tot i aix&ograve; encara tradueix les emoticones i l&iacute;nies noves, per&ograve; 
    la resta de text no &eacute;s modificat.</p>
</UL>


<P><B>4. Format de text Wiki </B></P>
<UL>
  <p>Aquest format utilitza una manera especials d'escriure text anomenada format 
    de Wiki</p>
  <p>Us permet escriure text de manera que encara &eacute;s prou llegible per&ograve; 
    que ser&agrave; convertit autom&agrave;ticament en text HTML amb encap&ccedil;alaments, 
    llistes i altres formats complexos.</p>
  <P ALIGN=RIGHT> 
    <? helpbutton("wiki", get_string("helpwiki")) ?>
    M&eacute;s informaci&oacute; sobre el format Wiki</P>
</UL>

