<P ALIGN=CENTER><B>Formatar text</B></P>

<P>Quan escriviu en Moodle podeu triar diferents formats per processar el text segons els vostres coneixements t&egrave;cnics i el tipus de navegador que utilitzeu.
 
<P><B>Normalment si deixeu aquest par&agrave;metre en el valor per defecte les coses funcionaran tal com espereu.</B>.

<P><B>1. Autoformat Moodle</B></P>

<UL>
  <p>Aquest format &eacute;s millor quan utilitzeu formularis web normals per escriure (en lloc de l'editor de text enriquit HTML). Nom&eacute;s cal que escriviu normalment com si estigu&eacute;ssiu enviant un correu.</p>
  <p>Quan deseu el text Moodle far&agrave; unes quantes coses per formatar-lo autom&agrave;ticament.</p>
  <p>Per exemple, els URL com ara <a href="http://www.google.com/">http://www.google.com</a> 
    o <a href="http://moodle.org/">http://moodle.org</a> es convertiran en enlla&ccedil;os.</p>
  <p>Els salts de l&iacute;nia es mantindran i les l&iacute;nies en blanc serviran per comen&ccedil;ar un nou par&agrave;graf.</p>
  <p>Les emoticones com ara :-) es convertiran autom&agrave;ticament en els seus 
    equivalents gr&agrave;fics.</p>
  Fins i tot podeu introduir codi HTML, si voleu, i es mantindr&agrave;. 
  <P>&nbsp; 
  <p align=right><a href="help.php?file=text.html">M&eacute;s informaci&oacute; sobre l'autoformatatge de Moodle</a></p>
</UL>


<P><B>2. Format HTML </B></P>

<UL>
  <p>Aquest format pressuposa que el text &eacute;s pur HTML. Si esteu utilitzant l'editor d'HTML per editar el text aquest &eacute;s el format per defecte; tots els comandaments de la barra d'eines produeixen codi HTML per v&oacute;s.</p>

  <p>Encara que no utilitzeu l'editor de text enriquit HTML podeu usar codi HTML 
    al text i es mostrar&agrave; exactament com voleu.</p>
    
  <p>A difer&egrave;ncia de l'Autoformat Moodle aqu&iacute; no hi ha formatatge autom&agrave;tic.</p>
  <P ALIGN=RIGHT> 
    <?php  helpbutton("html", get_string("helphtml")) ?>
    M&eacute;s informaci&oacute; sobre HTML en Moodle</P>
  <P ALIGN=RIGHT> 
    <?php  helpbutton("richtext", get_string("helprichtext")) ?>
    M&eacute;s informaci&oacute; sobre l'editor de text enriquit HTML</P>

</UL>


<P><B>3. Text</B></P>

<UL>
  <P>Aquest format &eacute;s &uacute;til quan necessiteu incloure gran quantitat de codi o d'HTML que voleu que es mostri exactament tal com l'heu escrit. 
  <p>S'hi tradueixen les emoticones i els salts de l&iacute;nia, per&ograve; a banda d'aix&ograve; no es toca res.</p>
</UL>


<P><B>4. Format de text Wiki </B></P>
<UL>
  <p>Aquest format utilitza una forma especial d'escriure text coneguda com format Wiki</p>
  <p>Aquest format permet escriure text de manera que segueix sent bastant llegible, per&ograve; que tamb&eacute; pot transformar-se autom&agrave;ticament en text HTML amb encap&ccedil;alaments, llistes i altres formatatges complexos.</p>
  <P ALIGN=RIGHT> 
    <?php  helpbutton("wiki", get_string("helpwiki")) ?>
    M&eacute;s informaci&oacute; sobre el format Wiki</P>
</UL>

