<p align="center"><b>C&agrave;rrega d'usuaris</b></p>

<p>En primer lloc, fixeu-vos que <strong>generalment no &eacute;s necessari importar usuaris en massa</strong>. Si voleu minorar les tasques de manteniment abans haur&iacute;eu d'explorar les formes d'autenticaci&oacute; que no requereixen un manteniment manual, per exemple la connexi&oacute; amb bases de dades externes o la possibilitat que els usuaris cre&iuml;n els seus comptes. Vg. la secci&oacute; d'Autenticaci&oacute; dels men&uacute;s d'administraci&oacute;.</p>

<p>Si esteu segur que voleu importar molts comptes d'usuari des d'un fitxer de text, aleshores heu de formatar aix&iacute; el fitxer:</p>

<ul>
  <li>Cada l&iacute;nia del fitxer cont&eacute; un registre.</li>
  <li>Cada registre &eacute;s una seq&uuml;&egrave;ncia de dades separades per comes.</li>
  <li>El primer registre del fitxer &eacute;s especial i cont&eacute; la llista de noms dels camps. Aix&ograve; defineix el format de la resta del fitxer.
    <blockquote>
      <p><strong>Noms de camps necessaris:</strong> aquests camps s'han d'incloure al primer registre i han d'estar definits per a cada usuari</p>
      <p></p>
      <font color="#990000" face="Courier New, Courier, mono">username, password, firstname, lastname, email</font></p>
</p>
      <p><strong>Noms de camps per defecte:</strong> aquests s&oacute;n opcionals - si no s&oacute;n inclosos, aleshores s'agafen del perfil de l'administrador principal</p>
      <p><font color="#990000" face="Courier New, Courier, mono">institution, department, city, country, lang, timezone</font> </p>
      <p><strong>Noms de camps opcionals: </strong>tots aquests s&oacute;n completament opcionals. Els noms dels cursos s&oacute;n els &quot;noms curts&quot; dels cursos - si s'inclouen, aleshores l'usuari &eacute;s inscrit com a estudiant en aquests cursos. Els noms de grups s'han d'associar als cursos corresponents, p. e. group1 a course1, etc.</p>
      <p> <font color="#990000" face="Courier New, Courier, mono">idnumber, icq, phone1, phone2, address, url, description, mailformat, maildisplay, htmleditor, autosubscribe, course1, course2, course3, course4, course5, group1, group2, group3, group4, group5</font></p>
    </blockquote>
    </li>
  <li>Les comes dins de les dades s'han de codificar com &amp;#44. El programa far&agrave; autom&agrave;ticament la descodificaci&oacute;. </li>
  <li>En els camps booleans, feu servir 0 per a fals i 1 per a vertader.</li>
  <li>Nota: si un usuari ja est&agrave; registrat en la base de dades d'usuaris de Moodle, aquest programa torna el n&uacute;mero userid de l'usuari (l'&iacute;ndex de la base de dades) i l'inscriu com a estudiant en els cursos especificats SENSE actualitzar les altres dades.</li>
</ul>
  
  
<p>Heus ac&iacute; un exemple d'un fitxer d'importaci&oacute; v&agrave;lid:</p>
<p><font size="-1" face="Courier New, Courier, mono">username, password, firstname, lastname, email, lang, idnumber, maildisplay, course1, group1<br>
jonest, verysecret, Tom, Jones, jonest@someplace.edu, en, 3663737, 1, Intro101, Section 1<br>
reznort, somesecret, Trent, Reznor, reznort@someplace.edu, en_us, 6736733, 0, Advanced202, Section 3</font></p>

