<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Documentation Moodle : Contexte</title>
  <link rel="stylesheet" href="./docstyles.css" type="TEXT/CSS">
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
<body bgcolor="#ffffff">
  
<h1>Contexte</h1>
 
<blockquote>
  <p>Moodle est une produit en constante &eacute;volution. Le d&eacute;veloppement
  a &eacute;t&eacute; d&eacute;marr&eacute; par <a href="http://moodle.org/user/view.php?id=1&amp;course=1"
  target="_top">Martin Dougiamas</a>, qui continue &agrave; conduire le projet&nbsp;:</p>
  <blockquote>
    <p><em>Je travaille &agrave; ce projet d'une fa&ccedil;on ou d'une autre,
    depuis plusieurs ann&eacute;es. Cela a commenc&eacute; dans les ann&eacute;es
    1990, alors que j'&eacute;tais webmaster &agrave; l'<a target="_top"
    href="http://www.curtin.edu.au/">Universit&eacute; technologique
    de Curtin</a> et administrateur syst&egrave;me de leur installation
    WebCT. Je rencontrais beaucoup de frustration avec le monstre
    qu'est WebCT et &ccedil;a commen&ccedil;ait &agrave; faire comme une d&eacute;mangeaison
    qu'il faut &agrave; tout prix gratter - il devait y avoir une meilleure
    fa&ccedil;on de le faire (mais non, pas Blackboard :-)</em></p>
    <p><em>Je connais aussi bon nombre de personnes dans des
    &eacute;coles et d'autres institutions plus petites (et quelques
    grandes aussi&nbsp;!) qui voudraient utiliser l'Internet de
    mani&egrave;re plus efficace, mais ne savent pas o&ugrave; commencer
    dans le labyrinthe des technologies et des p&eacute;dagogies
    qu'on y trouve. J'ai toujours esp&eacute;r&eacute; qu'il existe une
    alternative gratuite et libre que de telles personnes
    puissent utiliser pour les aider &agrave; porter leurs comp&eacute;tences
    d'enseignement dans un environnement en ligne.</em></p>
    <p><em>Mes profondes convictions sur les possibilit&eacute;s non r&eacute;alis&eacute;es
    d'une formation bas&eacute;e sur l'Internet m'ont conduit &agrave; faire un
    Masters, puis une th&egrave;se en &Eacute;ducation, en combinant ma 
    carri&egrave;re ant&eacute;rieure en Informatique avec mes nouvelles
    connaissances sur la nature de l'apprentissage et de la
    collaboration. En particulier, j'ai particuli&egrave;rement
    &eacute;t&eacute; influenc&eacute; par l'&eacute;pist&eacute;mologie du socio-constructivisme - 
    qui ne traite pas seulement l'apprentissage en tant qu'activit&eacute;
    sociale, mais s'occupe particuli&egrave;rement de l'apprentissage
    survenant lors de la construction active d'art&eacute;facts (comme
    des textes) destin&eacute;s &agrave; &ecirc;tre vus ou utilis&eacute;s par d'autres
    personnes.</em></p>
    <p><em>Pour moi, il est essentiel que ce logiciel soit facile
    &agrave; utiliser - en fait, il devrait &ecirc;tre aussi intuitif que
    possible.</em></p>
    <p><em>Je m'engage &agrave; continuer &agrave; travailler sur Moodle
    et &agrave; le conserver livre et gratuit. J'ai l'intime conviction
    de l'importance d'une formation illimit&eacute;e et d'un enseignement
    autoris&eacute;, et Moodle est ma fa&ccedil;on la plus importante de
    contribuer &agrave; la r&eacute;alisation de ces id&eacute;aux.</em></p>
  </blockquote>
  <p>A number of early prototypes were produced and discarded before he released 
  version 1.0 upon a largely unsuspecting world on August 20, 2002. This version 
  was targeted towards smaller, more intimate classes at University level, and 
  was the subject of research case studies that closely analysed the nature of 
  collaboration and reflection that occurred among these small groups of adult 
  participants.
</p>
  <p>Since then there has been steady series of new releases adding new features, 
  better scalability and improved performance. 
</p>
  <p>As Moodle has spread and the community has grown, more input is being drawn 
  from a wider variety of people in different teaching situations. For example, 
  Moodle is now used not only in Universities, but in high schools, primary schools, 
  non-profit organisations, private companies, by independent teachers and even 
  homeschooling parents. A growing number of people from around the world are 
  contributing to Moodle in different ways - for more details see the <a href="?file=credits.html">Credits</a> 
  page. 
</p>
  <p>An important feature of the Moodle project is the <a href="http://moodle.org" target="_top">moodle.org</a> 
  web site, which provides a central point for information, discussion and collaboration 
  among Moodle users, who include system administrators, teachers, researchers, 
  instructional designers and of course, developers. Like Moodle, this site is 
  always evolving to suit the needs of the community, and like Moodle it will 
  always be Free.
</p>
  <p>In 2003, the company <a href="http://moodle.com/" target="_top">moodle.com</a> 
  was launched to provide additional commercial support for those need it, as 
  well as managed hosting, consulting and other services.
</p>
  <p>For more about our future plans for Moodle, see the <a href="?file=future.html">Future</a> 
  roadmap.</p>
</blockquote>
<p align="CENTER"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>

</body>
</html>
