<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Documentation Moodle : Contexte</title>
  <link rel="stylesheet" href="./docstyles.css" type="TEXT/CSS">
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
<body bgcolor="#ffffff">
  
<h1>Contexte</h1>
 
<blockquote>
  <p>Moodle est une produit en constante &eacute;volution. Le d&eacute;veloppement
  a &eacute;t&eacute; d&eacute;marr&eacute; par <a href="http://moodle.org/user/view.php?id=1&amp;course=1"
  target="_top">Martin Dougiamas</a>, qui continue &agrave; conduire le projet&nbsp;:</p>
  <blockquote>
    <p><em>Je travaille &agrave; ce projet d'une fa&ccedil;on ou d'une autre,
    depuis plusieurs ann&eacute;es. Cela a commenc&eacute; dans les ann&eacute;es
    1990, alors que j'&eacute;tais webmaster &agrave; l'<a target="_top"
    href="http://www.curtin.edu.au/">Universit&eacute; technologique
    de Curtin</a> et administrateur syst&egrave;me de leur installation
    WebCT. Je rencontrais beaucoup de frustration avec le monstre
    qu'est WebCT et &ccedil;a commen&ccedil;ait &agrave; faire comme une d&eacute;mangeaison
    qu'il faut &agrave; tout prix gratter - il devait y avoir une meilleure
    fa&ccedil;on de le faire (mais non, pas Blackboard :-)</em></p>
    <p><em>Je connais aussi bon nombre de personnes dans des
    &eacute;coles et d'autres institutions plus petites (et quelques
    grandes aussi&nbsp;!) qui voudraient utiliser l'Internet de
    mani&egrave;re plus efficace, mais ne savent pas o&ugrave; commencer
    dans le labyrinthe des technologies et des p&eacute;dagogies
    qu'on y trouve. J'ai toujours esp&eacute;r&eacute; qu'il existe une
    alternative gratuite et libre que de telles personnes
    puissent utiliser pour les aider &agrave; porter leurs comp&eacute;tences
    d'enseignement dans un environnement en ligne.</em></p>
    <p><em>Mes profondes convictions sur les possibilit&eacute;s non r&eacute;alis&eacute;es
    d'une formation bas&eacute;e sur l'Internet m'ont conduit &agrave; faire un
    Masters, puis une th&egrave;se en &Eacute;ducation, en combinant ma 
    carri&egrave;re ant&eacute;rieure en Informatique avec mes nouvelles
    connaissances sur la nature de l'apprentissage et de la
    collaboration. En particulier, j'ai particuli&egrave;rement
    &eacute;t&eacute; influenc&eacute; par l'&eacute;pist&eacute;mologie du socio-constructivisme - 
    qui ne traite pas seulement l'apprentissage en tant qu'activit&eacute;
    sociale, mais s'occupe particuli&egrave;rement de l'apprentissage
    survenant lors de la construction active d'art&eacute;facts (comme
    des textes) destin&eacute;s &agrave; &ecirc;tre vus ou utilis&eacute;s par d'autres
    personnes.</em></p>
    <p><em>Pour moi, il est essentiel que ce logiciel soit facile
    &agrave; utiliser - en fait, il devrait &ecirc;tre aussi intuitif que
    possible.</em></p>
    <p><em>Je m'engage &agrave; continuer &agrave; travailler sur Moodle
    et &agrave; le conserver livre et gratuit. J'ai l'intime conviction
    de l'importance d'une formation illimit&eacute;e et d'un enseignement
    autoris&eacute;, et Moodle est ma fa&ccedil;on la plus importante de
    contribuer &agrave; la r&eacute;alisation de ces id&eacute;aux.</em></p>
  </blockquote>
  <p>Plusieurs prototypes initiaux ont &eacute;t&eacute; produits et &eacute;cart&eacute;s
  avant la sortie de la version 1.0, le 20 ao&ucirc;t 2002, &agrave; la surprise
  g&eacute;n&eacute;rale. Cette version &eacute;tait destin&eacute;e &agrave; de petites classes, plus intimes,
  au niveau universitaire. Elle &eacute;tait le sujet d'une recherche avec &eacute;tude
  de cas qui analysait attentivement la nature des collaborations et
  des r&eacute;flexions survenant dans des petits groupes de participants
  adultes.</p>
  <p>Depuis lors, de nouvelles versions sont constamment publi&eacute;es,
  avec de nouvelles fonctionnalit&eacute;s, plus de possibilit&eacute;s 
  grandir et une meilleure performance.</p>
  <p>Comme Moodle s'est r&eacute;pandu et que la communaut&eacute; s'est
  aggrandie, une large vari&eacute;t&eacute; de personnes, exer&ccedil;ant
  diff&eacute;rentes situations d'enseignement, utilisent Moodle.
  Par exemple, Moodle est maintenant utilis&eacute; non
  seulement dans les universit&eacute;s, mais aussi dans les lyc&eacute;es,
  les &eacute;coles primaires, dans des organisations &agrave; buts non lucratifs,
  dans des firmes priv&eacute;es, par des enseignants ind&eacute;pendants
  et m&ecirc;me par des parents enseignant &agrave; domicile. Un nombre
  sans cesse en augmentation de personnes du monde entier
  contribuent &agrave; Moodle en diff&eacute;rentes mani&egrave;res - pour
  plus de d&eacute;tails, voir la page des
  <a href="?file=credits.html">remerciements</a> (non traduite).</p>
  <p>Une partie importante du projet Moodle est le site web
  <a href="http://moodle.org" target="_top">moodle.org</a>, qui
  sert de point central pour l'information, la discussion et
  la collaboration des utilisateurs de Moodle. On compte parmi
  ceux-ci des administrateurs syst&egrave;mes, des enseignants, des
  chercheurs, des concepteurs en &eacute;ducation et bien s&ucirc;r des
  d&eacute;veloppeurs. Tout comme Moodle, ce site est en constante
  &eacute;volution pour s'adapter aux besoins de la communaut&eacute;, et tout
  comme Moodle, il sera toujours gratuit.</p>
  <p>En 2003, l'entreprise <a href="http://moodle.com/" target="_top">moodle.com</a>
  a &eacute;t&eacute; lanc&eacute;e pour offrir une assistance professionnelle &agrave; ceux
  qui en ont besoin, ainsi que des services d'h&eacute;bergement, de
  consultation et d'autres encore.</p>
  <p>Pour en savoir plus sur l'avenir de Moodle, voir la page
  <a href="?file=future.html">Futur</a>.</p>
</blockquote>
<p align="CENTER"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>

</body>
</html>
