<head>
<title>Documentation Moodle : Manuel du développeur</title>
<link rel="stylesheet" href="docstyles.css" type="test/css">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF">
<h1>Manuel du développeur</h1>
<blockquote>
  <p>Ce document d&eacute;crit en quelques mots le design &agrave; la base de Moodle et
  comment vous pouvez contribuer &agrave; son d&eacute;veloppement.</p>
  <p>Il est un peu mince pour l'instant. Une meilleure documentation est pr&eacute;vue&nbsp;!</p>
  <p>Sections de ce document&nbsp;:</p>
  <ol>
    <li><a href="#architecture">Architecture de Moodle</a></li>
    <li><a href="#contribute">Comment vous pouvez aider</a> 
      <ul>
        <li><a href="#activities">Activit&eacute;s d'apprentissage</a></li>
        <li><a href="#themes">Th&egrave;mes</a></li>
        <li><a href="#languages">Langues</a></li>
        <li><a href="#database">Sch&eacute;mas de bases de donn&eacute;es</a></li>
        <li><a href="#courseformats">Formats de cours</a></li>
        <li><a href="#doc">Documentation et articles</a></li>
        <li><a href="#bugs">Participer &agrave; la traque des bogues</a></li>
      </ul>
    </li>
  </ol>
</blockquote>
<p>&nbsp;</p>
<h2><a name="architecture"></a>1. Architecture de Moodle</h2>
<blockquote>
  <p>Du point de vue d'un administrateur de système, Moodle a été conçu selon les
  critères suivants :</p>
  <ol>
    <li><strong>Moodle devrait fonctionner sur le plus possible de
    plateformes diff&eacute;rentes</strong><br /><br />
    L'application web qui tourne sur le plupart des plateformes est PHP, en
    combinaison avec MySQL, et c'est l'environnement dans lequel Moodle a
    &eacute;t&eacute; d&eacute;velopp&eacute; (sur Linux, Windows et Mac OS X).
    Moodle utilise aussi la librairie ADOdb pour l'abstraction de la base de
    donn&eacute;es, ce qui implique que Moodle peut utiliser
    <a href="http://php.weblogs.com/ADOdb_manual#drivers">plus de 10 marques
    de bases de donn&eacute;es diff&eacute;rentes</a> (toutefois, il ne peut
    malheureusement pas encore <em><strong>mettre en place les tables</strong></em>
    de toutes ces bases de donn&eacute;es. Voir ci-dessous pour plus d'informations).<br /><br />
    </li>
    <li><strong>Moodle devrait &ecirc;tre facile &agrave; installer, &agrave; apprendre et
    &agrave; modifier</strong><br /><br />
    Les premiers prototypees de Moodle (1999) &eacute;taient bas&eacute;s sur
    <a target="_top" href="http://www.zope.org/">Zope</a>, un serveur d'application
    web orient&eacute; objet de technologie avanc&eacute;e. Malheureusement, bien que cette
    technologie soit plut&ocirc;t cool, elle avait une courbe d'apprentissage
    tr&egrave;s raide et n'&eacute;tait pas tr&egrave;s souple en termes d'administration de
    syst&egrave;mes. D'un autre c&ocirc;t&eacute;, le langage de scripts PHP est tr&egrave;s facile
    d'acc&egrave;s, notamment si vous avez d&eacute;j&agrave; programm&eacute; avec un autre
    langage de scripts. J'ai pris assez t&ocirc;t la d&eacute;cision de ne pas utiliser
    un concept orient&eacute; objet, l&agrave; encore, pour conserver la simplicit&eacute;
    par &eacute;gard pour les novices. En lieu et place, la r&eacute;utilisation du
    code est accomplie gr&acirc;ce &agrave; des librairies de fonctions clairement
    d&eacute;nomm&eacute;es et par une mise en page coh&eacute;rente des fichiers de scripts.
    En outre, PHP est facile &agrave; installer (des ex&eacute;cutables sont disponibles
    pour toutes les plateformes) et si largement r&eacute;pandu que la plupart
    des services d'h&eacute;bergement web l'offrent en standard.<br /><br />
    </li>
    <li><strong>Il devrait &ecirc;tre facile &agrave; mettre &agrave; jour d'une version &agrave;
    la suivante</strong><br /><br />
      Moodle conna&icirc;t son num&eacute;ro de version (tout comme ceux de chacun
      des modules) et un m&eacute;canisme y a &eacute;t&eacute; impl&eacute;ment&eacute;
      de sorte qu'il puisse se mettre &agrave; jour tout seul (il peut par exemple
      renommer les tables de la base de donn&eacute;es ou y ajouter
      de nouveaux champs). Si vous utilisez CVS sur Unix, vous pouvez
      par exemple taper la commande &laquo;&nbsp;cvs update -d&nbsp;&raquo;, puis visiter la page
      d'accueil de votre site pour terminer la mise &agrave; jour.<br /><br />
    </li>
    <li><strong>Il devrait &ecirc;tre modulaire pour pouvoir grandir facilement</strong><br /><br />
      Un grand nombre de fonctionnalit&eacute;s de Moodle sont modulaires, notamment
      les th&egrave;mes, les activit&eacute;s, les langues de l'interface, les
      sch&eacute;mas de la base de donn&eacute;es et les formats de cours. Cela permet
      &agrave; quiconque d'ajouter des fonctionnalit&eacute;s au code principal ou encore
      de distribuer des modules s&eacute;par&eacute;ment. Voir ci-dessous pour plus
      d'informations &agrave; ce sujet.<br /><br />
    </li>
    <li><strong>Il devrait pouvoir &ecirc;tre utilis&eacute; en association avec
    d'autres syst&egrave;mes</strong><br /><br />
      Moodle conserve tous les fichiers d'un cours dans le m&ecirc;me dossier sur le
      serveur. Cela permet &agrave; un administrateur syst&egrave;me d'offrir pour
      chaque enseignant n'importe quel type d'acc&egrave;s direct aux fichiers,
      comme Appletalk, SMB, NFS, FTP, WebDAV, etc. Les modules d'authentification
      permettent &agrave; Moodle d'utiliser LDAP, MAP, POP3, NNTP et d'autres
      bases de donn&eacute;es comme source des donn&eacute;es des utilisateurs. Autrement,
      il reste pas mal de travail &agrave; faire. Les fonctionnalit&eacute;s pr&eacute;vues
      de Moodle pour les versions &agrave; venir comprennent notamment&nbsp;:
      l'importation et l'exportation des donn&eacute;es en format XML (y compris
      IMS et SCORM) et l'utilisation croissante des feuilles de style pour
      l'interface (permettant ainsi une meilleure incorporation dans
      d'autres sites web).
      </li>
  </ol>
</blockquote>
<p>&nbsp;</p>
<h2><a name="contribute" id="contribute"></a>2. Comment vous pouvez aider</h2>
<blockquote>
  <p>Comme indiqu&eacute; ci-dessus, bon nombre de fonctionnalit&eacute;s de Moodle sont modulaires.
  M&ecirc;me si vous n'&ecirc;tes pas programmeur, il y a des choses que vous pouvez modifier ou
  pour lesquelles vous pouvez nous aider.</p>
  <h3><a name="activities" id="activities"></a>Activit&eacute;s d'apprentissage</h3>
  <blockquote>
    <p>Ce sont les modules les plus importants. Ils sont plac&eacute;s dans le dossier
    &laquo;&nbsp;mod&nbsp;&raquo;. Il y a sept modules par d&eacute;faut&nbsp;: devoir, sondage, test, forum,
    journal, questionnaire et ressource. Chaque module est plac&eacute; dans
    un sous-dossier propre et consiste en divers &eacute;l&eacute;ments obligatoires
    (ainsi que d'autres scripts propres &agrave; chaque module)&nbsp;:</p>
    <ul>
      <li>mod.html&nbsp;: un formulaire pour configurer ou mettre &agrave; jour un instance
      du module</li>
      <li>version.php&nbsp;: d&eacute;finit quelques meta-informations et met &agrave; disposition
      le m&eacute;canisme de mise &agrave; jour</li>
      <li>icon.gif&nbsp;: une ic&ocirc;ne 16x16 pour le module</li>
      <li>db/&nbsp;: des &laquo; dumps&nbsp;&raquo; SQL de toutes les tables de base de donn&eacute;es et
      des donn&eacute;es elles-m&ecirc;mes (pour chaque type de base de donn&eacute;es)</li>
      <li>index.php&nbsp;: une page permettant d'afficher la liste de toutes les
      instances du module dans un cours</li>
      <li>view.php&nbsp;: une page permettant d'afficher une instance particuli&egrave;re</li>
      <li>lib.php&nbsp;: toutes les fonctions d&eacute;finies par le module doivent s'y
      trouver. Si le nom du module est &laquo;&nbsp;bidule&nbsp;&raquo;, les fonctions n&eacute;cessaires
      sont&nbsp;notamment : 
        <ul>
          <li>bidule_add_instance() - code pour ajouter une nouvelle instance de bidule</li>
          <li>bidule_update_instance() - code pour mettre &agrave; jour une instance existante</li>
          <li>bidule_delete_instance() - code effacer une instance</li>
          <li>bidule_user_outline() - &eacute;tant donn&eacute;e une instance, retourne un r&eacute;sum&eacute;
          d'une contribution d'un utilisateur</li>
          <li>bidule_user_complete() - &eacute;tant donn&eacute;e une instance, affiche les details
          d'une contribution d'un utilisateur<br />
          </li>
          <li>Pour &eacute;viter tout conflit &eacute;ventuel, le nom de toutes les fonctions du module
          doit commencer par &laquo;&nbsp;bidule_&nbsp;&raquo; et celui de toutes les constantes par 
          &laquo;&nbsp;BIDULE_&nbsp;&raquo;</li>
        </ul>
      </li>
      <li>Finalement, chaque module comportera des fichiers de langue, qui contiennent
      les cha&icirc;nes de caract&egrave;res du module. Voir ci-dessous pour des d&eacute;tails.</li>
    </ul>
    <p>Pour programmer un nouveau module d'activit&eacute;, le plus simple est d'utiliser le
    mod&egrave;le <strong><a href="http://moodle.org/mod/newmodule_template.zip">mod/newmodule_template.zip</a></strong>.</p>
    D&eacute;compressez-le est suivez les instructions du fichier README inclus.</p>
    <p>Il est &eacute;galement judicieux de poster auparavant un message sur le forum
    <a href="http://moodle.org/mod/forum/view.php?id=44" target="_top">Activities 
      modules</a> dans le cours &laquo;&nbsp;Using Moodle&nbsp;&raquo;.</p>
    <p>&nbsp;</p>
  </blockquote>
  <h3><a name="themes" id="themes"></a>Th&egrave;mes</h3>
  <blockquote>
    <p>Les th&egrave;mes (ou &laquo; skins&nbsp;&raquo;) d&eacute;finissent l'aspect d'un
    site. Quelques th&egrave;mes simples sont fournis dans la distribution de Moodle.
    Vous pouvez aussi cr&eacute;er votre propre th&egrave;me avec vos couleurs, logo,
    styles et graphiques pr&eacute;f&eacute;r&eacute;s.</p>
    <p>Chaque th&egrave;me est plac&eacute; dans un sous-dossier &laquo;&nbsp;theme&nbsp;&raquo;
    qui contient au moins les fichiers suivants&nbsp;:</p>
    <ul>
      <li><strong>config.php</strong>&nbsp;: d&eacute;finit les couleurs du th&egrave;mes qui
      seront utilis&eacute;es dans le site.</li>
      <li><strong>styles.php</strong>&nbsp;: la feuille de style contentant les
      d&eacute;finitions des &eacute;l&eacute;ments standard HTML et que de nombreux
      &eacute;l&eacute;ments de Moodle.</li>
      <li><strong>header.html</strong>&nbsp;: fichier incorpor&eacute; au d&eacute;but
      de chaque page. Pour ajouter un logo au sommet de chaque page, c'est ce fichier qui devra
      &ecirc;tre modifi&eacute;.</li>
      <li><strong>footer.html</strong>&nbsp;: fichier incorpor&eacute; &agrave; la fin
      de chaque page.</li>
    </ul>
    <p>Pour cr&eacute;er votre propre th&egrave;me avec la version actuelle de Moodle&nbsp;:</p>
    <ol>
      <li>Copy one of the existing theme folders to one with a new name. I recommend 
        starting with one of the standard themes. </li>
      <li>Edit config.php and insert your own colours. </li>
      <li>Edit styles.php and change your CSS styles. </li>
      <li>Edit header.html and footer.html to add new logos, or change the layout. 
      </li>
    </ol>
    <p>Note that all these steps are optional - you can make a radically different 
      look to your site simply by editing the colours in config.php</p>
    <p>Note also that Moodle upgrades <em>may</em> break themes slightly, so check 
      the release notes carefully if you are using a custom theme.</p>
    <p>In particular, Moodle 2.0 will have a completely new display system, probably 
      based on XSL transformations of XML output from Moodle. It is likely that 
      the themes for this will be a completely different format, but the advantage 
      will be a much higher possible degree of customisation (including moving 
      elements around the page).</p>
    <p>More discussion about this in the <a target="_top" href="http://moodle.org/mod/forum/view.php?id=46">Themes 
      forum on Using Moodle</a>. If you create a nice theme that you think others 
      might want to use, please post your zip file on the themes forum!<br />
    </p>
  </blockquote>
  <h3><a name="languages" id="languages"></a>Langues</h3>
  <blockquote>
    <p>Moodle has been designed for internationalisation. Each 'string' or 'page' 
      of text that is displayed as part of the interface is drawn from a set of 
      language files. Each language is a subdirectory of the directory 'lang'. 
      The structure of the lang directory is as follows:</p>
    <p><strong>lang/en</strong> - directory containing all files for one language 
      (eg English)</p>
    <ul>
      <li>moodle.php - strings for main interface</li>
      <li>assignment.php - strings for assignment module</li>
      <li>choice.php - strings for choice module</li>
      <li>forum.php - strings for forum module</li>
      <li>journal.php - strings for journal module </li>
      <li>quiz.php - strings for quiz module</li>
      <li>resource.php - strings for resource module</li>
      <li>survey.php - strings for survey module</li>
      <li>.... plus other modules if any.<br />
        <br />
        A string is called from these files using the <strong><em>get_string()</em></strong><em> 
        </em>or<em> <strong>print_string()</strong> </em>functions. Each string 
        supports variable substitution, to support variable ordering in different 
        languages.<em><br />
        <br />
        </em>eg $strdueby = get_string(&quot;assignmentdueby&quot;, &quot;assignment&quot;, 
        userdate($date)); <br />
        <br />
        If a string doesn't exist in a particular language, then the equivalent 
        in English will automatically be used instead.</li>
    </ul>
    <p><strong>lang/en/help</strong> - contains whole help pages (for popup context-sensitive 
      help)</p>
    <blockquote>
      <p>Main help pages are situated here, while help pages specific to each 
        module are located in subdirectories with the module's name.</p>
      <p>You can insert a helpbutton in a page with the helpbutton function.</p>
      <p>eg helpbutton(&quot;text&quot;, &quot;Click here for help about text&quot;);</p>
      <p>and for modules:</p>
      <p>helpbutton(&quot;forumtypes&quot;, &quot;Forum types&quot;, &quot;forum&quot;);</p>
    </blockquote>
    <p>Note that you can edit languages online, using the administration web tools 
      under &quot;Check this language&quot;. This makes it easy to not to only 
      create new languages but to refine existing ones. If you are starting a 
      new language, please contact me, <a target="_top" href="http://dougiamas.com/">Martin 
      Dougiamas</a>. </p>
    <p>You might also like to post in the <a target="_top" href="http://moodle.org/mod/forum/view.php?id=43">Languages 
      forum on Using Moodle</a>. </p>
    <p>If you are maintaining a language an ongoing basis, I can give you <a href="?file=cvs.html">CVS 
      write access to the Moodle source code</a> so that you can directly maintain 
      the files.</p>
  </blockquote>
  <h3><a name="database" id="database"></a>Sch&eacute;mas de bases de donn&eacute;es</h3>
  <blockquote>
    <p>Given a working database with defined tables, the intentionally simple 
      SQL used in Moodle should work fine with a wide variety of database brands.</p>
    <p>A problem exists with <strong>automatically creating</strong> new tables 
      in a database, which is what Moodle tries to do upon initial installation. 
      Because every database is very different, there doesn't yet exist any way 
      to do this in a platform-independent way. To support this automation in 
      each database, schemas can be created that list the required SQL to create 
      Moodle tables in a particular database. These are files in <strong>lib/db</strong> 
      and inside the <strong>db</strong> subdirectory of each module.</p>
    <p>Currently, only MySQL and PostgreSQL are fully supported in this way (no-one 
      wrote the schemas for other brands).</p>
    <p>Moodle 1.2 will use a new method of database-independent XML schemas that 
      will make all this unnecessary.</p>
  </blockquote>
  <p>&nbsp;</p>
  <h3><a name="courseformats" id="courseformats"></a>Formats de cours</h3>
  <blockquote>
    <p>Moodle currently supports three different course formats: weekly, topics 
      and social. </p>
    <p>These are a little more connected to the rest of the code (and hence, less 
      &quot;pluggable&quot;) but it is still quite easy to add new ones.</p>
    <p>If you have any ideas for different formats that you need or would like 
      to see, get in touch with me and I'll do my absolute best to have them available 
      in future releases.</p>
  </blockquote>
  <p>&nbsp;</p>
  <h3><a name="doc" id="doc"></a>Documentation et articles</h3>
  <blockquote>
    <p>If you feel like writing a tutorial, an article, an academic paper or anything 
      else about Moodle, please do! </p>
    <p>Put it on the web and make sure you include links to <a target="_top" href="http://moodle.org/">http://moodle.org/</a></p>
  </blockquote>
  <p>&nbsp;</p>
  <h3><a name="bugs" id="bugs"></a>Participer &agrave; la traque des bogues</h3>
  <blockquote>
    <p>Finally, I would like to invite you to register on the &quot;bug tracker&quot; 
      at <a target="_top" href="http://moodle.org/bugs/">http://moodle.org/bugs</a> 
      so you can file any bugs that you find and perhaps participate in discussing 
      and fixing them. </p>
    <p>&quot;Bugs&quot; not only includes software bugs with current versions 
      of Moodle, but also new ideas, feature requests and even constructive criticism 
      of existing features. The beauty of open source is that anyone can participate 
      in some way and help to create a better product for all of us to enjoy. 
      In this project, your input is very welcome!</p>
  </blockquote>
</blockquote>
<p>&nbsp;</p>
<blockquote> 
  <blockquote> 
    <blockquote> 
      <p align="center">Nous vous remercions d'utiliser Moodle&nbsp;!<br />
        <br />
        <a target="_top" href="http://dougiamas.com/">Martin Dougiamas</a>, d&eacute;veloppeur
        principal</p>
    </blockquote>
  </blockquote>
</blockquote>
<p>&nbsp;</p>
<blockquote> 
  <p>&nbsp;</p>
</blockquote>
<p align="CENTER"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>
</body>
</html>
