<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  
<title>Documentation Moodle&nbsp;: fonctionnalit&eacute;s</title>
  
<link rel="stylesheet" href="docstyles.css" type="text/css">
  
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#ffffff">

<h1>Fonctionnalit&eacute;s</h1>

<blockquote>

<p>Moodle est un produit en constante &eacute;volution. Cette page ne donne qu'un aper&ccedil;u des nombreuses fonctionnalit&eacute;s qu'il offre.</p>

<h3>Concept g&eacute;n&eacute;ral</h3>

<ul>

<li>Favorise une p&eacute;dagogie socio-constructiviste (collaboration, activit&eacute;s, r&eacute;flexion critique, etc.).</li>

<li>Adapt&eacute; &agrave; des classes 100% en ligne, mais aussi comme compl&eacute;ment &agrave; un enseignement habituel.</li>

<li>Interface simple, l&eacute;g&egrave;re, efficace, compatible, sans n&eacute;cessit&eacute; d'un navigateur r&eacute;cent.</li>

<li>Facile &agrave; installer sur presque toutes les plateformes o&ugrave; tourne PHP. Ne n&eacute;cessite qu'une base de donn&eacute;es (que Moodle peut partager).</li>

<li>Compl&egrave;te abstraction de la base de donn&eacute;es (&agrave; part la d&eacute;finition initiale des tables), qui permet l'utilisation des principales marques de base de donn&eacute;es.</li>

<li>La liste des cours mentionne une description de chaque cours sur le serveur, avec acc&egrave;s &agrave; des invit&eacute;s y compris.</li>

<li>Les cours peuvent &ecirc;tre class&eacute;s en disciplines et peuvent &ecirc;tre recherch&eacute;s&nbsp;: un site Moodle peut comprendre des milliers de cours.</li>

<li>Impl&eacute;mentation d'une haute s&eacute;curit&eacute;. Les formulaires sont tous v&eacute;rifi&eacute;s, les donn&eacute;es sont valid&eacute;es, les cookies sont chiffr&eacute;s, etc.</li>

<li>La plupart des champs de texte (ressources, messages des forums, contributions aux journaux, etc.) peuvent &ecirc;tre remplis et modifi&eacute;s &agrave; l'aide d'un &eacute;diteur de textes WYSIWYG int&eacute;gr&eacute;.</li>

</ul>

<h3>Gestion du site</h3>

<ul>

<li>Le site est g&eacute;r&eacute; par un administrateur, utilisateur sp&eacute;cial d&eacute;fini lors de l'installation.</li>

<li>Des &laquo; th&egrave;mes &raquo; (plug-in) permettent &agrave; l'administrateur de personnaliser les couleurs, polices, mises en page, etc. du site pour l'adapter &agrave; vos besoins sp&eacute;cifiques.</li>

<li>Des modules d'activit&eacute; (plug-in) peuvent &ecirc;tre ajout&eacute;s &agrave; des installations existantes de Moodle.</li>

<li>Des fichiers de langues (plug-in) permettent une traduction compl&egrave;te dans n'importe quelle langue. Il y a actuellement des traductions pour plus de <a href="http://moodle.org/download/lang/" target="_top">34 langues</a>.</li>

<li>Le code source est &eacute;crit de fa&ccedil;on claire en PHP sous la licence GPL. Il est facile &agrave; adapter pour vos besoins sp&eacute;cifiques.</li>

</ul>

<h3>Gestion des utilisateurs</h3>

<ul>

<li>L'objectif est de r&eacute;duire le travail de l'administrateur &agrave; un minimum, tout en conservant une haute s&eacute;curit&eacute;.</li>

<li>Plusieurs m&eacute;canismes d'authentification sont support&eacute;s, gr&acirc;ce &agrave; des modules (plug-in), permettant une int&eacute;gration facile &agrave; des syst&egrave;mes existants.</li>

<li>M&eacute;thode standard par courriel : les &eacute;tudiants peuvent cr&eacute;er eux-m&ecirc;mes leurs comptes. Les adresses de courriel sont v&eacute;rifi&eacute;es par confirmation.</li>

<li>LDAP : les connexions sont permises apr&egrave;s v&eacute;rification aupr&egrave;s d'un serveur LDAP. L'administrateur peut sp&eacute;cifier quels champs utiliser.</li>

<li>IMAP, POP3, NNTP : les connexions sont permises apr&egrave;s v&eacute;rification aupr&egrave;s d'un serveur de mail ou de newsgroups. Le protocole SSL, les certificats et TLS sont support&eacute;s.</li>

<li>Base de donn&eacute;es externe : toute base de donn&eacute;es comprenant au moins deux champs peut &ecirc;tre utilis&eacute;e comme source d'authentification externe.</li>

<li>Une personne n'a besoin que d'un seul compte pour tout le serveur. Chaque compte peut avoir diff&eacute;rents r&ocirc;les.</li>

<li>Les administrateurs contr&ocirc;lent la cr&eacute;ation des cours et peuvent d&eacute;signer des enseignants en les assignant des cours.</li>

<li>Les responsables de cours ont le droit de cr&eacute;er des cours et d'y enseigner.</li>

<li>Il est possible de retirer les privil&egrave;ges de modification &agrave; certains enseignants, afin qu'ils ne puissent pas modifier le cours (par exemple pour des tuteurs).</li>

<li>S&eacute;curit&eacute; : les enseignants peuvent utiliser une &laquo;&nbsp;clef d'acc&egrave;s&nbsp;&raquo; pour &eacute;viter l'intrusion de personnes externes &agrave; leurs cours. Cette clef peut &ecirc;tre communiqu&eacute;e aux &eacute;tudiants de vive voix, par courriel, etc.</li>

<li>Les enseignants peuvent d&eacute;signer manuellement leurs &eacute;tudiants au besoin.</li>

<li>Les enseignants peuvent d&eacute;sinscrire manuellement des &eacute;tudiants de leur cours. Sans cela, les &eacute;tudiants sont automatiquement d&eacute;sinscrits du cours apr&egrave;s une certaine p&eacute;riode d'inactivit&eacute; (fix&eacute;e par l'administrateur).</li>

<li>Les &eacute;tudiants sont encourag&eacute;s &agrave; mettre en ligne un profil incluant une photo et une description. Les adresses de courriel peuvent &ecirc;tre prot&eacute;g&eacute;es (pas d'affichage) au besoin.</li>

<li>Chaque utilisateur peut indiquer son propre fuseau horaire, et toutes les dates de Moodle seront affich&eacute;es dans ce fuseau (dates des messages, d&eacute;lais des devoirs, etc.).</li>

<li>Chaque utilisateur peut choisir la langue de l'interface de Moodle (fran&ccedil;ais, anglais, allemand, italien, espagnol, etc.)</li>

</ul>

<h3>Gestion des cours</h3>

<ul>

<li>Un enseignant a le contr&ocirc;le total de tous les r&eacute;glages de son cours. Il peut m&ecirc;me en interdire l'acc&egrave;s aux autres enseignants.</li>

<li>Choix de diff&eacute;rents formats de cours&nbsp;: hebdomadaire, th&eacute;matique et informel, centr&eacute; sur la discussion.</li>

<li>Choix de plusieurs activit&eacute;s de cours&nbsp;: forums, journaux, tests, ressources, sondages, devoirs, chats, ateliers.</li>

<li>Les changements r&eacute;cents effectu&eacute;s dans un cours depuis la derni&egrave;re connexion peuvent &ecirc;tre affich&eacute;s sur la page d'accueil du cours, pour offrir un meilleur sentiment de communaut&eacute;.</li>

<li>La plupart des champs de texte (ressources, messages des forums, contributions aux journaux, etc.) peuvent &ecirc;tre remplis et modifi&eacute;s &agrave; l'aide d'un &eacute;diteur de textes WYSIWYG int&eacute;gr&eacute;.</li>

<li>Toutes les notes donn&eacute;es dans les forums, journaux, tests et devoirs peuvent &ecirc;tre affich&eacute;es sur une page (et t&eacute;l&eacute;charg&eacute;es comme fichier tableur).</li>

<li>Enregistrement et suivi complet des activit&eacute;s des utilisateurs. Des rapports d'activit&eacute; sont disponibles avec des graphiques et des d&eacute;tails pour chaque module (dernier acc&egrave;s, nombre de consultations, etc.), ainsi qu'un historique d&eacute;taill&eacute; de chaque action des &eacute;tudiants, y compris les messages des forums, les contributions aux journaux, etc.</li>

<li>Int&eacute;gration du courriel&nbsp;: des copies des messages des forums, feedbacks des enseignants, etc. peuvent &ecirc;tre envoy&eacute;s aux &eacute;tudiants en format HTML ou texte.</li>

<li>Bar&egrave;mes personnalis&eacute;s&nbsp;: les enseignants peuvent d&eacute;finir leurs propres bar&ecirc;mes pour les notes donn&eacute;es dans les forums, les devoirs et les journaux.</li>

<li>Les cours peuvent &ecirc;tre compress&eacute;s dans un fichier zip &agrave; l'aide de la fonction de backup. Ils peuvent ensuite &ecirc;tre r&eacute;utilis&eacute;s sur n'importe quel serveur Moodle.</li>

</ul>

<h3>Module Devoir</h3>

<ul>

<li>Les devoirs peuvent indiquer un d&eacute;lai de remise et une note maximale.</li>

<li>Les &eacute;tudiants peuvent d&eacute;poser leurs devoirs (tous formats de fichiers) sur le serveur. La date du d&eacute;p&ocirc;t est enregistr&eacute;e.</li>

<li>La remise en retard des devoirs est autoris&eacute;e, mais la dur&eacute;e du retard est clairement indiqu&eacute;e &agrave; l'enseignant.</li>

<li>Pour chaque devoir, toute la classe peut &ecirc;tre &eacute;valu&eacute;e (note ou commentaire) sur une seule page, avec un formulaire.</li>

<li>Le feedback de l'enseignant est affich&eacute; sur la page du devoir de chaque &eacute;tudiant, et une notification lui est envoy&eacute;e par courriel.</li>

<li>L'enseignant peut permettre de d&eacute;poser &agrave; nouveau un devoir apr&egrave;s &eacute;valuation, en vue de renoter le travail.</li>

</ul>

<h3>Module Chat</h3>

<ul>

<li>Permet une interaction synchrone souple par &eacute;crit.</li>

<li>Affiche l'image des profils dans la fen&ecirc;tre de chat.</li>

<li>Supporte l'int&eacute;gration d'URLs, de binettes, de HTML, d'images, etc.</li>

<li>Toutes les sessions sont enregistr&eacute;es et peuvent &ecirc;tre repass&eacute;es plus tard. Les enregistrements peuvent &ecirc;tre mis &agrave; disposition des &eacute;tudiants.</li>

</ul>

<h3>Module Sondage</h3>

<ul>

<li>Peut &ecirc;tre utilis&eacute; pour un vote sur un sujet ou pour obtenir un feedback de la part de tous les &eacute;tudiants.</li>

<li>L'enseignant voit un tableau explicite de qui a choisi quoi.</li>

<li>Les &eacute;tudiants peuvent &ecirc;tre autoris&eacute;s &agrave; voir un graphique des r&eacute;sultats.</li>

</ul>

<h3>Module Forum</h3>

<ul>

<li>Diff&eacute;rents types de forums sont disponibles, par exemple seulement pour enseignants, nouvelles du cours, ouvert &agrave; tous et une discussion par utilisateur.</li>

<li>Tous les messages comprennent l'image du profil de leur auteur.</li>

<li>Les discussions peuvent &ecirc;tre affich&eacute;es embo&icirc;t&eacute;es, &agrave; plat ou en fils de discussion, les messages les plus anciens ou les plus r&eacute;cents en premier.</li>

<li>Chaque participant peut s'abonner &agrave; chaque forum pour en recevoir les copies des messages par courriel. L'enseignant peut forcer cette option pour tous les participants.</li>

<li>L'enseignant peut permettre les r&eacute;ponses ou non (par exemple pour les forums d'annonces).</li>

<li>Les discussions peuvent &ecirc;tre d&eacute;plac&eacute;es facilement d'un forum &agrave; un autre par l'enseignant.</li>

<li>Les images annex&eacute;es sont affich&eacute;es en ligne.</li>

<li>Si l'&eacute;valuation est utilis&eacute;e dans les forums, on peut restreindre les &eacute;valuations aux messages post&eacute;s dans un intervalle de temps sp&eacute;cifi&eacute;.</li>

</ul>

<h3>Module Journal</h3>

<ul>

<li>Les journaux sont priv&eacute;s. Ils ne sont accessibles que pour l'&eacute;tudiant et l'enseignant.</li>

<li>Chaque contribution &agrave; un journal peut &ecirc;tre orient&eacute;e par un question ouverte.</li>

<li>Pour chaque contribution &agrave; un journal, toute la classe peut &ecirc;tre &eacute;valu&eacute;e sur une seule page, avec un formulaire.</li>

<li>Le feedback de l'enseignant est affich&eacute; sur la page de la contribution de chaque &eacute;tudiant, et une notification lui est envoy&eacute;e par courriel.</li>

</ul>

<h3>Module Test</h3>

<ul>

<li>Les enseignants peuvent d&eacute;finir une base de donn&eacute;es de questions pouvant &ecirc;tre r&eacute;utilis&eacute;es dans d'autres tests.</li>

<li>Les questions peuvent &ecirc;tre organis&eacute;es en cat&eacute;gories, afin de faciliter leur r&eacute;utilisation. Les cat&eacute;gories peuvent &ecirc;tre &laquo;&nbsp;publi&eacute;es&nbsp;&raquo; pour les rendre accessibles depuis tous les cours du site.</li>

<li>Les tests sont automatiquement &eacute;valu&eacute;s, et peuvent &ecirc;tre renot&eacute;s si des questions sont modifi&eacute;es.</li>

<li>Les tests peuvent &ecirc;tre accessibles uniquement durant un laps de temps d&eacute;fini.</li>

<li>Suivant le choix de l'enseignant, les tests peuvent offrir un feedback et/ou les bonnes r&eacute;ponses.</li>

<li>Les questions et r&eacute;ponses des tests peuvent &ecirc;tre m&eacute;lang&eacute;es (al&eacute;atoirement) pour diminuer la fraude.</li>

<li>Les questions peuvent contenir du code HTML et des images.</li>

<li>Les questions peuvent &ecirc;tre import&eacute;es &agrave; partir de fichiers textes.</li>

<li>Suivant le choix de l'enseignant, les tests peuvent &ecirc;tre tent&eacute;s plusieurs fois.</li>

<li>Suivant le choix de l'enseignant, les tentatives peuvent &ecirc;tre cumulatives, ou le test peut &ecirc;tre effectu&eacute; en plusieurs sessions.</li>

<li>Les questions &agrave; choix multiples permettent les r&eacute;ponses uniques ou multiples.</li>

<li>Questions &agrave; r&eacute;ponses courtes (mots ou phrases).</li>

<li>Questions Vrai-Faux.</li>

<li>Questions d'appariement.</li>

<li>Questions al&eacute;atoires.</li>

<li>Questions num&eacute;riques (avec intervalles de tol&eacute;rance).</li>

<li>Questions en format Cloze avec les r&eacute;ponses int&eacute;gr&eacute;es dans le texte.</li>

<li>Textes et graphiques de description int&eacute;gr&eacute;s.</li>

</ul>

<h3>Module Ressource</h3>

<ul>

<li>Permet l'affichage de tout contenu &eacute;lectronique, par exemple des documents PDF, Word, Powerpoint, animations Flash, s&eacute;quences vid&eacute;o, sons, etc.</li>

<li>Les fichiers peuvent &ecirc;tre d&eacute;pos&eacute;s et g&eacute;r&eacute;s sur le serveur, ou alors cr&eacute;&eacute;s &agrave; la vol&eacute;e &agrave; l'aide de formulaires web (texte ou HTML).</li>

<li>Les contenus existant sur le web peuvent &ecirc;tre li&eacute;s ou inclus de mani&egrave;re transparente dans l'interface du cours.</li>

<li>Les applications web externes peuvent &ecirc;tre li&eacute;es en leur passant des donn&eacute;es.</li>

</ul>

<h3>Module Consultation</h3>

<ul>

<li>Consultations pr&eacute;d&eacute;finies (COLLES, ATTLS) ayant fait leurs preuves comme instruments d'analyse de classes en ligne.</li>

<li>Les rapports des consultations sont toujours disponibles, et comprennent de nombreux graphiques. Les r&eacute;sultats sont t&eacute;l&eacute;chargeables en format Excel ou CSV (s&eacute;parateur virgule).</li>

<li>L'interface permet d'&eacute;viter la remise de consultations partiellement remplies.</li>

<li>Un feedback est fourni &agrave; l'&eacute;tudiant, en comparaison avec les moyennes de la classe.</li>

</ul>

<h3>Module Workshop</h3>

<ul>

<li>Permet l'&eacute;valuation de documents par les pairs. L'enseignant peut g&eacute;rer et noter l'&eacute;valuation.</li>

<li>Offre un grand nombre de bar&ecirc;mes possibles.</li>

<li>L'enseignant peut mettre &agrave; disposition des &eacute;tudiants des documents leur permettant de s'entra&icirc;ner &agrave; l'&eacute;valuation.</li>

<li>Module tr&egrave;s souple, comprenant de nombreuses options.</li>

</ul>

<p>&nbsp;</p>

</blockquote>

<p align="center"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>

<p align="center"><font size="1">Version: $Id$</font></p>

</body>
</html>
