<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
        "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<head>

<title>Documentation Moodle : Futur de Moodle</title>

<link rel="stylesheet" href="docstyles.css" type="text/css" />

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />

</head>

<body bgcolor="#ffffff">

<h1>Futur de Moodle</h1>

<blockquote>

<p>&Agrave; mesure que Moodle gagne en maturit&eacute;, son avenir est de plus en plus influenc&eacute; par la communaut&eacute; des d&eacute;veloppeurs et des utilisateurs. Une base de donn&eacute;es dynamique des nouvelles fonctionnalit&eacute;s propos&eacute;es et de leur statut peut &ecirc;tre consult&eacute;e sur <a target="_top" href="http://moodle.org/bugs/">moodle.org/bugs</a>. Vos <a href="?file=credits.html">contributions</a>, sous la forme d'id&eacute;es, de code, de commentaires ou de promotion sont toutes les bienvenues. Pour plus de d&eacute;tails, consultez le <a href="?file=developer.html">Manuel du d&eacute;veloppeur</a> ainsi que les <a href="http://moodle.org/help" target="_top">forums</a>. Vous pouvez aussi payer le d&eacute;veloppement d'une focntionnalit&eacute; dont vous avez besoin et dont vous aimeriez disposer rapidement. Voyez <a href="http://moodle.com/development/" target="_top">moodle.com/development</a> pour plus d'informations.</p>

<p>Voici la planification actuelle du futur de Moodle. Cette planification est cependant sujette à modifications, puisque le d&eacute;veloppement d&eacute;pend des <a href="http://moodle.org/donations/" target="_blank">sponsors</a> et des <a href="/?file=credits.html">d&eacute;veloppeurs</a>.</p>

<h3>Version 1.5 - février 2005</h3>

<blockquote>

<p>L'objectif de la version 1.5 est de rendre Moodle conforme à plusieurs impotantes normes en matière d'accessibilité des sites web, notamment WAI (W3C), SENDA (Royaume-Uni) et Section 508 (USA).</p>

<p>Le code d\'affichage sera conforme à la norme XHTML Transitional 1.0, et les CSS auront également été nettoyées et étendues, afin de permettre aux graphistes web un meilleur contrôle sur l\'aspect de leurs sites. Cette version n\'utilisera pas encore de modèles.</p>

<p>Il y aura aussi de nombreuses nouvelles fonctionnalités, par exemple&nbsp;:</p>

<ul>

<li>Une messagerie instantanée intégrée pour la communication directe&nbsp;;</li>

<li>De grandes améliorations du module Test, comprenant&nbsp;: des tests paginés avec un certain nombre de questions par page, une meilleure interface pour la production de tests et des catégories de questions en hiérarchie&nbsp;;</li>

<li>Un nouveau format de bloc, permettant d'avoir plusieurs copies de chaque bloc et une meilleure configuration (les anciens blocs provenant de tierces personnes doivent être mis à jour. Voir la documentation dans le dossier «&nbsp;blocks&nbsp;»)&nbsp;;</li>

<li>Intégration à LDAP étendue, de sorte que LDAP peut maintenant contrôler la création des cours, les participations aux groupes, la synchronisation des utilisateurs, etc.</li>

<li>Certains champs de l'utilisateur peuvent être verrouillés par l'administrateur&nbsp;;</li>

<li>Am&eacute;lioration du dépôt des fichiers, avec support de la vérification automatique anti-virus des nouveaux documents à l'aide de ClamAV&nbsp;;</li>

<li>Simplification de l'interface des modules Atelier et Leçon&nbsp;;</li>

<li>Nouveau filtre Tidy permettant de convertir tous les textes saisis par les utilisateurs en format XHTML&nbsp;</li>

<li>Module d'authentification PAM&nbsp;;</li>

<li>Les sessions peuvent maintenant être enregistrées dans la base de données (utile pour les clusters Moodle)&nbsp;;</li>

<li>Demande d'accord des directives du site pour les utilisateurs&nbsp;;</li>

<li>Bien d'autres améliorations et corrections de bogues.</li>

</ul>

</blockquote>

<h3>Version 1.6 - milieu 2005</h3>

<!-- ICI -->

<blockquote>

<p>Cette version se concentrera principalement sur la couche d'affichage, notamment en rendant Moodle totalement conforme avec les standards d'accessibilit&eacute; WAI (W3C), SENDA (Royaume-Uni) et Section 508 (&Eacute;tats-Unis).</p>

<ul>

<li>R&eacute;-&eacute;criture compl&egrave;te de la couche d'affichage s&eacute;parant la pr&eacute;sentation et la logique de l'application.</li>

<li>Syst&egrave;me de mod&egrave;les conformes au standard XHTML 1.0 pour une meilleure accessibilit&eacute;.</li>

<li>Puissant syst&egrave;me de feuilles de styles cascad&eacute;es (CSS) pour une meilleure compatibilit&eacute; entre plateformes.</li>

</ul>

<p>Comme pour la plupart des versions de Moodle, il y aura aussi bon nombre de nouvelles fonctionnalit&eacute;s et de modules d&eacute;velopp&eacute;s par la communaut&eacute; des d&eacute;veloppeurs.</p>

</blockquote>

<h3>Version 2.0 - plus tard en 2005</h3>

<blockquote>

<p>Cette version majeure comprendra des d&eacute;veloppements all&eacute;chant pour rendre Moodle meilleur en r&eacute;seau, avec une &eacute;volution naturelle vers la collaboration. Plus d'informations seront disponibles ult&eacute;rieurement.</p>

</blockquote>

</blockquote>

<p align="center"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>

<p align="center"><font size="1">Version: $Id$</font></p>

</body>