<head>

<title>Documentation Moodle : Futur de Moodle</title>

<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS">

<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"> </head>

<body bgcolor="#ffffff">

<h1>Futur de Moodle</h1> <blockquote>

<p>&Agrave; mesure que Moodle gagne en maturit&eacute;, son avenir est de plus en plus influenc&eacute; par la communaut&eacute; des d&eacute;veloppeurs et des utilisateurs. Une base de donn&eacute;es dynamique des nouvelles fonctionnalit&eacute;s propos&eacute;es et de leur statut peut &ecirc;tre consult&eacute;e sur <a target="_top" href="http://moodle.org/bugs/">moodle.org/bugs</a>. Vos <a href="?file=credits.html">contributions</a>, sous la forme d'id&eacute;es, de code, de commentaires ou de promotion sont toutes les bienvenues. Pour plus de d&eacute;tails, consultez le <a href="?file=developer.html">Manuel du d&eacute;veloppeur</a>. Vous pouvez aussi payer le d&eacute;veloppement d'une focntionnalit&eacute; dont vous avez besoin et dont vous aimeriez disposer rapidement. Voyez <a href="http://moodle.com/development/" target="_top">moodle.com/development</a> pour plus d'informations.</p>

<p>Voici notre vision actuelle du futur de Moodle, m&ecirc;me si des changements peuvent survenir, puisque le d&eacute;veloppement d&eacute;pend des sponsors et des d&eacute;veloppeurs.</p>

<h3>Version 1.4 - 31 ao&ucirc;t 2004</h3>

<blockquote>

<p>Cette version contient de nombreuses am&eacute;liorations structurelles et de modifications dans des modules clef de Moodle. Quelques extraits pour vous all&eacute;cher&nbsp;:</p>

<ul>

<li>Nouvelle architecture des <strong>inscriptions</strong> permettant toutes sortes de processus d'inscriptions automatiques. Un syst&egrave;me Paypal est inclus (pour les cours payant) avec acc&egrave;s instantan&eacute;, de m&ecirc;me que l'utilisation  d'une bases de donn&eacute;es externes quelconques, traitement de fichiers export&eacute;s de syst&egrave;mes plus anciens, etc.</li>

<li>Am&eacute;lioration du traitement des <strong>ressources</strong> avec un nouveau processus en une &eacute;tape et un meilleur contr&ocirc;le du format d'affichage. De nouveaux types de ressources peuvent &ecirc;tre d&eacute;velopp&eacute;s comme des extensions (plug-ins).</li>

<li>R&eacute;organisation du module <strong>quiz</strong>, permettant de nouveaux types de question comme des extensions (plug-ins). Un nouveau type de question d&eacute;nomm&eacute; &laquo;&nbsp;Question calcul&eacute;e&nbsp;&raquo; permet de pr&eacute;senter &agrave; chaque &eacute;tudiant des questions uniques.</li>

<li>Le module <strong>chat</strong> permet maintenant l'utilisation facultative d'un d&eacute;mon, fournissant une r&eacute;ponse quasi instantan&eacute;e &agrave; des centaines d'utilisateurs.</li>

<li>Module <strong>glossaire</strong> am&eacute;lior&eacute; pour permettre le d&eacute;veloppement de nouveaux formats de glossaires.</li>

<li>Am&eacute;lioration des sauvegardes permettant le d&eacute;placement de contenus (par exemple des liens) meilleure que jamais.</li>

<li>Module SCORM am&eacute;lior&eacute; pour supporter encore plus de contenus SCORM.</li>

<li>Interfaces am&eacute;lior&eacute;es pour l'ajout d'&eacute;tudiants, de responsables de cours et d'administrateurs.</li>

</ul>

</blockquote>

<h3>Version 1.5 - plus tard en 2004</h3>

<blockquote>

<p>Cette version se concentrera principalement sur la couche d'affichage, notamment en rendant Moodle totalement conforme avec les standards d'accessibilit&eacute; WAI (W3C), SENDA (Royaume-Uni) et Section 508 (&Eacute;tats-Unis).</p>

<ul>

<li>R&eacute;-&eacute;criture compl&egrave;te de la couche d'affichage s&eacute;parant la pr&eacute;sentation et la logique de l'application.</li>

<li>Syst&egrave;me de mod&egrave;les conformes au standard XHTML 1.0 pour une meilleure accessibilit&eacute;.</li>

<li>Puissant syst&egrave;me de feuilles de styles cascad&eacute;es (CSS) pour une meilleure compatibilit&eacute; entre plateformes.</li>

</ul>

<p>Comme la plupart des versions de Moodle, il y aura aussi bon nombre de nouvelles fonctionnalit&eacute;s et de modules d&eacute;velopp&eacute;s par la communaut&eacute; des d&eacute;veloppeurs.</p>

</blockquote>

<h3>Version 2.0</h3>

<blockquote>

<p>Cette version majeure comprendra des d&eacute;veloppements all&eacute;chant pour rendre Moodle meilleur en r&eacute;seau, avec une &eacute;volution naturelle vers la collaboration. Plus d'informations seront disponibles ult&eacute;rieurement.</p>

</blockquote>

<p align="center"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>

<p align="center"><font size="1">Version: $Id$</font></p>

</body>