<head>
    
<title>Documentation Moodle : Futur</title>
	
<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS">
    
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#ffffff">

<h1>Futur de Moodle</h1>
<blockquote>
  <p>&Agrave; mesure que Moodle gagne en maturit&eacute;, son avenir est de plus
  en plus influenc&eacute; par la communaut&eacute; des d&eacute;veloppeurs et des
  utilisateurs. Une base de donn&eacute;es dynamique des nouvelles
  fonctionnalit&eacute;s propos&eacute;es et de leur statut peut &ecirc;tre consult&eacute;e
  sur <a target="_top" href="http://moodle.org/bugs/">moodle.org/bugs</a>.
  Vos <a href="?file=credits.html">contributions</a>, sous la forme
  d'id&eacute;es, de code, de commentaires ou de promotion sont toutes
  les bienvenues. Pour plus de d&eacute;tails, consultez le
  <a href="?file=developer.html">Manuel du d&eacute;veloppeur</a>.</p>
  <p>Voici notre vision actuelle du futur de Moodle, m&ecirc;me si les
  changements d&eacute;pendent toujours de ce sur quoi veulent
  travailler les d&eacute;veloppeurs.</p>
  <h3>Version 1.2 - f&eacute;vrier 2004
</h3>
  <blockquote>
    <p>Les buts pricipaux de cette version comprennent&nbsp;:
    </p>
    <ul>
      <li>Support des groupes/cohortes &agrave; l'int&eacute;rieur des cours</li>
      <li>Nouveau module&nbsp;: Glossaire</li>
      <li>Filtres textes, gr&acirc;ce auxquels tout le texte peut &ecirc;tre
      analys&eacute; &agrave; l'aide d'extensions</li>
      <li>Nouvel &eacute;diteur WYSIWYG disponible partout dans Moodle</li>
  	  <li>Interfaces am&eacute;lior&eacute;es &agrave; de nombreux endroits</li>
    </ul>
  </blockquote>
  <p>&nbsp;</p>
  <h3>Version 2.0  - D&eacute;but 2004</h3>
  <blockquote>
    <p>Cette version majeure comprendra quelques changement essentiels
    dans la structure interne, pour gagner en flexibilit&eacute; et en
    possibilit&eacute; de grandir dans de nombreux endroits. Parmi les
    objectifs importants, on a&nbsp;:</p>
    <ul>
      <li>R&eacute;-&eacute;criture compl&egrave;te de la couche d'affichage &agrave; l'aide de
      code compatible XHTML, et impl&eacute;mentation compl&egrave;te de mod&egrave;les, pour
      une meilleure confirmit&eacute; avec les standards, plus de flexibilit&eacute;
      et d'accessibilit&eacute;</li>
      <li>Utilisation plus large des classes PHP dans les domaines clefs du
      code de Moodle, afin de rendre le travail des d&eacute;veloppeurs plus
      facile lors de l'&eacute;criture de nouveaux modules ou de l'int&eacute;gration
      dans des syst&egrave;mes externes</li>
      <li>Nouvelle architecture pour l'inscription, &agrave; l'aide d'extensions
      (semblable &agrave; l'architecture actuelle du syst&egrave;me d'authentification)
      afin que des syst&egrave;mes externes (p. ex. base de donn&eacute;es d'&eacute;tudiants,
      Paypal, LDAP, etc.) puissent contr&ocirc;ler l'acc&egrave;s aux cours des
      &eacute;tudiants et des enseignants</li>
    </ul>
  </blockquote>
  <h3>Version 2.1  - Milieu 2004</h3>
  <blockquote>
    <p>Cette version commencera &agrave; profiter des avantages de la
    nouvelle architecture et ajoutera de nouvelles fonctionnalit&eacute;s,
    comme&nbsp;:</p>
    <ul>
      <li>Nouveau syst&egrave;me de contr&ocirc;le d'acc&egrave;s permettant une d&eacute;finition
      fine des r&ocirc;les et des autorisations</li>
      <li>Assistance p&eacute;dagogique plus importante pour les enseignants et
      les &eacute;tudiants</li>
      <li>Support basique d'objets d'enseignement standard (SCORM)</li>
      <li>Meilleure int&eacute;gration de Moodle et de moodle.org (pour permettre
      aux enseignants de partager et de collaborer)</li>
    </ul>
  </blockquote>
  <p align="center">&nbsp;</p>
</blockquote>
<p align="center">&nbsp;</p>
<p align="center"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>
<p align="center"><font size="1">Version: $Id$</font></p>
</body>
