<head>
    
<title>Documentation Moodle : Installation</title>
	
<link rel="stylesheet" href="docstyles.css" type="text/css">
    
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#ffffff">
<h1>Installation de Moodle</h1>
<blockquote>
  <p>Ce document explique une premi&egrave;re installation de Moodle. Certaines &eacute;tapes sont
  d&eacute;crites en d&eacute;tails, afin de couvrir la grande vari&eacute;t&eacute; des petites particularit&eacute;s des
  diff&eacute;rents serveurs web. C'est pourquoi ce document vous semblera peut-&ecirc;tre long et compliqu&eacute;.
  Ne vous laissez pas d&eacute;courager pour autant - la mise en place de Moodle est d'habitude
  une affaire de minutes !</p>
  <p>Prenez le temps d'&eacute;tudier attentivement ces instructions - cela vous fera gagner du temps
  t&ocirc;t ou tard.</p>
  <p>Voici les diff&eacute;rentes sections de ce document :</p>
  <ol>
    <li><a href="#requirements">Logiciels et r&eacute;glages n&eacute;cessaires</a></li>
    <li><a href="#downloading">T&eacute;l&eacute;chargement</a></li>
    <li><a href="#site">Structure du site</a></li>
    <li><a href="#data">Cr&eacute;er un dossier de donn&eacute;es</a></li>
    <li><a href="#database">Cr&eacute;er une base de donn&eacute;es</a></li>
    <li><a href="#webserver">V&eacute;rifier les r&eacute;glages de votre serveur web</a></li>
    <li><a href="#config">Modifier config.php</a></li>
    <li><a href="#admin">Visiter la page d'administration</a></li>
    <li><a href="#cron">Mettre en place un cron</a></li>
    <li><a href="#course">Cr&eacute;er un nouveau cours</a></li>
  </ol>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="requirements"></a>1. Logiciels et r&eacute;glages n&eacute;cessaires</h3>
<blockquote> 
  <p>Moodle est principalement d&eacute;velopp&eacute; sur Linux avec Apache, MySQL et PHP (environnement
  appel&eacute; parfois plateforme LAMP), mais est aussi test&eacute; r&eacute;guli&egrave;rement avec PostgreSQL 
  et sur les syst&egrave;mes d'exploitation Windows XP, Mac OS X et Netware 6.</p>
  <p>Les logiciels et r&eacute;glages n&eacute;cessaires pour Moodle sont les suivants :</p>
  <ol>
    <li>Logiciel serveur web. La plupart des gens utilisent <a href="http://www.apache.org/"
    target="_blank">Apache</a>, mais Moodle devrait fonctionner tout aussi bien avec n'importe
    quel serveur web compatible avec PHP, comme IIS sur les plateformes Windows.</li>
    <li>Le langage <a href="http://www.php.net/" target="_blank">PHP</a> (version 4.1.0 
     ou ult&eacute;rieure), avec les r&eacute;glages suivants : 
      <ul>
        <li>la librairie <a href="http://www.boutell.com/gd/" target="_blank">GD</a>,
        install&eacute;e et active (ON), supportant les formats JPG et PNG ;</li>
        <li>la librairie zlib install&eacute;e et active (ON), si vous voulez faire des backups
        et les restaurer sous Windows ;</li>
        <li>support pour les sessions actif (ON) ;</li>
        <li>le d&eacute;p&ocirc;t (upload) de fichiers actif (ON) ;</li>
        <li>le mode &laquo;&nbsp;Safe Mode&nbsp;&raquo; doit &ecirc;tre inactif (OFF) (voir les forums sur moodle.org pour
        les probl&egrave;mes caus&eacute;s par le mode &laquo;&nbsp;Safe Mode&nbsp;&raquo;.</li>
      </ul>
    </li>
    <li>Un serveur de base de donn&eacute;es : <a href="http://www.mysql.com/" target="_blank">MySQL</a> 
    ou <a href="http://www.postgresql.org/" target="_blank">PostgreSQL</a> sont compl&egrave;tement 
    support&eacute;s et recommand&eacute;s pour &ecirc;tre utilis&eacute;s avec Moodle 1.1. D'autres bases de donn&eacute;es
    seront pleinement support&eacute;es dans la prochaine version.</li>
  </ol>
  <p>La plupart des h&ocirc;tes web proposent tout cela par d&eacute;faut. Si vous vous &ecirc;tes engag&eacute;
  aupr&egrave;s d'un h&ocirc;te web qui n'offre pas ces logiciels, demandez-lui pourquoi, et
  envisagez de changer d'h&eacute;bergement.</p>
  <p>Si vous voulez faire fonctionner Moodle sur votre propre ordinateur et que cela vous 
  fait un peu peur, lisez notre guide <a href="http://moodle.org/doc/?file=installamp.html">
  Installation d'Apache, MySQL et PHP</a>. Ce document offre quelques pas-&agrave;-pas pour
  l'installation de ces logiciels sur la plupart des plateformes.</p>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="downloading"></a>2. T&eacute;l&eacute;chargement</h3>
<blockquote>
  <p>Il y a deux fa&ccedil;ons d'obtenir Moodle : par t&eacute;l&eacute;chargement d'un fichier compress&eacute; ou
  &agrave; l'aide du CVS. Toutes deux sont expliqu&eacute;es en d&eacute;tail sur la page de t&eacute;l&eacute;chargement
  <a href="http://moodle.org/download/" target="_blank">http://moodle.org/download/</a>.</p>
  <p>Apr&egrave;s avoir t&eacute;l&eacute;charg&eacute; et d&eacute;compress&eacute; l'archive ou obtenu les fichiers par CVS,
  vous aurez sous les yeux un dossier nomm&eacute; &laquo;&nbsp;moodle&nbsp;&raquo;, contenant un certain nombre de dossiers
  et de fichiers.</p>
  <p>Vous pouvez placer ce dossier int&eacute;gralement dans le dossier documents de votre serveur
  web. Dans ce cas, le site Moodle sera accessible  &agrave; l'adresse <b>http://votreserveur.com/moodle/</b>.
  Vous pouvez aussi copier le contenu de ce dossier dans le dossier documents de votre serveur.
  Dans ce cas, le site Moodle sera accessible simplement &agrave; l'adresse <b>http://votreserveur.com/</b>.</p>
</blockquote>
<p>&nbsp;</p>
<h3 class="sectionheading"><a name="site"></a>3. Structure du site</h3>
<blockquote>
  <p>Voici une bref aper&ccedil;u du contenu du dossier Moodle, afin de vous permettre de ne pas
  vous perdre :</p>
  <blockquote>
    <p>config.php - l'UNIQUE fichier &agrave; modifier pour faire fonctionner votre site<br />
      version.php - indique la version actuelle du programme Moodle<br />
      index.php - la page d'accueil du site</p>
    <ul>
      <li>admin/ - programmes pour l'administration du serveur </li>
      <li>auth/ - modules pour l'authentification des utilisateurs </li>
      <li>course/ - programmes pour l'affichage et la gestion des cours </li>
      <li>doc/ - documentation et fichiers d'aide de Moodle (p. ex. cette page) </li>
      <li>files/ - programmes pour l'affichage et la gestion des fichiers d&eacute;pos&eacute;s </li>
      <li>lang/ - textes dans les diff&eacute;rentes langues, un dossier par langue </li>
      <li>lib/ - librairies pour le coeur du programme Moodle </li>
      <li>login/ - programmes de gestion du login et la cr&eacute;ation des comptes </li>
      <li>mod/ - tous les modules de cours Moodle </li>
      <li>pix/ - les images et graphiques g&eacute;n&eacute;riques du site </li>
      <li>theme/ - diff&eacute;rents th&egrave;mes pour changer l'aspect de votre site </li>
      <li>user/ - programmes pour afficher et g&eacute;rer les utilisateurs </li>
    </ul>
    <p>&nbsp;</p>
  </blockquote>
</blockquote>
<h3 class="sectionheading"><a name="data"></a>4. Cr&eacute;er un dossier de donn&eacute;es</h3>
<blockquote>
  <p>Moodle aura &eacute;galement besoin d'espace sur votre disque dur pour conserver les
  fichiers d&eacute;pos&eacute;s par les utilisateurs, comme les documents de cours ou les photos
  des utilisateurs.</p>
  <p>Cr&eacute;ez quelque part &agrave; cet effet un dossier. Par s&eacute;curit&eacute;, ce dossier NE DOIT PAS
  &ecirc;tre accessible directement depuis le web. La mani&egrave;re la plus simple d'obtenir cela est
  de le cr&eacute;er EN DEHORS du dossier web. Sinon, vous pouvez prot&eacute;ger ce dossier en y
  pla&ccedil;ant un fichier nomm&eacute; &laquo;&nbsp;.htaccess&nbsp;&raquo;, contenant cette ligne :</p>
  <blockquote>
    <pre>deny from all</pre>
  </blockquote>
  <p>Faites en sorte que le logiciel serveur (p. ex. Apache) ait les privil&egrave;ges pour
  &eacute;crire dans ce dossier, afin que Moodle puisse enregistrer les fichiers d&eacute;pos&eacute;s. Sur les
  ordinateurs UNIX, cela signifie que le possesseur du dossier en question soit quelque
  chose comme &laquo;&nbsp;nobody&nbsp;&raquo;, &laquo;&nbsp;www&nbsp;&raquo; ou &laquo;&nbsp;apache&nbsp;&raquo;.</p>
  <p>Sur la plupart des serveurs web, vous devrez probablement restreindre &agrave; votre
  &laquo;&nbsp;groupe&amp;nbsp&raquo; tous les acc&egrave;s &agrave; vos fichiers (afin d'&eacute;viter que d'autres utilisateurs
  du m&ecirc;me fournisseur puissent voir ou modifier vos fichiers), mais accorder les droits
  de lecture et d'&eacute;criture &agrave; tous les autres utilisateurs (ce qui permettra au serveur web
  d'acc&eacute;der &agrave; vos fichiers). Si vous avez des difficult&eacute;s &agrave; g&eacute;rer proprement cela, 
  parlez-en &agrave; l'administrateur de votre serveur web.</p>
</blockquote>
<p>&nbsp;</p>
<h3 class="sectionheading"><a name="database"></a>5. Cr&eacute;er une base de donn&eacute;es</h3>
<blockquote>
  <p>Il est n&eacute;cessaire de cr&eacute;er une base de donn&eacute;es vide (nomm&eacute;e par exemple
  &laquo;&nbsp;moodle&nbsp;&raquo;) dans votre gestionnaire de base de donn&eacute;es, ainsi qu'un
  utilisateur sp&eacute;cial (nomm&eacute; par exemple &laquo;&nbsp;moodleuser&nbsp;&raquo;) ayant acc&egrave;s
  &agrave; cette base de donn&eacute;es (et seulement &agrave; celle-ci). Il est possible d'utiliser
  l'utilisateur &laquo;&nbsp;root&nbsp;&raquo;, mais cela n'est pas recommand&eacute; sur un syst&egrave;me
  en production&nbsp;: si un pirate d&eacute;couvre le mot de passe, tout votre syst&egrave;me de base
  de donn&eacute;es serait alors compromis, plut&ocirc;t qu'une seule base de donn&eacute;es.</p>
  <p>Exemple de commandes sur MySQL&nbsp;:</p>
  <pre>
   # mysql -u root -p
   > CREATE DATABASE moodle; 
   > GRANT SELECT,INSERT,UPDATE,DELETE,CREATE,DROP,INDEX,ALTER ON moodle.* 
           TO moodleuser@localhost IDENTIFIED BY 'motdepasse'; 
   > quit 
   # mysqladmin -p reload
</pre>
  <p>Exemple de commandes sur PostgreSQL&nbsp;:</p>
  <pre>
   # su - postgres
   > psql -c "create user moodleuser createdb;" template1
   > psql -c "create database moodle;" -U moodleuser template1
   > psql -c "alter user moodleuser nocreatedb;" template1
</pre>
  <p>(Pour MySQL, vous pouvez utiliser <a href="http://phpmyadmin.sourceforge.net/">phpMyAdmin</a> 
  pour g&eacute;rer vos bases de donn&eacute;es - tout peut &ecirc;tre fait via une interface web).</p>
  <p>Moodle g&egrave;re les pr&eacute;fixes de tables &agrave; partir de la version 1.0.8. Il peut donc sans probl&egrave;me
  partager une base de donn&eacute;es comprenant des tables d'autres applications.</p>
</blockquote>
<p>&nbsp;</p>
<h3 class="sectionheading"><a name="webserver" id="webserver"></a>6. V&eacute;rifier les r&eacute;glages de votre serveur web</h3>
<blockquote>
  <p>Assurez-vous en premier lieu que votre serveur web permette d'utiliser &laquo;&nbsp;index.php&nbsp;&raquo;
  comme page par d&eacute;faut (de m&ecirc;me par exemple que index.html, index.htm, default.htm, etc.).</p>
  <p>Dans Apache, cela peut &ecirc;tre obtenu avec une directive &laquo;&nbsp;DirectoryIndex&nbsp;&raquo; dans votre
  fichier &laquo;&nbsp;httpd.conf&nbsp;&raquo;. Chez moi, cela se pr&eacute;sente ainsi&nbsp;:</p>
  <blockquote>
    <pre><strong>DirectoryIndex</strong> index.php index.html index.htm </pre>
  </blockquote>
  <p>Contr&ocirc;lez simplement que index.php soit dans la liste (et de pr&eacute;f&eacute;rence au d&eacute;but de la liste,
  pour des raisons de performance).</p>
  <p>Deuxi&egrave;mement, <b>si vous utilisez Apache 2</b>, vous devrez activer la variable <i>AcceptPathInfo</i>,
  qui permet de passer des arguments &agrave; des scripts, comme http://serveur/file.php/arg1/arg2.
  Cela est essentiel, pour permettre des liens relatifs entre vos ressources, et &eacute;galement pour
  offrir un gain de performance aux utilisateurs de votre site Moodle. Vous pouvez activer cette
  variable en ajoutant la ligne ci-dessous &agrave; votre fichier &laquo;&nbsp;httpd.conf&nbsp;&raquo;.
  <blockquote>
    <pre><strong>AcceptPathInfo</strong> on </pre>
  </blockquote>
  <p>Troisi&egrave;mement, pour fonctionner, Moodle n&eacute;cessite un certain nombre de r&eacute;glages PHP.
  <b>Sur la plupart des serveurs, ces r&eacute;glages sont actifs par d&eacute;faut</b>. Cependant,
  certains serveurs PHP (et avec certaines des versions les plus r&eacute;centes de PHP) peuvent
  avoir des r&eacute;glages diff&eacute;rents. Ces r&eacute;glages sont d&eacute;finis dans le fichier de configuration
  de PHP (dont le nom est habituellement php.ini)&nbsp;:</p>
  <blockquote>
    <pre>magic_quotes_gpc = 1        (preferred but not necessary)
magic_quotes_runtime = 0    (necessary)
file_uploads = 1
session.auto_start = 0
session.bug_compat_warn = 0</pre>
  </blockquote>
  <p>Si vous n'avez acc&egrave;s ni au fichier httpd.conf, ni au fichier php.ini de votre serveur,
  ou si Moodle est install&eacute; sur un serveur avec des applications n&eacute;cessitant des r&eacute;glages
  diff&eacute;rents, vous pouvez cependant CONTOURNER tous ces r&eacute;glages par d&eacute;faut.</p>
  <p>Pour le faire, il vous faudra cr&eacute;er dans le dossier de Moodle un fichier nomm&eacute;
  <b>.htaccess</b>, contenant les d&eacute;finitions ad&eacute;quates pour ces r&eacute;glages. Cela ne fonctionne
  que pour les serveurs Apaches et seulement si le privil&egrave;ge Overrides est accord&eacute;. Voici un
  exemple du contenu d'un fichier .htaccess&nbsp;:</p>
  <blockquote>
    <pre>
DirectoryIndex index.php index.html index.htm

&lt;IfDefine APACHE2>
     <b>AcceptPathInfo</b> on
&lt;/IfDefine>

php_flag magic_quotes_gpc 1
php_flag magic_quotes_runtime 0
php_flag file_uploads 1
php_flag session.auto_start 0
php_flag session.bug_compat_warn 0
</pre>
  </blockquote>
  <p>Dans ce fichiers, on peut aussi d&eacute;finir la taille maximale des fichiers d&eacute;pos&eacute;s&nbsp;:</p>  
  <blockquote>
    <pre>
LimitRequestBody 0
php_value upload_max_filesize 2M
php_value post_max_size 2M
</pre>
  </blockquote>
  <p>Le plus simple &agrave; faire est de copier le fichier fourni lib/htaccess, de le modifier suivant
  vos besoins. Ce fichier contient de plus amples instructions. Pour cela il vous suffit
  de taper, dans Unix, la commande&nbsp;:
  <blockquote>
    <pre>cp lib/htaccess .htaccess</pre>
  </blockquote>
</blockquote>
<p>&nbsp;</p>
<h3 class="sectionheading"><a name="config"></a>7. Modifier config.php</h3>
<blockquote>
  <p>Vous pouvez maintenant &eacute;diter le fichier de configuration <strong>config.php</strong>
  &agrave; l'aide d'un &eacute;diteur de texte. Ce fichier est utilis&eacute; par tous les autres fichiers
  de Moodle.</p>
  <p>Pour commencer, faites une copie du fichier <strong>config-dist.php</strong> et donnez-lui
  le nom &laquo;&nbsp;config.php&nbsp;&raquo;. Cette &eacute;tape est n&eacute;cessaire pour &eacute;viter que votre config.php
  ne soit effac&eacute; si plus tard vous mettez &agrave; jour Moodle.</p>
  <p>Modifiez votre <strong>config.php</strong> pour indiquer les d&eacute;tails de la base de
  donn&eacute;es que vous venez de d&eacute;finir (en incluant un pr&eacute;fixe de table - cela est OBLIGATOIRE
  pour PostgreSQL), ainsi que l'adresse du site, le chemin du dossier et celui du dossier
  des donn&eacute;es. Le fichier de configuration contient de plus amples informations et des 
  exemples.</p>
  <p>Une fois cette &eacute;tape effectu&eacute;e, le reste de l'installation a lieu via une interface
  web. Pour la suite et la fin de cette installation, nous supposerons que votre site est
  &agrave; l'adresse&nbsp;: <u>http://exemple.com/moodle</u>.</p>
</blockquote>
<p>&nbsp;</p>
<h3 class="sectionheading"><a name="admin"></a>8. Visiter la page d'administration</h3>
<blockquote> 
  <p>La page d'aministration devrait &ecirc;tre maintenant active &agrave; l'adresse
  <u>http://exemple.com/moodle/admin</u>. Si vous essayez d'acc&eacute;der &agrave; la page d'accueil de
  votre site, vous y arriverez directement malgr&eacute; tout. La premi&egrave;re fois que vous acc&eacute;derez
  &agrave; la page d'administration, un condens&eacute; de la licence GPL vous sera pr&eacute;sent&eacute;. Vous devez
  l'accepter avant de continuer la mise en service de votre installation.</p>
  <p>(Moodle va aussi essayer de placer des cookies dans votre navigateur. Si celui-ci vous
  permet d'accepter ou non les cookies, vous <b>devez</b> accepter les cookies de Moodle,
  ou alors Moodle ne fonctionnera pas.)</p>
  <p>Moodle va maintenant mettre en place votre base de donn&eacute;es et cr&eacute;er les tables qui
  contiendront les donn&eacute;es. Les tables de la base de donn&eacute;es principale sont d'abord cr&eacute;&eacute;es.
  Un certain nombre de commandes SQL seront affich&eacute;es, suivies de messages (en rouge ou
  en vert) de ce type :</p>
  <blockquote> 
    <p>CREATE TABLE course ( id int(10) unsigned NOT NULL auto_increment, category 
      int(10) unsigned NOT NULL default '0', password varchar(50) NOT NULL default 
      '', fullname varchar(254) NOT NULL default '', shortname varchar(15) NOT 
      NULL default '', summary text NOT NULL, format tinyint(4) NOT NULL default 
      '1', teacher varchar(100) NOT NULL default 'Teacher', startdate int(10) 
      unsigned NOT NULL default '0', enddate int(10) unsigned NOT NULL default 
      '0', timemodified int(10) unsigned NOT NULL default '0', PRIMARY KEY (id)) 
      TYPE=MyISAM</p>
    <p><font color="#006600">SUCCESS</font></p>
    <p>... et ainsi de suite, suivi de : <font color="#006600">Main databases set up 
    successfully.</font></p>
  </blockquote>
  <p>Si ces messages n'apparaissent pas, c'est qu'un pobl&egrave;me est survenu avec la
  base de donn&eacute;es, ou qu'un param&egrave;tre de votre configuration est incorrect dans 
  votre config.php. V&eacute;rifiez que PHP ne fonctionne pas en mode &laquo;&nbsp;Safe Mode&nbsp;&raquo;
  (certains h&ocirc;tes web commerciaux ont le mode &laquo;&nbsp;Safe Mode&nbsp;&raquo; actif). Vous pouvez
  v&eacute;rifier la configuration des variables PHP en cr&eacute;ant un fichier PHP contenant
  &amp;lt? phpinfo() ?&amp;gt et en le chargeant dans votre navigateur. V&eacute;rifiez tout et
  rechargez ensuite la page d'administration.</p>
  <p>Descendez tout en bas de la page et cliquez sur le lien &quot;Continuer&quot;</p>
  <p>Une page semblable va s'afficher, qui met en place toutes les tables requises par
  chaque module de Moodle. Comme avant, tout doit &ecirc;tre en<font color="#006600">vert</font>.</p>
  <p>Descendez tout en bas de la page et cliquez sur le lien &quot;Continuer&quot;</p>
  <p>Un formulaire devrait s'afficher maintenant, dans lequel vous pouvez d&eacute;finir
  plus d'options de configuration pour votre installation, telles que la langue
  par d&eacute;faut, les h&ocirc;tes SMTP, etc. Si vous n'avez pas encore d&eacute;termin&eacute; tous les
  r&eacute;glages, ce n'est pas grave - vous pourrez en tout temps modifier ces r&eacute;glages
  &agrave; l'aide de l'interface d'administartion de Moodle. Descendez tout en bas de la
  page et cliquez sur le bouton &laquo;&nbsp;Enregistrer&nbsp;&raquo;.</p>
  <p>Si vous &ecirc;tes coinc&eacute; sur cette page et ne pouvez continuer (et seulement dans
  ce cas), c'est probablement que votre serveur souffre de ce que j'appelle le
  probl&egrave;me du &laquo;&nbsp;buggy referrer&nbsp;&raquo;. Il et facile d'y rem&eacute;dier&nbsp;: d&eacute;sactivez
  le r&eacute;glage &laquo;&nbsp;secureforms&nbsp;&raquo;, puis essayez de continuer.</p>
  <p>La page suivante est un formulaire o_ vous pouvez d&eacute;finir les r&eacute;glages de votre
  site Moodle et de sa page d'accueil, comme le nom, le format, le texte de
  description, etc. Remplissez-le (vous pourrez en tout temps modifier ces r&eacute;glages)
  et cliquez sur le bouton &laquo;&nbsp;Enregistrer&nbsp;&raquo;.</p>
  <p>Finalement, l'on vous demandera de cr&eacute;er un utilisateur administrateur, qui aura
  acc&egrave;s aux pages d'administration. Remplissez les diff&eacute;rents champs avec votre nom,
  votre adresse de courriel, etc., puis cliquez sur le bouton &laquo;&nbsp;Enregistrer&nbsp;&raquo;.
  Tous les champs de sont pas obligatoires. Si toutefois vous oubliez de remplir un
  champ important, on vous demandera de les remplir.</p>
  <blockquote> 
    <blockquote> 
      <blockquote> 
        <blockquote> 
          <blockquote> 
            <p><strong>Assurez-vous de vous souvenir du nom d'utilisateur et du mot
            de passe que vous choisissez pour le compte administrateur. Ces donn&eacute;es
            seront n&eacute;cessaires pour acc&eacute;der &agrave; la page d'administration.</strong></p>
          </blockquote>
        </blockquote>
      </blockquote>
    </blockquote>
  </blockquote>
  <p>(Si pour une raison ou pour une autre l'installation est interrompue, ou si
  une erreur syst&egrave;me vous emp&ecirc;che de vous annoncer dans Moodle avec votre compte
  administrateur, il est en g&eacute;n&eacute;ral possible de s'annoncer avec le nom d'utilisateur
  par d&eacute;faut &laquo;&nbsp;<strong>admin</strong>&nbsp;&raquo;, avec le mot de passe 
  &laquo;&nbsp;<strong>admin</strong>&nbsp;&raquo;.)</p>
  <p>D&egrave;s que vous avez cr&eacute;&eacute; votre compte administrateur, la page d'accueil de votre
  site s'affichera. Remarquez les liens vers les options d'administration en bas &agrave; gauche
  de la page (ces options apparaissent aussi sur la page d'administration) - ces options
  ne sont visibles que parce que vous &ecirc;tes annonc&eacute; en tant qu'administrateur. L'administration
  de votre site Moodle peut &ecirc;tre int&eacute;gralement effectu&eacute;e &agrave; l'aide de ce menu. Par
  exemple/nbsp;:</p>
  <ul>
    <li>la cr&eacute;ation et la suppression de cours</li>
    <li>la cr&eacute;ation et la suppression de comptes utilisateurs</li>
    <li>l'administration des comptes d'enseignants</li>
    <li>la modification de r&eacute;glages globaux, comme les th&egrave;mes, etc.</li>
  </ul>
</blockquote>
<p>&nbsp;</p>
<h3 class="sectionheading"><a name="cron"></a>9. Mettre en place un cron</h3>
<blockquote> 
  <p>Certains des modules de Moodle n&eacute;cessitent de v&eacute;rifier certains param&egrave;tres, afin
  d'ex&eacute;cuter des op&eacute;rations. Par exemple, Moodle doit v&eacute;rifier si des messages ont &eacute;t&eacute;
  post&eacute;s dans les forums pour envoyer des copies de ces messages aux personnes qui le
  d&eacute;sirent.</p>
  <p>Le script qui effectue ces contr&ocirc;les est situ&eacute; dans le dossier admin. Il porte le nom
  cron.php. Ce script ne peut pas se lancer tout seul. Vous devez donc mettre en place un
  m&eacute;canisme permettant de le lancer r&eacute;guli&egrave;rement (par exemple toutes les 5 ou 10 minutes).
  On ainsi des &laquo;&nbsp;battements de coeur&nbsp;&raquo; &agrave; Moodle, et le script peut effectuer des
  op&eacute;rations d&eacute;finies par chaque module.</p>
  <p>Il est &agrave; remarquer que l'ordinateur effectuant le cron <b>n'est pas obligatoirement
  l'ordinateur sur lequel Moodle est install&eacute;</b>. Par exemple, si vous disposez d'un
  serveur web qui n'offre pas de tel m&eacute;canisme, vous pourrez lancer le cron sur un autre
  serveur, ou m&ecirc;me sur l'ordinateur de la maison. La seule chose qui importe est de charger
  r&eacute;guli&egrave;rement le fichier cron.php.</p>
  <p>L'appel de ce fichier ne surcharge pas le serveur. Une fr&eacute;quence d'appel de 5 minutes
  est donc raisonnable, mais peut fort bien &ecirc;tre port&eacute;e &agrave; 15 ou 30 minutes. Il n'est pas
  recommand&eacute; de fixer une trop longue p&eacute;riode, car cela mettra des d&eacute;lais dans l'envoi des
  courriels, ce qui peut rallentir l'activit&eacute; des cours.</p>
  <p>Avant tout, v&eacute;rifiez que le script fonctionne en l'appelant directement depuis
  votre navigateur&nbsp;:</p>
  <blockquote> 
    <pre>http://exemple.com/moodle/admin/cron.php</pre>
  </blockquote>
  <p>Vous pouvez alors mettre en place un m&eacute;canisme qui appellera le script &agrave; intervalles
  r&eacute;guliers.</p>
  <h4>Lancer le script en ligne de commande</h4>
  <p>Il est possible de lancer le script en ligne de commande, avec le m&ecirc;me r&eacute;sultat que
  ci-dessus. On peut par exemple utiliser la commande Unix &laquo;&nbsp;wget&nbsp;&raquo;&nbsp;:</p>
  <blockquote>
    <pre>wget -q -O /dev/null http://exemple.com/moodle/admin/cron.php</pre>
  </blockquote>
  <p>Dans cet exemple, le r&eacute;sultat de la commande est d&eacute;truit (envoyer vers /dev/null).</p>
  <p>M&ecirc;me chose avec lynx&nbsp;:</p>
  <blockquote>
    <pre>lynx -dump http://exemple.com/moodle/admin/cron.php &gt; /dev/null</pre>
  </blockquote>
  <p>On peut &eacute;galement utiliser une version de PHP compil&eacute;e pour utilisation en ligne de
  commande. L'avantage est qu'ainsi l'on n'encombre pas les journaux (logs) du serveur
  web avec les requ&ecirc;tes de cron.php. Le d&eacute;savantage est qu'il faut disposer d'une version
  sp&eacute;ciale de PHP.</p>
  <blockquote>
    <pre>/opt/bin/php /web/moodle/admin/cron.php

(Windows) C:\apache\php\php.exe C:\apache\htdocs\moodle\admin\cron.php
</pre>
  </blockquote>
  <h4>Lancer automatiquement le script toutes les 5 minutes</h4>
  <p><b>Sur Unix</b>&nbsp;: utilisez <b>cron</b>. En ligne de commande, &eacute;ditez les
  r&eacute;glages de cron avec &laquo;&nbsp;crontab -e&nbsp;&raquo; et ajouter une ligne de la
  forme&nbsp;:</p>
  <blockquote>
    <pre>*/5 * * * * wget -q -O /dev/null http://exemple.com/moodle/admin/cron.php</pre>
  </blockquote>
  <p>Habituellement, la commande &laquo;&nbsp;crontab&nbsp;&raquo; lance l'&eacute;diteur &laquo;&nbsp;vi&nbsp;&raquo;.
  On passe en mode insertion en tapant &laquo;&nbsp;i&nbsp;&raquo;, puis on tape une ligne comme ci-dessus.
  On sort ensuite du mode insertion en tapant la touche &lt;ESC&gt;. Il ne reste qu'&agrave;
  enregistrer et quitter en tapant &laquo;&nbsp;:wq&amp;nbsp&raquo;, ou &agrave; quitter sans enregistrer avec
  &laquo;&nbsp;:q!&nbsp;&raquo; (tout cela sans guillemets).</p>
  <p><b>Sous Windows</b>&nbsp;: la fa&ccedil;on la plus simple est d'utiliser le petit programme
  <a href="http://moodle.org/download/moodle-cron-for-windows.zip" title="Click to download this package (150k)" target="_blank">moodle-cron-for-windows.zip</a> 
  qui rend le processus tr&egrave;s simple. vous pouvez aussi essayer d'utiliser l'utilitaire Windows
  &laquo;&nbsp;Scheduled Tasks&nbsp;&raquo;.</p>
  <p><b>Sur les h&ocirc;tes web</b>&nbsp;: votre interface web de r&eacute;glages poss&egrave;de peut-&ecirc;tre une
  page vous permettant de mettre en place des crons. Demandez &agrave; votre administrateur des
  d&eacute;tails concernant leur utilisation.</p>
  <p></p>
</blockquote>
<h3 class="sectionheading"><a name="course"></a>10. Cr&eacute;er un nouveau cours</h3>
<blockquote>
  <p>Maintenant Moodle fonctionne correctement, et vous pouvez cr&eacute;er un cours.</p>
  <p>S&eacute;lectionnez &laquo;&nbsp;Ajouter un cours&nbsp;&raquo; dans les pages d'administration.</p>
  <p>Remplissez le formulaire, en pr&ecirc;tant attention en particulier au format du cours.
  Il n'est pas n&eacute;cessaire de se pr&eacute;occuper tout de suite de tous les d&eacute;tails. Tous les
  r&eacute;glages peuvent en effet &ecirc;tre modifi&eacute;s en tout temps par l'enseignant.</p>
  <p>Cliquez sur le bouton &laquo;&nbsp;Enregistrer&nbsp;&raquo;, et un autre formulaire s'affichera,
  o_ vous pourrez d&eacute;finir le ou les enseignants de ce cours. Ce formulaire ne permet
  d'ajouter comme enseignants que des utilisateurs d&eacute;j&agrave; d&eacute;finis - si vous voulez cr&eacute;ez
  un ou plusieurs nouveaux comptes, demandez aux personnes concern&eacute;es de s'en cr&eacute;er 
  (voir la page de connexion), ou cr&eacute;ez vous-m&ecirc;mes des comptes, en cliquant sur &laquo;&nbsp;Ajouter un
  utilisateur&nbsp;&raquo; dans les pages d'administration.</p>
  <p>Vous pouvez ensuite modifier selon vos d&eacute;sirs le cours, qui sera accessible sous
  les &laquo;&nbsp;Cours disponibles&nbsp;&raquo; de la page d'accueil.</p>
  <p>R&eacute;f&eacute;rez-vous au &laquo;&nbsp;<a href="./?file=teacher.html">Manuel de l'enseignant</a>&nbsp;&raquo;
  pour plus de d&eacute;tails sur la mise en place de cours.</p>
</blockquote>
<p>&nbsp;</p>
<p align="CENTER"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>
<p align="CENTER"><font size="1">Version: $Id$</font></p>
</body>
