<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  
<title>Documentation Moodle : Introduction</title>
  
<link rel="stylesheet" href="docstyles.css" type="text/css">
  
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
<body bgcolor="#ffffff">
  
<h1>Introduction</h1>
<blockquote>

<p>Moodle est un logiciel permettant la mise en place de cours en ligne et de sites web. C'est un projet b&eacute;n&eacute;ficiant d'un d&eacute;veloppement actif et con&ccedil;u pour favoriser un cadre de formation <a href="?file=philosophy.html">socio-constructiviste</a>.</p>

<p>Moodle est mis &agrave; disposition librement en tant que logiciel <a href="http://www.opensource.org/docs/definition_plain.html" target="_top"> Open Source</a>, suivant la <a href="http://www.gnu.org/copyleft/gpl.html" target="_top">licence GPL (GNU Public License)</a>. En gros, cela signifie que Moodle b&eacute;n&eacute;ficie d'un copyright, mais que vous disposez d'un certain nombre de libert&eacute;s. Vous avez le droit de copier, d'utiliser et de modifier Moodle pour autant que vous vous engagiez&nbsp;: <strong>&agrave; mettre &agrave; disposition des autres le code source</strong>&nbsp;; <strong>&agrave; ne pas modifier ni supprimer la licence originale et les copyrights</strong> et <strong>&agrave; appliquer la m&ecirc;me licence &agrave; tous les travaux d&eacute;riv&eacute;s</strong>. Pour plus de d&eacute;tails, consultez le texte complet de la licence. Contactez directement le <a href="http://moodle.org/user/view.php?id=1&amp;course=1">d&eacute;tenteur du copyright</a> si vous avez des questions.</p>

<p>Moodle fonctionne sur tous les ordinateurs qui peuvent faire tourner <a href="http://www.php.net/" target="_top">PHP</a> et qui peuvent mettre en oeuvre une base de donn&eacute;es (en particulier <a href="http://www.mysql.com/" target="_top">MySQL</a>).</p>

<p>Le terme &laquo;&nbsp;Moodle&nbsp;&raquo; &eacute;tait &agrave; l'origine un acronyme pour &laquo;&nbsp;Modular Object-Oriented Dynamic Learning Environment&nbsp;&raquo;. Cette terminologie est surtout utile aux programmeurs et aux th&eacute;oriciens de l'&eacute;ducation. Mais &laquo;&nbsp;moodle&nbsp;&raquo; est aussi un verbe qui d&eacute;crit la fa&ccedil;on de fl&acirc;ner paresseusement &agrave; travers quelque chose, faire des choses quand cela vous sied le mieux, une mani&egrave;re agr&eacute;able d'agir qui m&egrave;ne souvent &agrave; la r&eacute;flexion et &agrave; la cr&eacute;ativit&eacute;. Ce terme s'applique donc &agrave; la fa&ccedil;on dont Moodle a &eacute;t&eacute; d&eacute;velopp&eacute;, tout comme &agrave; la mani&egrave;re des &eacute;tudiants et enseignants d'approcher l'apprentissage et l'enseignement dans un cours en ligne. Toute personne utilisant Moodle est un &laquo;&nbsp;moodleur&nbsp;&raquo;.</p>

<p>Venez <a href="http://moodle.org/community/" target="_top">&laquo;&nbsp;moodler&nbsp;&raquo; avec nous</a>&nbsp;!</p>

</blockquote>

<p><br /></p>
<p align="center"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>
<p align="center"><font size="1">Version: $Id$</font></p>
</body>
</html>
