<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  
<title>Documentation Moodle : Philosophie</title>
  
<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS">
  
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
<body bgcolor="#ffffff">
  
<h1>Philosophie</h1>

<blockquote>

<h4>Remarque pr&eacute;liminaire du traducteur</h4>

  <p>La traduction des concepts p&eacute;dagogiques &agrave; la base
  du logiciel Moodle de Martin Dougiamas n'est pas facile
  &agrave; traduire. La traduction ci-dessous ne peut donc &ecirc;tre
  qu'approximative, d'autant plus que la terminologie des
  concepts d&eacute;crits n'existe (&agrave; ma connaissance) pas en
  fran&ccedil;ais). Vous trouverez donc quelques n&eacute;ologismes
  utilis&eacute;s pour refl&eacute;ter les termes anglais traduits.</p>
  <p>Merci de votre compr&eacute;hension, et passons maintenant
  &agrave; la traduction du texte.</p>

<hr />

  <p>Le concept et le d&eacute;veloppement de Moodle est guid&eacute;
  par une philosophie particuli&egrave;re de l'apprentissage,
  une fa&ccedil;on de penser dont on entend parler souvent sous
  le nom de &laquo;&nbsp;<em>p&eacute;dagogie socio-constructiviste</em>&nbsp;&raquo;.
  (certains scientifiques parmi vous pensent certainement
  d&eacute;j&agrave; &laquo;&nbsp;encore une de ces th&eacute;ories p&eacute;dagogiques bidon&nbsp;&raquo;
  et sont pr&ecirc;ts &agrave; changer de page, mais continuez &agrave;
  lire&nbsp;!)</p>
  <p>Cette page tente d'expliquer &agrave; l'aide de termes
  simples cette p&eacute;dagogie &agrave; l'aide de quatre
  <strong>concepts clefs</strong> sous-jacents. Chacun de ces
  points est un tr&egrave;s bref r&eacute;sum&eacute; d'un grand nombre de
  recherches. Si vous connaissez le domaine, cela pourra
  vous para&icirc;tre un peu mince.</p>
  <p>Si tout cela est compl&egrave;tement neuf pour vous, il est
  probable que ces id&eacute;es seront difficiles &agrave; comprendre -
  je vous recommande donc de les lire attentivement, tout en
  pensant &agrave; votre propre exp&eacute;rience lorsque vous essayez
  d'apprendre quelque chose.</p>
  <h3>1. Constructivisme</h3>
  <blockquote>
    <p>Ce point de vue affirme que les gens <strong>construisent</strong>
    activement leurs nouvelles connaissances en interagissant avec leur
    voisinage.</p>
    <p>Tout ce que vous lisez, voyez, entendez, ressentez et touchez
    est compar&eacute; &agrave; vos connaissances ant&eacute;rieures et si cela est
    viable dans votre monde mental, cela pourra former une nouvelle
    connaissance qui vous appartiendra. La connaissance est
    renforc&eacute;e si vous pouvez l'utiliser avec succ&egrave;s dans un
    voisinage plus large. Vous n'&ecirc;tes pas seulement une banque
    de m&eacute;moire qui absorbe passivement de l'information, et 
    la connaissance ne peut pas non plus vous &ecirc;tre
    &laquo;&nbsp;transmise&nbsp;&raquo; juste en lisant quelque chose ou en &eacute;coutant
    quelqu'un.</p>
    <p>Cela ne veut pas dire qu'il est impossible d'apprendre quoi
    que ce soit en lisant une page web ou en assistant &agrave; un cours&nbsp;;
    bien &eacute;videmment, cela est possible. Cela mets l'accent sur le fait
    qu'il n'y a pas seulement un transfert d'information d'un
    cerveau &agrave; un autre, mais que tout est conditionn&eacute; par
    l'interpr&eacute;tation.</p>
  </blockquote>
  <h3>2. Constructionisme</h3>
  <blockquote>
    <p>Le &laquo;&nbsp;constructionisme&nbsp;&raquo; affirme que l'apprentissage est particuli&egrave;rement
    efficace lorsque l'on construit quelque chose pour que d'autres
    l'exp&eacute;rimentent. Cela peut &ecirc;tre toutes sortes de choses, passant
    d'une phrase &eacute;nonc&eacute;e ou un message sur Internet &agrave; des art&eacute;facts
    plus complexes comme une peinture, une maison ou un logiciel.</p>
    <p>Par exemple, vous pouvez lire cette page plusieurs fois et
    malgr&eacute; tout l'oublier jusqu'&agrave; demain. Mais si vous essayez
    d'expliquer ces id&eacute;es &agrave; quelqu'un d'autres avec vos propres
    mots, ou si vous confectionnez une pr&eacute;sentation expliquant
    ces concepts, je peux alors vous garantir que vous aurez une
    meilleure compr&eacute;hension, mieux int&eacute;gr&eacute;es dans vos propres id&eacute;es.
    C'est pour cette raison que les gens prennent des notes durant
    les cours, m&ecirc;me s'ils ne les relisent pas toujours.</p>
  </blockquote>
  <h3>3. Socio-constructivisme</h3>
  <blockquote>
    <p>Cette id&eacute;e &eacute;tend les pr&eacute;c&eacute;dentes &agrave; un groupe social
    construisant des choses pour un autre groupe, en cr&eacute;ant
    en collaboration une culture d'art&eacute;facts partag&eacute;s, avec un sens
    partag&eacute;. Si l'on est immerg&eacute; dans une telle culture d'objets
    partag&eacute;s, on apprend &agrave; chaque instant comment faire partie
    int&eacute;grante de cette culture, &agrave; tous les niveaux.</p>
    <p>Une tasse en fournit un tr&egrave;s simple exemple. L'objet peut
    &ecirc;tre utilis&eacute; pour de nombreuses choses, mais sa forme sugg&egrave;re
    une certaine &laquo; connaissance&nbsp;&raquo; sur la capacit&eacute; &agrave; contenir
    des liquides. Un exemple plus complexe est un cours en
    ligne. La &laquo;&nbsp;forme&nbsp;&raquo; des outils logiciels indique bien
    s&ucirc;r certaines choses sur le fonctionnement des cours
    en ligne, mais les activit&eacute;s et textes produits dans le
    groupe aideront &agrave; ce faire une id&eacute;e du comportement
    de chaque personne dans ce groupe.</p>
  </blockquote>
  <h3>4. Connect&eacute; et s&eacute;par&eacute;</h3>
  <blockquote>
    <p>This idea looks deeper into the motivations of individuals within
    a discussion. <strong>Separate</strong> behaviour is when someone
    tries to remain 'objective' and 'factual', and tends to defend their
    own ideas using logic to find holes in their opponent's ideas.
    <strong>Connected</strong> behaviour is a more empathic approach
    that accepts subjectivity, trying to listen and ask questions in an
    effort to understand the other point of view.
    <strong>Constructed</strong> behaviour is when a person is sensitive
    to both of these approaches and is able to choose either of them as
    appropriate to the current situation.</p>
    <p>In general, a healthy amount of connected behaviour within a
    learning community is a very powerful stimulant for learning, not
    only bringing people closer together but promoting deeper reflection
    and re-examination of their existing beliefs.</p>
  </blockquote>
  <hr>
  <p>Once you are thinking about all these issues, it helps you to focus
  on the experiences that would be best for   learning from the
  learner's point of view, rather than just publishing and assessing the
  information you think they need to know. It can also help you realise
  how each participant in a course can be a teacher as well as a
  learner. Your job as a 'teacher' can change from being 'the source of
  knowledge' to being an influencer and role model of  class culture, 
  connecting with students in a personal way that addresses their own
  learning needs, and moderating discussions and activities in a way
  that collectively leads students towards the learning goals of the
  class.</p>
  <p>Obviously Moodle doesn't force this style of behaviour, but this is
  what it is best at supporting. In future, as the technical
  infrastructure of Moodle stabilises, further improvements in
  pedagogical support will be a major direction for Moodle
  development.</p>
</blockquote>
<hr>
<p align="center"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>
<p align="center"><font size="1">Version: $Id$</font></p>
</body>
</html>
