<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  
<title>Documentation Moodle : Philosophie</title>
  
<link rel="stylesheet" href="docstyles.css" type="TEXT/CSS">
  
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>
<body bgcolor="#ffffff">
  
<h1>Philosophie</h1>

<blockquote>

<h4>Remarque pr&eacute;liminaire du traducteur</h4>

<p>Les concepts p&eacute;dagogiques &agrave; la base du logiciel Moodle de Martin Dougiamas ne sont pas faciles &agrave; traduire. La traduction ci-dessous ne peut donc &ecirc;tre qu'approximative, d'autant plus que la terminologie de certains concepts d&eacute;crits n'existe (&agrave; ma connaissance) pas en fran&ccedil;ais. Vous y trouverez donc quelques n&eacute;ologismes utilis&eacute;s pour refl&eacute;ter les termes anglais traduits.</p>

<p>Merci de votre compr&eacute;hension, et passons maintenant &agrave; la traduction du texte.</p>

<p align="right">Nicolas Martignoni</p>

<hr />

<p>Le concept et le d&eacute;veloppement de Moodle est guid&eacute; par une philosophie particuli&egrave;re de l'apprentissage, une fa&ccedil;on de penser dont on entend parler souvent sous le nom de &laquo;&nbsp;<em>p&eacute;dagogie socio-constructiviste</em>&nbsp;&raquo;. (Certains scientifiques parmi vous pensent certainement d&eacute;j&agrave; &laquo;&nbsp;encore une de ces th&eacute;ories p&eacute;dagogiques bidon&nbsp;&raquo; et sont pr&ecirc;ts &agrave; changer de page. Mais non, continuez &agrave; lire&nbsp;!)</p>

<p>Cette page tente d'expliquer &agrave; l'aide de termes simples cette p&eacute;dagogie &agrave; l'aide de quatre <strong>concepts clefs</strong> sous-jacents. Chacun de ces points est un tr&egrave;s bref r&eacute;sum&eacute; d'un grand nombre de recherches. Si vous connaissez le domaine, cela pourra vous para&icirc;tre un peu succinct.</p>

<p>Si tout cela est compl&egrave;tement neuf pour vous, il est probable que ces id&eacute;es seront difficiles &agrave; comprendre. Je vous recommande donc de les lire attentivement, tout en pensant &agrave; votre propre exp&eacute;rience lorsque vous essayez d'<strong>apprendre</strong> quelque chose.</p>

<h3>1. Constructivisme</h3>

<blockquote>

<p>Ce point de vue affirme que les gens <strong>construisent</strong> activement leurs nouvelles connaissances en interagissant avec leur voisinage.</p>

<p>Tout ce que vous lisez, voyez, entendez, ressentez et touchez est compar&eacute; &agrave; vos connaissances ant&eacute;rieures et si cela est viable dans votre monde mental, cela pourra former une nouvelle connaissance qui vous appartiendra. La connaissance est renforc&eacute;e si vous pouvez l'utiliser avec succ&egrave;s dans un environnement plus large. Vous n'&ecirc;tes pas seulement une banque de m&eacute;moire qui absorbe passivement de l'information, et la connaissance ne peut pas non plus vous &ecirc;tre &laquo;&nbsp;transmise&nbsp;&raquo; juste en lisant quelque chose ou en &eacute;coutant quelqu'un.</p>

<p>Cela ne veut pas dire qu'il est impossible d'apprendre quoi que ce soit en lisant une page web ou en assistant &agrave; un cours&nbsp;; bien &eacute;videmment, cela est possible. Cela met l'accent sur le fait qu'il n'y a pas seulement un transfert d'information d'un cerveau &agrave; un autre, mais que tout est conditionn&eacute; par l'interpr&eacute;tation.</p>

</blockquote>

<h3>2. Constructionisme</h3>

<blockquote>

<p>Le &laquo;&nbsp;constructionisme&nbsp;&raquo; affirme que l'apprentissage est particuli&egrave;rement efficace lorsque l'on construit quelque chose pour que d'autres l'exp&eacute;rimentent. Cela peut &ecirc;tre toutes sortes de choses, allant d'une phrase &eacute;nonc&eacute;e ou d'un courriel sur Internet &agrave; des art&eacute;facts plus complexes comme un tableau peint, une maison ou un logiciel.</p>

<p>Par exemple, vous pouvez lire cette page plusieurs fois et malgr&eacute; tout l'oublier jusqu'&agrave; demain. Mais si vous essayez d'expliquer ces id&eacute;es &agrave; quelqu'un d'autre avec vos propres mots, ou si vous confectionnez une pr&eacute;sentation expliquant ces concepts, je peux alors vous garantir que vous aurez une meilleure compr&eacute;hension, mieux int&eacute;gr&eacute;e dans vos propres id&eacute;es. C'est pour cette raison que les gens prennent des notes durant les cours, m&ecirc;me s'ils ne les relisent pas toujours.</p> </blockquote>

<h3>3. Socio-constructivisme</h3>

<blockquote>

<p>Cette id&eacute;e &eacute;tend les pr&eacute;c&eacute;dentes &agrave; un groupe social construisant des choses pour un autre groupe, en cr&eacute;ant en collaboration une culture d'art&eacute;facts partag&eacute;s, avec un sens partag&eacute;. Si l'on est immerg&eacute; dans une telle culture d'objets partag&eacute;s, on apprend &agrave; chaque instant comment faire partie int&eacute;grante de cette culture, &agrave; tous les niveaux.</p>

<p>Une tasse en fournit un tr&egrave;s simple exemple. L'objet peut &ecirc;tre utilis&eacute; pour de nombreuses choses, mais sa forme sugg&egrave;re une certaine &laquo; connaissance&nbsp;&raquo; sur la capacit&eacute; &agrave; contenir des liquides. Un exemple plus complexe est un cours en ligne. La &laquo;&nbsp;forme&nbsp;&raquo; des outils logiciels indique bien s&ucirc;r certaines choses sur le fonctionnement des cours en ligne, mais les activit&eacute;s et textes produits dans le groupe aideront &agrave; ce faire une id&eacute;e du comportement de chaque personne dans ce groupe.</p> </blockquote>

<h3>4. Li&eacute; et d&eacute;tach&eacute;</h3>

<blockquote>

<p>Cette id&eacute;e s'int&eacute;resse davantage aux motivations des individus dans le cadre d'une discussion. Un comportement &laquo;&nbsp;<strong>d&eacute;tach&eacute;</strong>&nbsp;&raquo; consiste &agrave; rester &laquo;&nbsp;objectif&nbsp;&raquo; et proche des &laquo;&nbsp;faits&nbsp;&raquo;, et &agrave; d&eacute;fendre son opinion &agrave; l'aide de la logique en cherchant les lacunes des id&eacute;es d'autrui. Un comportement &laquo;&nbsp;<strong>li&eacute;</strong>&nbsp;&raquo; consiste en une approche plus empathique, qui accepte la subjectivit&eacute;, essayant d'&eacute;couter et de poser des questions afin de comprendre le point de vue de l'autre. Un comportement &laquo;&nbsp;<strong>construit</strong>&nbsp;&raquo; est celui d'une personne sensible &agrave; ces deux approches et capable de choisir la plus appropri&eacute;e des deux dans une situation concr&egrave;te.</p>

<p>En g&eacute;n&eacute;ral, dans une communaut&eacute; d'apprentissage, une saine proportion de comportement li&eacute; est un tr&egrave;s puissant stimulant pour l'apprentissage, non seulement parce qu'il permet le rapprochement des personnes, mais aussi en favorisant une r&eacute;flexion plus profonde et un examen des propres croyances de chacun.</p>

</blockquote>

<hr>

<p>Lorsque vous pensez &agrave; tout cela, vous vous concentrez sur les exp&eacute;riences pouvant &ecirc;tre les meilleures pour l'apprentissage, du point de vue de l'apprenant, plut&ocirc;t que de simplement publier et &eacute;valuer les informations que vous estimez qu'ils doivent conna&icirc;tre. Cela vous aide aussi &agrave; r&eacute;aliser que chaque participant &agrave; un cours peut &ecirc;tre tout &agrave; tour un enseignant et un apprenant. Votre travail d'&laquo;&nbsp;enseignant&nbsp;&raquo; peut se modifier, en passant du r&ocirc;le de &laquo;&nbsp;source de la connaissance&nbsp;&raquo; &agrave; celui de p&ocirc;le d'influence et mod&egrave;le de la culture de classe. Il s'agit d'avoir des contacts personnalis&eacute;s et adapt&eacute;s aux besoins d'apprentissage de chaque &eacute;tudiant, et d'animer les discussions et les activit&eacute;s de fa&ccedil;on &agrave; atteindre collectivement les objectifs d'apprentissage de la classe.</p>

<p>Bien &eacute;videmment, Moodle ne vous force pas &agrave; ce style d'enseignement, mais c'est pour ce type de comportement qu'il offre le meilleur cadre. &Agrave; l'avenir, &agrave; mesure que l'infrastructure technique de Moodle se stabilisera, des am&eacute;liorations dans l'assistance p&eacute;dagogique seront la direction principale du d&eacute;veloppement de Moodle.</p>

</blockquote>

<hr>

<p align="center"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>

<p align="center"><font size="1">Version: $Id$</font></p>
</body>
</html>
