<head>
<title>Documentation Moodle : Manuel de l'enseignant</title>
<link rel="stylesheet" href="docstyles.css" type="text/css">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#ffffff">
<h1>Manuel de l'enseignant</h1>
<p>Cette page est un guide rapide &agrave; la cr&eacute;ation de cours en ligne avec Moodle.
Il d&eacute;crit les fonctions principales &agrave; disposition, ainsi que quelques-unes des
d&eacute;cisions que vous serez amener &agrave; prendre.</p>
<p>Sections de ce document :</p>
<ol>
  <li><a href="#started">Pour commencer</a></li>
  <li><a href="#settings">Configurer le cours</a></li>
  <li><a href="#upload">D&eacute;poser des fichiers</a></li>
  <li><a href="#activities">Mettre en place des activit&eacute;s</a></li>
  <li><a href="#course">Lancer le cours</a></li>
  <li><a href="#further">Informations compl&eacute;mentaires</a></li>
</ol>
<h3 class="sectionheading"><a name="started"></a>Pour commencer</h3>
<blockquote> 
  <p>Ce document pr&eacute;suppose que l'administrateur de votre site a configur&eacute;
  Moodle et vous a donn&eacute; un cours vide avec lequel vous pouvez commencer &agrave;
  travailler. Il part aussi de l'id&eacute;e que vous vous &ecirc;tes connect&eacute; dans votre
  cours avec votre compte d'enseignant.</p>
  <p>Voici trois conseils qui vous aideront &agrave; commmencer le travail avec Moodle.</p>
  <ol>
    <li><strong>N'ayez pas peur d'exp&eacute;rimenter&nbsp;:</strong>
      <blockquote>explorez votre cours et faites-y des modifications. Il est difficile
      de casser quoi que ce soit dans un cours Moodle, et m&ecirc;me dans ce cas, il est 
      facile de corriger le probl&egrave;me.
    </blockquote>
    <li><strong>Rep&eacute;rez et utilisez ces petites ic&ocirc;nes</strong>&nbsp;: 
      <blockquote> 
        <p>&nbsp;<img src="../pix/i/edit.gif"> - l'<strong>ic&ocirc;ne de modification</strong> 
        vous permet de modifier l'&eacute;l&eacute;ment &agrave; c&ocirc;t&eacute; duquel elle est plac&eacute;e.</p>
        <p><img src="../pix/help.gif" width="22" height="17"> - l'<strong>ic&ocirc;ne
        d'aide</strong> ouvre une <a target="helpwindow" href="../help.php?file=index.html">fen&ecirc;tre d'aide</a>.</p>
        <p>&nbsp;<img src="../pix/i/hide.gif" width="16" height="16"> - l'<strong>ic&ocirc;ne
        oeil ouvert</strong> vous permet de cacher des &eacute;l&eacute;ments aux &eacute;tudiants.</p>
        <p>&nbsp;<img src="../pix/i/show.gif" width="16" height="16"> - l'<strong>ic&ocirc;ne
        oeil ferm&eacute;</strong> vous permet de rendre disponible un &eacute;l&eacute;ment cach&eacute;.</p>
      </blockquote>
    </li>
    <li><strong>Utilisez la barre de navigation au haut de chaque page</strong>&nbsp;:
	  <blockquote>elle vous aidera &agrave; vous rappeler o&ugrave; vous vous trouvez et
	  vous &eacute;vitera de vous perdre dans le site.
      </blockquote>
    </li>
  </ol>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="settings"></a>Configurer le cours</h3>
<blockquote> 
  <p>La premi&egrave;re chose &agrave; faire est de regarder l'espace &laquo; administration &raquo; de votre
  page de cours et de cliquer sur &laquo; <strong>param&egrave;tres...</strong> &raquo; (ce lien, ainsi
  que toute la section d'administration, ne sont accessibles que par vous et par
  l'administrateur du site. Les &eacute;tudiants ne verront pas ces liens).</p>
  <p>Sur la page des param&egrave;tres, vous pouvez changer un certain nombre de r&eacute;glages
  pour votre cours : nom, clef d'acc&egrave;s, date du d&eacute;but, etc. Nous ne parlerons pas de
  tout cela ici, car en cliquer sur l'ic&ocirc;ne d'aide vous aurez des explications
  d&eacute;taill&eacute;es. Nous allons parler du r&eacute;glage le plus important, le &laquo; <strong>format
  du cours</strong> &raquo;.</p>
  <p>Le format de cours que vous choisirez d&eacute;terminera la disposition de base et la
  structure de votre cours. La version 1.0 de Moodle offre trois formats - il y en aura
  beaucoup d'autres &agrave; l'avenir (merci d'envoyer vos id&eacute;es &agrave;
  <a href="mailto:martin@moodle.org">martin@moodle.org</a> !)</p>
  <p>Voici des copies d'&eacute;crans de trois cours dans chacun de ces trois formats (ne
  faites pas attention aux couleurs, qui sont d&eacute;termin&eacute;es par l'administrateur pour
  tout le site).</p>
  <p align="center"><strong>Format hebdomadaire :</strong></p>
  <p align="center"><img src="pix/weekly.jpg" width="570" height="527"></p>
  <p align="center">&nbsp;</p>
  <p align="center"><strong>Format th&eacute;matique :</strong></p>
  <p align="center"><img src="pix/topics.jpg" width="570" height="463"></p>
  <p align="center">&nbsp;</p>
  <p align="center"><strong>Format informel :</strong></p>
  <p align="center"><img src="pix/social.jpg" width="570" height="429"></p>
  <p>&nbsp;</p>
  <p>Notez que le format hebdomadaire et le format th&eacute;matique sont tr&egrave;s semblables
  du point de vue de leur structure. La diff&eacute;rence principale est que dans le format
  hebdomadaire, chaque bo&icirc;te couvre exactement une semaine, tandis que dans le format
  th&eacute;matique, chaque bo&icirc;te peut correspondre &agrave; une p&eacute;riode de votre choix, plus
  courte ou plus longue. Le format informel est par contre tr&egrave;s diff&eacute;rent&nbsp;: il est 
  construit autour d'un forum, qui est affich&eacute; sur la page principale du cours.</p>
  <p>Pour plus de d&eacute;tails, cliquez sur les boutons d'aide de la page de configuration
  du cours.</p>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="upload"></a>D&eacute;poser des fichiers</h3>
<blockquote> 
  <p>Vous pouvez ajouter &agrave; votre cours des documents &eacute;lectroniques en votre possession,
  comme des pages web, des fichiers audio, des s&eacute;quences vid&eacute;o, documents word ou des
  animations flash. N'importe quel type de fichier peut &ecirc;tre d&eacute;pos&eacute; dans votre cours
  et stock&eacute; sur le serveur. Sur le serveur, vous pourrez alors les d&eacute;placer, les renommer,
  les modifier ou les supprimer.</p>
  <p>Toutes ces op&eacute;rations se font &agrave; partir du lien <strong>Fichiers...</strong>
  de votre menu Administration. Le gestionnaire de fichiers ressemble &agrave; cela&nbsp;:</p>
  <p align="center"><img src="pix/files.jpg" width="400" height="347"></p>
  <p>&nbsp;</p>
  <p>Cette interface n'est accessible que pour les enseignants. Les &eacute;tudiants ne
  peuvent pas y acc&eacute;der. Des fichiers peuvent &ecirc;tre mis &agrave; disposition des &eacute;tudiants en
  temps opportun, en tant que &laquo; ressources &raquo; (voir la section suivante).</p>
  <p>Comme on le voit sur l'illustration, les fichiers sont organis&eacute;s en dans
  des sous-dossiers. Vous pouvez cr&eacute;er autant de sous-dossiers que vous voulez et
  d&eacute;placer vos fichiers de l'un &agrave; l'autre.</p>
  <p>Par l'interface web, il n'est possible pour l'instant que de d&eacute;poser un fichier
  &agrave; la fois. Pour t&eacute;l&eacute;charger un grand nombre de fichiers &agrave; la fois (par exemple
  un site web complet), il est pr&eacute;f&eacute;rable de les compresser en un seul fichier &agrave;
  l'aide d'un <strong>programme zip</strong>, de d&eacute;poser le fichier compress&eacute; et
  de le d&eacute;compresser sur le serveur (vous verrez un lien &laquo; D&eacute;compacter &raquo; &agrave;
  c&ocirc;ter des fichiers zip).</p>
  <p>Vous pouvez pr&eacute;visualiser un fichier en cliquant sur son nom. Votre serveur
  web se chargera de l'afficher ou de le t&eacute;l&eacute;charger sur votre ordinateur.</p>
  <p>Les fichiers HTML et texte peuvent &ecirc;tre modifi&eacute;s directement en ligne.
  Les autres types de fichiers peuvent &ecirc;tre modifi&eacute;s sur votre ordinateur et
  d&eacute;pos&eacute;s &agrave; nouveau sur le serveur. Si vous d&eacute;posez un fichier de m&ecirc;me nom qu'un
  fichier d&eacute;j&agrave; en place sur le serveur, ce dernier sera automatiquement
  remplac&eacute;.</p>
  <p>Un dernier mot&nbsp;: si vos fichiers sont d&eacute;j&agrave; en ligne sur le web, il
  n'est pas n&eacute;cessaire de d&eacute;poser vos fichiers. Vous pouvez les lier directement
  depuis votre cours (voir le module &laquo; Ressources &raquo; et la section suivante).</p>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="activities"></a>Mettre en place des activit&eacute;s</h3>
<blockquote> 
  <p>La mise en place d'un cours comprend l'ajout d'activit&eacute;s &agrave; ce cours. Ces
  activit&eacute;s devront &ecirc;tre utilis&eacute;es par les &eacute;tudiants dans l'ordre o&ugrave; elles sont
  d&eacute;pos&eacute;es, ou dans n'importe quel ordre.</p>
  <p>Pour passer en mode &laquo; &eacute;dition &raquo;, cliquer sur &laquo; Activer le mode d'&eacute;dition &raquo;.
  Cela affichera les commandes suppl&eacute;mentaires qui vous permettront de modifier
  la page principale de votre cours. La premi&egrave;re illustration de cette page (cours
  en format hebdomadaire) vous montre les commandes d'&eacute;dition activ&eacute;es.</p>
  <p>Pour ajouter une nouvelle activit&eacute;, il vous suffit de s&eacute;lectionner la semaine,
  le th&egrave;me ou le forum que vous voulez modifier, et de choisir le type
  d'activit&eacute; &agrave; partir du menu d&eacute;roulant : ressource, devoir, forum, sondage,
  test. Voici une liste de toutes les activit&eacute;s fournie en standard dans Moodle
  1.0&nbsp;: </p>
  <dl>
    <dt><strong>Devoir</strong></dt>
    <dd>Un devoir est une activit&eacute; o&ugrave; vous sp&eacute;cifiez une t&acirc;che &agrave; effectuer, avec
    une date limite et une note maximale. Les &eacute;tudiants pourront d&eacute;poser un
    fichier contenant le fruit de leur travail. La date et l'heure du d&eacute;p&ocirc;t
    du fichier est enregistr&eacute;e. Vous pourrez acc&eacute;der &agrave; une page o&ugrave;
    voir tous les fichiers (et s'ils sont en avance ou en retard), donner une
    note et &eacute;crire un commentaire. Une demi-heure apr&egrave;s que vous avez mis
    une note, Moodle enverra automatiquement &agrave; l'&eacute;tudiant une notification par
    courriel.</dd>
    <br />
    <br />
    <dt><strong>Sondage</strong></dt>
    <dd>Un sondage fonctionne tr&egrave;s simplement&nbsp;: vous posez une question et indiquez
    un certain nombre de r&eacute;ponses possibles. Les &eacute;tudiants font leur choix et
    l'ensemble des r&eacute;sultats est visible sur une seule page. On peut l'utiliser par
    exemple pour des sondages rapides ou pour des votes de classes.</dd>
    <br />
    <br />
    <dt><strong>Forum</strong></dt>
    <dd>Ce module est de loin le plus important. c'est l&agrave; que toutes les discussions
    ont lieu. Chaque fois que vous ajoutez un forum, vous pouvez choisir entre 
    diff&eacute;rents types&nbsp;: discussion sur un th&egrave;me, discussion g&eacute;n&eacute;rale (plusieurs
    th&egrave;mes) et une discussion pour chaque participant.</dd>
    <br />
    <br />
    <dt><strong>Journal</strong></dt>
    <dd>Chaque activit&eacute; de type journal compose une entr&eacute;e dans le journal complet
    du cours. Vous pouvez y indiquer une question ouverte pour faciliter les
    contributions des &eacute;tudiants, ainsi qu'un laps de temps o&ugrave; le journal est
    ouvert (seulement pour le format de cours hebdomadaire). Une bonne politique consiste
    &agrave; cr&eacute;er un journal par semaine. Encouragez vos &eacute;l&egrave;ves &agrave; y &eacute;crire
    avec un esprit critique sur leur processus d'apprentissage, puisqu'ils ne
    sont accessibles que par l'enseignant et eux-m&ecirc;mes. Plus tard, vous pourrez noter
    et commenter toutes les contributions de la semaine ou du th&egrave;me, et les &eacute;tudiants
    recevront automatiquement un courriel les informant de votre feedback. Les
    journaux ne sont pas destin&eacute;s &agrave; &ecirc;tre compl&eacute;t&eacute;s sur la dur&eacute;e. Si vous d&eacute;sirez
    cette fonctionnalit&eacute;, ajoutez d'autres activit&eacute;s de type journal.</dd>
    <br />
    <br />
    <dt><strong>Ressource</strong></dt>
    <dd>Les ressources constituent le contenu de votre cours. Chaque ressource peut
    &ecirc;tre un fichier d&eacute;pos&eacute; ou une URL pointant vers un fichier sur l'Internet. Vous
    pouvez aussi entretenir des pages de texte en les tapant directement dans un
    formulaire.</dd>
    <br />
    <br />
    <dt><strong>Test</strong></dt>
    <dd>Ce module vous permet de cr&eacute;er et proposer des tests consistant de questions
    &agrave; choix multiples, de questions vrai-faux ou de questions &agrave; r&eacute;ponses courtes.
    Ces questions sont stock&eacute;es dans une base de donn&eacute;es structur&eacute;e en cat&eacute;gories.
    Elles peuvent &ecirc;tre r&eacute;utilis&eacute;es dans un cours et m&ecirc;me dans d'autres cours. Les
    tests peuvent autoriser une ou plusieurs tentatives. Dans ce dernier cas, chaque
    tentative est automatiquement enregistr&eacute;e, et l'enseignant peut choisir de
    donner un feedback ou d'afficher la bonne r&eacute;ponse. Ce module comprend des
    outils de notation.</dd>
    <br />
    <br />
    <dt><strong>Questionnaire</strong></dt>
    <dd>Le module questionnaire offre quelques instruments vous permettant
    d'&eacute;valuer et de comprendre votre classe. Pour l'instant, les questionnaires inclus
    sont COLLES et ATTLS. Ils peuvent &ecirc;tre propos&eacute;s aux &eacute;tudiants t&ocirc;t dans le
    d&eacute;roulement du cours, comme outil de diagnostic et &agrave; la fin du cours comme
    outil d'&eacute;valuation (dans mes cours, j'en utilise un par semaine).</dd>
  </dl>
  <br />
  <p>Une fois que les activit&eacute;s de votre cours sont en place, vous pouvez les d&eacute;placer
  vers le haut ou le bas en cliquant sur les petites ic&ocirc;nes fl&egrave;ches (<img src="../pix/t/up.gif"
  width="9" height="10"> <img src="../pix/t/down.gif" width="9" height="10">) visibles
  &agrave; c&ocirc;t&eacute; de chacune d'elles. Vous pouvez aussi les supprimer en utilisant l'ic&ocirc;ne en forme
  de croix <img src="../pix/t/delete.gif" width="10" height="10">, ou les modifier en cliquant
  sur l'ic&ocirc;ne <img src="../pix/t/edit.gif" width="10" height="11">.</p>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="course"></a>Lancer le cours</h3>
<blockquote> 
  <p>Voici quelques id&eacute;es et conseils pour mettre en oeuvre votre cours&nbsp;:</p>
  <ol>
    <li>Inscrivez-vous &agrave; tous les forums, de fa&ccedil;on &agrave; recevoir par courriel tous les
    messages&nbsp; vous resterez ainsi bien en contact avec votre classe.</li>
    <li>encouragez tous les &eacute;tudiants &agrave; compl&eacute;ter leur profil utilisateur (avec une
    photo) et lisez-les tous. Cela vous aidera &agrave; mieux comprendre certains de leurs
    travaux et &agrave; leur r&eacute;pondre de fa&ccedil;on ad&eacute;quate.</li>
    <li>Gardez vos remarques personnelles dans le &laquo;&nbsp;<strong>forum des
    enseignants</strong>&nbsp;&raquo; (menu Administration). Cela est particuli&egrave;rement
    utile si vous enseignez en &eacute;quipe.</li>
    <li>Consultez r&eacute;guli&egrave;rement le &laquo;&nbsp;<strong>Journal des &eacute;v&eacute;nements</strong>&nbsp;&raquo;
    (menu Administration) pour avoir la liste compl&egrave;te des visites et actions des
    participants au cours. Vous y verrez un lien ouvrant une fen&ecirc;tre montrant l'activit&eacute;
    de l'heure pass&eacute;e et qui se met &agrave; jour chaque minute. En gardant ouverte cette fen&ecirc;tre,
    vous pourrez suivre en temps r&eacute;el l'activit&eacute; du cours.</li>
    <li>Utilisez le &laquo;&nbsp;<strong>Journal d'activit&eacute;</strong>&nbsp;&raquo; (accessible depuis
    le profil de chaque utilisateur). Il fournit une vue compl&egrave;te et d&eacute;taill&eacute;e 
    de l'activit&eacute; d'un participant dans un cours.</li>
    <li>R&eacute;pondez rapidement aux &eacute;tudiants. Faites-le tout de suite ! C'est une condition
    essentielle &agrave; l'&eacute;tablissement d'un sentiment d'appartenance &agrave; une communaut&eacute;
    d'apprentissage et au succ&egrave;s de votre cours. En outre, vous risquez sans cela
    d'&ecirc;tre submerg&eacute; par les messages.</li>
  </ol>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="further"></a>Informations compl&eacute;mentaires</h3>
<blockquote> 
  <p>Si vous rencontrez des difficult&eacute;s avec votre site, veuillez contacter l'administrateur
  local du site.</p>
  <p>Si vous avez de bonnes id&eacute;es pour am&eacute;liorer Moodle, ou si vous avez de bonnes
  exp&eacute;riences &agrave; partager, venez sur <a href="http://moodle.org/"
  target="_top">moodle.org</a> et rejoignez-nous dans le cours &laquo;&nbsp;<a
  href="http://moodle.org/course/view.php?id=5" target="_top">Using Moodle</a>&nbsp;&raquo;.
  Nous serons heureux de vous &eacute;couter, et vous pourrez ainsi nous aider &agrave;
  am&eacute;liorer Moodle.</p>
  <p>Si vous voulez collaborer au codage de nouveaux modules, &eacute;crire de la documentation
  ou des articles, contactez-moi&nbsp;: <a href="http://moodle.org/user/view.php?id=1&amp;course=1"
  target="_top">Martin Dougiamas</a> ou visitez le site r&eacute;pertoriant les bogues de Moodle
  (bug tracker), &agrave; l'adresse <a href="http://moodle.org/bugs/" target="_top">moodle.org/bugs</a>.</p>
  <p>N'oubliez pas d'utiliser les ic&ocirc;nes d'aide. Voici une <a target="helpwindow"
  href="../help.php?file=index.html">liste de tous les fichiers d'aide</a> de Moodle.</p>
  <p align="center">Nous vous remercions d'utiliser Moodle - et bonne chance pour vos cours&nbsp;!</p>
  <hr>
  <p>&nbsp;</p>
</blockquote>
<p align="center"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>
<p align="center"><font size="1">Version: $Id$</font></p>
</body>
