<!-- Ce fichier est en cours de traduction. Il sera mis &agrave; jour petit &agrave; petit -->
<head>
<title>Documentation Moodle : Manuel de l'enseignant</title>
<link rel="stylesheet" href="docstyles.css" type="text/css">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#ffffff">
<h1>Manuel de l'enseignant</h1>
<p>Cette page est un guide rapide &agrave; la cr&eacute;ation de cours en ligne avec Moodle.
Il d&eacute;crit les fonctions principales &agrave; disposition, ainsi que quelques-unes des
d&eacute;cisions que vous serez amener &agrave; prendre.</p>
<p>Sections de ce document :</p>
<ol>
  <li><a href="#started">Pour commencer</a></li>
  <li><a href="#settings">Configurer le cours</a></li>
  <li><a href="#upload">D&eacute;poser des fichiers</a></li>
  <li><a href="#activities">Mettre en place des activit&eacute;s</a></li>
  <li><a href="#course">Lancer le cours</a></li>
  <li><a href="#further">Informations compl&eacute;mentaires</a></li>
</ol>
<h3 class="sectionheading"><a name="started"></a>Pour commencer</h3>
<blockquote> 
  <p>Ce document pr&eacute;suppose que l'administrateur de votre site a configur&eacute;
  Moodle et vous a donn&eacute; un cours vide avec lequel vous pouvez commencer &agrave;
  travailler. Il part aussi de l'id&eacute;e que vous vous &ecirc;tes connect&eacute; dans votre
  cours avec votre compte d'enseignant.</p>
  <p>Voici trois conseils qui vous aideront &agrave; commmencer le travail avec Moodle.</p>
  <ol>
    <li><strong>N'ayez pas peur d'exp&eacute;rimenter&nbsp;:</strong>
      <blockquote>explorez votre cours et faites-y des modifications. Il est difficile
      de casser quoi que ce soit dans un cours Moodle, et m&ecirc;me dans ce cas, il est 
      facile de corriger le probl&egrave;me.
    </blockquote>
    <li><strong>Rep&eacute;rez et utilisez ces petites ic&ocirc;nes</strong>&nbsp;: 
      <blockquote> 
        <p>&nbsp;<img src="../pix/i/edit.gif"> - l'<strong>ic&ocirc;ne de modification</strong> 
        vous permet de modifier l'&eacute;l&eacute;ment &agrave; c&ocirc;t&eacute; duquel elle est plac&eacute;e.</p>
        <p><img src="../pix/help.gif" width="22" height="17"> - l'<strong>ic&ocirc;ne
        d'aide</strong> ouvre une fen&ecirc;tre avec un texte d'aide.</p>
        <p>&nbsp;<img src="../pix/i/hide.gif" width="16" height="16"> - l'<strong>ic&ocirc;ne
        oeil ouvert</strong> vous permet de cacher des &eacute;l&eacute;ments aux &eacute;tudiants.</p>
        <p>&nbsp;<img src="../pix/i/show.gif" width="16" height="16"> - l'<strong>ic&ocirc;ne
        oeil ferm&eacute;</strong> vous permet de rendre disponible un &eacute;l&eacute;ment cach&eacute;.</p>
      </blockquote>
    </li>
    <li><strong>Utilisez la barre de navigation au haut de chaque page</strong>&nbsp;:
	  <blockquote>elle vous aidera &agrave; vous rappeler o&ugrave; vous vous trouvez et
	  vous &eacute;vitera de vous perdre dans le site.
      </blockquote>
    </li>
  </ol>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="settings"></a>Configurer le cours</h3>
<blockquote> 
  <p>La premi&egrave;re chose &agrave; faire est de regarder l'espace &laquo; administration &raquo; de votre
  page de cours et de cliquer sur &laquo; <strong>param&egrave;tres...</strong> &raquo; (ce lien, ainsi
  que toute la section d'administration, ne sont accessibles que par vous et par
  l'administrateur de site. Les &eacute;tudiants ne verront pas ces liens).</p>
  <p>Sur la page des param&egrave;tres, vous pouvez changer un certain nombre de r&eacute;glages
  pour votre cours : nom, clef d'acc&egrave;s, date du d&eacute;but, etc. Nous ne parlerons pas de
  tout cela ici, car en cliquer sur l'ic&ocirc;ne d'aide vous aurez des explications
  d&eacute;taill&eacute;es. Nous allons parler du r&eacute;glage le plus important, le &laquo; <strong>format
  du cours</strong> &raquo;.</p>
  <p>Le format de cours que vous choisirez d&eacute;terminera la disposition de base et la
  structure de votre cours. La version 1.0 de Moodle offre trois formats - il y en aura
  beaucoup d'autres &agrave; l'avenir (merci d'envoyer vos id&eacute;es &agrave;
  <a href="mailto:martin@moodle.org">martin@moodle.org</a> !)</p>
  <p>Voici des copies d'&eacute;crans de trois cours dans chacun de ces trois formats (ne
  faites pas attention aux couleurs, qui sont d&eacute;termin&eacute;es par l'administrateur pour
  tout le site).</p>
  <p align="center"><strong>Format hebdomadaire :</strong></p>
  <p align="center"><img src="pix/weekly.jpg" width="570" height="527"></p>
  <p align="center">&nbsp;</p>
  <p align="center"><strong>Format en chapitres :</strong></p>
  <p align="center"><img src="pix/topics.jpg" width="570" height="463"></p>
  <p align="center">&nbsp;</p>
  <p align="center"><strong>Format informel :</strong></p>
  <p align="center"><img src="pix/social.jpg" width="570" height="429"></p>
  <p>&nbsp;</p>
  <p>Notez que le format hebdomadaire et les formats en chapitres sont tr&egrave;s semblables
  du point de vue de leur structure. La diff&eacute;rence principale est que dans le format
  hebdomadaire, chaque bo&icirc;te couvre exactement une semaine, tandis que dans le format
  en chapitres, chaque bo&icirc;te peut correspondre &agrave; une p&eacute;riode de votre choix, plus
  courte ou plus longue. Le format informel est par contre tr&egrave;s diff&eacute;rent&nbsp;: il est 
  construit autour d'un forum, qui est affich&eacute; sur la page principale du cours.</p>
  <p>Pour plus de d&eacute;tails, cliquez sur les boutons d'aide de la page de configuration
  du cours.</p>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="upload"></a>D&eacute;poser des fichiers</h3>
<blockquote> 
  <p>Vous pouvez ajouter &agrave; votre cours des documents &eacute;lectroniques en votre possession,
  comme des pages web, des fichiers audio, des s&eacute;quences vid&eacute;o, documents word ou des
  animations flash. N'importe quel type de fichier peut &ecirc;tre d&eacute;pos&eacute; dans votre cours
  et stock&eacute; sur le serveur. Sur le serveur, vous pourrez alors les d&eacute;placer, les renommer,
  les modifier ou les supprimer.</p>
  <p>Toutes ces op&eacute;rations se font par lien <strong>Fichiers...</strong> de votre menu
  Administration. Le gestionnaire de fichiers ressemble &agrave; cela&nbsp;:</p>
  <p align="center"><img src="pix/files.jpg" width="400" height="347"></p>
  <p>&nbsp;</p>
  <p>Cette interface n'est accessible que pour les enseignants. Les &eacute;tudiants ne
  peuvent pas y acc&eacute;der. Des fichiers peuvent &ecirc;tre mis &agrave; disposition des &eacute;tudiants en
  temps opportun, en tant que &laquo; ressources &raquo; (voir la section suivante).</p>
  <p>Comme on le voit sur l'illustration, les fichiers sont organis&eacute;s en dans
  des sous-dossiers. Vous pouvez cr&eacute;er autant de sous-dossiers que vous voulez et
  d&eacute;placer vos fichiers de l'un &agrave; l'autre.</p>
  <p>Par l'interface web, il n'est possible pour l'instant que de d&eacute;poser un fichier
  &agrave; la fois. Pour t&eacute;l&eacute;charger un grand nombre de fichiers &agrave; la fois (par exemple
  un site web complet), il est pr&eacute;f&eacute;rable de les compresser en un seul fichier &agrave;
  l'aide d'un <strong>programme zip</strong>, de d&eacute;poser le fichier compress&eacute; et
  de le d&eacute;compresser sur le serveur (vous verrez un lien &laquo; D&eacute;compacter &raquo; &agrave;
  c&ocirc;ter des fichiers zip).</p>
  <p>Vous pouvez pr&eacute;visualiser un fichier en cliquant sur son nom. Votre serveur
  web se chargera de les afficher ou de le t&eacute;l&eacute;charger sur votre ordinateur.</p>
  <p>Les fichiers HTML et texte pur peuvent &ecirc;tre modifi&eacute;s directement en ligne.
  Les autres types de fichiers peuvent &ecirc;tre modifi&eacute;s sur votre ordinateur et
  d&eacute;pos&eacute;s &agrave; nouveau sur le serveur. Si vous d&eacute;posez un fichier de m&ecirc;me nom qu'un
  fichier d&eacute;j&agrave; en place sur le serveur, ce dernier sera automatiquement
  remplac&eacute;.</p>
  <p>Un dernier mot&nbsp;: si vos fichiers sont d&eacute;j&agrave; en ligne sur le web, il
  n'est pas n&eacute;cessaire de d&eacute;poser vos fichiers. Vous pouvez les lier directement
  depuis votre cours (voir le module &laquo; Ressources &raquo; et la section suivante).</p>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="activities"></a>Mettre en place des activit&eacute;s</h3>
<blockquote> 
  <p>La mise en place d'un cours comprend l'ajout d'activit&eacute;s &agrave; ce cours. Ces
  activit&eacute;s devront &ecirc;tre utilis&eacute;es par les &eacute;tudiants dans l'ordre o&ugrave; elles sont
  d&eacute;pos&eacute;es, ou dans n'importe quel ordre.</p>
  <p>Pour passer en mode &laquo; &eacute;dition &raquo;, cliquer sur &laquo; Activer le mode d'&eacute;dition &raquo;.
  Cela affichera les commandes suppl&eacute;mentaires qui vous permettront de modifier
  la page principale de votre cours. La premi&egrave;re illustration de cette page (cours
  en format hebdomadaire) vous montre les commandes d'&eacute;dition activ&eacute;es.</p>
  <p>Pour ajouter une nouvelle activit&eacute;, il vous suffit de s&eacute;lectionner la semaine,
  le chapitre ou le forum que vous voulez modifier, et de choisir le type
  d'activit&eacute; &agrave; partir du menu d&eacute;roulant : ressource, devoir, forum, sondage,
  test. Voici une liste de toutes les activit&eacute;s fournie en standard dans Moodle
  1.0&nbsp;: </p>
  <dl>
    <dt><strong>Devoir</strong></dt>
    <dd>Un devoir est une activit&eacute; o&ugrave; vous sp&eacute;cifiez une t&acirc;che &agrave; effectuer, avec
    une date limite et une note maximale. Les &eacute;tudiants pourront d&eacute;poser un
    fichier contenant le fruit de leur travail. La date et l'heure du d&eacute;p&ocirc;t
    du fichier est enregistr&eacute;e. Vous pourrez acc&eacute;der &agrave; une page o&ugrave;
    voir tous les fichiers (et s'ils sont en avance ou en retard), et de donner une
    note et d'&eacute;crire un commentaire. Une demi-heure apr&egrave;s que vous avez mis
    une note, Moodle enverra automatiquement &agrave; l'&eacute;tudiant une notification par
    e-mail.</dd>
    <br />
    <br />
    <dt><strong>Sondage</strong></dt>
<!-- Le reste doit encore &ecirc;tre traduit -->
    <dd>A choice activity is very simple - you ask a question and specify a choice 
      of responses. Students can make their choice, and you have a report screen 
      where you can see the results. I use it to gather research consent from 
      my students, but you could use it for quick polls or class votes.</dd>
    <br />
    <br />
    <dt><strong>Forum</strong></dt>
    <dd>This module is by far the most important - it is here that discussion 
      takes place. When you add a new forum, yu will presented with a choice of 
      different types - a simple single-topic discussion, a free-for-all general 
      forum, or a one-discussion-thread-per-user.</dd>
    <br />
    <br />
    <dt><strong>Journal</strong></dt>
    <dd>Each journal activity is an entry in the whole course journal. For each 
      one you can specify an open-ended question that guides what students write, 
      as well as a window of time in which the journal is open (weekly course 
      format only). A general rule of thumb is to create one journal per week. 
      Encourage students to write reflectively and critically in these journals, 
      as they are only available to them and you. Afterwards, you will be able 
      to grade and comment all the entries for that week or topic, and students 
      will receive an automatic email informing them of your feedback. Journals 
      are not designed to be continually added to - if you need to do that then 
      add more journal activities.</dd>
    <br />
    <br />
    <dt><strong>Ressource</strong></dt>
    <dd>Resources are the content of your course. Each resource can be any file 
      you have uploaded or can point to using a URL. You can also maintain simple 
      text-based pages by typing them directly into a form.</dd>
    <br />
    <br />
    <dt><strong>Test</strong></dt>
    <dd>This module allows you to design and set quiz tests, consisting of multiple 
      choice, true-false, and short answer questions. These questions are kept 
      in a categorised database, and can be re-used within courses and even between 
      courses. Quizzes can allow multiple attempts. Each attempt is automatically 
      marked, and the teacher can choose whether to give feedback or to show correct 
      answers. This module includes grading facilities. </dd>
    <br />
    <br />
    <dt><strong>Questionnaire</strong></dt>
    <dd>The survey module provides a number of predefined survey instruments that 
      are useful in evaluating and understanding your class. Currently they include 
      the COLLES and the ATTLS instruments. They can be given to students early 
      in the course as a diagnostic tool and at the end of the course as an evaluation 
      tool (I use one every week in my courses).</dd>
  </dl>
  <br />
  <p>After adding your activities you can move them up and down in your course 
    layout by clicking on the little arrow icons (<img src="../pix/t/up.gif" width="9" height="10"> 
    <img src="../pix/t/down.gif" width="9" height="10">) next to each one. You 
    can also delete them using the cross icon <img src="../pix/t/delete.gif" width="10" height="10">, 
    and re-edit them using the edit icon <img src="../pix/t/edit.gif" width="10" height="11">.</p>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="course"></a>Lancer le cours</h3>
<blockquote> 
  <p>There are some big plans to extend this document into a more comprehensive 
    tutorial. Until then here are a few ideas:</p>
  <ol>
    <li>Subscribe yourself to all the forums so you keep in touch with your class 
      activity. </li>
    <li>Encourage all the students fill out their user profile (including photos) 
      and read them all - this will help provide some context to their later writings 
      and help you to respond in ways that are tailored to their own needs.</li>
    <li>Keep notes to yourself in the private "<strong>Teacher's Forum</strong>" 
      (under Administration). This is especially useful when team teaching.</li>
    <li>Use the "<strong>Logs</strong>" link (under Administration) 
      to get access to complete, raw logs. In there you'll see a link to a popup 
      window that updates every sixty seconds and shows the last hour of activity. 
      This is useful to keep open on your desktop all day so you can feel in touch 
      with what's going on in the course.</li>
    <li>Use the "<strong>Activity Reports</strong>" (next to each name 
      in the list of all people, or from any user profile page). These provide 
      a great way to see what any particular person has been up to in the course.</li>
    <li>Respond quickly to students. Don't leave it for later - do it right away. 
      Not only is it easy to become overwhelmed with the volume that can be generated, 
      but it's a crucial part of building and maintaining a community feel in 
      your course.</li>
  </ol>
  <p>&nbsp;</p>
</blockquote>
<h3 class="sectionheading"><a name="further"></a>Informations compl&eacute;mentaires</h3>
<blockquote> 
  <p>If you have any particular problems with your site, you should contact your 
    local site administrator.</p>
  <p>If you have some great ideas for improvements to Moodle, or even some good 
    stories, come over to <a href="http://moodle.org/" target="_top">moodle.org</a> 
    and join us in the course called "<a href="http://moodle.org/course/view.php?id=5" target="_top">Using 
    Moodle</a>". We'd love to hear from you, and you can help Moodle improve.</p>
  <p>If you want to contribute to coding new modules, or writing documentation, 
    or papers, contact me: <a href="http://moodle.org/user/view.php?id=1&amp;course=1" target="_top">Martin 
    Dougiamas</a> or browse the "bug tracker" site for Moodle, at <a href="http://moodle.org/bugs/" target="_top">moodle.org/bugs</a></p>
  <p align="center">Thanks for using Moodle - and good luck with your teaching!</p>
  <hr>
  <p>&nbsp;</p>
</blockquote>
<p align="center"><font size="1"><a href="." target="_top">Documentation Moodle</a></font></p>
<p align="center"><font size="1">Version: $Id: teacher.html,v 1.4 2002/08/18 10:00:01 
  martin Exp $</font></p>
</body>
