<h2>&Uacute;s del Wiki</h2>
<p>
El wiki de Moodle est&agrave; basat en
l'<a href="http://erfurtwiki.sourceforge.net/?id=ErfurtWiki" target="_blank">ErfurtWiki</a>,
que &eacute;s una implementaci&oacute; del sistema hipertext
<a href="http://c2.com/cgi/wiki?WikiWikiWeb" target="_blank">WikiWikiWeb</a>. Permet una edici&oacute; i creaci&oacute; col&middot;laborativa senzilla de p&agrave;gines web.</p>
<p>
<ul>
<li>apreneu a <a href="#createpages">crear p&agrave;gines</a></li>
<li>feu clic en <img src="pix/t/edit.gif"> o seleccioneu "Edita aquest p&agrave;gina" en el men&uacute; desplegable per modificar el contingut d'una p&agrave;gina</li>
<li>podeu formatar les p&agrave;gines amb <a href="#wikimarkup">marques wiki</a> o amb HTML (si el wiki est&agrave; configurat aix&iacute;)</li>
<li>cerqueu p&agrave;gines o aneu a la llista de novetats</li>
<li>tamb&eacute; hi ha llistes de les p&agrave;gines m&eacute;s visitades, les que s'actualitzen m&eacute;s sovint i les que s'han actualitzat m&eacute;s recentment</li>
</ul>
</p>
<p>
<a name="createpages"></a><b>Crear p&agrave;gines</b>:<br />
Una p&agrave;gina es crea donant-li nom dins del text d'una altra p&agrave;gina existent. El nom d'una p&agrave;gina wiki fa servir l'anomenat <a href="#camelcase">CamelCase</a> o si no es posa entre claud&agrave;tors [ ].</p>
<p>
Per exemple:
<ul>
<li>P&agrave;ginaWiki (CamelCase)</li>
<li>[P&agrave;gina Wiki] (entre claud&agrave;tors)</li>
</ul></p>
<p>
El text que hagi rebut un nom de p&agrave;gina wiki portar&agrave; un interrogant '?' darrere. Fent clic en l'interrogant '?' entreu en el mode d'edici&oacute; d'aquesta p&agrave;gina. Escriviu el vostre text, el deseu i ja teniu una nova p&agrave;gina wiki.</p>
<p><a name="wikimarkup"></a><b>Marques wiki</b>:<br />
Totes les p&agrave;gines d'un wiki es poden formatar f&agrave;cilment utilitzant marques wiki.
</p>
<h4>Par&agrave;grafs</h4>
  <ul>
  <li>separeu els par&agrave;grafs per mitj&agrave; de l&iacute;nies en blanc</li>
  <li>uilitzeu tres signes de percentatge %%% per for&ccedil;ar un salt de l&iacute;nia</li>
  <li>si poseu espais o tabuladors al comen&ccedil;ament d'una l&iacute;nia, el text se sagnar&agrave;</li>
  </ul>

<h4>!! Encap&ccedil;alaments</h4>

  <ul type="circle">
  <li> utilitzeu un signe d'admiraci&oacute; ! al comen&ccedil;ament de la l&iacute;nia per crear un encap&ccedil;alament de mida petita</li>

  <li> !! m&eacute;s gran</li>
  <li> !!! la mida m&eacute;s gran</li>
  </ul>

<h4>Estils</h4>

  <ul>

  <li>si voleu <em>emfasitzar</em> el text, poseu-lo entre cometes simples '' (generalment es visualitza en lletra it&agrave;lica)</li>
  <li>la <strong>negreta</strong> s'aconsegueix amb dos car&agrave;cters de subratllat __ (o amb asteriscos **)</li>
  <li>poseu el <big>text gran</big> entre car&agrave;cters ##</li>
  <li>podeu aconseguir <small>text petit</small> usant "&micro;&micro;"</li>
  <li>una <tt>p&ograve;lissa tipus m&agrave;quina d'escriure</tt> s'obt&eacute; posant el text entre dos iguals ==</li>
  </ul>

<h4>Llistes</h4>

  <ul>
  <li> comenceu cada l&iacute;nia amb un asterisc * per crear una llista</li>
  <li> utilitzeu # per a llistes numerades
    <ol>
    <li>podeu crear subllistes</li>

    <li> els &iacute;tems de llistes subseg&uuml;ents han de comen&ccedil;ar amb la mateixa combinaci&oacute; d'* i #</li>
    </ol>
  </li>
  </ul>

<h4>Hiperenlla&ccedil;os</h4>

  <ul>

  <li>escriviu un MotWiki dins del text per crear un nou hiperenlla&ccedil;</li>
  <li>poseu uns mots [entre claud&agrave;tors] per crear un hiperenlla&ccedil; que no sigui un MotWiki</li>

  <li>qualsevol adre&ccedil;a web v&agrave;lida (que comenci amb http:/) com ara  http://www.google.com/ es convertir&agrave; en un enlla&ccedil; autom&agrave;ticament</li>
  <li>poseu una adre&ccedil;a web o un WikiLink entre claud&agrave;tors i assigneu-li un t&iacute;tol entre cometes o amb el car&agrave;cter |
    <ul>
    <li> [t&iacute;tol | http://www.google.com]</li>
    <li> [MotWiki "t&iacute;tol"] or ["t&iacute;tol" WikiLink]    </li>
    </ul>
  </li>
  <li>si no voleu que un MotWiki o una adre&ccedil;a web http:// (o [quelcom] que vagi entre claud&agrave;tors) es converteixi en un enlla&ccedil;, poseu davant un signe d'admiraci&oacute; o una titlla:
    <ul>
    <li> !NoEnlla&ccedil;, ~NoEnlla&ccedil;/li>
    <li> ![no enlla&ccedil;], !http://noenlla&ccedil;.org/    </li>

    </ul>
  </li>
  </ul>

<h4> Tables with |</h4>
<table cellpadding="2" border="1" cellspacing="0">
<tr>
<td> poseu el text </td>
<td> entre car&agrave;cters </td>
<td> de tra&ccedil; vertical </td>
</tr><tr>
<td> per construir </td>
<td> una estructura de taula  </td>
</tr><tr>
<td> els navegadors normalment </td>
<td> ignoren les cel&middot;les </td>
<td> que falten </td>
</tr>
</table>


<p>
Si us plau deixeu sempre una l&iacute;nia en blanc abans de la taula i una altra despr&eacute;s per separar-la dels par&agrave;grafs adjacents.
</p>

<h4>Imatges</h4>

  <ul>

  <li>per incloure una imatge dins d'una p&agrave;gina, poseu la seva adre&ccedil;a entre claud&agrave;tors: [http://www.example.com/pics/image.png] </li>
  <li>alternativament podeu fer servir la funci&oacute; de c&agrave;rrega d'imatges</li>
  </ul>

<h4>M&eacute;s informaci&oacute;</h4>
El llenguatge de marques del Wiki ofereix m&eacute;s possibilitats. Si us plau consulteu l'<a href="http://erfurtwiki.sourceforge.net" target=_new>Erfurt Wiki Homepage</a> per trobar m&eacute;s informaci&oacute;.

<p>
<a name="camelcase"></a><b>Camel Case</b>:<br />
El CamelCase (lletres camell) descriu l'aparen&ccedil;a dels MotsWiki: mots junts, sense espais, separats per maj&uacute;scules inicials. La combinaci&oacute; de maj&uacute;scules i min&uacute;scules sembla els geps d'un camell.</p>
<p>
Aquesta manera de posar noms fa que els puristes de l'idioma odien els Wikis, per&ograve; &eacute;s molt com&uacute; en el m&oacute;n de la inform&agrave;tica i la usen la majoria dels  
programadors.</p>


