<P ALIGN=CENTER><B>&Uacute;s del Wiki</B></P>
<p>
<br>

El Wiki &eacute;s una plataforma per a treballar plegats en la construcci&oacute; de p&agrave;gines web. Els principis s&oacute;n simples.
<br><br>

<ul>
<li>Alg&uacute; escriu un text i el desa.</li>
<li>M&eacute;s tard, una altra persona llegeix aquest text i pensa que es podrien fer certs canvis i afegir algunes coses. Fa clic al bot&oacute; "Edita" i modifica la p&agrave;gina. </li>
<li>Quan desa la nova versi&oacute;, aquesta est&agrave; disponible per a tothom.</li><br>    <br>
</ul>

Amb un wiki, tamb&eacute;s es pot afegir f&agrave;cilment una p&agrave;gina nova o un enlla&ccedil; a p&agrave;gines existents.
<br><br>

<ul>
<li>Un ella&ccedil; es crea per mitj&agrave; d'un MotWiki. Aix_ &eacute;s un mot amb almenys dues lletres maj&uacute;scules. Si ja existia una p&agrave;gina amb aquest nom, es crear&agrave; un enlla&ccedil; autom&agrave;ticament. Si no, es visualitza un signe d'interrogaci&oacute;.</li>
<li>Fent clic en aquest interrogant es crea una p&agrave;gina nova en blanc amb aquest nom que es pot editar.</li>
</ul>
<br><br>


<P ALIGN=CENTER><B><br>
Regles de formatatge del wiki</B></P>
<p>


<h4>Par&agrave;grafs</h4>
  <ul>
  <li>separeu els par&agrave;grafs per mitj&agrave; de l&iacute;nies en blanc</li>
  <li>uilitzeu tres signes de percentatge %%% per for&ccedil;ar un salt de l&iacute;nia</li>
  <li>si poseu espais o tabuladors al comen&ccedil;ament d'una l&iacute;nia, el text se sagnar&agrave;</li>
  </ul>

<h4>!! Encap&ccedil;alaments</h4>

  <ul type="circle">
  <li> utilitzeu un signe d'admiraci&oacute; ! al comen&ccedil;ament de la l&iacute;nia per crear un encap&ccedil;alament de mida petita</li>

  <li> !! m&eacute;s gran</li>
  <li> !!! la mida m&eacute;s gran</li>
  </ul>

<h4>Estils</h4>

  <ul>

  <li>si voleu <em>emfasitzar</em> el text, poseu-lo entre cometes simples '' (generalment es visualitza en lletra it&agrave;lica)</li>
  <li>la <strong>negreta</strong> s'aconsegueix amb dos car&agrave;cters de subratllat __ (o amb asteriscos **)</li>
  <li>poseu el <big>text gran</big> entre car&agrave;cters ##</li>
  <li>podeu aconseguir <small>text petit</small> usant "&micro;&micro;"</li>
  <li>una <tt>p&ograve;lissa tipus m&agrave;quina d'escriure</tt> s'obt&eacute; posant el text entre dos iguals ==</li>
  </ul>

<h4>Llistes</h4>

  <ul>
  <li> comenceu cada l&iacute;nia amb un asterisc * per crear una llista</li>
  <li> utilitzeu # per a llistes numerades
    <ol>
    <li>podeu crear subllistes</li>

    <li> els &iacute;tems de llistes subseg&uuml;ents han de comen&ccedil;ar amb la mateixa combinaci&oacute; d'* i #</li>
    </ol>
  </li>
  </ul>

<h4>Hiperenlla&ccedil;os</h4>

  <ul>

  <li>escriviu un MotWiki dins del text per crear un nou hiperenlla&ccedil;</li>
  <li>poseu uns mots [entre claud&agrave;tors] per crear un hiperenlla&ccedil; que no sigui un MotWiki</li>

  <li>qualsevol adre&ccedil;a web v&agrave;lida (que comenci amb http:/) com ara  http://www.google.com/ es convertir&agrave; en un enlla&ccedil; autom&agrave;ticament</li>
  <li>poseu una adre&ccedil;a web o un WikiLink entre claud&agrave;tors i assigneu-li un t&iacute;tol entre cometes o amb el car&agrave;cter |
    <ul>
    <li> [t&iacute;tol | http://www.google.com]</li>
    <li> [MotWiki "t&iacute;tol"] or ["t&iacute;tol" WikiLink]    </li>
    </ul>
  </li>
  <li>si no voleu que un MotWiki o una adre&ccedil;a web http:// (o [quelcom] que vagi entre claud&agrave;tors) es converteixi en un enlla&ccedil;, poseu davant un signe d'admiraci&oacute; o una titlla:
    <ul>
    <li> !NoEnlla&ccedil;, ~NoEnlla&ccedil;/li>
    <li> ![no enlla&ccedil;], !http://noenlla&ccedil;.org/    </li>

    </ul>
  </li>
  </ul>

<h4> Taules amb |</h4>
| poseu el text | entre car&agrave;cters | de tra&ccedil; vertical | <br>
| per construir | una estructura de taula | <br>
| els navegadors normalment | ignoren les cel&middot;les | que falten | <br>


<p>
Si us plau deixeu sempre una l&iacute;nia en blanc abans de la taula i una altra despr&eacute;s per separar-la dels par&agrave;grafs adjacents.
</p>

<h4>Imatges</h4>

  <ul>

  <li>per incloure una imatge dins d'una p&agrave;gina, poseu la seva adre&ccedil;a entre claud&agrave;tors: [http://www.example.com/pics/image.png] </li>
  <li>alternativament podeu fer servir la funci&oacute; de c&agrave;rrega d'imatges</li>
  </ul>

<h4>M&eacute;s informaci&oacute;</h4>
El llenguatge de marques del Wiki ofereix m&eacute;s possibilitats. Si us plau consulteu l'<a href="http://erfurtwiki.sourceforge.net" target=_new>Erfurt Wiki Homepage</a> per trobar m&eacute;s informaci&oacute;.

