<p align="center"><b>Valoracions</b></p>

<p>Cada missatge es pot valorar utilitzant una escala basada en la <b>teoria del coneixement separat i connectat</b>.</p>

<p>Aquesta teoria us pot ajudar a veure les interaccions humanes d'una altra manera. Descriu dues formes diferents d'avaluar i aprendre sobre les coses que veiem i sentim.</p>

<p>Tot i que cadascun de nosaltres utilitzem aquests dos m&egrave;todes en diferent mesura en diferents ocasions, pot ser &uacute;til com a exemple per entendre'ns imaginar dues persones, una que sigui majorit&agrave;riament un coneixedor separat, en Joan, i l'altra que sigui majorment una coneixedora connectada, la Maria.</p>

<ul>
  <li>En Joan prefereix romandre tan 'objectiu' com sigui possible, sense permetre que intervinguin sentiments ni emocions. En una discussi&oacute; amb altres persones que tenen idees diferents, a ell li agrada defendre les seves idees i usar la l&ograve;gica per trobar escletxes en les idees dels oponents. &Eacute;s cr&iacute;tic amb les idees noves mentre no siguin fets provats per fonts respectables, com ara llibres de text, professors prestigiosos o b&eacute; la seva experi&egrave;ncia directa. En Joan &eacute;s tot un exemple de <b>coneixedor separat.</b></li>
  <li>La Maria &eacute;s m&eacute;s sensible a les altres persones. Est&agrave; preparada per a l'empatia i tendeix a escoltar i fer preguntes fins que sent que pot connectar i "entendre les coses des de l'altre punt de vista". Apr&egrave;n provant a compartir les experi&egrave;ncies que menen als coneixements de les altres persones. Quan parla amb altres evita la confrontaci&oacute; i molt sovint prova d'ajudar-los si pot veure la manera de fer-ho, usant suggeriments l&ograve;gics. La Maria &eacute;s un bon exemple de <b>coneixedora connectada.</b></li>
</ul>

<p>Us heu fixat que el coneixedor separat &eacute;s home i la connectada &eacute;s dona? Alguns estudis han mostrat que estad&iacute;sticament sol ser aix&iacute;, tot i que hi ha casos individuals en tot l'espectre que va entre aquests dos extrems.</p>

<p>Per a un grup d'aprenents efectiu i col&middot;laboratiu, seria ideal que tothom fos capa&ccedil; d'usar AMBDUES maneres de con&egrave;ixer.</p>

<p>En una situaci&oacute; concreta com un f&ograve;rum electr&ograve;nic, una intervenci&oacute; d'una persona pot mostrar alguna de les dues caracter&iacute;stiques i fins i tot les dues. Alg&uacute; que generalment &eacute;s un bon coneixedor 'connectat' pot fer una intervenci&oacute; molt 'separada', i a l'inrev&eacute;s. L'objectiu de valorar cada missatge per mitj&agrave; d'aquesta escala &eacute;s:</p>

<blockquote>
a) ajudar-vos a pensar sobre aquestes q&uuml;estions quan llegiu altres missatges i b) proporcionar retroacci&oacute; a cada autor sobre com el veuen els altres.
</blockquote>

<p>Els resultats no s'utilitzen per avaluar de cap manera els estudiants; simplement serveixen per ajudar a millorar la comunicaci&oacute; i l'aprenentatge.</p>

<hr />

<p>Si hi esteu interessats, aquestes s&oacute;n algunes refer&egrave;ncies d'articles 
dels autors que originalment van desenvolupar aquestes idees:</p>

<ul>
  <li>Belenky, M.F., Clinchy, B.M., Goldberger, N.R., &amp; Tarule, J.M. (1986). 
    Women's ways of knowing: the development of self, voice, and mind. New York, 
    NY: Basic Books.</li>
  <li>Clinchy, B.M. (1989a). The development of thoughtfulness in college women: 
    Integrating reason and care. American Behavioural Scientist, 32(6), 647-657.</li>
  <li>Clinchy, B.M. (1989b). On critical thinking &amp; connected knowing. Liberal 
    education, 75(5), 14-19.</li>
  <li>Clinchy, B.M. (1996). Connected and separate knowing; Toward a marriage 
    of two minds. In N.R. Goldberger, Tarule, J.M., Clinchy, B.M. &amp;</li>
  <li>Belenky, M.F. (Eds.), Knowledge, Difference, and Power; Essays inspired 
    by &ldquo;Women&rsquo;s Ways of Knowing&rdquo; (pp. 205-247). New York, NY: 
    Basic Books.</li>
  <li>Galotti, K. M., Clinchy, B. M., Ainsworth, K., Lavin, B., &amp; Mansfield, 
    A. F. (1999). A New Way of Assessing Ways of Knowing: The Attitudes Towards 
    Thinking and Learning Survey (ATTLS). Sex Roles, 40(9/10), 745-766.</li>
  <li>Galotti, K. M., Reimer, R. L., &amp; Drebus, D. W. (2001). Ways of knowing 
    as learning styles: Learning MAGIC with a partner. Sex Roles, 44(7/8), 419-436. 
    <br>
  </li>
</ul>

