<?PHP // $Id$ 
      // enrol_internal.php - created with Moodle 1.6 development (2005060201)


$string['description'] = '.این یک فرم پیش ثبت نام است هر دانشجو میتواند به دوطریق در یک دوره درسی ثبت نام نماید
<ul>
<li>معلم یا مدیر میتواند به صورت  غیر خورکار با استفاده از لینک در منوی کرس مدیریت در درس ثبت نام کند</li>
<li> هر درس میتواند یک رمز ورود پیش فرض داشته باشد که  به عنوان کلید ثبت نام شناخته می شود.هر فرد با داشتن این رمز می تواند خود را به درس اضافه کند</li>
</ul>';
$string['enrolname'] = 'ثبت نام داخلی';

?>
