<?PHP // $Id$ 
      // enrol_database.php - created with Moodle 1.6 development (2005060201)


$string['dbhost'] = 'نام میزبانی پایگاه داده سرور ';
$string['dbname'] = 'معین کردن پایگاه داده برای استفاده';
$string['dbpass'] = 'رمز ورود برای دسترسی به سرور';
$string['dbtable'] = 'جدول پایگاه داده';
$string['dbtype'] = 'نوع پایگاه داده خارجی';
$string['dbuser'] = 'نام کاربری برای دسترسی به سرور';
$string['description'] = '.شما میتوانید از یک پایگاه داده خارجی از هر نوعی برای کنترل ثبت نامها استفاده کنید این طور پیش بینی شده است که پایگاه داده خارجی شامل یک فیلد حاوی شناه درس و یک فیلد حاوی نما کاربر است که اینها با فیلدهایی که حاوی شناسه درس و نام کاربر در جدول فرعی مقایسه میشود';
$string['enrolname'] = 'پایگاه داده خارجی';
$string['localcoursefield'] = ' (eg idnumber)نام فیلدی  در جدول کرس های درسی برای خطاب';
$string['localuserfield'] = '(eg idnumber)نام فیلددر جدول محلی کاربر که برای تطبیق با کاربر در رکورد مرکزی استفاده میشود';
$string['remotecoursefield'] = 'کرس درس در آن میرودIDفیلدی در پایگاه داده مرکزی که انتظار یافتن ';
$string['remoteuserfield'] = 'فیلدی در پایگاه داده مرکزی که انتظار یافتن نام کاربری در آن میرود';

?>
