<p align="center"><b>Adapt&iacute;v m&oacute;d</b></p>

<p>Igen v&aacute;laszt&aacute;sa eset&eacute;n a tanul&oacute;k ugyanarra a k&eacute;rd&eacute;sre azonos pr&oacute;b&aacute;lkoz&aacute;s sor&aacute;n t&ouml;bbsz&ouml;r is v&aacute;laszolhatnak. 
&Iacute;gy ha egy tanul&oacute; megold&aacute;s&aacute;ra helytelen jelz&eacute;st kap, azonnal &uacute;jb&oacute;l pr&oacute;b&aacute;lkozhat. 
Ugyanakkor &aacute;ltal&aacute;ban minden rossz pr&oacute;b&aacute;lkoz&aacute;s ut&aacute;n b&uuml;ntet&#337;pontot kap 
(a b&uuml;ntet&eacute;s m&eacute;rt&eacute;k&eacute;t a b&uuml;ntet&eacute;si t&eacute;nyez&#337; szabja meg, l&aacute;sd a k&ouml;vetkez&#337; pontot).</p>

<p>Ezen m&oacute;dban olyan k&eacute;rd&eacute;seket tehet&uuml;nk fel, amelyek m&oacute;dosulnak a tanul&oacute; v&aacute;lasz&aacute;nak 
megfelel&#337;en. Az IMS QTI specifik&aacute;ci&oacute; &iacute;gy hat&aacute;rozza meg az adapt&iacute;v k&eacute;rd&eacute;seket:</p>

<blockquote>
Egy adapt&iacute;v t&eacute;tel olyan k&eacute;rd&eacute;s, amely megjelen&eacute;s&eacute;t, pontoz&aacute;s&aacute;t (a v&aacute;lasz feldolgoz&aacute;s&aacute;t) vagy egyszerre mind a kett&#337;t 
a vizsg&aacute;z&oacute; egyes pr&oacute;b&aacute;lkoz&aacute;sainak megfelel&#337;en m&oacute;dos&iacute;tja. 
P&eacute;ld&aacute;ul egy adapt&iacute;v k&eacute;rd&eacute;s felsz&oacute;l&iacute;thatja a vizsg&aacute;z&oacute;t egy szabadsz&ouml;veges r&eacute;sz kit&ouml;lt&eacute;s&eacute;re, 
nem megfelel&#337; v&aacute;lasz eset&eacute;n azonban egyszer&#369; feleletv&aacute;laszt&aacute;s lehet&#337;s&eacute;g&eacute;t k&iacute;n&aacute;lhatja fel, 
&eacute;s kevesebb pontot adhat a jav&iacute;tott v&aacute;lasz megad&aacute;s&aacute;ra. 
Az adapt&iacute;v jelleggel a szerz&#337; format&iacute;v helyzetekben haszn&aacute;lhat&oacute; k&eacute;rd&eacute;seket dolgozhat ki,
 melyek v&eacute;gigvezetik a vizsg&aacute;z&oacute;t, ugyanakkor olyan eredm&eacute;nyt biztos&iacute;tanak, amely figyelembe veszi 
 az &aacute;ltaluk bej&aacute;rt utat.
</blockquote>

<p>Adapt&iacute;v m&oacute;dban egy tov&aacute;bbi <?php print_string('mark', 'quiz') ?> gomb jelenik meg minden k&eacute;rd&eacute;s mellett.
Ha a tanul&oacute; megnyomja ezt a gombot, az arra a k&eacute;rd&eacute;sre adott v&aacute;lasz pontoz&aacute;sra ker&uuml;l &eacute;s az el&eacute;rt eredm&eacute;ny megjelenik
a tanul&oacute; el&#337;tt. Ha a k&eacute;rd&eacute;s adapt&iacute;v, akkor &uacute;j &aacute;llapot&aacute;ban jelenik meg, mely figyelembe veszi a tanul&oacute; v&aacute;lasz&aacute;t &eacute;s 
sz&aacute;mos esetben tov&aacute;bbi adatot k&eacute;r a tanul&oacute;t&oacute;l. A legegyszer&#369;bb adapt&iacute;v k&eacute;rd&eacute;s eset&eacute;n az 
&uacute;j &aacute;llapot esetleg csak a visszajelz&eacute;s sz&ouml;veg&eacute;ben t&eacute;r el, &eacute;s arra sz&oacute;l&iacute;tja fel a tanul&oacute;t, hogy pr&oacute;b&aacute;lkozz&eacute;k &uacute;jb&oacute;l.
Bonyolultabb esetben a k&eacute;rd&eacute;s sz&ouml;vege &eacute;s az interakci&oacute; elemei is v&aacute;ltozhatnak.
</p>