<P ALIGN=CENTER><B>Sz&aacute;m&iacute;t&aacute;sos k&eacute;rd&eacute;sek</B></P>
A sz&aacute;m&iacute;t&aacute;sos k&eacute;rd&eacute;sekkel egyedi k&eacute;rd&eacute;seket hozhatunk l&eacute;tre olyan 
helyettes&iacute;t&#337;k megad&aacute;s&aacute;val, amelyek hely&eacute;re a teszt megold&aacute;sa sor&aacute;n 
konkr&eacute;t &eacute;rt&eacute;kek ker&uuml;lnek.
<br/>Al&aacute;bb egy r&ouml;vid v&aacute;ltozata l&aacute;that&oacute; a f&#337; szerkeszt&#337; oldalnak, benne n&eacute;h&aacute;ny p&eacute;ld&aacute;val:<br/>

<table><tbody>
<tr valign="top">
    <td align="right"><p><b>K&eacute;rd&eacute;s:</b></p>
    </td>
    <td>
        <textarea id="questiontext" name="questiontext" rows="5" cols="40" wrap="virtual">Mennyi {a} + {b} ?</textarea>
</td>
</tr>
<tr valign="top">
    <td align="right"><p><b>Haszn&aacute;land&oacute; k&eacute;p:</b></p></td>
    <td>
    <select name="image"><option value="" selected="selected">Semmi</option><option value="grevture.gif">grevture.gif</option></select>
    </td>
</tr>

<tr valign="top">
<td align="right"><p><b>Helyes k&eacute;plet:</b></p></td>
    <td>
    <input align="left" type="text" id="formula0" name="answer[]" size="20" value="{a} + {b}">&nbsp;&nbsp;
    <input type="hidden" name="fraction[]" value="1.0">
    </td>
</tr>
<tr valign="top">
    <td align="right"><p><b>Tolerancia:</b></p></td>
    <td>
    <input align="left" type="text" id="tolerance0&quot;" name="tolerance[]" size="15" value="0.01">±
    </td>
</tr>
<tr valign="top">
<td align="right"><p><b>Tolerancia típusa:</b></p></td>
    <td>
    <select name="tolerancetype[]"><option value="1" selected="selected">Relat&iacute;v</option><option value="2">Nomin&aacute;lis</option><option value="3">Geometriai</option></select>
    </td>
</tr>
<tr valign="top">
<td align="right"><p><b>Szignifik&aacute;ns sz&aacute;mjegyek:</b></p></td>
    <td>
    <select name="correctanswerlength[]"><option value="1">1</option><option value="2" selected="selected">2</option><option value="3">3</option><option value="4">4</option><option value="5">5</option><option value="6">6</option><option value="7">7</option><option value="8">8</option><option value="9">9</option><option value="10">10</option></select>
    </td>
</tr>
</tbody></table>

<br/>
A k&eacute;rd&eacute;s sz&ouml;veg&eacute;ben &eacute;s a "Helyes k&eacute;plet" hely&eacute;n {a} &eacute;s {b} l&aacute;that&oacute;. 
Ezek &eacute;s b&aacute;rmely egy&eacute;b {n&eacute;v} haszn&aacute;lhat&oacute; helyettes&iacute;t&#337;k&eacute;nt, melynek hely&eacute;re a teszt
megold&aacute;sa sor&aacute;n valamilyen &eacute;rt&eacute;k ker&uuml;l. Emellett a helyes &eacute;rt&eacute;k kisz&aacute;m&iacute;t&aacute;sa is 
megt&ouml;rt&eacute;nik, ha a tesztet a "Helyes k&eacute;plet" kifejez&eacute;ssel adj&aacute;k le, amely sz&aacute;mjegyes kifejez&eacute;ss&eacute; 
alakul a behelyettes&iacute;t&eacute;st k&ouml;vet&#337;en. A lehets&eacute;ges helyettes&iacute;t&#337;k &eacute;rt&eacute;keit egy 
k&eacute;s&#337;bbi oldalon lehet be&aacute;ll&iacute;tani vagy el&#337;&aacute;ll&iacute;tani a sz&aacute;m&iacute;t&aacute;sos 
k&eacute;rd&eacute;sek szerkeszt&#337; var&aacute;zsl&oacute;j&aacute;ban...
<br/>A p&eacute;ldak&eacute;pletben a + m&#369;veleti jel szerepel. Egy&eacute;b elfogadhat&oacute; jelek: -*/ és %, ahol a % a modul&oacute;. 
Haszn&aacute;lhat&oacute;k emellett egyes PHP-szer&#369; matematikai f&uuml;ggv&eacute;nyek. Ilyenek a 24 egyargumentum&uacute; f&uuml;ggv&eacute;ny:<br/><b>
abs, acos, acosh, asin, asinh, atan, atanh, ceil, cos, cosh, deg2rad, exp, expm1, floor, log, log10, log1p, rad2deg, round, sin, sinh, sprt, tan, tanh
</b><br/>&eacute;s k&eacute;t k&eacute;targumentum&uacute; f&uuml;ggv&eacute;ny<br/><b>
atan2, pow
</b><br/> tov&aacute;bb&aacute; a <b>min</b> &eacute;s a <b>max</b> f&uuml;ggv&eacute;ny, melyek k&eacute;t vagy t&ouml;bb argumentumot vehetnek fel.
 Ugyancsak haszn&aacute;lhat&oacute; az argumentum n&eacute;lk&uuml;li <b>pi</b> f&uuml;ggv&eacute;ny, de ne feledkezz&uuml;nk meg a 
 z&aacute;r&oacute;jelek haszn&aacute;lat&aacute;r&oacute;l - a helyes haszn&aacute;lat: <b>pi()</b>. Hasonl&oacute;k&eacute;ppen a t&ouml;bbi
f&uuml;ggv&eacute;ny argumentumait z&aacute;r&oacute;jelek k&ouml;z&eacute; kell tenni. Például:  <b>sin({a}) + cos({b}) * 2</b>. 
A f&uuml;ggv&eacute;nyek egym&aacute;sba &aacute;gyaz&aacute;sa nem okozhat gondot, pl. <b>cos(deg2rad({a} + 90))</b> stb.
<br/>A PHP-szer&#369; f&uuml;ggv&eacute;nyekr&#337;l r&eacute;szletesebben l&aacute;sd  <a target="phpmathdoc" href="http://www.php.net/manual/en/ref.math.php">a PHP port&aacute;lj&aacute;n tal&aacute;lhat&oacute; dokument&aacute;ci&oacute;t</a>.
<br/><br/>
Sz&aacute;mjegyes k&eacute;rd&eacute;sek eset&eacute;n megadhat&oacute; egy hat&aacute;r, melyen bel&uuml;l minden v&aacute;lasz helyesnek 
fogadhat&oacute; el. Erre a c&eacute;lra szolg&aacute;l a "Tolerancia" mez&#337;. H&aacute;romf&eacute;le tolerancia l&eacute;tezik. 
Ezek a <b>relat&iacute;v, nomin&aacute;lis &eacute;s geometriai</b>. Ha azt felt&eacute;telezz&uuml;k, hogy a teszt id&#337;pontj&aacute;ban 
a helyes v&aacute;lasz 200, a tolerancia pedig 0,5, akkor a k&uuml;l&ouml;nf&eacute;le toleranciat&iacute;pusokn&aacute;l ez &iacute;gy alakul:
<br/><br/><b>Relatív:</B> A tolerancia intervallum&aacute;nak a kisz&aacute;m&iacute;t&aacute;sa a helyes v&aacute;lasz 0,5-del val&oacute; 
megszorz&aacute;s&aacute;val t&ouml;rt&eacute;nik, vagyis ez esetben 100-at kapunk, &iacute;gy ezen tolerancia eset&eacute;n a helyes 
feleletnek 100 és 300 k&ouml;z&eacute; kell esni.  (200 ± 100)<br/>
Ez akkor hasznos megold&aacute;s, amikor a helyes v&aacute;laszok nagyban elt&eacute;rhetnek a helyettes&iacute;t&#337; &eacute;rt&eacute;keket illet&#337;en.
<br/><br/><b>Nominális:</b>  Ez a legegyszer&#369;bb toleranciat&iacute;pus, ugyanakkor nem a legalkalmasabb. A helyes 
feleletnek 199,5 és 200,5 k&ouml;z&eacute; kell esni. (200 ± 0,5)<br/>
Ez a toleranciatípus akkor hasznos megold&aacute;s, amikor a helyes v&aacute;laszok csak csek&eacute;ly m&eacute;rt&eacute;kben t&eacute;rnek el egym&aacute;st&oacute;l.
<br/><br/><b>Geometriai:</b> A tolerancia intervallum&aacute;nak fels&#337; hat&aacute;ra 200 + 0,5*200, egyben azonos a relat&iacute;vval.
 Az alsó határ 200/(1 + 0,5). A helyes feleletnek 133,33 és 300 k&ouml;z&eacute; kell esni.<br/>
Ez olyan bonyolult, nagy toleranciatartom&aacute;nyt ig&eacute;nyl&#337; sz&aacute;m&iacute;t&aacute;sok eset&eacute;n hasznos, ahol 
a fels&#337; hat&aacute;rt a legal&aacute;bb 1-es relat&iacute;v tolerancia adja, als&oacute; hat&aacute;rnak viszont egy&eacute;rtelm&#369;en elfogadhatatlan, mivel 
minden esetben 0 volna a helyes v&aacute;lasz.
<br/><br/>
A  <b>Szignifik&aacute;ns sz&aacute;mjegyek</b> mind&ouml;ssze a helyes v&aacute;lasznak az ellen&#337;rz&eacute;sben
vagy jelent&eacute;sekben val&oacute; megjelen&iacute;t&eacute;s&eacute;re vonatkozik. 
P&eacute;ld&aacute;k: Ha ez az &eacute;rt&eacute;k 3, akkor a 13,333 mint helyes v&aacute;lasz 13,3 form&aacute;ban jelenik meg; 
az 1236 hely&eacute;n 1240; a 23 hely&eacute;n 23,0 stb. lesz l&aacute;that&oacute;.
<br/><br/>
A visszajelz&eacute;si mez&#337; &eacute;s az opcion&aacute;lis egys&eacute;gmez&#337;k a sz&aacute;mjegyes k&eacute;rd&eacute;sekkel azonos m&oacute;don m&#369;k&ouml;dnek.
<br/>