<p align="center"><strong>K&eacute;rd&eacute;sek export&aacute;l&aacute;sa egy kateg&oacute;ri&aacute;b&oacute;l</strong></p>

<p>Ezzel a funkci&oacute;val k&eacute;rd&eacute;sek eg&eacute;sz kateg&oacute;ri&aacute;j&aacute;t export&aacute;lhatjuk egy sz&ouml;veges &aacute;llom&aacute;nyba. 

<p>Ne feledj&uuml;k, hogy egy sor f&aacute;jlforma eset&eacute;n bizonyos inform&aacute;ci&oacute;k elvesznek, ha export&aacute;ljuk a k&eacute;rd&eacute;seket. Ennek az az oka, hogy sz&aacute;mos forma nem rendelkezik az &ouml;sszes olyan jellemz&#337;vel, amellyel a Moodle k&eacute;rd&eacute;sei fel vannak ruh&aacute;zva. Nem v&aacute;rhatjuk el, hogy a k&eacute;rd&eacute;sek export&aacute;l&aacute;sa &eacute;s import&aacute;l&aacute;sa ut&aacute;n azok majd azonosak is lesznek. R&aacute;ad&aacute;sul el&#337;fordulhat, hogy egyes k&eacute;rd&eacute;st&iacute;pusokat egy&aacute;ltal&aacute;n nem lehet export&aacute;lni. Aj&aacute;nlatos az export&aacute;lt adatokat ellen&#337;rizni, miel&#337;tt konkr&eacute;t el&#337;&aacute;ll&iacute;t&aacute;si k&ouml;rnyezetben haszn&aacute;ln&aacute;nk &#337;ket.</p>

<p>A jelenleg t&aacute;mogatott forma (form&aacute;k) a k&ouml;vetkez&#337;k:</p>

<p><strong>GIFT-forma</strong></p>
<ul>
<p>Moodle-ban a tesztk&eacute;rd&eacute;sek sz&ouml;veges &aacute;llom&aacute;nyba export&aacute;l&aacute;s&aacute;ra a GIFT a leg&aacute;ltal&aacute;nosabb rendelkez&eacute;sre &aacute;ll&oacute; forma. Eredetileg egy k&ouml;nny&#369; m&oacute;dszert k&iacute;n&aacute;lt arra, hogy a tan&aacute;rok a k&eacute;rd&eacute;seket sz&ouml;veges &aacute;llom&aacute;nyk&eacute;nt &iacute;rhass&aacute;k meg. T&aacute;mogatja a feleletv&aacute;laszt&oacute;s, igaz-hamis, kieg&eacute;sz&iacute;t&#337;, p&aacute;ros&iacute;t&oacute; &eacute;s sz&aacute;mjegyes k&eacute;rd&eacute;sek haszn&aacute;lat&aacute;t, tov&aacute;bb&aacute; az _____ besz&uacute;r&aacute;s&aacute;t a "sz&oacute;kit&ouml;lt&#337;" forma eset&eacute;n. Ne feledj&uuml;k, hogy a kit&ouml;lt&#337; k&eacute;rd&eacute;sek haszn&aacute;lat&aacute;t a rendszer jelenleg nem t&aacute;mogatja. A k&uuml;l&ouml;nf&eacute;le k&eacute;rd&eacute;st&iacute;pusokat egy sz&ouml;veges &aacute;llom&aacute;nyon bel&uuml;l vegyesen is haszn&aacute;lhatjuk, emellett a forma t&aacute;mogatja egysoros megjegyz&eacute;sek, k&eacute;rd&eacute;snevek, visszajelz&eacute;s &eacute;s sz&aacute;zal&eacute;kosan s&uacute;lyozott pontok alkalmaz&aacute;s&aacute;t. &Iacute;me n&eacute;h&aacute;ny p&eacute;lda:</p>
<pre>
Ki fekszik Grant s&iacute;rj&aacute;ban?{~Grant ~Jefferson =senki}

Grant {~temetett =elhantolt ~&eacute;l} Grant s&iacute;rj&aacute;ban.

Grant van eltemetve Grant s&iacute;rj&aacute;ba.{FALSE}

Ki fekszik Grant s&iacute;rj&aacute;ban?{=senki =senki sem}

Mikor sz&uuml;letett Ulysses S. Grant?{#1822}
</pre>

<p align=right><a href="help.php?file=formatgift.html&amp;module=quiz">Tov&aacute;bbi inform&aacute;ci&oacute;k a "GIFT" form&aacute;val kapcsolatosan</a></p>
</ul>

<p>Tov&aacute;bbi form&aacute;k ker&uuml;lnek a rendszer a k&eacute;s&#337;bbiekben, ide&eacute;rtve a WebCT-t, az IMS QTI-t &eacute;s b&aacute;rmely egyebet, amelyet a Moodle felhaszn&aacute;l&oacute;i rendelkez&eacute;sre bocs&aacute;tanak! </p>
