<p align="center"><strong>"GIFT" form&aacute;j&uacute; &aacute;llom&aacute;nyok import&aacute;l&aacute;sa</strong></p>
<p>A GIFT a legkiterjedtebb import&aacute;l&aacute;si forma, mellyel a Moodle sz&ouml;veges &aacute;llom&aacute;nyokb&oacute;l 
tesztk&eacute;rd&eacute;seket k&eacute;pes beolvasni. T&aacute;mogatja a feleletv&aacute;laszt&oacute;s, igaz-hamis, 
kieg&eacute;sz&iacute;t&#337;, p&aacute;ros&iacute;t&oacute; &eacute;s sz&aacute;mjegyes k&eacute;rd&eacute;sek haszn&aacute;lat&aacute;t, 
tov&aacute;bb&aacute; az _____ besz&uacute;r&aacute;s&aacute;t a "sz&oacute;kit&ouml;lt&#337;" forma eset&eacute;n. 
A k&uuml;l&ouml;nf&eacute;le k&eacute;rd&eacute;sfajt&aacute;k egyetlen sz&ouml;veges &aacute;llom&aacute;nyban vegyesen 
haszn&aacute;lhat&oacute;k, emellett a form&aacute;tum t&aacute;mogatja egysoros megjegyz&eacute;sek, k&eacute;rd&eacute;snevek, 
visszajelz&eacute;s &eacute;s sz&aacute;zal&eacute;ks&uacute;lyoz&aacute;s&uacute; pontok haszn&aacute;lat&aacute;t.</p>

    <p>A sz&ouml;veges &aacute;llom&aacute;ny k&oacute;dol&aacute;s&aacute;nak meg kell egyeznie a Moodle telep&iacute;t&eacute;se sor&aacute;n 
    alkalmazott k&oacute;dol&aacute;ssal. P&eacute;ld&aacute;t tal&aacute;l a k&eacute;rd&eacute;st tartalmaz&oacute; sz&ouml;veges 
    &aacute;llom&aacute;nyokra ezen a helyen: <a href="../../../../mod/quiz/format/gift/examples.txt">gift/examples.txt</a>.</p>


<h3>K&Eacute;RD&Eacute;SFAJT&Aacute;K</h3>

<p><u>Feleletv&aacute;laszt&oacute;s:</u><br />
    Feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;sek eset&eacute;n a helytelen v&aacute;laszok el&#337;tt hull&aacute;mjel (~) &aacute;ll, 
    a helyes v&aacute;laszokat az egyenl&#337;s&eacute;gjel (=) el&#337;zi meg.</p>
    <pre>     H&aacute;nyat l&eacute;p a ver&eacute;b egy &eacute;vben? {~egyet ~sokat =egyet sem}</pre>
    <p>A <strong>sz&oacute;kit&ouml;lt&#337;</strong> forma automatikusan besz&uacute;r egy kit&ouml;ltend&#337; &uuml;res r&eacute;szt 
    (p&eacute;ld&aacute;ul &iacute;gy: _____) a mondat k&ouml;zep&eacute;be. A sz&oacute;kit&ouml;lt&#337; forma haszn&aacute;lata 
    eset&eacute;n tegye a v&aacute;laszokat oda, ahol az al&aacute;h&uacute;z&aacute;s a mondatban megjelenik.</p>
    <pre>     A ver&eacute;b  {~egyet =egyet sem ~sokat} l&eacute;p egy &eacute;vben.</pre>
    <p>Ha a v&aacute;laszok a lez&aacute;r&oacute; &iacute;r&aacute;sjel el&#337;tt j&ouml;nnek, akkor a sz&oacute;kit&ouml;lt&#337; 
    form&aacute;hoz az adott helyen megjelenik a kit&ouml;lt&eacute;s hely&eacute;t jelz&#337; vonal. Minden k&eacute;rd&eacute;sfajta 
    megfogalmazhat&oacute; sz&oacute;kit&ouml;lt&#337; form&aacute;ban.</p>
    <p>A k&eacute;rd&eacute;sek elv&aacute;laszt&aacute;sa &uuml;res sorral (kett&#337;s kocsi-vissza jel besz&uacute;r&aacute;s&aacute;val) 
    t&ouml;rt&eacute;nik. Az egy&eacute;rtelm&#369;s&eacute;g &eacute;rdek&eacute;ben a v&aacute;laszok megadhat&oacute;k k&uuml;l&ouml;n 
    sorokban, s&#337;t, a sorban beljebb kezdhet&#337;k. P&eacute;ld&aacute;ul:</p>
    <pre>     Amerik&aacute;ban a h&aacute;laad&aacute;s &uuml;nnep&eacute;t november {
         ~m&aacute;sodik
         ~harmadik
         =negyedik
     } cs&uuml;t&ouml;rt&ouml;k&eacute;n &uuml;nneplik.
     
     A jap&aacute;n bet&#369;k eredetileg mely orsz&aacute;gb&oacute;l sz&aacute;rmaznak? {
         ~India
         =K&iacute;na
         ~Korea
         ~Egyiptom}</pre>

<p><u>Kieg&eacute;sz&iacute;t&#337; k&eacute;rd&eacute;sfajta:</u><br />
    Kieg&eacute;sz&iacute;t&#337; k&eacute;rd&eacute;sfajta eset&eacute;n a v&aacute;laszok mindegyike el&#337;tt egyenl&#337;s&eacute;gjel (=) 
    szerepel, ez jelzi, hogy mindegyik v&aacute;lasz helyes v&aacute;lasz. A v&aacute;laszokban nem szerepelhet hull&aacute;mjel.</p>
    <pre>     H&aacute;nyat l&eacute;p a ver&eacute;b egy &eacute;vben?{=egyet sem =semennyit}

     K&eacute;tszer kett&#337; egyenl&#337;  {=n&eacute;gy =4}.</pre>
    <p>Amennyiben csak <u>egyetlen</u> helyes kieg&eacute;sz&iacute;t&#337; v&aacute;lasz van, akkor azt megadhatja a megel&#337;z&#337; 
    egyenl&#337;s&eacute;gjel n&eacute;lk&uuml;l is, felt&eacute;ve, hogy nem keverhet&#337; &ouml;ssze az igaz-hamis fajt&aacute;val.

<p><u>Igaz-hamis:</u><br />
    Enn&eacute;l a k&eacute;rd&eacute;sfajt&aacute;n&aacute;l a v&aacute;lasz azt jelzi, hogy az adott meg&aacute;llap&iacute;t&aacute;s igaz, 
    avagy hamis. A v&aacute;laszt {TRUE} vagy {FALSE}, r&ouml;vid&iacute;tve {T} vagy {F} [igaz, illetve hamis] form&aacute;ban adhatja meg.</p>
    <pre>     A ver&eacute;b h&aacute;rmat l&eacute;p egy &eacute;vben.{F}

     A nap keleten kel fel.{T}</pre>

<p><u>P&aacute;ros&iacute;t&oacute;:</u><br />
    A p&aacute;ros&iacute;t&oacute; p&aacute;rjai egyenl&#337;s&eacute;gjellel (=) kezd&#337;dnek, elv&aacute;laszt&oacute;nak a "-&gt;" jel 
    haszn&aacute;latos. Legal&aacute;bb h&aacute;rom p&aacute;ros&iacute;tand&oacute; p&aacute;rt kell l&eacute;trehozni.</p>
    <pre>     P&aacute;ros&iacute;t&oacute; k&eacute;rd&eacute;s {
         =1. alk&eacute;rd&eacute;s -&gt; 1. alv&aacute;lasz
         =2. alk&eacute;rd&eacute;s -&gt; 2. alv&aacute;lasz
         =3. alk&eacute;rd&eacute;s -&gt; 3. alv&aacute;lasz
         }
     
     P&aacute;ros&iacute;tsa az al&aacute;bbi orsz&aacute;gokat &eacute;s f&#337;v&aacute;rosukat. {
         =Kanada -&gt; Ottawa
         =Olaszorsz&aacute;g -&gt; R&oacute;ma
         =Jap&aacute;n  -&gt; Toki&oacute;
         =India  -&gt; &Uacute;j-Delhi
         }</pre>
    <p>A p&aacute;ros&iacute;t&oacute; k&eacute;rd&eacute;sek nem t&aacute;mogatj&aacute;k a visszajelz&eacute;st &eacute;s a 
    sz&aacute;zal&eacute;kosan s&uacute;lyozott v&aacute;laszokat.</p>

<p><u>Sz&aacute;mjegyes:</u><br />
    A sz&aacute;mjegyes k&eacute;rd&eacute;sek v&aacute;laszokat tartalmaz&oacute; r&eacute;sz&eacute;nek sz&aacute;mjegyjellel (#) kell 
    kezd&#337;dni. A sz&aacute;mjegyes v&aacute;laszokban megadhat egy hibahat&aacute;rt, melyet kett&#337;sponttal elv&aacute;lasztva a helyes 
    v&aacute;lasz ut&aacute;n &iacute;r. Ha p&eacute;ld&aacute;ul a helyes v&aacute;lasz 1,5 &eacute;s 2,5 k&ouml;z&eacute; eshet, akkor azt 
    &iacute;gy adja meg: <u>{#2:0,5}</u>. Ez azt jelenti, hogy egy 0,5-&ouml;s (azaz 1,5-t&#337;l 2,5-ig terjed&#337;) hibahat&aacute;rt 
    megenged&#337; 2 eredm&eacute;ny helyesnek tekintend&#337;. Ha nem ad meg hibahat&aacute;rt, akkor a rendszer azt null&aacute;nak tekinti.</p>
    <pre>     Mikor sz&uuml;letett Ulysses S. Grant? {#1822}

     Milyen &eacute;rt&eacute;ke van a pi-nek (3 tizedes &eacute;rt&eacute;kig)? {#3,1415:0,0005}.</pre>
    <p>Opcion&aacute;lisan a sz&aacute;mjegyes v&aacute;laszok megadhat&oacute;k tartom&aacute;nyk&eacute;nt az al&aacute;bbi form&aacute;ban: 
    {#<i>Minim&aacute;lis&Eacute;rt&eacute;k</i>..<i>Maxim&aacute;lis&Eacute;rt&eacute;k</i>}.</p>
    <pre>     Milyen &eacute;rt&eacute;ke van a pi-nek (3 tizedes &eacute;rt&eacute;kig)? {#3,141..3.142}.</pre>
    <p>A Moodle b&ouml;ng&eacute;sz&#337; fel&uuml;lete nem t&aacute;mogatja a t&ouml;bbsz&ouml;r&ouml;s sz&aacute;mjegyes v&aacute;lasz 
    haszn&aacute;lat&aacute;t, ugyanakkor a Moodle k&oacute;dja &eacute;s a GIFT t&aacute;mogatja ezt. Ily m&oacute;don t&ouml;bbsz&ouml;r&ouml;s 
    sz&aacute;mjegyes tartom&aacute;nyt adhat meg, ami k&uuml;l&ouml;n&ouml;sen hasznos lehet akkor, ha sz&aacute;zal&eacute;kosan s&uacute;lyozott 
    pontoz&aacute;ssal kombin&aacute;lja. Ha t&ouml;bbsz&ouml;r&ouml;s v&aacute;laszad&aacute;st haszn&aacute;l, ezek el&eacute; - a 
    kieg&eacute;sz&iacute;t&#337; k&eacute;rd&eacute;shez hasonl&oacute;an - egyenl&#337;s&eacute;gjelet kell besz&uacute;rni.</p>
    <pre>     Mikor sz&uuml;letett Ulysses S. Grant? {#
         =1822:0
         =%50%1822:2}</pre>
    <p>Ne feledje, hogy mivel a Moodle b&ouml;ng&eacute;sz&#337;j&eacute;nek grafikus fel&uuml;lete nem t&aacute;mogatja  a t&ouml;bbsz&ouml;r&ouml;s 
    v&aacute;laszad&aacute;st sz&aacute;mjegyes k&eacute;rd&eacute;sek eset&eacute;n, ez&eacute;rt ezeket nem lehet a Moodle-ban megtekinteni vagy 
    szerkeszteni. Az els&#337; ut&aacute;ni sz&aacute;mjegyes v&aacute;laszok m&oacute;dos&iacute;t&aacute;s&aacute;ra az egyetlen 
    lehet&#337;s&eacute;g, ha kit&ouml;rli az adott k&eacute;rd&eacute;st &eacute;s &uacute;jraimport&aacute;lja (vagy valami 
    phpMyAdmin-hoz hasonl&oacute; megold&aacute;st haszn&aacute;l).</p>


<h3>OPCI&Oacute;K</h3>
    <p>Ezen alapvet&#337; k&eacute;rd&eacute;sfajt&aacute;kon t&uacute;l ez a sz&#369;r&#337; a k&ouml;vetkez&#337; opci&oacute;kat teszi 
    lehet&#337;v&eacute;: egysoros megjegyz&eacute;s, k&eacute;rd&eacute;s neve, visszajelz&eacute;s, valamint sz&aacute;zal&eacute;kosan 
    s&uacute;lyozott v&aacute;laszok.</p>

<p><u>Egysoros megjegyz&eacute;s:</u><br />
    A sz&ouml;veges &aacute;llom&aacute;nyba olyan megjegyz&eacute;seket &iacute;rhat, amelyeket a Moodle nem import&aacute;l. Ezzel 
    fejl&eacute;ceket vagy tov&aacute;bbi inform&aacute;ci&oacute;kat adhat meg a k&eacute;rd&eacute;sekkel kapcsolatosan. Minden 
    kett&#337;s visszaperjellel kezd&#337;d&#337; sort (a tabul&aacute;torokat vagy sz&oacute;k&ouml;z&ouml;ket nem sz&aacute;m&iacute;tva) a 
    sz&#369;r&#337; nem vesz figyelembe.</p>
    <pre>     // Alc&iacute;m: Sz&aacute;mjegyes k&eacute;rd&eacute;sek al&aacute;bb
     Mennyi 2 meg 2? {#4}</pre>

<p><u>K&eacute;rd&eacute;s neve:</u><br />
    A k&eacute;rd&eacute;snek &uacute;gy adhat nevet, hogy el&#337;sz&ouml;r meg&iacute;rja, majd dupla kett&#337;spontok k&ouml;z&eacute; 
    illeszti.</p>
    <pre>     ::A kanji eredete::A jap&aacute;n bet&#369;k eredetileg mely orsz&aacute;gb&oacute;l sz&aacute;rmaznak? {=K&iacute;na} 
    ::H&aacute;laad&aacute;s &uuml;nnepe::Amerik&aacute;ban a h&aacute;laad&aacute;s &uuml;nnep&eacute;t november {
         ~m&aacute;sodik ~harmadik =negyedik} cs&uuml;t&ouml;rt&ouml;k&eacute;n &uuml;nneplik.</pre>
    <p>Ha nem ad nevet a k&eacute;rd&eacute;snek, akkor alaphelyzetben az eg&eacute;sz k&eacute;rd&eacute;st n&eacute;vnek tekinti a rendszer.</p>

<p><u>Visszajelz&eacute;s:</u><br />
    Az egyes v&aacute;laszokhoz visszajelz&eacute;st adhat meg a v&aacute;laszok ut&aacute;n egy sz&aacute;mjel (#), majd a visszajelz&eacute;s 
    beg&eacute;pel&eacute;s&eacute;vel.</p>
    <pre>     Mi a v&aacute;lasz erre a feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;sre?{
     ~rossz v&aacute;lasz#visszajelz&eacute;sk&eacute;nt hozz&aacute;f&#369;z&ouml;tt megjegyz&eacute;s a rossz v&aacute;laszhoz
     ~egy m&aacute;sik rossz v&aacute;lasz#visszajelz&eacute;sk&eacute;nt hozz&aacute;f&#369;z&ouml;tt megjegyz&eacute;s ehhez a rossz 
     v&aacute;laszhoz
     =j&oacute; v&aacute;lasz#Nagyon j&oacute;!}
     
     H&aacute;nyat l&eacute;p a ver&eacute;b egy &eacute;vben?{
     =egyet sem#kit&#369;n&#337; v&aacute;lasz!
     =semennyit#kit&#369;n&#337; v&aacute;lasz!}
     
     A ver&eacute;b sokat l&eacute;p egy &eacute;vben.{FALSE#A ver&eacute;b egyet sem l&eacute;p, mert ugrik.}</pre>
    <p>Feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;sekn&eacute;l csak a tanul&oacute; &aacute;ltal kiv&aacute;lasztott v&aacute;laszra 
    vonatkoz&oacute; visszajelz&eacute;s jelenik meg. Kieg&eacute;sz&iacute;t&#337; k&eacute;rd&eacute;sekn&eacute;l a visszajelz&eacute;s csak 
    akkor jelenik meg, amikor a tanul&oacute;k helyes v&aacute;laszt adnak. Igaz-hamis k&eacute;rd&eacute;sekn&eacute;l az import&aacute;lt 
    visszajelz&eacute;st a rendszer elmenti, &iacute;gy az akkor jelez ki, ha a tanul&oacute; rossz v&aacute;laszt v&aacute;lasztott. Ennek 
    megfelel&#337;en a fenti utols&oacute; p&eacute;ld&aacute;n&aacute;l a tanul&oacute; csak akkor l&aacute;tja a visszajelz&eacute;st, ha 
    IGAZ volt a v&aacute;lasza.</p>

<p><u>V&aacute;laszok sz&aacute;zal&eacute;kos s&uacute;lyoz&aacute;sa:</u><br />
    V&aacute;laszok sz&aacute;zal&eacute;kos s&uacute;lyoz&aacute;s&aacute;val mind a feleletv&aacute;laszt&oacute;s, mind a 
    kieg&eacute;sz&iacute;t&#337; k&eacute;rd&eacute;sek eset&eacute;n &eacute;lhet. A v&aacute;laszok sz&aacute;zal&eacute;kos 
    s&uacute;lyoz&aacute;s&aacute;t &uacute;gy adhatja meg, hogy a hull&aacute;mvonal (feleletv&aacute;laszt&oacute;s 
    k&eacute;rd&eacute;sekn&eacute;l) vagy az egyenl&#337;s&eacute;gjel (kieg&eacute;sz&iacute;t&#337; k&eacute;rd&eacute;sekn&eacute;l) 
    ut&aacute;n sz&aacute;zal&eacute;kjelek k&ouml;z&ouml;tt megadja a k&iacute;v&aacute;nt sz&aacute;zal&eacute;kos &eacute;rt&eacute;ket  
    (p&eacute;ld&aacute;ul &iacute;gy:  %50%). Ezt az opci&oacute;t kombin&aacute;lhatja a visszajelz&eacute;shez f&#369;z&ouml;tt 
    megjegyz&eacute;sekkel.</p>
    <pre>     Neh&eacute;z k&eacute;rd&eacute;s.{~rossz v&aacute;lasz ~%50%f&eacute;l kreditpontos v&aacute;lasz = teljes kreditpontos v&aacute;lasz}
          
     ::J&eacute;zus sz&uuml;l&#337;v&aacute;rosa::J&eacute;zus Krisztus sz&aacute;rmaz&aacute;si helye {
     ~Jeruzs&aacute;lem#Ez egy fontos v&aacute;ros volt, de a v&aacute;lasz rossz.
     ~%25%Betlehem#Ott sz&uuml;letett, de nem ott nevelkedett.
     ~%50%Galilea#Adjon pontosabb v&aacute;laszt.
     =N&aacute;z&aacute;ret#Helyes! J&oacute; v&aacute;lasz!}.
     
     ::J&eacute;zus sz&uuml;l&#337;v&aacute;rosa:: J&eacute;zus Krisztus sz&aacute;rmaz&aacute;si helye  {
     =N&aacute;z&aacute;ret#Helyes! J&oacute; v&aacute;lasz!
     =%75%N&aacute;zeret#Helyes, de hib&aacute;s a helyes&iacute;r&aacute;sa.
     =%25%Betlehem#Ott sz&uuml;letett, de nem ott nevelkedett.}</pre>
    <p>Ne feledje, hogy a k&eacute;t utols&oacute; p&eacute;lda alapvet&#337;en ugyanaz a k&eacute;rd&eacute;s, az els&#337; 
    feleletv&aacute;laszt&oacute;s, a m&aacute;sodik kieg&eacute;sz&iacute;t&#337; form&aacute;ban.</p>

    <p><font size="-1">Figyelje meg, hogy a v&aacute;laszokhoz megadhat olyan sz&aacute;zal&eacute;kos s&uacute;lyoz&aacute;st, amelyet a 
    b&ouml;ng&eacute;sz&#337; mint fel&uuml;let NEM tesz el&eacute;rhet&#337;v&eacute;. Az ilyen v&aacute;laszokhoz rendelt s&uacute;lyok 
    kisz&aacute;m&iacute;t&aacute;sa helyesen t&ouml;rt&eacute;nik (az import&aacute;l&aacute;s sor&aacute;n hozz&aacute;rendelt 
    &eacute;rt&eacute;knek megfelel&#337;en), a tesztet megold&oacute; tanul&oacute; sz&aacute;m&aacute;ra pedig a szok&aacute;sos m&oacute;don 
    jelenik meg. Ugyanakkor az ilyen v&aacute;laszs&uacute;lyok nem jelennek meg helyesen a tan&aacute;r sz&aacute;m&aacute;ra, amikor a Moodle 
    K&eacute;rd&eacute;s szerkeszt&eacute;se men&uuml;j&eacute;ben v&eacute;gzi a szerkeszt&eacute;st. A leg&ouml;rd&uuml;l&#337; men&uuml; 
    mind&ouml;ssze bizonyos r&ouml;gz&iacute;tett &eacute;rt&eacute;keket enged meg, &eacute;s ha a v&aacute;laszs&uacute;ly nem pontosan egyezik 
    meg az el&#337;re meghat&aacute;rozott &eacute;rt&eacute;kek valamelyik&eacute;vel, akkor a kijelz&eacute;s sem lesz pontos. Ha ilyen 
    k&eacute;rd&eacute;st szerkeszt a b&ouml;ng&eacute;sz&#337; fel&uuml;let&eacute;n kereszt&uuml;l, akkor a v&aacute;laszhoz rendelt 
    s&uacute;ly a kijelzettre fog m&oacute;dosulni.</font></p>

<p><u>T&ouml;bb v&aacute;lasz:</u><br />
    A t&ouml;bb v&aacute;laszt tartalmaz&oacute; opci&oacute; feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;sek eset&eacute;n 
    haszn&aacute;latos, amikor a teljes kreditponthoz k&eacute;t vagy t&ouml;bb v&aacute;laszt kell kiv&aacute;lasztani. A t&ouml;bb 
    v&aacute;laszt lehet&#337;v&eacute; tev&#337; opci&oacute;t &uacute;gy kapcsolhatja be, hogy a t&ouml;bb v&aacute;laszhoz 
    r&eacute;szs&uacute;lyokat rendel, ugyanakkor egy v&aacute;laszn&aacute;l sem engedi meg teljes kreditpont 
    hozz&aacute;rendel&eacute;s&eacute;t.</p>
    <pre>     Melyik k&eacute;t h&oacute;nap k&ouml;vetkezik egym&aacute;s ut&aacute;n? {
          ~%-50%m&aacute;rcius &eacute;s m&aacute;jus
          ~%50%m&aacute;jus &eacute;s j&uacute;nius
          ~%50%szeptember &eacute;s okt&oacute;ber
          ~%-50%febru&aacute;r &eacute;s &aacute;prilis }</pre>

<p><u>Speci&aacute;lis karakterek ~ = # { } :</u><br />
    Ezek a szimb&oacute;lumok <strong> ~ = # { } </strong> ennek a sz&#369;r&#337;nek a m&#369;k&ouml;d&eacute;s&eacute;t 
    szab&aacute;lyozz&aacute;k, ez&eacute;rt nem haszn&aacute;lhat&oacute;k k&eacute;rd&eacute;sek sz&ouml;veg&eacute;ben. Mivel ezeknek a 
    jeleknek speci&aacute;lis szerepe van ennek a sz&#369;r&#337;nek a m&#369;k&ouml;d&eacute;s&eacute;t illet&#337;en, elnevez&eacute;s&uuml;k 
    "vez&eacute;rl&#337;karakter." N&eacute;ha azonban sz&uuml;ks&eacute;g lehet arra, hogy valamelyik&uuml;ket - p&eacute;ld&aacute;ul egy 
    matematikai k&eacute;pletben - k&eacute;rd&eacute;sben haszn&aacute;lja. Ezt &uacute;gy oldhatja meg, hogy az adott vez&eacute;rl&#337;karaktert 
    speci&aacute;lis jellel egy&uuml;tt &iacute;rja. Mind&ouml;ssze annyit kell tennie, hogy a vez&eacute;rl&#337;karakter el&eacute; egy 
    visszaperjel karaktert (\) &iacute;r. &Iacute;gy a sz&#369;r&#337; tudni fogja, hogy mikor akarja az adott karaktert eredeti 
    jelent&eacute;s&eacute;ben haszn&aacute;lni, &eacute;s mikor szerepel vez&eacute;rl&#337;karakterk&eacute;nt. P&eacute;ld&aacute;ul:</p>
    <pre>     Melyik v&aacute;lasz eredm&eacute;nye 5? {
          ~ \= 2 + 2
          = \= 2 + 3
          ~ \= 2 + 4  }

     ::GIFT vez&eacute;rl&#337;karakterek::
     Az al&aacute;bbiak k&ouml;z&uuml;l melyik NEM vez&eacute;rl&#337;karakter a GIFT import&aacute;l&aacute;si form&aacute;tuma eset&eacute;n? {
        ~ \~     # \~ vez&eacute;rl&#337;karakter.
        ~ \=     # \= vez&eacute;rl&#337;karakter.
        ~ \#     # \# vez&eacute;rl&#337;karakter.
        ~ \{     # \{ vez&eacute;rl&#337;karakter.
        ~ \}     # \} vez&eacute;rl&#337;karakter.
        = \     # Helyes! \ (visszaperjel) nem vez&eacute;rl&#337;karakter. DE,
                   haszn&aacute;lhatja vez&eacute;rl&#337;karakterek eredeti jelent&eacute;sben val&oacute; haszn&aacute;lat&aacute;nak 
                   jelz&eacute;s&eacute;re.
     }</pre>
    <p>A k&eacute;rd&eacute;s feldolgoz&aacute;sa sor&aacute;n a visszaperjel t&ouml;rl&#337;dik, a Moodle nem t&aacute;rolja.</p>

<p><u>Egy&eacute;b opci&oacute;k:</u><br />
    Kieg&eacute;sz&iacute;t&#337; k&eacute;rd&eacute;sek eset&eacute;n &uacute;gy k&uuml;l&ouml;nb&ouml;ztetheti meg a kis- &eacute;s 
    nagybet&#369;s &iacute;r&aacute;sm&oacute;dot, hogy az al&aacute;bbi sorban a "0"-t "1"-re m&oacute;dos&iacute;tja:<br />
    <tt>$question-&gt;usecase = 0; // Kis-/nagybet&#369; figyelmen k&iacute;v&uuml;l hagyva</tt></p>
    <p>Egy&eacute;b opci&oacute;kat &eacute;rhet el, ha m&oacute;dos&iacute;tja a <strong>gift/format.php</strong> 
    import&aacute;l&aacute;si sz&#369;r&#337; k&oacute;dj&aacute;t. </p>
<p></p>

<h3>KREDITPONTOK</h3>
    <p>Ennek a sz&#369;r&#337;nek a kidolgoz&aacute;sa a Moodle k&ouml;z&ouml;ss&eacute;g&eacute;nek sz&aacute;mos tagja &aacute;ltal 
    v&eacute;gzett er&#337;fesz&iacute;t&eacute;s eredm&eacute;nye. Eredetileg sz&oacute;kit&ouml;lt&#337;s form&aacute;tumra &eacute;p&uuml;lt 
    Martin Dougiamas &eacute;s Thomas Robb programk&oacute;dja alapj&aacute;n. Paul Tsuchido Shew ezt a sz&#369;r&#337;t 2003 december&eacute;ben 
    &iacute;rta meg. A sz&#369;r&#337;be be&eacute;p&iacute;tette a k&ouml;z&ouml;ss&eacute;g r&eacute;sz&eacute;r&#337;l egy robusztusabb 
    k&eacute;rd&eacute;sform&aacute;ra vonatkoz&oacute;an &eacute;rkezett javaslatokat. Az elnevez&eacute;s a "General Import Format Technology" 
    [&aacute;ltal&aacute;nos import&aacute;l&aacute;si form&aacute;tum technol&oacute;gi&aacute;ja] kifejez&eacute;sb&#337;l alkotott 
    mozaiksz&oacute;: GIFT.</p>
    <p><font size="-1">A GIFT-sz&#369;r&#337; &eacute;s annak dokument&aacute;ci&oacute;ja Paul Tsuchido Shew munk&aacute;ja: http://ac.shew.jp. 
    Utols&oacute; friss&iacute;t&eacute;s d&aacute;tuma: 2004. febru&aacute;r 27.</font></p>