<p align="center"><strong>&Uacute;j k&eacute;rd&eacute;sek import&aacute;l&aacute;sa</strong></p>

<p>Ezzel a funkci&oacute;val k&uuml;ls&#337;, &#369;rlapon kereszt&uuml;l felt&ouml;lt&ouml;tt sz&ouml;veges &aacute;llom&aacute;nyb&oacute;l 
import&aacute;lhat k&eacute;rd&eacute;seket. </p>

<p>A rendszer egy sor &aacute;llom&aacute;nyform&aacute;t t&aacute;mogat:</p>

<p><strong>GIFT-forma</strong></p>
<ul>
<p>A GIFT a legkiterjedtebb import&aacute;l&aacute;si forma, mellyel a Moodle sz&ouml;veges &aacute;llom&aacute;nyokb&oacute;l 
tesztk&eacute;rd&eacute;seket k&eacute;pes beolvasni. Eredetileg egy k&ouml;nny&#369; m&oacute;dszert k&iacute;n&aacute;lt arra, hogy a 
tan&aacute;rok a k&eacute;rd&eacute;seket sz&ouml;veges &aacute;llom&aacute;nyk&eacute;nt &iacute;rhass&aacute;k meg.  T&aacute;mogatja a feleletv&aacute;laszt&oacute;s, igaz-hamis, kieg&eacute;sz&iacute;t&#337;, p&aacute;ros&iacute;t&oacute; &eacute;s sz&aacute;mjegyes k&eacute;rd&eacute;sek haszn&aacute;lat&aacute;t, tov&aacute;bb&aacute; az _____ besz&uacute;r&aacute;s&aacute;t a "sz&oacute;kit&ouml;lt&#337;" forma eset&eacute;n.  A k&uuml;l&ouml;nf&eacute;le k&eacute;rd&eacute;sfajt&aacute;k egyetlen sz&ouml;veges &aacute;llom&aacute;nyban vegyesen haszn&aacute;lhat&oacute;k, emellett a form&aacute;tum t&aacute;mogatja egysoros megjegyz&eacute;sek, k&eacute;rd&eacute;snevek, visszajelz&eacute;s &eacute;s sz&aacute;zal&eacute;ks&uacute;lyoz&aacute;s&uacute; pontok haszn&aacute;lat&aacute;t. &Iacute;me n&eacute;h&aacute;ny p&eacute;lda:</p>
<pre>
Ki fekszik Grant s&iacute;rj&aacute;ban?{~Grant ~Jefferson =senki}

Grant {~temetett =elhantolt ~&eacute;l} Grant s&iacute;rj&aacute;ban.

Grant van eltemetve Grant s&iacute;rj&aacute;ba.{FALSE}

Ki fekszik Grant s&iacute;rj&aacute;ban?{=senki =senki sem}

</pre>

<p align="right"><a href="help.php?file=formatgift.html&amp;module=quiz">Tov&aacute;bbi inform&aacute;ci&oacute;k a "GIFT"-
form&aacute;val kapcsolatosan</a></p>
</ul>

<p><strong>Aiken-forma</strong></p>
<ul>
<p>Az Aiken-forma feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;sek k&eacute;sz&iacute;t&eacute;s&eacute;hez haszn&aacute;lt igen 
egyszer&#369;, olvashat&oacute; forma. &Iacute;me egy p&eacute;lda erre a form&aacute;ra:</p>
<pre>
Mi az els&#337;seg&eacute;ly c&eacute;lja?
A. &Eacute;let megment&eacute;se, tov&aacute;bbi s&eacute;r&uuml;l&eacute;s megel&#337;z&eacute;se, eg&eacute;szs&eacute;g meg&#337;rz&eacute;se
B. S&eacute;r&uuml;lt vagy sebes&uuml;lt szem&eacute;ly r&eacute;sz&eacute;re orvosi ell&aacute;t&aacute;s biztos&iacute;t&aacute;sa
C. Tov&aacute;bbi s&eacute;r&uuml;l&eacute;s megel&#337;z&eacute;se
D. Seg&iacute;ts&eacute;get keres&#337; &aacute;ldozatok megseg&iacute;t&eacute;se
V&Aacute;LASZ: A
</pre>

<p align="right"><a href="help.php?file=formataiken.html&amp;module=quiz">Tov&aacute;bbi inform&aacute;ci&oacute;k az Aiken-form&aacute;val 
kapcsolatosan</a></p>
</ul>


<p><strong>Sz&oacute;kit&ouml;lt&#337;</strong></p>
<ul>
<p>Ez a forma csak a feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;seket t&aacute;mogatja. Az egyes v&aacute;laszokat hull&aacute;mjel 
(~) v&aacute;lasztja el egym&aacute;st&oacute;l, a helyes v&aacute;lasz el&#337;tt egyenl&#337;s&eacute;gjel (=) &aacute;ll. 
&Iacute;me egy p&eacute;lda:

<blockquote>Amikor kisgyermekk&eacute;nt elkezdj&uuml;k felfedezni test&uuml;nk r&eacute;szeit, az {=anat&oacute;mia &eacute;s 
fiziol&oacute;gia ~reflexol&oacute;gia ~tudom&aacute;ny ~k&iacute;s&eacute;rlet} tanul&oacute;iv&aacute; v&aacute;lunk, &eacute;s 
bizonyos &eacute;rtelemben tanul&oacute;k is maradunk eg&eacute;sz &eacute;let&uuml;nkben. </blockquote>

<p align="right"><a href="help.php?file=formatmissingword.html&amp;module=quiz">Tov&aacute;bbi inform&aacute;ci&oacute;k a 
sz&oacute;kit&ouml;lt&#337; form&aacute;val kapcsolatosan</a></p>
</ul>


<p><strong>AON</strong></p>
<ul>
<p>Ez azonos a sz&oacute;kit&ouml;lt&#337; form&aacute;val, azzal a k&uuml;l&ouml;nbs&eacute;ggel, hogy a k&eacute;rd&eacute;sek 
import&aacute;l&aacute;sa ut&aacute;n az &ouml;sszes kieg&eacute;sz&iacute;t&#337; k&eacute;rd&eacute;seket a rendszer n&eacute;gyes&eacute;vel 
p&aacute;ros&iacute;t&oacute; k&eacute;rd&eacute;sekk&eacute; alak&iacute;tja &aacute;t.</p>
<p>Emellett az import&aacute;l&aacute;s sor&aacute;n a feleletv&aacute;laszt&oacute;s k&eacute;rd&eacute;sekre adand&oacute; v&aacute;laszokat 
a rendszer v&eacute;letlenszer&#369;en rendezi el.</p>
<p>Nev&eacute;t egy olyan szervezetr&#337;l kapta, amely sz&aacute;mos tesztjellemz&#337; kifejleszt&eacute;s&eacute;hez adott 
t&aacute;mogat&aacute;st</p>
</ul>


<p><strong>Blackboard</strong></p>
<ul>
<p>Ez a modul a Blackboard export&aacute;l&aacute;si form&aacute;j&aacute;nak megfelel&#337; k&eacute;rd&eacute;seket k&eacute;pes 
import&aacute;lni. A modul a PHP-ben leford&iacute;tott XML-f&uuml;ggv&eacute;nyekre t&aacute;maszkodik.</p>

<p align="right"><a href="help.php?file=formatblackboard.html&amp;module=quiz">Tov&aacute;bbi inform&aacute;ci&oacute;k a Blackboard-
form&aacute;val kapcsolatosan</a></p>
</ul>


<p><strong>WebCT</strong></p>
<ul>
<p>Ez a modul a WebCT export&aacute;l&aacute;si form&aacute;j&aacute;nak megfelel&#337; k&eacute;rd&eacute;seket k&eacute;pes 
import&aacute;lni.</p>

<p align="right"><a href="help.php?file=formatwebct.html&amp;module=quiz">Tov&aacute;bbi inform&aacute;ci&oacute;k a WebCT-form&aacute;val 
kapcsolatosan</a></p>
</ul>


<p><strong>Course Test Manager</strong></p>
<ul>
<p>Ez a modul Course Test Manager feladatbanki form&aacute;ban mentett k&eacute;rd&eacute;seket k&eacute;pes import&aacute;lni. A 
Microsoft Access adatb&aacute;zisban t&aacute;rolt feladatbankhoz k&uuml;l&ouml;nf&eacute;le hozz&aacute;f&eacute;r&eacute;si m&oacute;dokat 
t&aacute;mogat att&oacute;l f&uuml;gg&#337;en, hogy a Moodle Windows vagy Linux webszerveren fut-e.</p>
<p>Windows alatt az Access adatb&aacute;zist b&aacute;rmely egy&eacute;b adat&aacute;llom&aacute;nyhoz hasonl&oacute;an 
import&aacute;lhatja.</p>
<p>Linux eset&eacute;n egy Windows g&eacute;pet kell l&eacute;trehozni a Course Test Manager adatb&aacute;zissal azonos 
h&aacute;l&oacute;zaton egy ODBC Socket Server nev&#369; porgrammal egy&uuml;tt, amely XML seg&iacute;ts&eacute;g&eacute;vel 
adja &aacute;t az adatokat a Moodle sz&aacute;m&aacute;ra a Linux szerveren.</p>  
<p>Az ilyen import&aacute;l&aacute;si lehet&#337;s&eacute;g haszn&aacute;lata el&#337;tt olvassa el az eg&eacute;sz 
s&uacute;g&oacute;t.</p>


<p align="right"><a href="help.php?file=formatctm.html&amp;module=quiz">Tov&aacute;bbi inform&aacute;ci&oacute;k a CTM-form&aacute;val 
kapcsolatosan</a></p>
</ul>

<p><strong>Be&eacute;p&iacute;tett v&aacute;laszok (Kit&ouml;lt&#337;)</strong></p>
<ul>
<p>Ez a speci&aacute;lis forma csak egyfajta k&eacute;rd&eacute;s, a be&eacute;p&iacute;tett v&aacute;laszos 
(m&aacute;s n&eacute;ven kit&ouml;lt&#337;s) forma import&aacute;l&aacute;s&aacute;ra alkalmas.
</p>

<p align="right"><a href="help.php?file=multianswer.html&amp;module=quiz">Tov&aacute;bbi inform&aacute;ci&oacute;k a kit&ouml;lt&#337;s form&aacute;val 
kapcsolatosan</a></p>
</ul>



<p><strong>Saj&aacute;t</strong></p>
<ul>
<p>Ha saj&aacute;t import&aacute;l&aacute;si form&aacute;val rendelkezik, szerkessze meg ennek megfelel&#337;en a mod/quiz/format/custom.php 
&aacute;llom&aacute;nyt.</p>

<p>Az &uacute;jonnan &iacute;rand&oacute; k&oacute;d igen csek&eacute;ly -  az adott sz&ouml;vegb&#337;l mind&ouml;ssze egy 
k&eacute;rd&eacute;s beolvas&aacute;s&aacute;t kell meg&iacute;rni.

<p align="right"><a href="help.php?file=formatcustom.html&amp;module=quiz">Tov&aacute;bbi inform&aacute;ci&oacute;k a 
saj&aacute;t form&aacute;val kapcsolatosan</a></p>
</ul>


<p>Tov&aacute;bbi form&aacute;k ker&uuml;lnek a rendszerbe a k&eacute;s&#337;bbiek folyam&aacute;n, ide&eacute;rtve a WebCT-t, az 
IMS QTI-t &eacute;s b&aacute;rmely egyebet, amelyet a Moodle felhaszn&aacute;l&oacute;i rendelkez&eacute;sre bocs&aacute;tanak!  </p>
