<p align="center"><b>Administration</b></p>
<p>
Den f&ouml;rsta tabellen p&aring; den h&auml;r sk&auml;rmen visar hur
de &ouml;vergripande betygen/omd&ouml;mena f&ouml;r inskickade arbeten ber&auml;knas.
De &ouml;vergripande betygen/omd&ouml;mena &auml;r den viktade summan av 
tv&aring; komponenter.
</p>
<ol><li>
<b>Distansl&auml;rarens betyg/omd&ouml;me f&ouml;r studentens/elevens/deltagarens/den l&auml;randes 
(prelimin&auml;ra) bed&ouml;mning/v&auml;rdering/betygss&auml;ttning av sitt eget arbete.</b>
<br /><br />
Detta kan kallas "betyg/omd&ouml;me f&ouml;r betygss&auml;ttning/avgivande av omd&ouml;me".
N&auml;r studenterna/eleverna/deltagarna/de l&auml;rande v&auml;l har skickat in sina arbeten s&aring;
beh&ouml;ver de inte revidera sina bed&ouml;mningar/v&auml;rderingar/betygs&auml;ttningar. 
Han/hon ombeds INTE att g&ouml;ra en s&aring;dan revision varje g&aring;ng de skickar in sina arbeten igen.
Det betyg/omd&ouml;me som de har f&aring;tt &auml;r relevant f&ouml;r deras prestation men det &auml;r 
inte lika viktigt som distansl&auml;rarens bed&ouml;mning/v&auml;rdering/betygss&auml;ttning av arbetet.
I normalfallet ska det allts&aring; viktas l&auml;gre.<br /><br /></li> 
<li><b>Det betyg/omd&ouml;me som distansl&auml;raren har avgivit om de inskickade arbetena.</b>
<br /><br />
Dessa bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar &auml;r normalt sett 
den viktigaste delen av en &ouml;vningsuppgift. N&auml;r studenterna/eleverna/deltagarna/de l&auml;rande
till&aring;ts skicka in sina arbeten upprepade g&aring;nger kan Du som distansl&auml;rare avg&ouml;ra
huruvida slutbetyget/det slutliga omd&ouml;met ska vara medelbetyget/omd&ouml;met f&ouml;r det inskickade arbetet
eller betyget/omd&ouml;met f&ouml;r det b&auml;sta arbetet.</li> 
</ol>
<p>
Dessa tv&aring; komponenter viktas som l&auml;mpliga f&ouml;r uppgiften.
Som distansl&auml;rare kan Du t ex vikta 'betygsbetyget' mycket l&aring;gt, t o m till '0'.
I det fallet kommer betyget/omd&ouml;met till st&ouml;rsta delen eller helt och h&aring;llet att
utg&ouml;ras av de betyg/omd&ouml;men som de f&aring;r p&aring; sina inskickade arbeten.
De b&aring;da viktade faktorerna kan &auml;ndras n&auml;r som helst under uppgiften. Konsekvensen
f&ouml;r betygen/omd&ouml;mena av varje &auml;ndring visas omedelbart p&aring; 'Betygssidan'
och i listan &ouml;ver slutbetyg/slutliga omd&ouml;men.
</p><p>
Sidan f&ouml;r administration listar ocks&aring;:
<ol>
 <li>distansl&auml;rarens inskickade arbeten
(beskrivningarna av &Ouml;vningsuppgiften), </li>
<li>studenternas/elevernas/deltagarnas/de l&auml;randes
(prelimin&auml;ra) bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar 
av sina egna arbeten</li>
<li>studenternas/elevernas/deltagarnas/de l&auml;randes inskickade arbeten
</li>
</ol>
<p>
Dessa tabeller till&aring;ter att Du, n&auml;r Du finner det l&auml;mpligt, 
byter namn p&aring;, tar bort, visar, eller omv&auml;rderar alla element som ing&aring;r.
<br /><br />
Den h&auml;r delen av sidan kan anv&auml;ndas f&ouml;r att &ouml;vervaka 
studenternas/elevernas/deltagarnas/de l&auml;randes framsteg under hela processen med
&Ouml;vningsuppgiften.
</p>
