<p align="center"><b>Betyg/omd&ouml;men p&aring; uppgifter</b></p>

<p>
I den h&auml;r &Ouml;vningsuppgiften anv&auml;nder b&aring;de studenter/elever/deltagare/l&auml;rande och
distansl&auml;rare samma formul&auml;r f&ouml;r bed&ouml;mning/v&auml;rdering/betygss&auml;ttning
f&ouml;r att hantera det arbete som produceras. B&aring;da grupperna anv&auml;nder formul&auml;ret 
under olika stadier av &Ouml;vningsuppgiften. S&aring;lunda &auml;r den nedanst&aring;ende f&ouml;rklaringen
uppdelad i tv&aring; delar.
</p>
	
<p><b>F&ouml;r studenter/elever/deltagare/l&auml;rande</b></p>
	
<p>
Formul&auml;ret f&ouml;r bed&ouml;mning/v&auml;rdering/betygss&auml;ttning
&auml;r fr&auml;mst till f&ouml;r att visa hur Ditt arbete blir bed&ouml;mt/v&auml;rderat/betygssatt
av distansl&auml;raren. Du ska allts&aring; fylla i det h&auml;r formul&auml;ret <b>innan</b> 
Du kan skicka in Ditt arbete. Du kan anv&auml;nda det som en checklista.
Formul&auml;ret skickas <b>inte</b> till distansl&auml;raren n&auml;r Du sparar det.
Du kan komma tillbaka till det h&auml;r formul&auml;ret och &auml;ndra i det (och i Ditt arbete)
s&aring;  m&aring;nga g&aring;nger Du vill. Detta under f&ouml;ruts&auml;ttning att Du 
<b>inte</b> har skickat in Ditt arbete. 
</p><p>
L&auml;gg m&auml;rke till att &auml;ven om Du f&aring;r g&ouml;ra det, s&aring; &auml;r det egentligen
inte n&ouml;dv&auml;ndigt att skicka in Ditt arbete omedelbart efter det att Du har fyllt i det h&auml;r formul&auml;ret
fullst&auml;ndigt. 
</p><p>
Inneh&aring;llet i Din bed&ouml;mning/v&auml;rdering/betygss&auml;ttning finns dock kvar och
blir tillg&auml;nglig f&ouml;r distansl&auml;raren n&auml;r Du skickar in Ditt arbete.
</p>
	
<p>
Om distansl&auml;raren kr&auml;ver att Du ska g&ouml;ra &auml;ndringar i Ditt arbete
och skicka in det igen, s&aring; kommer Du <b>inte</b> att beh&ouml;va revidera 
bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen av Ditt "nya" arbete. 
Bed&ouml;mningen/v&auml;rderingen/betygss&auml;ttningen beh&ouml;ver Du bara 
g&ouml;ra f&ouml;rsta g&aring;ngen.
</p>
	
<p>
Distansl&auml;raren tittar p&aring; denna Din (prelimin&auml;ra) bed&ouml;mning/v&auml;rdering/betygss&auml;ttning av 
Ditt eget arbete. Distansl&auml;raren kan i samband med det l&auml;gga till kommentarer och s&auml;tta betyg p&aring;/avge omd&ouml;men om
det. Du kommer att kunna se dessa kommentarer och betyget/omd&ouml;met kan vara en del 
underlaget f&ouml;r det slutbetyg/slutliga omd&ouml;me som Du f&aring;r p&aring; denna &Ouml;vningsuppgift.
</p>
<p><b>F&ouml;r distansl&auml;raren</b></p>
<p>
Formul&auml;ret f&ouml;r bed&ouml;mning/v&auml;rdering/betygss&auml;ttning anv&auml;nder Du 
f&ouml;r att s&auml;tta betyg p&aring;/avge omd&ouml;men om de arbeten som studenterna/eleverna/deltagarna/de l&auml;rande
skickar in. Dessa betyg/omd&ouml;men utg&ouml;r i normalfallet en huvudkomponent i slutbetygen/de slutliga omd&ouml;mena
p&aring; &Ouml;vningsuppgiften. N&auml;r Du har gjort Din bed&ouml;mning/v&auml;rdering/betygss&auml;ttning kan Du
avg&ouml;ra om Du vill l&aring;ta studenterna/eleverna/deltagarna/de l&auml;rande &auml;ndra och skicka in sina 
arbeten igen, f&ouml;rhoppningsvis med f&ouml;rb&auml;ttringar.
</p><p>
N&auml;r Du sparar en bed&ouml;mning/v&auml;rdering/betygss&auml;ttning f&aring;r en kort tid
inom vilken Du kan g&ouml;ra &auml;ndringar innan den g&ouml;rs tillg&auml;nglig f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande.
</p>
