<img valign=absmiddle src="<?php echo $CFG->wwwroot?>/mod/exercise/icon.gif">&nbsp;<b>&Ouml;vningsuppgift</b>
<p>
En &Ouml;vningsuppgift &auml;r en enkel men kraftfull uppgift. I en &Ouml;vningsuppgift
ber distansl&auml;raren studenterna/eleverna/deltagarna/de l&auml;rande att utf&ouml;ra
ett praktiskt arbete. Det kan inneb&auml;ra att skriva en ess&auml; eller en rapport, att 
f&ouml;rbereda en presentation eller ett kalkylblad etc. 
</p><p>
N&auml;r studenterna/eleverna/deltagarna/de l&auml;rande
har gjort uppgiften s&aring; m&aring;ste de f&ouml;rst bed&ouml;ma/v&auml;rdera/betygss&auml;tta sitt eget 
arbete innan de skickar in det till distansl&auml;raren. 
</p><p>
N&auml;r de v&auml;l har skickat in det kan
Du som distansl&auml;rare bed&ouml;ma b&aring;de deras bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar
och sj&auml;lva arbetet. 
</p><p>
Du kan ocks&aring; ge &aring;terkoppling och be dem f&ouml;rb&auml;ttra sina arbeten
och skicka in dem igen om Du vill.
 </p>
Innan &Ouml;vningsuppgiften b&ouml;rjar skapar Du den genom att:
<ol> 
<li>
skapa ett Word-dokument eller en HTML-fil som introducerar &Ouml;vningsuppgiften
och klarg&ouml;r f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande vad de beh&ouml;ver g&ouml;ra.
Sedan laddar Du upp den till &Ouml;vningsuppgiften.
</li><li>
l&auml;gga till textelementen och v&auml;lja alternativ i formul&auml;ret f&ouml;r 
bed&ouml;mning/v&auml;rdering/betygss&auml;ttning. Det h&auml;r formul&auml;ret 
anv&auml;nds b&aring;de av studenterna/eleverna/deltagarna/de l&auml;rande f&ouml;r att 
bed&ouml;ma/v&auml;rdera/betygss&auml;tta det arbete som ska produceras i &Ouml;vningsuppgiften.
Det finns olika typer av bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar som man kan anv&auml;nda.
<br /><br />
Se det hj&auml;lp-dokument som handlar om "Strategier f&ouml;r att s&auml;tta betyg/avge omd&ouml;men".
</ol>	
<p>
I stora klasser kan Du som distansl&auml;rare tycka att det &auml;r l&auml;mpligt att skapa 
mer &auml;n en version av &Ouml;vningsuppgiften. Med det f&aring;r Du variation och kan f&ouml;rvissa
Dig om att studenterna/eleverna/deltagarna/de l&auml;rande g&ouml;r olika saker under arbetet.
</p><p>
Studenterna/eleverna/deltagarna/de l&auml;rande tilldelas &Ouml;vningsuppgifterna  p&aring; ett 
slumpm&auml;ssigt men balanserat s&auml;tt. Var och en f&aring;r bara en variant men b&aring;da varianterna
distribueras till i stort sett lika m&aring;nga uppgiftsl&ouml;sare.
L&auml;gg m&auml;rke till att varianterna m&aring;ste utformas s&aring; att de kan bed&ouml;mas/v&auml;rderas/betygss&auml;ttas
enligt samma f&ouml;rmul&auml;r.
</p>

<p>
N&auml;r Du har beskrivningarna av &Ouml;vningsuppgiften formul&auml;ret f&ouml;r 
bed&ouml;mning/v&auml;rdering/betygss&auml;ttning p&aring; plats s&aring; &ouml;ppnas
uppgiften f&ouml;r studenterna/eleverna/deltagarna/de l&auml;rande. De f&aring;r se 
en beskrivning av &ouml;vningen eller uppgiften. 
</p><p>
N&auml;r de har gjort sin &Ouml;vningsuppgift
m&aring;ste de bed&ouml;ma/v&auml;rdera/betygss&auml;tta sitt eget arbete innan de kan skicka 
in sitt arbete till distansl&auml;raren. De kan anv&auml;nda formul&auml;ret som 
en 'checklista'. Om de s&aring; &ouml;nskar s&aring; kan de b&aring;de revidera sina arbeten
och bed&ouml;mningar/v&auml;rderingar/betygss&auml;ttningar innan de skickar in sina arbeten.
</p><p>
F&ouml;rhoppningsvis s&aring; blir de uppmuntrade att g&ouml;ra det.
</p><p>
N&auml;r n&aring;gon v&auml;l har skickat in sitt arbete s&aring; blir b&aring;de dennes
arbete och bed&ouml;mning/v&auml;rdering/begtygss&auml;ttning tillg&auml;ngliga f&ouml;r distansl&auml;raren.
</p><p>
Du kan s&auml;tta betyg p&aring;/avge omd&ouml;men om bed&ouml;mningarna/v&auml;rderingarna/betygss&auml;ttningarna
och det finns ett utrymme f&ouml;r kommentarer. Som distansl&auml;rare har Du &auml;ven tillg&aring;ng till
sj&auml;lva arbetet (genom att anv&auml;nda bed&ouml;mningarna/v&auml;rderingarna/betygss&auml;ttningarna som en
utg&aring;ngspunkt). Du kan i samband med det avg&ouml;ra om Du ska be n&aring;gon att skicka in en reviderad
och f&ouml;rb&auml;ttrad version om det &auml;r p&aring;kallat.
</p>
	
<p>
N&auml;r Du s&auml;tter betyg p&aring;/avger omd&ouml;men om ett reviderat arbete 
s&aring; kan Du via formul&auml;ret bygga vidare p&aring; det bed&ouml;mningsarbete
som Du redan har lagt ned.
</p>
	
<p>
N&auml;r stoppdatumet intr&auml;ffar s&aring; flyttar Du &Ouml;vningsuppgiften
till n&auml;sta fas. D&auml;rmed g&aring;r det inte att skicka in fler arbeten.
Nu &auml;r det tid att s&auml;tta betyg p&aring;/avge omd&ouml;men om de arbeten och insatser
som Du &auml;nnu inte har gjort det p&aring;.
</p>
<p>
N&auml;r alla inskickade arbeten har f&aring;tt betyg/omd&ouml;men s&aring; flyttas
&Ouml;vningsuppgiften till den sista fasen. Studenterna/eleverna/deltagarna/de l&auml;rande 
kan nu se sina slutbetyg/slutliga omd&ouml;men och de betyg/omd&ouml;men som de har f&aring;tt
f&ouml;r sina inskickade arbeten. Betyget/omd&ouml;met p&aring; &Ouml;vningsuppgiften &auml;r en 
viktad kombination av distansl&auml;rarens betyg/omd&ouml;me f&ouml;r deras sj&auml;lvbed&ouml;mning
och distansl&auml;rarens betyg/omd&ouml;me f&ouml;r detta arbete. Studentens/elevens/deltagarens/den l&auml;randes
eget betyg/omd&ouml;me r&auml;knas INTE. Viktningen som anv&auml;nds f&ouml;r de b&aring;da betygen/omd&ouml;mena
kan st&auml;llas in och &auml;ndras n&auml;r som helst under uppgiften.
</p><p>
N&auml;r Du som distansl&auml;rare l&aring;ter studenterna/eleverna/deltagarna/de l&auml;rande skicka 
in sina arbeten igen s&aring; b&ouml;r Du fundera &ouml;ver hur Du ska st&auml;lla in det alternativ som 
kontrollerar hur slutbetygen/de slutliga omd&ouml;mena ber&auml;knas med utg&aring;ngspunkt fr&aring;n 
flerfaldigt inskickade arbeten. H&auml;r kan Du v&auml;lja mellan medelbetyget eller det h&ouml;gsta betyget.
Du kan &auml;ndra det h&auml;r alternativet n&auml;r som helst och alla &auml;ndringar avspeglar sig 
omedelbart p&aring; betygs/omd&ouml;messidan.
</p><p>
I &Ouml;vningsuppgiftens slutfas kan studenterna/eleverna/deltagarna/de l&auml;rande
&auml;ven se en tabell som rangordnar de inskickade arbetena. Det arbete som har f&aring;tt 
h&ouml;gst betyg/omd&ouml;me visas l&auml;ngst upp i tabellen. N&auml;r det &auml;r fr&aring;gan
om flerfaldigt inskickade arbeten s&aring; visas bara vars och ens b&auml;sta arbete.</p>
	
