<p align="center"><strong>Forr&aacute;s t&iacute;pusa</strong></p>

<p>Forr&aacute;s lehet b&aacute;rmely elk&eacute;pzelhet&#337; tartalom. Ide tartoznak mindazok a k&uuml;l&ouml;nf&eacute;le t&iacute;pusok, amelyek 
alapvet&#337;en meghat&aacute;rozz&aacute;k, hogy a tartalom mik&eacute;ppen &eacute;rhet&#337; el:</p>

<p><strong>Egyszer&#369; sz&ouml;veg</strong> - a legk&ouml;nnyebben el&#337;&aacute;ll&iacute;that&oacute; t&iacute;pus. Az oldalt 
egyszer&#369; g&eacute;pel&eacute;ssel lehet a k&ouml;vetkez&#337; oldalon szerepl&#337; &#369;rlapon megszerkeszteni. Egyes beg&eacute;pelt dolgok 
form&aacute;z&aacute;sa automatikusan t&ouml;rt&eacute;nik, ahogyan pl. a f&oacute;rum&uuml;zenetek&eacute;. 
<a href="help.php?file=text.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s az automatikusan form&aacute;zott sz&ouml;vegr&#337;l</a></p>

<p><strong>HTML-sz&ouml;veg</strong> - a nyelvet ismer&#337; felhaszn&aacute;l&oacute;knak aj&aacute;nlott. Semmilyen automatikus 
form&aacute;z&aacute;s nem t&ouml;rt&eacute;nik, mindent mag&aacute;nak a felhaszn&aacute;l&oacute;nak kell meg&iacute;rni HTML-k&oacute;dokkal.
<a href="help.php?file=html.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s a HTML-sz&ouml;vegr&#337;l</a></p>

<p><strong>Hivatkoz&aacute;s</strong> - szakirodalmi hivatkoz&aacute;s egy foly&oacute;iratra vagy k&ouml;nyvre.</p>

<p><strong>Felt&ouml;lt&ouml;tt &aacute;llom&aacute;ny </strong> - azokat az &aacute;llom&aacute;nyokat jelzi, amelyeket a kurzusba a 
felhaszn&aacute;l&oacute; felt&ouml;lt&ouml;tt. L&aacute;sd az '&Aacute;llom&aacute;nyok' c. r&eacute;szt.</p>

<p><strong>K&ouml;nyvt&aacute;r</strong> - a kurzus&aacute;llom&aacute;nyok ter&uuml;let&eacute;vel kapcsolatosan megjelen&iacute;ti a teljes 
k&ouml;nyvt&aacute;r- (&eacute;s alk&ouml;nyvt&aacute;r-) szerkezetet. Ennek alapj&aacute;n a tanul&oacute;k v&eacute;gigb&ouml;ng&eacute;szhetik 
&eacute;s megtekinthetik az &ouml;sszes itt l&eacute;v&#337; &aacute;llom&aacute;nyt.</p>

<p><strong>Webes ugr&oacute;pont</strong> - Egy URL-mutat&oacute; a web valamely hely&eacute;re. Ha valaki erre a 
forr&aacute;stev&eacute;kenys&eacute;gre kattint, kiker&uuml;l a kurzusb&oacute;l (a megadott oldal t&ouml;lti be a b&ouml;ng&eacute;sz&#337; 
ablak&aacute;t, illetve - ha &iacute;gy adja meg - egy teljesen &uacute;j ablakot ind&iacute;t el).</p>
 <p><strong>Weboldal</strong> - Egy URL-mutat&oacute; a web valamely hely&eacute;re.  Az el&#337;z&#337; t&iacute;pushoz hasonl&oacute;an ez is egy 
 weboldalt jelen&iacute;t meg. Az el&#337;z&#337; t&iacute;pust&oacute;l annyiban azonban elt&eacute;r, hogy az oldal 
<strong>keretben jelenik meg</strong>, mintha be lenne &eacute;p&iacute;tve a kurzusba.</p>

<p><strong>Program</strong> - olyan k&uuml;ls&#337; program, amely inform&aacute;ci&oacute;kat k&eacute;r a jelenlegi 
Moodle-felhaszn&aacute;l&oacute;r&oacute;l &eacute;s -kurzusr&oacute;l. Ennek k&ouml;sz&ouml;nhet&#337;en k&uuml;ls&#337; webalkalmaz&aacute;sok 
m&#369;k&ouml;dhetnek egy&uuml;tt a Moodle-lal. 
<a href="help.php?file=program.html&amp;module=resource">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s a programforr&aacute;sokr&oacute;l</a></p>

<p><strong>Wiki-sz&ouml;veg</strong> - t&ouml;bb form&aacute;z&aacute;si lehet&#337;s&eacute;get k&iacute;n&aacute;l, mint az egyszer&#369; 
sz&ouml;veg, ugyanakkor nem ig&eacute;nyli a HTML elsaj&aacute;t&iacute;t&aacute;s&aacute;t. Egyszer&#369; sz&ouml;veg be&iacute;r&aacute;sa 
mellett egy sor form&aacute;z&oacute; karaktert g&eacute;pelhet (p&eacute;ld&aacute;ul: *this will be bold* /ez a r&eacute;sz vastagbet&#369;s lesz/), 
&iacute;gy k&ouml;nny&#369;szerrel &ouml;sszetett form&aacute;z&aacute;si utas&iacute;t&aacute;sokat fogalmazhat meg. 
<a href="help.php?file=wiki.html">Tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s a Wiki-sz&ouml;vegr&#337;l</a></p>

