<p align="center"><strong>Ablakbe&aacute;ll&iacute;t&aacute;sok</strong></p>

<p>Ezek a be&aacute;ll&iacute;t&aacute;sok elrejthet&#337;k/megjelen&iacute;thet&#337;k a Be&aacute;ll&iacute;t&aacute;sok 
elrejt&eacute;se/Be&aacute;ll&iacute;t&aacute;sok megjelen&iacute;t&eacute;se gombra kattintva.</p>

<p>A tananyagok &aacute;ltal&aacute;ban szok&aacute;sos keretes ablakban jelennek meg, a fels&#337; keretben a 
Moodle navig&aacute;ci&oacute;s eszk&ouml;zeivel.  Ha kedve tartja, elt&aacute;vol&iacute;thatja a keretet, ez esetben a tananyag 
egy szok&aacute;sos weboldalhoz hasonl&oacute;an t&ouml;lti ki az ablakot.</p>

<p>Ha viszont a tananyagot egy &uacute;j el&#337;bukkan&oacute; ablakban szeretn&eacute; megjelen&iacute;teni, 
hajtsa v&eacute;gre a k&ouml;vetkez&#337; l&eacute;p&eacute;seket:</p>

<ol>
  <li>Az <strong>Ablak:</strong> r&eacute;szben v&aacute;lassza az '&Uacute;j ablak' pontot.</li>
  <li>Azokat a lehet&#337;s&eacute;geket, amelyeket nem k&iacute;v&aacute;n haszn&aacute;lni, &aacute;ll&iacute;tsa be bejel&ouml;letlennek.<br />

<blockquote>
  <strong>M&eacute;retezhet&#337; legyen az ablak?</strong>
  <p>
  Kiv&aacute;laszt&aacute;sakor a felhaszn&aacute;l&oacute;k m&oacute;dos&iacute;thatj&aacute;k az ablak m&eacute;ret&eacute;t. 
  Aj&aacute;nlatos a kiv&aacute;laszt&aacute;st mindig megtartani. M&oacute;dos&iacute;t&aacute;sa akkor lehet sz&uuml;ks&eacute;ges, ha a tananyag 
  r&ouml;gz&iacute;tett m&eacute;ret&#369; &eacute;s az ablakot ehhez akarja igaz&iacute;tani.</p>

  <strong>G&ouml;rgethet&#337; legyen az ablak?</strong>
  <p>
  Bejel&ouml;l&eacute;se eset&eacute;n a felhaszn&aacute;l&oacute;k a teljes tananyagot v&eacute;gign&eacute;zhetik.  
  Ellenkez&#337; esetben csak azt l&aacute;tj&aacute;k, ami az ablakban elf&eacute;r, a t&ouml;bbi r&eacute;sz&eacute;t nem.</p>

  <strong>Mutassa a k&ouml;nyvt&aacute;rkapcsolatokat?</strong>
  <p>Kiv&aacute;laszt&aacute;sakor a felhaszn&aacute;l&oacute;k ebben az ablakban l&aacute;tj&aacute;k k&ouml;nyvt&aacute;rkapcsolataikat.
    B&ouml;ng&eacute;sz&#337;nk&eacute;nt elt&eacute;r&#337;: megjelenhet Kedvencek (IE), K&ouml;nyvjelz&#337;k (Mozilla/Firefox, Opera) 
    stb. n&eacute;ven.</p>

  <strong>Mutassa a c&iacute;msort?</strong>
  <p>Kiv&aacute;laszt&aacute;sakor a felhaszn&aacute;l&oacute;k l&aacute;thatj&aacute;k a tananyag URL-j&eacute;t (webc&iacute;m&eacute;t).</p>

  <strong>Mutassa a men&uuml;sort?</strong>
  <p>Kiv&aacute;laszt&aacute;sakor a felhaszn&aacute;l&oacute;k haszn&aacute;lhatj&aacute;k az ablak men&uuml;sor&aacute;t.  
  &Aacute;ltal&aacute;ban hasznos dolog, de n&eacute;h&aacute;ny grafikus tananyag jobban mutat a men&uuml;sor n&eacute;lk&uuml;l.</p>

  <strong>Mutassa az eszk&ouml;zsort?</strong>
  <p>Az eszk&ouml;zsorral k&ouml;nnyebb navig&aacute;lni, mert el&eacute;rhet&#337; rajta a Vissza/El&#337;re, a Kezd&#337;lap &eacute;s a 
  Friss&iacute;t&eacute;s gomb.</p>

  <strong>Mutassa az &aacute;llapotsort?</strong>
  <p>Az &aacute;llapotsorral t&aacute;j&eacute;koz&oacute;dhat p&eacute;ld&aacute;ul arr&oacute;l, hogy a tananyag mekkora h&aacute;nyada 
  t&ouml;lt&#337;d&ouml;tt be, vannak-e biztons&aacute;gi 
  &uuml;zenetek stb.</p>

</blockquote>

  <li>Megnyitand&oacute; ablak m&eacute;ret&eacute;nek megad&aacute;sa. </li>

<blockquote>
  <p>Sokan m&eacute;g ma is 800x600-as k&eacute;perny&#337;felbont&aacute;st haszn&aacute;lnak.  &Aacute;ltal&aacute;ban c&eacute;lszer&#369; 
  el&#337;sz&ouml;r enn&eacute;l kisebb felbont&aacute;ssal, p&eacute;ld&aacute;ul 600x480-assal kezdeni.</p>

  <p>Ha a mez&#337;ket &uuml;resen hagyja, az &uacute;j el&#337;ugr&oacute; ablak m&eacute;rete azonos lesz az&eacute;val,
   amelyr&#337;l azt el&#337;h&iacute;vta.</p>

</blockquote>
</li>
</ol>
