<p><font size="2" face="Arial, Helvetica, sans-serif"><strong>Tegevuste moodulid</strong><br>
  Moodle sisaldab tervet hulka tegevuste mooduleid, mida saab kasutada mistahes 
  kursuse koostamisel.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"><strong>Foorumid</strong><br>
  See tegevus v&otilde;ib osutuda k&otilde;ige olulisemaks &#8211; just siin leiavad 
  diskussioonid enamasti aset. Foorumeid v&otilde;ib struktureerida erineval viisil 
  ja need v&otilde;ivad sisaldada ka grupikaaslaste reitingu igale postitusele. 
  Postitusi saab vaadata erinevates formaatides ning neil v&otilde;ivad olla kaasas 
  manused. Liitudes foorumiga saavad osalejad emaili teel koopiad igast uuest 
  postitusest. &Otilde;petaja v&otilde;ib muuta liitumise kohustuslikuks k&otilde;igile, 
  kui seda soovitakse.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"><strong>P&auml;evikud</strong><br>
  See moodul on &auml;&auml;rmiselt oluline tegevus m&otilde;tisklemiseks. &Otilde;petaja 
  palub &otilde;pilasel m&otilde;tiskleda mingil konkreetsel teemal ja &otilde;pilane 
  saab oma vastust mingi aja jooksul redigeerida ja parandada. Vastus on privaatne 
  ja seda n&auml;eb ainult &otilde;petaja, kes v&otilde;ib pakkuda tagasisidet 
  ja hinnata igat p&auml;eviku sissekannet. Enamasti on sobilik korraldada &uuml;ks 
  P&auml;eviku tegevus n&auml;dalas. <br>
  <br>
  <strong>Ressursid</strong><br>
  Ressursid on sisu: informatsioon, mida &otilde;petaja soovib kursusel esitada. 
  See v&otilde;ib olla koostatud kursuse serverisse &uuml;les laaditud failide 
  kujul; otse Moodle&#8217;is redigeeritud lehtedena v&otilde;i v&auml;lise veebilehe 
  kujul, mis on osa sellest kursusest.<br>
  <br>
  <strong>Assigneeringud</strong><br>
  Assigneeringud v&otilde;imaldavad &otilde;petajal t&auml;psustada &uuml;lesannet, 
  mis eeldab, et &otilde;pilased koostavad mistahes formaadis digitaalse materjali/sisu 
  ja esitavad selle serverisse &uuml;les laadides. T&uuml;&uuml;pilised assigneeringud 
  oleks esseed, projektid, raportid jne. See moodul h&otilde;lmab ka graafilisi 
  vahendeid. <br>
  <br>
  <strong>K&uuml;simustikud</strong><br>
  See moodul v&otilde;imaldab &otilde;petajal koostada ja seadistada testk&uuml;simustikke, 
  mis koosnevad valikvastustega, &otilde;ige/vale ja l&uuml;hivastustega k&uuml;simustest. 
  K&uuml;simusi s&auml;ilitatakse kategoriseeritud andmebaasis ning neid saab 
  kursuste jooksul ning isegi erinevate kursuste vahel korduvalt kasutada. K&uuml;simustikele 
  v&otilde;ib olla lubatud proovida vastata mitu korda. Iga katse m&auml;rgitakse 
  automaatselt &auml;ra ja &otilde;petaja otsustab, kas anda tagasisidet v&otilde;i 
  n&auml;idata &otilde;igeid vastuseid. See moodul h&otilde;lmab ka graafilisi 
  vahendeid.<br>
  <br>
  <strong>Valikud</strong><br>
  Valiku tegevus on v&auml;ga lihtne &#8211; &otilde;petaja esitab k&uuml;simuse 
  ja annab rea valikvastuseid. See v&otilde;ib anda hea tulemuse kiirh&auml;&auml;letusena, 
  et stimuleerida teemaga seotud m&otilde;tteid; v&otilde;imaldada klassil h&auml;&auml;letada 
  kursuse suunitluse asjus v&otilde;i saavutada n&otilde;usolek uurimuse l&auml;biviimiseks.<br>
  <br>
  <strong>Uurimused</strong><br>
  Uurimuse moodul annab rea t&otilde;endatud uurimisinstrumente, mis on leidnud 
  heakskiitu &otilde;ppimise hindamisel ja stimuleerimisel online keskkonnas. 
  &Otilde;petajad v&otilde;ivad neid kasutada &otilde;pilastelt andmete kogumiseks, 
  mis on toeks klassi tundma&otilde;ppimisel ning ka oma &otilde;petamismeetodite 
  &uuml;le m&otilde;tisklemiseks.<br>
  </font></p>
