<p align="center"><strong>&Eacute;rt&eacute;kel&eacute;sek egyeztet&eacute;se</strong></p>

<p>Egy csoportos feladat a k&ouml;vetkez&#337; jellemz&#337;kkel rendelkezhet:</p>

<ol>
<li>A lead&aacute;si &eacute;s &eacute;rt&eacute;kel&eacute;si szakaszban, amikor a tanul&oacute; a t&ouml;bbi tanul&oacute; &aacute;ltal k&eacute;sz&iacute;tett &eacute;rt&eacute;kel&eacute;st l&aacute;tja, nincs visszajelz&eacute;s a munk&aacute;t lead&oacute; tanul&oacute;kt&oacute;l azon tanul&oacute; fel&eacute;, aki az &eacute;rt&eacute;kel&eacute;st v&eacute;gezte. Lehets&eacute;ges visszajelz&eacute;s a tan&aacute;r r&eacute;sz&eacute;r&#337;l, ha a tan&aacute;r &uacute;gy d&ouml;nt, hogy oszt&aacute;lyozza a tanul&oacute;i &eacute;rt&eacute;kel&eacute;seket, mely esetben a tan&aacute;r pontsz&aacute;mai &eacute;s megjegyz&eacute;sei mind a munk&aacute;t k&eacute;sz&iacute;t&#337;, mind az &eacute;rt&eacute;kel&eacute;st v&eacute;gz&#337; tanul&oacute; sz&aacute;m&aacute;ra hozz&aacute;f&eacute;rhet&#337;v&eacute; v&aacute;lnak. Ugyanakkor b&aacute;rmely munk&aacute;t illet&#337;en a tanul&oacute;t&aacute;rsak csakis egyir&aacute;ny&uacute; visszajelz&eacute;ssel &eacute;lhetnek.</li>
	
<li>A lead&aacute;si &eacute;s &eacute;rt&eacute;kel&eacute;si szakaszban a tanul&oacute;k l&aacute;tj&aacute;k a t&ouml;bbi tanul&oacute; 
&aacute;ltal k&eacute;sz&iacute;tett &eacute;rt&eacute;kel&eacute;st &eacute;s lehet&#337;s&eacute;g&uuml;k van arra, hogy megjegyz&eacute;st 
tegyenek ezen &eacute;rt&eacute;kel&eacute;sekre. A (t&aacute;rsuk &aacute;ltali) &eacute;rt&eacute;kel&eacute;ssel vagy egyet&eacute;rtenek, vagy 
nem. Ha az &eacute;rt&eacute;kel&eacute;ssel egyet&eacute;rtenek, akkor az &eacute;rt&eacute;kel&eacute;s megmarad &eacute;s szerepelni fog a 
t&aacute;rs &aacute;ltal az adott munk&aacute;ra adott pontsz&aacute;m meghat&aacute;roz&aacute;s&aacute;ban a v&eacute;gs&#337; 
sz&aacute;m&iacute;t&aacute;sn&aacute;l. Ha viszont nem &eacute;rtenek egyet az &eacute;rt&eacute;kel&eacute;ssel, akkor az 
&eacute;rt&eacute;kel&eacute;st v&eacute;gz&#337; tanul&oacute;nak lehet&#337;s&eacute;ge ny&iacute;lik annak fel&uuml;lvizsg&aacute;lat&aacute;ra. 
A fel&uuml;lvizsg&aacute;lat/egyet nem &eacute;rt&eacute;s ciklusa mindaddig folytat&oacute;dik, am&iacute;g vagy egyet&eacute;rt&eacute;s alakul ki, 
vagy a hat&aacute;rid&#337; lej&aacute;r. Az az &eacute;rt&eacute;kel&eacute;s, amely a hat&aacute;rid&#337; el&eacute;r&eacute;sekor 
tov&aacute;bbra is "vitatott", nem veend&#337; figyelembe a v&eacute;gs&#337; sz&aacute;m&iacute;t&aacute;sn&aacute;l. Ennek k&ouml;sz&ouml;nhet&#337;en a t&aacute;rsak k&ouml;z&ouml;tt k&eacute;tir&aacute;ny&uacute; visszajelz&eacute;s j&ouml;n l&eacute;tre minden egyes munk&aacute;val kapcsolatosan. </li></ol>
<p>Ha a m&aacute;sodik munkam&oacute;dszert v&aacute;lasztja, lehet&#337;s&eacute;g van a pontsz&aacute;mok kijelz&eacute;s&eacute;nek a 
kikapcsol&aacute;s&aacute;ra. Vagyis ha ezt a "pontsz&aacute;mok elrejt&eacute;se" opci&oacute;t v&aacute;lasztja, akkor csakis az 
&eacute;rt&eacute;kel&eacute;shez tartoz&oacute; megjegyz&eacute;sek jelennek meg az &eacute;ppen &eacute;rt&eacute;kelt tanul&oacute; 
sz&aacute;m&aacute;ra. A pontsz&aacute;mok csak az egyet&eacute;rt&eacute;s kialakul&aacute;sa ut&aacute;n v&aacute;lnak 
l&aacute;that&oacute;v&aacute; (csakis a megjegyz&eacute;sek tekintet&eacute;ben). Ne feledje, hogy ez az opci&oacute; csakis akkor 
l&eacute;p &eacute;letbe, amikor az &eacute;rt&eacute;kel&eacute;sekhez egyet&eacute;rt&eacute;sre van sz&uuml;ks&eacute;g.</p>
