<p align="center"><strong>&Eacute;rt&eacute;kel&eacute;sek elemz&eacute;se</strong></p>

<p>Ez az elemz&eacute;s a p&eacute;ld&aacute;kkal kapcsolatos &eacute;rt&eacute;kel&eacute;sre, valamint a feladat t&aacute;rsak &aacute;ltali 
&eacute;rt&eacute;kel&eacute;si szakasz&aacute;ban v&eacute;gzett &eacute;rt&eacute;kel&eacute;sre ir&aacute;nyul. C&eacute;lja, hogy az adott 
tan&aacute;ri &eacute;s tanul&oacute;i &eacute;rt&eacute;kel&eacute;shalmazb&oacute;l kiv&aacute;lassza a jobb &eacute;rt&eacute;kel&eacute;seket. 
Ezeket a "j&oacute;" &eacute;rt&eacute;kel&eacute;seket haszn&aacute;lja a v&eacute;gs&#337; pontsz&aacute;m 
kisz&aacute;m&iacute;t&aacute;s&aacute;n&aacute;l.
</p>

<p>Az elemz&eacute;st akkor c&eacute;lszer&#369; elv&eacute;gezni, amikor tan&aacute;ri &eacute;rt&eacute;kel&eacute;sek &aacute;llnak 
rendelkez&eacute;sre. Ezeket az &eacute;rt&eacute;kel&eacute;seket viszony&iacute;t&aacute;si alapk&eacute;nt haszn&aacute;lhatja a tanul&oacute;i 
&eacute;rt&eacute;kel&eacute;sek meg&iacute;t&eacute;l&eacute;se sor&aacute;n. A tan&aacute;rnak <strong>nem</strong> sz&uuml;ks&eacute;ges minden 
p&eacute;ld&aacute;t &eacute;s minden leadott munk&aacute;t &eacute;rt&eacute;kelni, ugyanakkor az elemz&eacute;s jobban t&aacute;j&eacute;koztat, 
ha t&ouml;bb tan&aacute;ri &eacute;rt&eacute;kel&eacute;se van, mint amennyi az egyes tanul&oacute;k &aacute;ltal v&eacute;gzett &eacute;rt&eacute;kel&eacute;sek &aacute;tlagos mennyis&eacute;ge. Min&eacute;l t&ouml;bb &eacute;rt&eacute;kel&eacute;st k&eacute;sz&iacute;t a tan&aacute;r, ann&aacute;l biztosabb lehet az elemz&eacute;s eredm&eacute;ny&eacute;t illet&#337;en.
</p>

<p>Az elemz&eacute;sre rendszerint t&ouml;bb alkalommal ker&uuml;l sor, ilyenkor &aacute;ltal&aacute;ban egy vagy t&ouml;bb opci&oacute; megv&aacute;ltozik. Az elemz&eacute;s mik&eacute;ntje a lap tetej&eacute;n megjelen&#337; h&aacute;rom opci&oacute;val szab&aacute;lyozhat&oacute;. </p>

<ol><li>A tan&aacute;ri &eacute;rt&eacute;kel&eacute;s bet&ouml;lt&eacute;s&eacute;vel &aacute;ll&iacute;tja be az adott tan&aacute;r 
&eacute;rt&eacute;kel&eacute;seinek a tanul&oacute;k &eacute;rt&eacute;kel&eacute;seivel szembeni s&uacute;lyoz&aacute;s&aacute;t a 
hibaelemz&eacute;si szakaszban. Ha a tan&aacute;r a leadott munk&aacute;val kapcsolatos saj&aacute;t pontoz&aacute;si 
strat&eacute;gi&aacute;j&aacute;t a tanul&oacute;k  pontoz&aacute;sa el&eacute; k&iacute;v&aacute;nja rangsorolni, akkor a 
hibat&aacute;bl&aacute;zatban a tan&aacute;rnak kell a legkisebb &aacute;tlagos hib&aacute;val szerepl&#337; &eacute;rt&eacute;kel&eacute;st 
v&eacute;gz&#337;nek lennie. Ha a tan&aacute;r nem az els&#337; helyen szerepel, akkor a tan&aacute;ri &eacute;rt&eacute;kel&eacute;s 
bet&ouml;lt&eacute;se mindaddig n&ouml;velend&#337;, am&iacute;g a tan&aacute;r a legkisebb &aacute;tlagos hibasz&aacute;mmal nem rendelkezik. 
Ez azt jelenti, hogy a tan&aacute;ri &eacute;rt&eacute;kel&eacute;s fog domin&aacute;lni &eacute;s a tan&aacute;rhoz hasonl&oacute;an pontoz&oacute; 
tanul&oacute;k &uacute;gyszint&eacute;n a hibat&aacute;bl&aacute;zat fels&#337; r&eacute;sz&eacute;n jelennek majd meg. A t&aacute;bl&aacute;zat 
als&oacute; r&eacute;sz&eacute;n megjelen&#337; tanul&oacute;k pontoz&aacute;sa nem felel meg a tan&aacute;r 
&eacute;rt&eacute;kel&eacute;s&eacute;nek (sem a t&aacute;bl&aacute;zat tetej&eacute;n l&eacute;v&#337; tanul&oacute;k&eacute;nak). 
Min&eacute;l t&ouml;bb tan&aacute;ri &eacute;rt&eacute;kel&eacute;s &aacute;ll rendelkez&eacute;sre, ann&aacute;l val&oacute;sz&iacute;n&#369;bb, 
hogy ezt az opci&oacute;t nem kell ig&eacute;nybe venni a tan&aacute;rnak a t&aacute;bl&aacute;zat tetej&eacute;re juttat&aacute;s&aacute;hoz. 
Ne feledje, hogy ez az opci&oacute; <strong>nem</strong> rendel s&uacute;lyoz&aacute;st a tan&aacute;ri &eacute;rt&eacute;kel&eacute;shez, ha az szerepel a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;ban. Abban a sz&aacute;m&iacute;t&aacute;sban a tan&aacute;ri &eacute;rt&eacute;kel&eacute;snek a tanul&oacute;i &eacute;rt&eacute;kel&eacute;sekkel azonos lesz a s&uacute;lya. &Iacute;gy p&eacute;ld&aacute;ul ha egy tanul&oacute; leadott munk&aacute;j&aacute;t a tan&aacute;r 41%-ra &eacute;rt&eacute;keli, t&aacute;rsai pedig 45% - 55%-ra, akkor a konkr&eacute;t leadott munka v&eacute;gs&#337; pontsz&aacute;ma (41% + 45% + 55%) / 3, azaz 47% lesz.</li>

<li>Az &eacute;rt&eacute;kel&eacute;si pontsz&aacute;m s&uacute;lyoz&aacute;sa a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;sakor 
haszn&aacute;latos. A tanul&oacute;i "pontoz&aacute;si teljes&iacute;tm&eacute;ny" kisz&aacute;m&iacute;t&aacute;s&aacute;hoz egyszer&#369; 
k&eacute;plet haszn&aacute;latos. Ez a tanul&oacute;k "j&oacute;" &eacute;rt&eacute;kel&eacute;s&eacute;nek az ar&aacute;nya a sz&aacute;mukra 
rendelkez&eacute;sre &aacute;ll&oacute; &eacute;rt&eacute;kel&eacute;sek maxim&aacute;lis sz&aacute;m&aacute;hoz viszony&iacute;tva. &Iacute;gy 
p&eacute;ld&aacute;ul ha az a feladat, hogy a tanul&oacute;k 3 &eacute;rt&eacute;kel&eacute;st k&eacute;sz&iacute;tsenek a p&eacute;ldak&eacute;nt 
leadott munk&aacute;r&oacute;l &eacute;s 5 csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;st, az adott tanul&oacute; pedig 7 
&eacute;rt&eacute;kel&eacute;st k&eacute;sz&iacute;t, &eacute;s ebb&#337;l 1 kimarad az elemz&eacute;sb&#337;l (l&aacute;sd al&aacute;bb), akkor a 
pontoz&aacute;si teljes&iacute;tm&eacute;nye (7 - 1)/8, azaz 75% lesz. A feladat v&eacute;gs&#337; pontsz&aacute;ma ezen pontoz&aacute;si 
teljes&iacute;tm&eacute;ny &eacute;s a leadott munk&aacute;jukra adott pontsz&aacute;m (vagy t&ouml;bb leadott munka eset&eacute;n a legjobb 
pontsz&aacute;m) s&uacute;lyozott kombin&aacute;ci&oacute;ja. A leadott munka pontsz&aacute;ma mindig 1-es s&uacute;llyal szerepel. &Iacute;gy ha 
ezt az opci&oacute;t, mondjuk, 0,5-re &aacute;ll&iacute;tja, akkor a k&eacute;t pontsz&aacute;m 0,5:1 ar&aacute;nyban, vagy a pontoz&aacute;si 
teljes&iacute;tm&eacute;ny 33%-ak&eacute;nt &eacute;s a leadott munka pontsz&aacute;m&aacute;nak 66%-ak&eacute;nt &ouml;sszegz&#337;dik.</li>
<li>A kiejtend&#337; &eacute;rt&eacute;kel&eacute;sek sz&aacute;zal&eacute;kos ar&aacute;nya hat&aacute;rozza meg a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;b&oacute;l kihagyand&oacute; &eacute;rt&eacute;kel&eacute;sek sz&aacute;m&aacute;t. Ez k&eacute;tf&eacute;lek&eacute;ppen &aacute;ll&iacute;that&oacute; be. 
<ul><li>Ha tudja, mik&eacute;nt t&ouml;rt&eacute;nik a pontoz&aacute;si teljes&iacute;tm&eacute;ny kisz&aacute;m&iacute;t&aacute;sa, akkor ha az adott tanul&oacute; elv&eacute;gzi az &ouml;sszes neki kiosztott munka &eacute;rt&eacute;kel&eacute;s&eacute;t, teljes jegyet kaphat (erre az elemre), ha egyetlen &eacute;rt&eacute;kel&eacute;st sem ejtenek ki. Ha a tan&aacute;r &eacute;sszer&#369;bb &aacute;tlagpontsz&aacute;mot k&iacute;v&aacute;n haszn&aacute;lni, akkor ennek az opci&oacute;nak a 30%-ra &aacute;ll&iacute;t&aacute;s&aacute;val mintegy 70%-os &aacute;tlagos pontoz&aacute;si teljes&iacute;tm&eacute;nyhez juthat  (ism&eacute;t csakis akkor, ha minden tanul&oacute; az &ouml;sszes rendelkez&eacute;s&eacute;re &aacute;ll&oacute; &eacute;rt&eacute;kel&eacute;st lepontozta).</li>
<li>M&aacute;sfel&#337;l a kiejtend&#337; &eacute;rt&eacute;kel&eacute;sek sz&aacute;ma is be&aacute;ll&iacute;that&oacute; &uacute;gy, hogy a fennmarad&oacute; "j&oacute;" &eacute;rt&eacute;kel&eacute;sek az &aacute;tlagos hibasz&aacute;mot valamilyen &eacute;sszer&#369; &eacute;rt&eacute;ken bel&uuml;l tarts&aacute;k. Ezek azok a sz&aacute;zal&eacute;kos ar&aacute;nyok, amelyek a hibat&aacute;bl&aacute;zat negyedik oszlop&aacute;ban szerepelnek. P&eacute;ld&aacute;ul felt&eacute;telezhet&#337;, hogy minden tanul&oacute;i &eacute;rt&eacute;kel&eacute;s (&aacute;tlagosan) a 20%-os tartom&aacute;nyon bel&uuml;lre ker&uuml;l. Ekkor az elemz&eacute;s n&eacute;h&aacute;nyszori megism&eacute;tl&eacute;s&eacute;vel be&aacute;ll&iacute;that&oacute; a kiejtend&#337; &eacute;rt&eacute;kel&eacute;sek sz&aacute;ma mindaddig, am&iacute;g a jelen oszlopban l&eacute;v&#337; sz&aacute;mok mindegyike egy konkr&eacute;t hat&aacute;ron bel&uuml;l nem esik.</li> </ul>
</ol>
<p>A hibat&aacute;bl&aacute;zaton t&uacute;l az elemz&eacute;s felsorolja az &ouml;sszes &eacute;rt&eacute;kel&eacute;s pontsz&aacute;m&aacute;t 
&eacute;s a tanul&oacute;knak adott v&eacute;gs&#337; pontsz&aacute;mot. Ennek a t&aacute;bl&aacute;zatnak a megvizsg&aacute;l&aacute;s&aacute;val 
eld&ouml;nthet&#337;, hogy az eredm&eacute;nyek &eacute;sszer&#369;ek-e. K&ouml;zelebbr&#337;l, ha sok &eacute;rt&eacute;kel&eacute;st ejt ki, bizonyos leadott munk&aacute;k &eacute;rt&eacute;kel&eacute;s n&eacute;lk&uuml;l maradhatnak &eacute;s a tanul&oacute; v&eacute;gs&#337; pontsz&aacute;ma t&uacute;lzottan alacsony lesz. Az elemz&eacute;s a leadott munk&aacute;k sz&aacute;m&aacute;t a lap tetej&eacute;n, valamint k&ouml;zvetlen&uuml;l a pontsz&aacute;mt&aacute;bl&aacute;zat el&#337;tt mutatja. Ennek a k&eacute;t sz&aacute;mnak azonosnak kell lenni. Ha egy vagy t&ouml;bb &eacute;rt&eacute;keletlen leadott munka fordul el&#337; &eacute;s a tan&aacute;r nem k&iacute;v&aacute;nja cs&ouml;kkenteni a kiejtett &eacute;rt&eacute;kel&eacute;sek sz&aacute;m&aacute;t, akkor a tan&aacute;rnak &eacute;rt&eacute;kelnie kell ezen leadott munk&aacute;kat &eacute;s meg kell ism&eacute;telnie az elemz&eacute;st. Fontos, hogy minden leadott munka legal&aacute;bb egyszer &eacute;rt&eacute;kelve legyen az elemz&eacute;s v&eacute;gs&#337; szakasz&aacute;ban, azaz amikor a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;sa t&ouml;rt&eacute;nik. 
</p>
<p>A kiejtett &eacute;rt&eacute;kel&eacute;sek sz&aacute;ma &eacute;s a glob&aacute;lis v&eacute;gs&#337; pontsz&aacute;m k&ouml;z&ouml;tt 
egyens&uacute;ly &aacute;ll fenn. Min&eacute;l t&ouml;bb &eacute;rt&eacute;kel&eacute;st ejt ki, ann&aacute;l alacsonyabb lesz a v&eacute;gs&#337; 
pontsz&aacute;m. Ha viszont <strong>nem</strong> ejti ki a gy&ouml;nge &eacute;rt&eacute;kel&eacute;seket, akkor a tanul&oacute;k 
kifog&aacute;solhatj&aacute;k az &eacute;rt&eacute;kel&eacute;s min&#337;s&eacute;g&eacute;t, ami meghat&aacute;rozza a munk&aacute;juk&eacute;rt 
kapott pontsz&aacute;mot. Ha elegend&#337; tan&aacute;ri &eacute;rt&eacute;kel&eacute;s &aacute;ll rendelkez&eacute;sre az elemz&eacute;s k&uuml;l&ouml;n&ouml;sebb er&#337;ltet&eacute;s n&eacute;lk&uuml;li tan&aacute;ri el&#337;t&eacute;rbe helyez&eacute;s&eacute;hez, &uacute;gy az &eacute;rt&eacute;kel&eacute;seknek mintegy a 15%-30%-&aacute;t c&eacute;lszer&#369; kihagyni. </p>
<p>Ne feledje, hogy ez az elemz&eacute;s hossz&uacute; id&#337;t vesz ig&eacute;nybe, mivel ism&eacute;tl&#337;d&#337; folyamatr&oacute;l van 
sz&oacute;. Hosszas k&eacute;s&eacute;sekre sz&aacute;m&iacute;that.
</p>
