<p align="center"><strong>A v&eacute;gs&#337; pontsz&aacute;m &ouml;sszet&eacute;tele</strong></p>

<p>A k&eacute;perny&#337;n a t&aacute;bl&aacute;zat a v&eacute;gs&#337; pontsz&aacute;mot &eacute;s annak kisz&aacute;m&iacute;t&aacute;s&aacute;t mutatja. A v&eacute;gs&#337; pontsz&aacute;m h&aacute;rom lehets&eacute;ges &ouml;sszetev&#337;b&#337;l &aacute;ll.</p>
	
<ol>
<li>A tan&aacute;r pontsz&aacute;ma a tanul&oacute; leadott munk&aacute;j&aacute;ra.</li>
<li>A csoportt&aacute;rsak pontsz&aacute;ma a tanul&oacute; leadott munk&aacute;j&aacute;ra. </li>
<li>A csoportt&aacute;rsi pontoz&aacute;si szakaszban a teljes&iacute;tm&eacute;nyre adott pontsz&aacute;m. A teljes&iacute;tm&eacute;ny alapja a k&ouml;vetkez&#337;: (a) a pontsz&aacute;mai a t&ouml;bbi tanul&oacute; &aacute;tlagos pontsz&aacute;m&aacute;hoz t&uacute;l magas vagy t&uacute;l alacsonyak voltak-e (ezt torz&iacute;t&aacute;snak h&iacute;vj&aacute;k), (b) pontsz&aacute;mai &aacute;ltal&aacute;ban v&eacute;ve k&ouml;vetik-e a t&ouml;bbi tanul&oacute; &aacute;ltal adott pontsz&aacute;mot (ezt megb&iacute;zhat&oacute;s&aacute;gnak h&iacute;vj&aacute;k) &eacute;s (c) a tanul&oacute;nak az &aacute;ltala pontozott egy&eacute;b munk&aacute;kra tett megjegyz&eacute;seinek a min&#337;s&eacute;ge. Ezt a pontsz&aacute;mot a tan&aacute;r adta. Ez a h&aacute;rom teljes&iacute;tm&eacute;nypont sorrendben 1:2:3 t&eacute;nyez&#337;k&eacute;nt s&uacute;lyoz&oacute;dik &eacute;s kiadja a glob&aacute;lis "pontoz&aacute;si" pontsz&aacute;mot. M&aacute;sk&eacute;ppen fogalmazva, a megjegyz&eacute;sek tan&aacute;r &aacute;ltali pontoz&aacute;sa ugyanolyan s&uacute;ly&uacute;, mint a torz&iacute;t&aacute;si &eacute;s a megb&iacute;zhat&oacute;s&aacute;gi t&eacute;nyez&#337; egy&uuml;ttv&eacute;ve. </li></ol>

<p>Ezt a h&aacute;rom &ouml;sszetev&#337;t a feladat szempontj&aacute;b&oacute;l megfelel&#337;nek v&eacute;lt m&oacute;don s&uacute;lyozhatja. 
A s&uacute;lyok a kisebb t&aacute;bl&aacute;zatban l&aacute;that&oacute;k.</p>
