<p align="center"><strong>A v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;sa</strong></p>

<p>A k&eacute;perny&#337;n a t&aacute;bl&aacute;zat azt mutatja, hogyan t&ouml;rt&eacute;nik a tanul&oacute;k v&eacute;gs&#337; 
pontsz&aacute;mainak a kisz&aacute;m&iacute;t&aacute;sa. A v&eacute;gs&#337; pontsz&aacute;m legfeljebb &ouml;t &ouml;sszetev&#337; 
s&uacute;lyozott &ouml;sszeg&eacute;b&#337;l alakul ki.</p>
	
<ol>
<li>A tan&aacute;r pontsz&aacute;ma a leadott munk&aacute;ra. Ez opcion&aacute;lis &eacute;s akkor haszn&aacute;latos, ha a tan&aacute;r val&oacute;ban &eacute;rt&eacute;keli a tanul&oacute; munk&aacute;j&aacute;t. Ha a tanul&oacute; egyn&eacute;l t&ouml;bb munk&aacute;t ad le, akkor a "legjobbra" adott pontsz&aacute;m haszn&aacute;latos. Ez esetben a "legjobb" azt a munk&aacute;t jelenti, amely a tan&aacute;ri pontsz&aacute;m &eacute;s a csoportt&aacute;rsi pontsz&aacute;m legmagasabb s&uacute;lyozott kombin&aacute;ci&oacute;j&aacute;t adja ...</li>
<li>A csoportt&aacute;rsak pontsz&aacute;ma a tanul&oacute; leadott munk&aacute;j&aacute;ra. Itt &uacute;gyszint&eacute;n ha a tanul&oacute; egyn&eacute;l t&ouml;bb munk&aacute;t ad le, akkor a "legjobbra" adott pontsz&aacute;m haszn&aacute;latos. A csoportt&aacute;rsi pontsz&aacute;m opcion&aacute;lisan mag&aacute;ban foglalhatja a tan&aacute;ri pontsz&aacute;mot. Ez a pontsz&aacute;m akkor szerepel, ha a csoportt&aacute;rsi pontsz&aacute;mok mennyis&eacute;ge t&uacute;l alacsony, illetve ha felt&eacute;telezhet&#337;, hogy a csoportt&aacute;rsi pontsz&aacute;mokat torz&iacute;t&aacute;s (rendszerint felfel&eacute;) vagy megb&iacute;zhatatlans&aacute;g jellemzi. Figyelembev&eacute;tel eset&eacute;n a tan&aacute;ri pontsz&aacute;m az &aacute;tlag kisz&aacute;m&iacute;t&aacute;sa sor&aacute;n ugyan&uacute;gy kezelend&#337;, mint a csoportt&aacute;rsi pontsz&aacute;m. <li>A tanul&oacute;i torz&iacute;t&aacute;s a csoportt&aacute;rsi munka pontoz&aacute;s&aacute;ban. Ez azt m&eacute;ri, hogy a tanul&oacute; a munk&aacute;t t&uacute;l magasan vagy t&uacute;l alacsonyan pontozza-e. Ez nem valamif&eacute;le abszol&uacute;t m&eacute;rce, mivel minden egyes &eacute;rt&eacute;kelt leadott munka tekintet&eacute;ben a tanul&oacute; pontsz&aacute;ma &eacute;s a csoportt&aacute;rsak &aacute;tlaga k&ouml;z&ouml;tti k&uuml;l&ouml;nbs&eacute;gen alapul. &Aacute;ltal&aacute;ban v&eacute;ve 
ehhez az &ouml;sszetev&#337;h&ouml;z NE rendeljen t&uacute;l magas s&uacute;lyt.</li>
<li>A tanul&oacute; megb&iacute;zhat&oacute;s&aacute;ga a csoportt&aacute;rsi munka pontoz&aacute;sa sor&aacute;n. Ezzel m&eacute;rhet&#337;, hogy a tanul&oacute;i pontoz&aacute;s mennyire k&ouml;zel&iacute;t a csoportt&aacute;rsak &aacute;ltal &eacute;rt&eacute;kelt munka &aacute;tlagos pontsz&aacute;m&aacute;hoz. Ez az &ouml;sszetev&#337; levonja a tanul&oacute;i torz&iacute;t&aacute;st &eacute;s &aacute;tlagolja a pontoz&aacute;sa &eacute;s a csoportt&aacute;rsak &aacute;tlagos pontsz&aacute;ma k&ouml;z&ouml;tti k&uuml;l&ouml;nbs&eacute;get. Elm&eacute;letileg ha egy tanul&oacute; magas jegyeket ad a j&oacute; munk&aacute;kra &eacute;s alacsonyakat a gyeng&eacute;kre, akkor a megb&iacute;zhat&oacute;s&aacute;gi szintje magas lesz. Ha gyan&iacute;that&oacute;, hogy a tanul&oacute;k &aacute;ltal&aacute;ban v&eacute;ve gyeng&eacute;n &eacute;rt&eacute;kelnek, akkor a tan&aacute;r pontoz&aacute;s&aacute;t bele kell venni a csoportt&aacute;rsak &aacute;tlagaiba, ennek eredm&eacute;nyek&eacute;nt a megb&iacute;zhat&oacute;s&aacute;gi &eacute;rt&eacute;kek jobban &eacute;rtelmezhet&#337;k lesznek.</li>
<li>A tan&aacute;r &aacute;ltal a tanul&oacute; &eacute;rt&eacute;kel&eacute;seire adott &aacute;tlagpontsz&aacute;m. Ez egyar&aacute;nt tartalmazza a tanul&oacute; &aacute;ltal mintamunk&aacute;kra adott el&#337;zetes &eacute;rt&eacute;kel&eacute;st &eacute;s b&aacute;rmely olyan pontoz&aacute;st, amelyet a tan&aacute;r k&eacute;sz&iacute;t a feladat csoportt&aacute;rsak &aacute;ltali &eacute;rt&eacute;kel&eacute;se sor&aacute;n keletkez&#337; &eacute;rt&eacute;kel&eacute;sekre vonatkoz&oacute;an. &Aacute;ltal&aacute;ban v&eacute;ve ez az &ouml;sszetev&#337; feltehet&#337;leg fontosabb, mint ak&aacute;r a torz&iacute;t&aacute;s, ak&aacute;r a megb&iacute;zhat&oacute;s&aacute;g, ez&eacute;rt ha van, nagyobb s&uacute;llyal kell szerepeltetni. </li></ol>

<p>Ezt az &ouml;t &ouml;sszetev&#337;t az adott feladat szempontj&aacute;b&oacute;l megfelel&#337;nek v&eacute;lt m&oacute;don s&uacute;lyozhatja. 
P&eacute;ld&aacute;ul a tan&aacute;ri pontsz&aacute;m nagyobb s&uacute;llyal eshet latba, ha a feladat csoportt&aacute;rsak &aacute;ltali pontozott 
r&eacute;sze a feladat mint eg&eacute;sz szempontj&aacute;b&oacute;l csak csek&eacute;ly jelent&#337;s&eacute;g&#369; r&eacute;szk&eacute;nt 
szerepel. M&aacute;sr&eacute;szr&#337;l ha a tan&aacute;r csak n&eacute;h&aacute;ny leadott munk&aacute;t pontoz, ezek a pontok figyelmen 
k&iacute;v&uuml;l hagyhat&oacute;k oly m&oacute;don, hogy nulla s&uacute;llyal szerepelteti &#337;ket. Ha a feladat a tanul&oacute;kra 
mint &eacute;rt&eacute;kel&#337;kre &eacute;s visszajelz&eacute;s biztos&iacute;t&aacute;s&aacute;ra korl&aacute;toz&oacute;dik, akkor az 
els&#337; k&eacute;t &ouml;sszetev&#337; null&aacute;ra (vagy alacsonyra) &aacute;ll&iacute;that&oacute;, &eacute;s a tanul&oacute; 
pontoz&aacute;si k&eacute;pess&eacute;ge hat&aacute;rozza meg a v&eacute;gs&#337; pontsz&aacute;mot.</p>

<p>Ne feledje, hogy ez a k&eacute;perny&#337; ism&eacute;tl&#337;d&#337;en j&ouml;n f&ouml;l, &eacute;s a v&eacute;gs&#337; pontsz&aacute;mok 
rendszerint mindaddig nem el&eacute;rhet&#337;k a tanul&oacute;k sz&aacute;m&aacute;ra, am&iacute;g a feladat az utols&oacute; szakaszba 
nem &eacute;r. Ha a tan&aacute;r el&eacute;gedett a v&eacute;gs&#337; pontsz&aacute;mokkal &eacute;s azok s&uacute;lyoz&aacute;s&aacute;val, akkor 
el&eacute;rhet&#337;v&eacute; teheti &#337;ket a tanul&oacute;k sz&aacute;m&aacute;ra.</p>
