<p align="center"><strong>&Eacute;rt&eacute;kel&eacute;sek &ouml;sszehasonl&iacute;t&aacute;sa</strong></p>

<p>M&#369;helymunka eset&eacute;n ugyanazt a munk&aacute;t &aacute;ltal&aacute;ban mind a tan&aacute;r, mind a tanul&oacute;k &eacute;rt&eacute;kelik. 
P&eacute;ld&aacute;k haszn&aacute;lata eset&eacute;n el&#337;sz&ouml;r a tan&aacute;r &eacute;rt&eacute;keli ezeket, miel&#337;tt a tanul&oacute;k 
ezek egy kiv&aacute;lasztott r&eacute;sz&eacute;t &eacute;rt&eacute;keln&eacute;k. A tanul&oacute;k munk&aacute;j&aacute;t a tan&aacute;r 
&uacute;gyszint&eacute;n - legal&aacute;bb r&eacute;szben - &eacute;rt&eacute;kelheti, ak&aacute;rcsak egy sor tanul&oacute; is. 
A tan&aacute;r sz&aacute;m&aacute;ra a m&#369;helymunka lehet&#337;s&eacute;get ad arra, hogy a pontsz&aacute;m egy r&eacute;sz&eacute;t
 a tanul&oacute;i &eacute;rt&eacute;kel&eacute;sekre ford&iacute;tsa, a fennmarad&oacute; r&eacute;sz&eacute;t pedig mag&aacute;nak a 
 munk&aacute;nak az &eacute;rt&eacute;kel&eacute;s&eacute;re. (Az ar&aacute;nyt a m&#369;helymunka v&eacute;ge fel&eacute; lehet 
 be&aacute;ll&iacute;tani.) A tanul&oacute;i &eacute;rt&eacute;kel&eacute;s pontsz&aacute;ma att&oacute;l f&uuml;gg, mennyire k&ouml;zel&iacute;ti 
 meg a tan&aacute;ri &eacute;rt&eacute;kel&eacute;st. (Ez ut&oacute;bbi hi&aacute;ny&aacute;ban a t&aacute;rsak 
 &eacute;rt&eacute;kel&eacute;s&eacute;nek az &aacute;tlaga sz&aacute;m&iacute;t).</p>
<p>A tanul&oacute; &eacute;s a tan&aacute;r &eacute;rt&eacute;kel&eacute;se k&ouml;z&ouml;tti egyez&eacute;st az egyes elemekre adott 
pontsz&aacute;mok k&uuml;l&ouml;nbs&eacute;ge hat&aacute;rozza meg (voltak&eacute;ppen a n&eacute;gyzetes k&uuml;l&ouml;nbs&eacute;g alapj&aacute;n). 
Ezen k&uuml;l&ouml;nbs&eacute;gek &aacute;tlag&aacute;t kifejez&#337; pontsz&aacute;mm&aacute; kell &aacute;talak&iacute;tani. 
Az &quot;&eacute;rt&eacute;kel&eacute;sek &ouml;sszehasonl&iacute;t&aacute;sa&quot; r&eacute;v&eacute;n szab&aacute;lyozhatja a tan&aacute;r, 
hogy az &ouml;sszehasonl&iacute;t&aacute;sok mik&eacute;nt alakuljanak &aacute;t pontokk&aacute;.</p>

<p>Ennek a k&ouml;vetkezm&eacute;nyeit megvil&aacute;g&iacute;thatjuk az al&aacute;bbi egyszer&#369; p&eacute;ld&aacute;val, 
mely t&iacute;z igen-nem k&eacute;rd&eacute;s &eacute;rt&eacute;kel&eacute;s&eacute;t tartalmazza. A benne szerepl&#337; 
k&eacute;rd&eacute;sek p&eacute;ld&aacute;ul a k&ouml;vetkez&#337;k lehetnek: &quot;A t&aacute;bl&aacute;zatot helyesen &aacute;ll&iacute;tott&aacute;k el&#337;?&quot;, 
&quot;A sz&aacute;m&iacute;tott nyeres&eacute;g 100,66 forint?&quot; stb. T&iacute;z ilyen k&eacute;rd&eacute;s eset&eacute;n ha a be&aacute;ll&iacute;t&aacute;s &quot;Igen laza&quot;, 
a tanul&oacute; &eacute;s a tan&aacute;r &eacute;rt&eacute;kel&eacute;se k&ouml;z&ouml;tti t&ouml;k&eacute;letes egyez&eacute;s eset&eacute;n a pont 100%, egy k&eacute;rd&eacute;s elt&eacute;r&eacute;se 
eset&eacute;n 90%, kett&#337;n&eacute;l 80%, h&aacute;romn&aacute;l 70% stb. Ez elfogadhat&oacute;nak t&#369;nik, ez&eacute;rt f&ouml;lmer&uuml;lhet, mi&eacute;rt 
lett az &ouml;sszehasonl&iacute;t&aacute;s megjel&ouml;l&eacute;se &quot;nagyon laza&quot;. Vegy&uuml;k alapul azt az esetet, amikor a tanul&oacute; 
a has&aacute;ra &uuml;tve &eacute;rt&eacute;keli a 10 k&eacute;rd&eacute;sre adott v&aacute;laszt. &Aacute;tlagos esetben 10-b&#337;l 5 k&eacute;rd&eacute;sn&eacute;l volna egyez&eacute;s. 
&Iacute;gy tal&aacute;lgat&aacute;ssal 50% k&ouml;r&uuml;li eredm&eacute;nyt &eacute;rne el. A helyzet &eacute;rtelmesebb&eacute; tehet&#337; a &quot;laza&quot; opci&oacute;val, 
mely esetben a tal&aacute;lgat&aacute;s mintegy 20%-ot &eacute;r. A &quot;k&ouml;zepes&quot; opci&oacute;n&aacute;l a tal&aacute;lgat&aacute;s legt&ouml;bbsz&ouml;r 
nulla pontot eredm&eacute;nyez. Ezen a szinten 50% akkor adhat&oacute;, ha a k&eacute;t &eacute;rt&eacute;kel&eacute;s a t&iacute;zb&#337;l nyolc 
k&eacute;rd&eacute;sn&eacute;l egyezik. H&aacute;rom elt&eacute;r&eacute;s eset&eacute;n a pont csak 25%. A &quot;szigor&uacute;&quot; eset&eacute;n k&eacute;t k&uuml;l&ouml;nb&ouml;z&#337; &eacute;rt&eacute;kel&eacute;s&#369; 
k&eacute;rd&eacute;sn&eacute;l a pontsz&aacute;m 40%. A &quot;nagyon szigor&uacute;&quot; tartom&aacute;nyban m&aacute;r k&eacute;t elt&eacute;r&eacute;s is 35%-os, egyetlen 
elt&eacute;r&eacute;s pedig 65%-os eredm&eacute;nyt ad.</p>

<p>Ez a p&eacute;lda meglehet&#337;sen mesters&eacute;ges, mivel az &eacute;rt&eacute;kel&eacute;sek 
t&ouml;bbs&eacute;ge &eacute;rt&eacute;ktartom&aacute;nyra, nem igen-nem &eacute;rt&eacute;kre vonatkozik. 
Ilyen esetekben az &ouml;sszehasonl&iacute;t&aacute;s feltehet&#337;leg a fentiekn&eacute;l 
magasabb pontokat eredm&eacute;nyez. A k&uuml;l&ouml;nf&eacute;le szintek (nagyon laza, laza, k&ouml;zepes...) 
&uacute;gy vannak megadva, hogy a tan&aacute;r finom&iacute;tani tudja a hasonl&iacute;t&aacute;sokat. Ha &uacute;gy &eacute;rz&eacute;keli, 
hogy az &eacute;rt&eacute;kel&eacute;sre adott pontok t&uacute;l alacsonyak, elviheti az &eacute;rt&eacute;kel&eacute;st a &quot;laza&quot; vagy ak&aacute;r a 
&quot;nagyon laza&quot; ir&aacute;ny&aacute;ba. &Eacute;s megford&iacute;tva: ha a tanul&oacute; &eacute;rt&eacute;kel&eacute;s&eacute;t t&uacute;l magasnak &eacute;rz&eacute;keli, elmozdulhat 
a &quot;szigor&uacute;&quot; vagy a &quot;nagyon szigor&uacute;&quot; ir&aacute;ny&aacute;ba. Az eg&eacute;sz pr&oacute;b&aacute;lkoz&aacute;s dolga, mik&ouml;zben a legjobb kiindul&oacute; 
pont a &quot;k&ouml;zepes&quot; opci&oacute;.</p>

<p>A m&#369;helymunka sor&aacute;n a tan&aacute;r &uacute;gy &eacute;rz&eacute;kelheti, hogy a tanul&oacute;i &eacute;rt&eacute;kel&eacute;sekre adott 
pontok t&uacute;l alacsonyak vagy t&uacute;l magasak. Ezek a pontok l&aacute;tszanak a m&#369;helymunka 
adminisztr&aacute;ci&oacute;s oldal&aacute;n. Ilyenkor a tan&aacute;r m&oacute;dos&iacute;thatja az opci&oacute; be&aacute;ll&iacute;t&aacute;s&aacute;t 
&eacute;s &uacute;jrasz&aacute;molhatja a tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek pontsz&aacute;m&aacute;t (a &quot;pontoz&aacute;si pontokat&quot;). 
Az &uacute;jrasz&aacute;m&iacute;t&aacute;shoz kattintson a gyakorlat adminisztr&aacute;ci&oacute;s oldal&aacute;n tal&aacute;lhat&oacute; 
&quot;Tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek &uacute;jrapontoz&aacute;sa&quot; pontra. Ezt a m&#369;helymunka folyam&aacute;n b&aacute;rmikor 
v&eacute;grehajthatja.</p>

