<p align="center"><strong>Feladatelemek</strong></p>

<p>A pontoz&aacute;s megk&ouml;nny&iacute;t&eacute;se &eacute;rdek&eacute;ben a csoportos feladatnak &eacute;sszer&#369; sz&aacute;m&uacute; &eacute;rt&eacute;kel&eacute;si elemmel kell rendelkeznie. Az egyes elemeknek a feladat valamely konkr&eacute;t szempontj&aacute;ra kell vonatkozniuk. Jellemz&#337; esetben egy-egy feladathoz 5-15 megjegyz&eacute;si pontoz&aacute;si elemet kell hozz&aacute;rendelni, a t&eacute;nyleges sz&aacute;m a feladat m&eacute;ret&eacute;t&#337;l &eacute;s bonyolults&aacute;g&aacute;t&oacute;l f&uuml;gg. Csoportt&aacute;rsi feladat eset&eacute;n megengedett egyetlen elem haszn&aacute;lata, &eacute;s hasonl&oacute; &eacute;rt&eacute;kel&eacute;si strat&eacute;gi&aacute;val ruh&aacute;zhat&oacute; fel, mint egy szok&aacute;sos Moodle-feladat. </p>
	
<p>Az elemek t&iacute;pusa a feladat pontoz&aacute;si strat&eacute;gi&aacute;j&aacute;t&oacute;l f&uuml;gg.</p>

<p><strong>Nem pontozott</strong> Az elemek a feladat szempontjainak a le&iacute;r&aacute;sai. Az &eacute;rt&eacute;kel&eacute;st 
v&eacute;gz&#337;t arra k&eacute;ri, hogy f&#369;zz&ouml;n megjegyz&eacute;seket ezekhez a szempontokhoz. Ak&aacute;rcsak az &ouml;sszes pontoz&aacute;si strat&eacute;gia eset&eacute;n, l&eacute;tezik egy ter&uuml;let az &aacute;ltal&aacute;nos megjegyz&eacute;sek sz&aacute;m&aacute;ra.</p>

<p><strong>Akkumulat&iacute;v pontoz&aacute;s</strong> Az elemek az al&aacute;bbi h&aacute;rom jellemz&#337;vel rendelkeznek:</p>

<ol>
<li>Az &eacute;rt&eacute;kel&eacute;si elemek LE&Iacute;R&Aacute;SA - Ennek egy&eacute;rtelm&#369;en r&ouml;gz&iacute;teni kell, hogy a feladatot 
mely szempont szerint &eacute;rt&eacute;keli. Ha az &eacute;rt&eacute;kel&eacute;s min&#337;s&eacute;gi, c&eacute;lszer&#369; r&eacute;szletezni, 
mit tekint kiv&aacute;l&oacute;nak, k&ouml;zepesnek, illetve gyeng&eacute;nek.</li> 
<li>Az &eacute;rt&eacute;kel&eacute;si elemek SK&Aacute;L&Aacute;JA - Egy el&#337;re meghat&aacute;rozott sz&aacute;m&uacute; sk&aacute;la 
&aacute;ll rendelkez&eacute;sre. Ezek az egyszer&#369; igen/nem jelleg&#369; sk&aacute;l&aacute;t&oacute;l a t&ouml;bbpontos sk&aacute;l&aacute;n 
kereszt&uuml;l a teljes sz&aacute;zal&eacute;kos sk&aacute;l&aacute;ig terjednek. Minden elemnek megvan a maga sk&aacute;l&aacute;ja, 
amelynek igazodnia kell az adott elemhez kapcsol&oacute;d&oacute; lehets&eacute;ges vari&aacute;ci&oacute;k sz&aacute;m&aacute;hoz. Ne feledje, 
hogy a sk&aacute;la NEM hat&aacute;rozza meg az elem fontoss&aacute;g&aacute;t az &aacute;tlagos pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;sa 
sor&aacute;n, azaz egy k&eacute;tpontos sk&aacute;l&aacute;nak azonos a "hat&aacute;sa", mint a 100 pontosnak, ha a megfelel&#337; elemek azonos 
s&uacute;llyal szerepelnek.</li>

<li>Az &eacute;rt&eacute;kel&eacute;si elemek S&Uacute;LYA  - Alaphelyzetben az elemek azonos fontoss&aacute;g&uacute;ak a feladat &aacute;tlagos 
pontsz&aacute;m&aacute;nak a kisz&aacute;m&iacute;t&aacute;sa sor&aacute;n. Ez megv&aacute;ltoztathat&oacute;, ha a fontosabb elemekhez 
1-n&eacute;l nagyobb, a kev&eacute;sb&eacute; fontosakhoz 1-n&eacute;l kisebb s&uacute;lyt rendel. A s&uacute;lyok m&oacute;dos&iacute;t&aacute;sa 
NEM befoly&aacute;solja a maxim&aacute;lis pontsz&aacute;mot, azt az &eacute;rt&eacute;ket ugyanis a csoportt&aacute;rsi feladathoz 
tartoz&oacute; 'maxim&aacute;lis pontsz&aacute;m' param&eacute;ter hat&aacute;rozza meg. A s&uacute;lyok kaphatnak negat&iacute;v 
&eacute;rt&eacute;keket, ez k&iacute;s&eacute;rleti jelleggel alkalmazhat&oacute;.</li> </ol>
<p><strong>Hib&aacute;n alapul&oacute; pontoz&aacute;s</strong> Az elemek &aacute;ltal&aacute;ban olyan t&eacute;teleket vagy szempontokat 
fogalmaznak meg, amelyeknek meg kell jelenni a feladatban. Az &eacute;rt&eacute;kel&eacute;s ezen t&eacute;telek vagy szempontok 
megl&eacute;t&eacute;n vagy hi&aacute;ny&aacute;n alapszik. A tan&aacute;rnak olyam pontsz&aacute;mt&aacute;bl&aacute;zatot kell 
be&aacute;ll&iacute;tania, amely a javaslat szerinti pontokat adja akkor, ha minden t&eacute;tel jelen van, ha egy hi&aacute;nyzik, 
ha kett&#337; hi&aacute;nyzik stb. Ha egyes t&eacute;telek fontosabbak, mint egy m&aacute;sik, akkor ezekhez a t&eacute;telekhez 1-n&eacute;l 
nagyobb s&uacute;lyt rendelhet. A kisebb t&eacute;telekhez 1-n&eacute;l kisebb s&uacute;lyt rendelhet. A glob&aacute;lis 
"hibasz&aacute;m" a hi&aacute;nyz&oacute; t&eacute;telek s&uacute;lyozott &ouml;sszege. Az &eacute;rt&eacute;kel&eacute;st v&eacute;gz&#337; 
mindig v&eacute;grehajthat kisebb m&oacute;dos&iacute;t&aacute;sokat ezeken a javaslat szerinti pontokon.</p>


<p><strong>Krit&eacute;riumon alapul&oacute; pontoz&aacute;s</strong> Az elemek "szintre" vonatkoz&oacute; meg&aacute;llap&iacute;t&aacute;sokat 
tartalmaznak, melyekkel a feladat rangsorolhat&oacute;. A meg&aacute;llap&iacute;t&aacute;sok lehetnek &ouml;sszegezend&#337; jelleg&#369;ek, 
illetve lehetnek &ouml;nmagukban &aacute;ll&oacute; meg&aacute;llap&iacute;t&aacute;sok. Az &eacute;rt&eacute;kel&eacute;st v&eacute;gz&#337;nek 
kell eld&ouml;ntenie, hogy melyik meg&aacute;llap&iacute;t&aacute;s illik jobban az egyes munk&aacute;kra. A tan&aacute;rnak minden 
krit&eacute;riumra vonatkoz&oacute; meg&aacute;llap&iacute;t&aacute;st egy javasolt pontsz&aacute;mhoz kell kapcsolnia. Ezeket 
&aacute;ltal&aacute;ban el kell rendezni. Az &eacute;rt&eacute;kel&eacute;st v&eacute;gz&#337; v&eacute;grehajthat kisebb 
m&oacute;dos&iacute;t&aacute;sokat ezeken a javaslat szerinti pontokon.</p>

<p><strong>Rubrika alap&uacute; pontoz&aacute;s</strong> Hasonl&iacute;t a krit&eacute;riumon alapul&oacute; pontoz&aacute;shoz, de itt 
egyn&eacute;l t&ouml;bb krit&eacute;riummal van dolga. A krit&eacute;riumok sz&aacute;m&aacute;t a feladat param&eacute;terei k&ouml;z&ouml;tt adja 
meg. Az egyes krit&eacute;riumokon bel&uuml;l legfeljebb &ouml;t "szintre" vonatkoz&oacute; meg&aacute;llap&iacute;t&aacute;st tehet. Egy adott 
feladaton bel&uuml;l a szintek sz&aacute;ma krit&eacute;riumr&oacute;l krit&eacute;riumra v&aacute;ltozhat. Egy-egy krit&eacute;rium 
be&aacute;ll&iacute;t&aacute;sa sor&aacute;n egy &uuml;res "szintre" vonatkoz&oacute; meg&aacute;llap&iacute;t&aacute;s jelzi a "szintre" 
vonatkoz&oacute; meg&aacute;llap&iacute;t&aacute;s v&eacute;g&eacute;t. Ennek megfelel&#337;en n&eacute;mely krit&eacute;riumhoz k&eacute;t szint 
tartozhat, m&aacute;s esetben h&aacute;rom szint, legfeljebb &ouml;t szint lehets&eacute;ges. A krit&eacute;riumok s&uacute;lyozhat&oacute;k. A 
szintekhez 0, 1, 2, legfeljebb 4 pont rendelhet&#337;. Az &eacute;rt&eacute;kel&eacute;s pontsz&aacute;ma ezen pontok s&uacute;lyozott 
&ouml;sszege.</p>