<p align="center"><b>Tanul&oacute;i &eacute;rt&eacute;kel&eacute;sekre adott pont</b></p>

<p>Ez a maxim&aacute;lis pontsz&aacute;m, amelyet a tanul&oacute;k &ouml;nmaguk vagy m&aacute;s munk&aacute;j&aacute;nak az 
&eacute;rt&eacute;kel&eacute;s&eacute;re kaphatnak. Vagyis ez az &eacute;rt&eacute;kel&eacute;seikre adott pont. 
Az &eacute;rt&eacute;kel&eacute;s t&eacute;nyleges pontsz&aacute;m&aacute;t a m&#369;helymodul sz&aacute;m&iacute;tja ki oly m&oacute;don, hogy 
egybeveti az &eacute;rt&eacute;kel&eacute;st ugyanazon leadott munka &quot;legjobb&quot; &eacute;rt&eacute;kel&eacute;s&eacute;vel. Az a
    &quot;legjobb&quot; &eacute;rt&eacute;kel&eacute;s, amely az &ouml;sszes &eacute;rt&eacute;kel&eacute;s &aacute;tlag&eacute;rt&eacute;k&eacute;hez 
    a legk&ouml;zelebb &aacute;ll. (Ez egy &quot;s&uacute;lyozott&quot; &aacute;tlag, amennyiben a tan&aacute;r
    &eacute;rt&eacute;kel&eacute;se egyn&eacute;l nagyobb s&uacute;lyt kap.) Ha egy leadott munk&aacute;hoz csak egy &eacute;rt&eacute;kel&eacute;s tartozik,
    ez az &eacute;rt&eacute;kel&eacute;s sz&aacute;m&iacute;t a legjobbnak. Kett&#337; eset&eacute;n mindkett&#337; 
    &quot;legjobbnak&quot; min&#337;s&uuml;l. A modul csak h&aacute;rom vagy t&ouml;bb &eacute;rt&eacute;kel&eacute;s eset&eacute;n tesz 
    k&uuml;l&ouml;nbs&eacute;get az &eacute;rt&eacute;kel&eacute;sek k&ouml;z&ouml;tt.</p>

<p>Ennek a pontnak n&eacute;ha &quot;pontoz&aacute;si vagy oszt&aacute;lyoz&oacute; pont&quot; a neve, 
    <i><b>nem</b></i> a munk&aacute;ra adott maxim&aacute;lis pontot jelenti, mert annak az elnevez&eacute;se a 
    &quot;leadott munk&aacute;kra adott pont&quot;.</p>

<p>Egy tanul&oacute;nak a m&#369;helymunk&aacute;ra adott pontja ezen pontnak &eacute;s saj&aacute;t leadott munk&aacute;ja (munk&aacute;i) pontj&aacute;nak 
az &ouml;sszege. &Iacute;gy amennyiben a tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek pontja (maximum) 20, akkor a leadott munk&aacute;&eacute;rt 
(maxim&aacute;lisan) 80 pont j&aacute;r, vagyis a m&#369;helymunka (maxim&aacute;lis) pontsz&aacute;ma 100.</p>

<p>Ez az &eacute;rt&eacute;k b&aacute;rmikor m&oacute;dos&iacute;that&oacute;, a tanul&oacute;k (&eacute;s a tan&aacute;r) pedig azonnal l&aacute;tj&aacute;k a v&aacute;ltoz&aacute;st.</p>

