<P ALIGN=CENTER><B>Csoportt&aacute;rsi feladatok pontoz&aacute;sa</B></P>

<P>A pontoz&aacute;s megk&ouml;nny&iacute;t&eacute;se &eacute;rdek&eacute;ben egy-egy csoportt&aacute;rsi feladat egy sor &eacute;rt&eacute;kel&eacute;si "elemre" van felosztva. Az egyes elemeknek a feladat valamely konkr&eacute;t szempontj&aacute;ra vonatkozik. Az &eacute;rt&eacute;kel&eacute;s fajt&aacute;j&aacute;t&oacute;l f&uuml;gg&#337;en az al&aacute;bbi teend&#337;ket hajtsuk v&eacute;gre:
<OL>
<LI>A megfelel&#337; gombra kattintva vagy a leg&ouml;rd&uuml;l&#337; men&uuml;b&#337;l a megfelel&#337; sz&aacute;mot kiv&aacute;lasztva adjunk meg egy pontsz&aacute;mot.
	
<LI>A Visszajelz&eacute;s mez&#337;ben f&#369;zz&uuml;nk magyar&aacute;zatot az adott pontsz&aacute;mhoz. Ha &uacute;gy v&eacute;lj&uuml;k, hogy az indok egy&eacute;rtelm&#369;, hagyjuk a sz&ouml;vegmez&#337;t &uuml;resen. Ne feledj&uuml;k, hogy a tan&aacute;r megtekintheti az &eacute;rt&eacute;kel&eacute;s&eacute;t &eacute;s magyar&aacute;zatot k&eacute;rhet az adott pontsz&aacute;mmal kapcsolatosan, ha nem szerepel mellette magyar&aacute;zat.
</OL>

<P>M&aacute;sfajta &eacute;rt&eacute;kel&eacute;sekn&eacute;l azt kell meg&aacute;llap&iacute;tani, hogy bizonyos t&eacute;telek megvannak-e, vagy hi&aacute;nyoznak, ism&eacute;t m&aacute;sok eset&eacute;n ki kell v&aacute;lasztani, hogy melyik meg&aacute;llap&iacute;t&aacute;s illik a legjobban az adott munk&aacute;ra. Mindk&eacute;t feladatn&aacute;l a pontokat n&eacute;mileg igaz&iacute;thatjuk ig&eacute;nyeinknek megfelel&#337;en.

<P>Ezen az &#369;rlapon az utols&oacute; mez&#337;ben &aacute;ltal&aacute;nos megjegyz&eacute;st f&#369;zhet&uuml;nk a munk&aacute;hoz. Ebben kell az &eacute;rt&eacute;kel&eacute;st megindokolni. Az &eacute;rt&eacute;kel&eacute;s legyen udvarias &eacute;s lehet&#337;s&eacute;g szerint konstrukt&iacute;v. &Eacute;rt&eacute;kel&eacute;s&uuml;nk megjelenik azon tanul&oacute; el&#337;tt, aki az adott munk&aacute;t k&eacute;sz&iacute;tette. <P>Csak korl&aacute;tozott id&#337;, &aacute;ltal&aacute;ban egy f&eacute;l &oacute;ra &aacute;ll rendelkez&eacute;s&eacute;re arra, hogy meggondolva magunkat m&oacute;dos&iacute;tsunk a pontokon vagy a megjegyz&eacute;seken. Ha ez az id&#337; letelik, az a szem&eacute;ly, akinek a munk&aacute;j&aacute;t &eacute;rt&eacute;kel&eacute;si, &eacute;rtes&iacute;t&eacute;st kap az &eacute;rt&eacute;kel&eacute;sr&#337;l. Ebben a szakaszban megtekinthetj&uuml;k az adott &eacute;rt&eacute;kel&eacute;st, de m&aacute;r nem m&oacute;dos&iacute;thatunk rajta.
</P>
