<P ALIGN=CENTER><B>Tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek pontoz&aacute;sa</B></P>

<P>Ezen a k&eacute;perny&#337;n adhat&oacute; meg a feladat lead&aacute;si &eacute;s &eacute;rt&eacute;kel&eacute;si szakasz&aacute;ban a tanul&oacute; &aacute;ltal v&eacute;gzett &eacute;rt&eacute;kel&eacute;sre a tan&aacute;r pontsz&aacute;ma. A pontoz&aacute;s viszonylag egyszer&#369;, a 20-b&oacute;l el&eacute;rt pontsz&aacute;m adhat&oacute; meg. A tan&aacute;r a feladat megkezd&eacute;se el&#337;tt a tanul&oacute;nak adott utas&iacute;t&aacute;sok alapj&aacute;n eld&ouml;ntheti, mit fog oszt&aacute;lyozni &eacute;s milyen viszony&iacute;tott pontsz&aacute;mot fog adni. Magasabb szinten p&eacute;ld&aacute;ul a tanul&oacute;t&oacute;l kritikai megjegyz&eacute;sek v&aacute;rhat&oacute;k el, k&ouml;zepes szinten elv&aacute;rhat&oacute; t&#337;le, hogy r&aacute;mutasson az er&#337;s &eacute;s gyenge pontokra, alacsonyabb szinten pedig el&#337;fordulhat, hogy a tanul&oacute; mind&ouml;ssze a hib&aacute;k &eacute;s pontatlans&aacute;gok felt&uuml;ntet&eacute;s&eacute;re ker&iacute;t sort.</P>
	
<P>Adott esetben a tanul&oacute;&eacute; el&#337;tt megjelenik a tan&aacute;r saj&aacute;t &eacute;rt&eacute;kel&eacute;se, &iacute;gy k&ouml;nny&#369; megejteni az &ouml;sszehasonl&iacute;t&aacute;st. A tan&aacute;r saj&aacute;t megjegyz&eacute;se ennek megfelel&#337;en viszony&iacute;t&aacute;si alapk&eacute;nt haszn&aacute;lhat&oacute;.</P>

<P>Az &eacute;rt&eacute;kel&eacute;sre adott pontsz&aacute;m a lap alj&aacute;n l&eacute;v&#337; megfelel&#337; gomb megnyom&aacute;s&aacute;val jelenik meg. A pontoz&aacute;s ism&eacute;tl&eacute;s&eacute;re a "szerkeszt&eacute;si id&#337;tartam" alatt van lehet&#337;s&eacute;g. Amint az erre rendelkez&eacute;sre &aacute;ll&oacute; id&#337; letelik, a tanul&oacute; sz&aacute;m&aacute;ra hozz&aacute;f&eacute;rhet&#337; v&aacute;lik a tan&aacute;r megjegyz&eacute;se. Ugyanakkor az "oszt&aacute;lyoz&oacute; pontsz&aacute;mot" a tanul&oacute; mindaddig nem l&aacute;tja, am&iacute;g a v&eacute;gs&#337; pontsz&aacute;m rendelkez&eacute;sre nem &aacute;ll. (Ennek az az oka, hogy az adott munk&aacute;ra kapott pontsz&aacute;m &eacute;s ezen munka  &Eacute;RT&Eacute;KEL&Eacute;S&Eacute;RE kapott pontsz&aacute;m &ouml;sszekeverhet&#337;, a feladat adott korai szakasz&aacute;ban a k&uuml;l&ouml;nbs&eacute;g esetleg kev&eacute;ss&eacute; l&aacute;tszik vil&aacute;gosan a tanul&oacute; sz&aacute;m&aacute;ra.)</P>
