<p align="center"><strong>M&#369;helymunka feladat&aacute;nak kezel&eacute;se</strong></p>
<p>A m&#369;helymunka sor&aacute;n kapott feladat bonyolultabb a szok&aacute;sos feladatn&aacute;l.
    Egy sor l&eacute;p&eacute;sb&#337;l &aacute;ll, ezek a k&ouml;vetkez&#337;k: </p>
<ol>
<li><p><strong>Feladat kijel&ouml;l&eacute;se</strong> A feladat &eacute;rt&eacute;kel&eacute;s&eacute;t egy sor &eacute;rt&eacute;kel&eacute;si 
ELEMRE kell bontani. Ez&aacute;ltal a feladat pontoz&aacute;sa kev&eacute;sb&eacute; lesz &ouml;nk&eacute;nyes, emellett keret&uuml;l 
szolg&aacute;l a tanul&oacute;knak az &eacute;rt&eacute;kel&eacute;s elv&eacute;gz&eacute;s&eacute;hez. A tan&aacute;r dolga 
az &eacute;rt&eacute;kel&eacute;si elemek &ouml;ssze&aacute;ll&iacute;t&aacute;sa, &iacute;gy a pontoz&aacute;si lap 
elk&eacute;sz&iacute;t&eacute;se is. (L&aacute;sd a r&eacute;szleteket ott.)</p>

    <p>Az &eacute;rt&eacute;kel&eacute;si elemek be&aacute;ll&iacute;t&aacute;s&aacute;t k&ouml;vet&#337;en a tan&aacute;r 
    a p&eacute;ldamunk&aacute;k k&ouml;z&uuml;l n&eacute;h&aacute;nyat k&ouml;zread.  Ezeken a tanul&oacute;k gyakorolhatj&aacute;k 
    az &eacute;rt&eacute;kel&eacute;st, miel&#337;tt saj&aacute;t munk&aacute;jukat elk&eacute;sz&iacute;tik. 
    Miel&#337;tt azonban a feladatok a tanul&oacute;k sz&aacute;m&aacute;ra hozz&aacute;f&eacute;rhet&#337;v&eacute; v&aacute;lnak,
    ezeket a p&eacute;ld&aacute;kat a tan&aacute;rnak &eacute;rt&eacute;kelnie kell. Ezzel a tan&aacute;rnak minta-&quot;v&aacute;laszok&quot; 
    &aacute;llnak a rendelkez&eacute;s&eacute;re, amikor a p&eacute;ld&aacute;k tanul&oacute;k &aacute;ltali &eacute;rt&eacute;kel&eacute;s&eacute;t 
    ellen&#337;rzi (mely a k&ouml;vetkez&#337; szakaszban k&eacute;sz&uuml;l el).</p>

    <p>A mintamunk&aacute;k tan&aacute;r &aacute;ltali k&ouml;zread&aacute;sa opcion&aacute;lis, bizonyos feladatokn&aacute;l 
    feltehet&#337;leg nincs is helye.</p></li>

<li><p><strong>Tanul&oacute;i leadott munk&aacute;k enged&eacute;lyez&eacute;se</strong> A feladat ezen a ponton el&eacute;rhet&#337; a tanul&oacute;k 
    sz&aacute;m&aacute;ra. Ha a tan&aacute;r &ouml;ssze&aacute;ll&iacute;tott egy sor p&eacute;ldamunk&aacute;t, a tanul&oacute;knak 
    ezek k&ouml;z&uuml;l egy konkr&eacute;t mennyis&eacute;get &eacute;rt&eacute;kelni kell. (Az &eacute;rt&eacute;kel&eacute;sek 
    sz&aacute;ma a feladat l&eacute;trehoz&aacute;sakor d&#337;l el.)  
    Ha egy tanul&oacute; teljes&iacute;tette a kell&#337; sz&aacute;m&uacute; &eacute;rt&eacute;kel&eacute;st, leadhatja saj&aacute;t 
    munk&aacute;j&aacute;t. P&eacute;ld&aacute;k n&eacute;lk&uuml;li feladat eset&eacute;n a tanul&oacute;k munk&aacute;ikat minden 
    k&eacute;sleked&eacute;s n&eacute;lk&uuml;l leadhatj&aacute;k.</p>

<p>A feladatnak a munkalead&aacute;si szakaszban tart&aacute;sa azzal az el&#337;nnyel j&aacute;r, 
  hogy a leadott munk&aacute;k &ouml;sszegy&#369;jthet&#337;v&eacute; v&aacute;lnak. Ezut&aacute;n a k&ouml;vetkez&#337; k&eacute;t 
  szakaszban azok kioszt&aacute;sa sor&aacute;n jobb munkaeloszt&aacute;s &eacute;rhet&#337; el. 
  Ha a feladat az (enged&eacute;lyezett) &quot;&Ouml;ssze&aacute;ll&iacute;t&aacute;s&quot; szakaszb&oacute;l k&ouml;zvetlen&uuml;l 
  a &quot;Lead&aacute;sok &eacute;s &eacute;rt&eacute;kel&eacute;sek enged&eacute;lyez&eacute;se&quot; 
  szakaszba ker&uuml;l, a munk&aacute;jukat kor&aacute;n lead&oacute; tanul&oacute;k a kor&aacute;n leadott munk&aacute;kb&oacute;l 
  kapnak &eacute;rt&eacute;kelend&#337; anyagot, m&iacute;g a k&eacute;s&#337;bb lead&oacute;k a k&eacute;s&#337;bbiekb&#337;l. 
  A csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;s el&#337;tt egy &quot;k&eacute;sleltet&eacute;s&quot;
  beiktat&aacute;sa nagyban cs&ouml;kkenti ezt a probl&eacute;m&aacute;t. </p>

    <p>Ha a tanul&oacute; lead egy munk&aacute;t, a tan&aacute;r, ha k&iacute;v&aacute;nja, &eacute;rt&eacute;kelheti azt. 
    Ez az &eacute;rt&eacute;kel&eacute;s beker&uuml;lhet a tanul&oacute; v&eacute;gs&#337; oszt&aacute;lyzat&aacute;ba. Ezek
    az &eacute;rt&eacute;kel&eacute;sek a feladat lead&aacute;si &eacute;s &eacute;rt&eacute;kel&eacute;si szakasz&aacute;ban 
    t&ouml;rt&eacute;nhetnek.</p></li>

<li><p><strong>Tanul&oacute;i leadott munk&aacute;k &eacute;s &eacute;rt&eacute;kel&eacute;sek enged&eacute;lyez&eacute;se</strong> 
  Ha a feladatnak r&eacute;sze a csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;s, a munk&aacute;jukat m&aacute;r leadott 
  tanul&oacute;k ekkor l&aacute;tj&aacute;k m&aacute;s tanul&oacute;k &eacute;rt&eacute;kelhet&#337; munk&aacute;it. A t&ouml;bbi 
  tanul&oacute; pedig leadhatja munk&aacute;j&aacute;t (de <strong>nem</strong> l&aacute;tja m&aacute;s tanul&oacute;k 
  &eacute;rt&eacute;kel&eacute;sre leadott munk&aacute;it).
    Ebben a szakaszban a munk&aacute;k lead&aacute;sa, &uacute;jb&oacute;li lead&aacute;sa, mindezek &eacute;rt&eacute;kel&eacute;se 
    egyszerre t&ouml;rt&eacute;nhet. </p>

    <p>A tan&aacute;r a munka lead&aacute;s&aacute;t &eacute;s annak csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;s&eacute;t k&eacute;t 
    k&uuml;l&ouml;n szakaszra oszthatja, megv&aacute;rva, am&iacute;g az &ouml;sszes tanul&oacute; leadja a munk&aacute;j&aacute;t, miel&#337;tt
    a csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;si szakaszt megkezdi. Ez esetben erre a szakaszra egy&aacute;ltal&aacute;n
    nem ker&uuml;l sor, a feladat a &quot;Lead&aacute;sok enged&eacute;lyez&eacute;se&quot; szakaszb&oacute;l egyb&#337;l az
    &quot;&Eacute;rt&eacute;kel&eacute;sek enged&eacute;lyez&eacute;se&quot; szakaszba ker&uuml;l. 
    Ezzel a tan&aacute;r hat&aacute;rid&#337;t szabhat a munk&aacute;k lead&aacute;s&aacute;hoz,
    a feladat ezen hat&aacute;rid&#337; el&eacute;rkez&eacute;sekor ker&uuml;l az 
     &quot;&Eacute;rt&eacute;kel&eacute;sek enged&eacute;lyez&eacute;se&quot; szakaszba.</p>

<p> Ha viszont a tan&aacute;r nem k&iacute;v&aacute;nja a feladatot ilyen egy&eacute;rtelm&#369;en kett&eacute;osztani, akkor
    a feladat beleker&uuml;l ebbe a szakaszba. Ha a lead&aacute;sok &eacute;s &eacute;rt&eacute;kel&eacute;sek egyszerre t&ouml;rt&eacute;nhetnek, 
    a tan&aacute;rnak fontol&oacute;ra kell venni a t&uacute;lzott kijel&ouml;l&eacute;si szint EGY-re (vagy ak&aacute;r KETT&#336;-re) 
    &aacute;ll&iacute;t&aacute;s&aacute;t, hogy a kijel&ouml;l&eacute;sek sim&aacute;n t&ouml;rt&eacute;njenek (l&aacute;sd a vonatkoz&oacute; 
    s&uacute;g&oacute;t). Ezzel <strong>egyes</strong> leadott munk&aacute;k t&ouml;bbsz&ouml;r, m&aacute;s munk&aacute;k kevesebbszer
    ker&uuml;lnek (csoportt&aacute;rsi) &eacute;rt&eacute;kel&eacute;sre, mint a leadott munk&aacute;k t&ouml;bbs&eacute;ge.</p>

    <p>Ha a tanul&oacute; elk&eacute;sz&uuml;lt az &eacute;rt&eacute;kel&eacute;ssel, csoportt&aacute;rsai megtekinthetik
    ezt az &eacute;rt&eacute;kel&eacute;st. A munk&aacute;j&aacute;t lead&oacute; tanul&oacute; megjegyz&eacute;st f&#369;zhet az &eacute;rt&eacute;kel&eacute;shez, ha 
    ez az opci&oacute; a feladatn&aacute;l be lett jel&ouml;lve. </p></li>

<li><p><strong>Tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek enged&eacute;lyez&eacute;se</strong> 
    Ebben a szakaszban folytat&oacute;dnak a csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;sek, de a tanul&oacute;k m&aacute;r nem adhatnak le 
    munk&aacute;t, bele&eacute;rtve az &uacute;jb&oacute;li lead&aacute;st is. Azok, akik nem adtak le munk&aacute;t, 
    &eacute;rtes&iacute;t&eacute;st kapnak arr&oacute;l, hogy m&aacute;r nem adhatnak le munk&aacute;t &eacute;s <strong>nem</strong> 
    l&aacute;thatnak semmilyen &eacute;rt&eacute;kelend&#337; (csoportt&aacute;rsi) munk&aacute;t.</p></li>

<li><p><strong>V&eacute;gs&#337; pontsz&aacute;mok kijez&eacute;se</strong> Az &eacute;rt&eacute;kel&eacute;s utols&oacute; szakasz&aacute;ban
  a tanul&oacute;k r&eacute;szletesen l&aacute;thatj&aacute;k v&eacute;gs&#337; pontsz&aacute;maikat. Az egyes leadott munk&aacute;kra
  kapott &eacute;rt&eacute;kel&eacute;sek k&uuml;l&ouml;n-k&uuml;l&ouml;n k&ouml;nnyen &aacute;ttekinthet&#337;k.</p>

<p>A tanul&oacute;k (&eacute;s a tan&aacute;r) opcion&aacute;lisan l&aacute;thatnak egy &quot;ligat&aacute;bl&aacute;zatot&quot;
    a tanul&oacute;i leadott munk&aacute;kr&oacute;l. A munk&aacute;k pontsz&aacute;m szerint, a legmagasabb pontot kap&oacute;t&oacute;l 
    lefel&eacute; vannak felsorolva benne.</p></li>
</ol>

<p>A feladat b&aacute;rmely szakasz&aacute;ban a tan&aacute;r megnyithatja az 
    &quot;Adminisztráció&quot; oldalt. Ez mutatja a feladat pillanatnyi &aacute;llapot&aacute;t. 
    Felsorolja (ha van) a tan&aacute;ri mintap&eacute;ld&aacute;kat, a tanul&oacute;k (tan&aacute;ri p&eacute;ld&aacute;kra, saj&aacute;t
    munk&aacute;jukra &eacute;s m&aacute;s tanul&oacute;k leadott munk&aacute;ira adott) &eacute;rt&eacute;kel&eacute;seit, valamint
    a tanul&oacute;k leadott munk&aacute;it. A tan&aacute;r ezen az oldalon &eacute;rt&eacute;kelheti, ill. &eacute;rt&eacute;kelheti &uacute;jb&oacute;l
     a leadott munk&aacute;kat, t&ouml;r&ouml;lheti a leadott munk&aacute;kat &eacute;s az &eacute;rt&eacute;kel&eacute;seket, &eacute;s &aacute;ltal&aacute;ban
     nyomon k&ouml;vetheti a feladattal kapcsolatos folyamatot.</p>

