<p align="center"><strong>M&#369;helyfeladat kezel&eacute;se </strong></p>

<p>A m&#369;helyfeladat vagy csoportos feladat bonyolultabb, mint a szok&aacute;sos feladatok. A feladat v&eacute;grehajt&aacute;sa t&ouml;bb l&eacute;p&eacute;sb&#337;l vagy szakaszb&oacute;l &aacute;ll. Ezek a k&ouml;vetkez&#337;k:</p>

<ol>
<li><p><strong>Feladat kijel&ouml;l&eacute;se</strong> A feladat &eacute;rt&eacute;kel&eacute;s&eacute;t egy sor &eacute;rt&eacute;kel&eacute;si elemre kell bontani. Ennek eredm&eacute;nyek&eacute;nt a feladat pontoz&aacute;sa kev&eacute;sb&eacute; lesz &ouml;nk&eacute;nyes &eacute;s a tanul&oacute;kat egyfajta kerettel l&aacute;tja el az &eacute;rt&eacute;kel&eacute;s elv&eacute;gz&eacute;s&eacute;hez. Az &eacute;rt&eacute;kel&eacute;si elemek &ouml;ssze&aacute;ll&iacute;t&aacute;sa &eacute;s ennek megfelel&#337;en a pontoz&aacute;si &#369;rlap elk&eacute;sz&iacute;t&eacute;se a tan&aacute;r feladata. (A r&eacute;szleteket l&aacute;sd az adott oldalon.)</p>
	
	<p>Ha megt&ouml;rt&eacute;nt az &eacute;rt&eacute;kel&eacute;si elemek &ouml;ssze&aacute;ll&iacute;t&aacute;sa, a tan&aacute;r &aacute;ltal&aacute;ban n&eacute;h&aacute;ny mintamunk&aacute;t ad k&ouml;zre. Ezek olyan gyakorl&oacute; anyagok, amelyekkel a tanul&oacute;k saj&aacute;t munk&aacute;juk elk&eacute;sz&iacute;t&eacute;se el&#337;tt gyakorolhatj&aacute;k az &eacute;rt&eacute;kel&eacute;st. Miel&#337;tt azonban a feladatot a tanul&oacute;k megkapj&aacute;k, ezeket a mintamunk&aacute;kat a tan&aacute;rnak &eacute;rt&eacute;kelnie kell. Ennek k&ouml;sz&ouml;nhet&#337;en a tan&aacute;r "mintav&aacute;laszokhoz" jut ezen p&eacute;ld&aacute;k tanul&oacute;i &eacute;rt&eacute;kel&eacute;s&eacute;nek fel&uuml;lvizsg&aacute;lata sor&aacute;n (melyre a k&ouml;vetkez&#337; l&eacute;p&eacute;sben ker&uuml;l sor).</p>
	
	<p>A tan&aacute;r a mintamunk&aacute;kat v&aacute;laszthat&oacute;an adja k&ouml;zre. El&#337;fordulhat, hogy bizonyos feladatok eset&eacute;n ez nem is hely&eacute;nval&oacute;.</p></li>
	
<li><p><strong>Tanul&oacute;i leadott munk&aacute;k enged&eacute;lyez&eacute;se</strong> A feladat hozz&aacute;f&eacute;rhet&#337; a tanul&oacute;k sz&aacute;m&aacute;ra. Ha a tan&aacute;r k&eacute;sz&iacute;tett mintamunk&aacute;kat, a tanul&oacute;knak ezek k&ouml;z&uuml;l n&eacute;h&aacute;nyat &eacute;rt&eacute;kelni kell. (Az &eacute;rt&eacute;kel&eacute;sek sz&aacute;m&aacute;t a feladat l&eacute;trehoz&aacute;sakor hat&aacute;rozza meg.) Ha egy tanul&oacute; elk&eacute;sz&iacute;tette az el&#337;&iacute;rt sz&aacute;m&uacute; &eacute;rt&eacute;kel&eacute;st, leadhatja a saj&aacute;t munk&aacute;j&aacute;t. Ha egy feladathoz nincs p&eacute;lda, a tanul&oacute;k szabadon halad&eacute;ktalanul beny&uacute;jthatj&aacute;k munk&aacute;jukat.</p>

<p>Ha a feladatot a leadott munk&aacute;k f&aacute;zis&aacute;ban hagyjuk, akkor &ouml;sszegy&#369;jthetj&uuml;k a leadott munk&aacute;kat. Ha ezt k&ouml;vet&#337;en a k&ouml;vetkez&#337; k&eacute;t f&aacute;zisban kiadjuk &#337;ket, jobban fogjuk tudni elosztani a munk&aacute;t. Ha viszont a feladatot az (enged&eacute;lyezett) "be&aacute;ll&iacute;t&aacute;si" f&aacute;zisb&oacute;l egyb&#337;l a "munkalead&aacute;s &eacute;s &eacute;rt&eacute;kel&eacute;s enged&eacute;lyez&eacute;se" f&aacute;zisba tessz&uuml;k, akkor a munk&aacute;jukat kor&aacute;n lead&oacute; tanul&oacute;k ink&aacute;bb a kor&aacute;bban leadott munk&aacute;kat fogj&aacute;k &eacute;rt&eacute;kelni, m&iacute;g a munk&aacute;jukat k&eacute;s&#337;bb lead&oacute; tanul&oacute;k ink&aacute;bb a k&eacute;sei leadott munk&aacute;kat fogj&aacute;k &eacute;rt&eacute;kelni. Ha egy "k&eacute;sleltet&eacute;st" iktatunk be a csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;s megkezd&eacute;s&eacute;be, akkor ez a probl&eacute;ma nagy m&eacute;rt&eacute;kben kik&uuml;sz&ouml;b&ouml;lhet&#337;. <p>Ha egy tanul&oacute; lead egy munk&aacute;t, a tan&aacute;r - ha sz&uuml;ks&eacute;ges - &eacute;rt&eacute;kelheti a munk&aacute;j&aacute;t. Ez az &eacute;rt&eacute;kel&eacute;s besz&aacute;m&iacute;that&oacute; a tanul&oacute; v&eacute;gs&#337; pontsz&aacute;m&aacute;ba. Az &eacute;rt&eacute;kel&eacute;sek egyar&aacute;nt elv&eacute;gezhet&#337;k a munka lead&aacute;si &eacute;s &eacute;rt&eacute;kel&eacute;si szakasz&aacute;ban. Amennyiben a tan&aacute;ri &eacute;rt&eacute;kel&eacute;sre a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;sa el&#337;tt ker&uuml;l sor,  &uacute;gy annak eredm&eacute;nye felhaszn&aacute;lhat&oacute; az adott sz&aacute;m&iacute;t&aacute;s sor&aacute;n.</p></li>
	
<li><p><strong>Tanul&oacute;i munkalead&aacute;s &eacute;s &eacute;rt&eacute;kel&eacute;s enged&eacute;lyez&eacute;se</strong> Ha a feladat csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;st tartalmaz, akkor azokn&aacute;l a tanul&oacute;kn&aacute;l, akik munk&aacute;t adtak le, megjelennek m&aacute;s tanul&oacute;k &eacute;rt&eacute;kel&eacute;sre v&aacute;r&oacute; munk&aacute;i. Azok a tanul&oacute;k, akik m&eacute;g nem adtak le munk&aacute;t, most m&aacute;r leadhatj&aacute;k munk&aacute;jukat (de <strong>nem</strong> l&aacute;tj&aacute;k m&aacute;s tanul&oacute;k &eacute;rt&eacute;kelend&#337; munk&aacute;it). Ebben a f&aacute;zisban a munk&aacute;k lead&aacute;sa, a munk&aacute;k &uacute;jb&oacute;li lead&aacute;sa, valamint a leadott munk&aacute;k &eacute;s az &uacute;jb&oacute;l leadott munk&aacute;k &eacute;rt&eacute;kel&eacute;se egyszerre t&ouml;rt&eacute;nhet. </p>

    <p>El&#337;fordulhat, hogy a tan&aacute;r a leadott munk&aacute;t &eacute;s annak csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;s&eacute;t k&eacute;t k&uuml;l&ouml;n szakaszra k&iacute;v&aacute;nja bontani, &ouml;sszev&aacute;rva, am&iacute;g minden tanul&oacute; leadja a munk&aacute;j&aacute;t, miel&#337;tt &aacute;tt&eacute;r a csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;si szakasz&aacute;ra. Ilyen esetben erre a f&aacute;zisra egy&aacute;ltal&aacute;n nem ker&uuml;l sor, a feladat a "leadott munka enged&eacute;lyez&eacute;se" szakaszb&oacute;l k&ouml;zvetlen&uuml;l az "&Eacute;rt&eacute;kel&eacute;sek enged&eacute;lyez&eacute;se" szakaszba ker&uuml;l. Ez&aacute;ltal a tan&aacute;r hat&aacute;rid&#337;t szabhat meg a leadand&oacute; munk&aacute;kra, a feladat az adott id&#337;pontban &aacute;tker&uuml;l az "&Eacute;rt&eacute;kel&eacute;sek enged&eacute;lyez&eacute;se" szakaszba.</p>

<p>Ha viszont a tan&aacute;r nem k&iacute;v&aacute;nja a feladatot ilyen mereven megosztani, akkor a feladat ezt a szakaszt haszn&aacute;lja. Ha a tan&aacute;r lehet&#337;v&eacute; teszi, hogy a leadott munka &eacute;s az &eacute;rt&eacute;kel&eacute;s egy&uuml;tt jelenjen meg, akkor figyelembe kell vennie a kijel&ouml;l&eacute;si szint t&uacute;ll&eacute;p&eacute;s&eacute;nek EGY-re (esetlegesen KETTÕ-re) val&oacute; be&aacute;ll&iacute;t&aacute;s&aacute;t annak &eacute;rdek&eacute;ben, hogy a kijel&ouml;l&eacute;sek sim&aacute;n menjenek v&eacute;gbe (a tov&aacute;bbi r&eacute;szleteket l. az adminisztr&aacute;tori oldalon). Ne feledj&uuml;k, hogy ennek eredm&eacute;nyek&eacute;nt egyes leadott munk&aacute;k t&ouml;bbsz&ouml;ri (csoportt&aacute;rsi) &eacute;rt&eacute;kel&eacute;sre ker&uuml;lhetnek, m&aacute;sok pedig kevesebbszer, mint a leadott munk&aacute;k t&ouml;bbs&eacute;ge.</p>
	
	<p>Amikor a tanul&oacute; elv&eacute;gzett egy &eacute;rt&eacute;kel&eacute;st, csoportt&aacute;rsai megtekinthetik. Az a tanul&oacute;, aki leadta a munk&aacute;t, megjegyz&eacute;st tehet az &eacute;rt&eacute;kel&eacute;sre vonatkoz&oacute;an, amennyiben ezt az opci&oacute;t bejel&ouml;lt&eacute;k az adott feladatn&aacute;l. Ha k&iacute;v&aacute;nja, a tan&aacute;r pontozhatja ezeket a csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;seket, az &iacute;gy kapott pontok pedig &aacute;tvihet&#337;k a tanul&oacute;k v&eacute;gs&#337; pontsz&aacute;m&aacute;ba (de erre sok esetben nincs igaz&aacute;n sz&uuml;ks&eacute;g, l&aacute;sd a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;r&oacute;l sz&oacute;l&oacute; r&eacute;szt).</p></li>

<li><p><strong>Tanul&oacute;i &eacute;rt&eacute;kel&eacute;s enged&eacute;lyez&eacute;se</strong> Ebben a szakaszban folytat&oacute;dnak a csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;sek, de a tanul&oacute;k semmi olyan munk&aacute;t nem adhatnak le, amely ism&eacute;telt lead&aacute;st tartalmaz. Azok a tanul&oacute;k, akik nem adtak le munk&aacute;t, arr&oacute;l &eacute;rtes&uuml;lnek, hogy munka lead&aacute;s&aacute;ra nincs tov&aacute;bb lehet&#337;s&eacute;g, &eacute;s <strong>nem</strong> tekinthetnek meg semmilyen (csoportt&aacute;rs &aacute;ltal) &eacute;rt&eacute;kel&eacute;sre leadott munk&aacute;t.</p>
	
	<p>A tan&aacute;r, ha k&iacute;v&aacute;nja, pontozhatja a csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;seket, &eacute;s ezek eredm&eacute;ny&eacute;t &aacute;tviheti a tanul&oacute;k v&eacute;gs&#337; pontsz&aacute;m&aacute;ba (de erre sok esetben nincs igaz&aacute;n sz&uuml;ks&eacute;g, l&aacute;sd a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;r&oacute;l sz&oacute;l&oacute; r&eacute;szt).</p></li>

<li><p><strong>V&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;sa</strong> A hat&aacute;rid&#337; lej&aacute;rta ut&aacute;n a tan&aacute;r a feladatot a  k&ouml;vetkez&#337; szakaszba helyezi &aacute;t, ahol m&aacute;r nincs lehet&#337;s&eacute;g arra, hogy a tanul&oacute;k tov&aacute;bbi &eacute;rt&eacute;kel&eacute;st v&eacute;gezzenek. A tan&aacute;r, ha k&iacute;v&aacute;nja, befejezheti a p&eacute;ld&aacute;kon v&eacute;grehajtott &eacute;rt&eacute;kel&eacute;sek pontoz&aacute;s&aacute;t, valamint a tanul&oacute;i leadott munk&aacute;k pontoz&aacute;s&aacute;t. Ugyancsak pontozhatja a tanul&oacute;k &aacute;ltal elv&eacute;gzett csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;seket. Erre igaz&aacute;b&oacute;l <strong>nincs</strong> sz&uuml;ks&eacute;g, mivel ha kell&#337; sz&aacute;m&uacute; &eacute;rt&eacute;kel&eacute;s &aacute;ll rendelkez&eacute;sre az egyes leadott munk&aacute;khoz, akkor az egyes tanul&oacute;k "pontoz&aacute;si teljes&iacute;tm&eacute;nye" meghat&aacute;rozhat&oacute; a relat&iacute;v ponteredm&eacute;nyek alapj&aacute;n. </p>
	
	<p>A pontoz&aacute;s befejez&eacute;s&eacute;t k&ouml;vet&#337;en a tan&aacute;r kisz&aacute;m&iacute;tja a tanul&oacute; v&eacute;gs&#337; pontsz&aacute;m&aacute;t. A v&eacute;gs&#337; pontsz&aacute;m rendszerint h&aacute;rom &ouml;sszetev&#337;b&#337;l alakul ki, a tan&aacute;rnak a  tanul&oacute; munk&aacute;j&aacute;ra adott pontsz&aacute;m&aacute;b&oacute;l, a  tanul&oacute; munk&aacute;j&aacute;ra adott csoportt&aacute;rs pontsz&aacute;m &aacute;tlag&aacute;b&oacute;l, valamint a tanul&oacute;k pontoz&aacute;si teljes&iacute;tm&eacute;ny&eacute;b&#337;l. Az ut&oacute;bbi mag&aacute;ban foglalja a tan&aacute;r &aacute;ltal a tanul&oacute;k megjegyz&eacute;s&eacute;re adott &aacute;tlagos "oszt&aacute;lyoz&oacute; pontsz&aacute;mot". Erre a h&aacute;rom &ouml;sszetev&#337;re a tan&aacute;r s&uacute;lyokat &aacute;llap&iacute;t meg, miel&#337;tt sor ker&uuml;lne a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;ra.</p></li>

<li><p><strong>V&eacute;gs&#337; pontsz&aacute;m kijelz&eacute;se</strong> El&eacute;rkezik a feladat v&eacute;gs&#337; szakasza, mely sor&aacute;n a tanul&oacute;k megtekinthetik v&eacute;gs&#337; pontsz&aacute;mukat. A tan&aacute;r, ha k&iacute;v&aacute;nja, visszamehet a feladaton &eacute;s &aacute;ll&iacute;that p&eacute;ld&aacute;ul a v&eacute;gs&#337; pontsz&aacute;m kisz&aacute;m&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt s&uacute;lyokon, majd ezt k&ouml;vet&#337;en a tanul&oacute;knak megmutathatja a m&oacute;dos&iacute;tott pontokat.</p>

	<p>A tanul&oacute; (&eacute;s a tan&aacute;r) ugyancsak megtekintheti a tanul&oacute;k leadott munk&aacute;j&aacute;nak a "ligat&aacute;bl&aacute;zat&aacute;t". Itt a megjelen&iacute;t&eacute;s a pontsz&aacute;mok sorrendj&eacute;ben t&ouml;rt&eacute;nik, a legjobb leadott munka &aacute;ll az els&#337; helyen. A leadott munk&aacute;ra adott pontsz&aacute;m a tan&aacute;r &aacute;ltal adott pontsz&aacute;m &eacute;s (ha vannak) a csoportt&aacute;rsi pontok &aacute;tlaga. Az alkalmazott s&uacute;lyoz&aacute;s az el&#337;z&#337; szakaszban alkalmazottal megegyez&#337; s&uacute;lyoz&aacute;s.</p></li>
</ol>

<p>A feladat b&aacute;rmely szakasz&aacute;ban a tan&aacute;r megnyithatja az "Adminisztr&aacute;tor" oldalt. Ezen az oldalon l&aacute;that&oacute; a feladat mindenkori &aacute;llapota. Felsorolja a tan&aacute;r p&eacute;ldak&eacute;nt leadott munk&aacute;it (ha vannak), a tanul&oacute;k &eacute;rt&eacute;kel&eacute;s&eacute;t (a tan&aacute;r p&eacute;ld&aacute;ira, saj&aacute;t munk&aacute;jukra &eacute;s egy&eacute;b tanul&oacute;k leadott munk&aacute;j&aacute;ra vonatkoz&oacute;an), valamint a tanul&oacute;k leadott munk&aacute;it. A tan&aacute;r ezt az oldalt haszn&aacute;lhatja a leadott munk&aacute;k &eacute;rt&eacute;kel&eacute;s&eacute;re &eacute;s &uacute;jb&oacute;li &eacute;rt&eacute;kel&eacute;s&eacute;re, az &eacute;rt&eacute;kel&eacute;sek pontoz&aacute;s&aacute;ra &eacute;s &uacute;jb&oacute;li pontoz&aacute;s&aacute;ra, itt t&ouml;r&ouml;lhet leadott munk&aacute;kat &eacute;s &eacute;rt&eacute;kel&eacute;seket, &eacute;s &aacute;ltal&aacute;ban v&eacute;ve ezen az oldalon k&ouml;vetheti nyomon a feladat menet&eacute;t.</p>
