<p align="center"><strong>&Eacute;rt&eacute;kel&eacute;st v&eacute;gz&#337; csoportt&aacute;rsak sz&aacute;ma</strong></p>
<p>A csoportt&aacute;rsak &aacute;ltal pontozott feladatokhoz &aacute;ltal&aacute;ban 3 - 8 &eacute;rt&eacute;kel&#337; csoportt&aacute;rs kapcsol&oacute;dik. Azaz a csoportt&aacute;rsi pontoz&aacute;si szakaszban minden tanul&oacute;nak ennyi, az oszt&aacute;lyban l&eacute;v&#337; m&aacute;s tanul&oacute;kt&oacute;l sz&aacute;rmaz&oacute; munk&aacute;t kell pontozni. Min&eacute;l nagyobb a feladat annak tartalm&aacute;t illet&#337;en, ann&aacute;l kisebb lesz ez a sz&aacute;m, ellenkez&#337; esetben a pontoz&aacute;s tanul&oacute;kra nehezed&#337; terhe t&uacute;l nagy lesz. Ugyanakkor a tanul&oacute;knak elegend&#337; p&eacute;ld&aacute;t kell l&aacute;tni ahhoz, hogy l&aacute;ss&aacute;k, mit&#337;l lesz egy munka j&oacute; vagy rossz. Tov&aacute;bbmenve, a tanul&oacute; pontoz&aacute;si teljes&iacute;tm&eacute;ny&eacute;nek az &eacute;rtelmes &eacute;rt&eacute;kel&eacute;s&eacute;hez hozz&aacute;tartozik, hogy min&eacute;l t&ouml;bb csoportt&aacute;rs pontoz, ann&aacute;l jobb. Ez a teljes&iacute;tm&eacute;ny feltehet&#337;leg nem lesz m&eacute;rvad&oacute;, ha csak h&aacute;rom vagy n&eacute;gy pontoz&aacute;st k&eacute;sz&iacute;t el egy-egy tanul&oacute;.
</p>	
<p>Felt&eacute;ve, hogy elegend&#337; mennyis&eacute;g&#369; munk&aacute;t adtak le (10-et vagy ann&aacute;l t&ouml;bbet), a rendszer minden tanul&oacute;hoz legal&aacute;bb egy "j&oacute;" &eacute;s legal&aacute;bb egy "gyenge" munk&aacute;t fog hozz&aacute;rendelni. Ez viszont csak akkor hajthat&oacute; v&eacute;gre, ha a tan&aacute;r M&Eacute;G a munka (csoportt&aacute;rsi) pontoz&aacute;sra val&oacute; kijel&ouml;l&eacute;se ELÕTT elv&eacute;gezte a pontoz&aacute;st. M&aacute;sr&eacute;szr&#337;l a tan&aacute;rnak NEM kell minden munk&aacute;t pontoznia, egy minta is elegend&#337;. Emellett a tan&aacute;ri pontoz&aacute;snak NEM sz&uuml;ks&eacute;gszer&#369; a v&eacute;gleges pontoz&aacute;snak lenni, a c&eacute;lnak egy el&#337;zetes pontoz&aacute;s is megfelel. Tekintetbe kell ugyanakkor venni azt, hogy ha be van kapcsolva a tan&aacute;ri pontoz&aacute;st kijelz&#337; opci&oacute;, akkor ezeket a pontokat a tanul&oacute;k l&aacute;tni fogj&aacute;k a leadott munka szakasz&aacute;nak a v&eacute;g&eacute;n. <p>A csoportt&aacute;rsi &eacute;rt&eacute;kel&#337;k sz&aacute;ma lehet nulla is. Ebben az esetben a feladat vagy &ouml;npontoz&aacute;sos feladat lesz, ha ez az opci&oacute; be van kapcsolva, vagy pedig szok&aacute;sos tan&aacute;r pontozta feladat.
</p>
