<p align="center"><strong>Ar&aacute;nytalans&aacute;gi szint</strong></p>

<p>Ez a szint hat&aacute;rozza meg azt, hogy a csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;sek kioszt&aacute;sa az oszt&aacute;lyban kiegyens&uacute;lyozott volt-e, avagy sem. A "kiegyens&uacute;lyozott" itt azt jelenti, hogy az egyes tanul&oacute;i leadott munk&aacute;k h&aacute;nyszor vannak kijel&ouml;lve (csoportt&aacute;rsi) &eacute;rt&eacute;kel&eacute;sre. Ha az ar&aacute;nytalans&aacute;gi szint null&aacute;ra (ZERO) van &aacute;ll&iacute;tva, akkor az &ouml;sszes leadott munka azonos mennyis&eacute;gben van kiadva, vagyis a kijel&ouml;l&eacute;s kiegyens&uacute;lyozott. Amikor a szint 1-re (ONE) van &aacute;ll&iacute;tva, akkor a leadott munk&aacute;k egy r&eacute;sze a t&ouml;bbi kijel&ouml;l&eacute;shez k&eacute;pest eggyel t&ouml;bbsz&ouml;r lehet kiadva (ebb&#337;l ad&oacute;d&oacute;an a leadott munk&aacute;k egy r&eacute;sze eggyel kevesebbszer lehet kiadva, mint a t&ouml;bbi), vagyis a kijel&ouml;l&eacute;s nem kiegyens&uacute;lyozott. Hasonl&oacute;k&eacute;ppen ha a szint 2-re (TWO) van &aacute;ll&iacute;tva, akkor nagyobb kiegyens&uacute;lyozatlans&aacute;got enged&eacute;lyez.</p>

<p>Ide&aacute;lis esetben minden csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;snek kiegyens&uacute;lyozottnak kell lenni. Ugyanakkor ennek az a h&aacute;tr&aacute;nya, hogy n&eacute;h&aacute;ny tanul&oacute; eset&eacute;n nem &aacute;ll rendelkez&eacute;sre az &eacute;rt&eacute;kel&eacute;sre leadott teljes munkamennyis&eacute;g mindaddig, am&iacute;g az  utols&oacute; tanul&oacute; le nem adta a munk&aacute;j&aacute;t. ONE [EGY]-re be&aacute;ll&iacute;tott ar&aacute;nytalans&aacute;gi szint eset&eacute;n a legt&ouml;bb tanul&oacute; azt tapasztalja, hogy eset&eacute;ben megvan az &eacute;rt&eacute;kel&eacute;sre leadott teljes munkamennyis&eacute;g &eacute;s <strong>nem</strong> kell v&aacute;rniuk a k&eacute;sei leadott munk&aacute;kra. A k&eacute;s&#337;n leadott munk&aacute;k mennyis&eacute;ge m&eacute;g kevesebb akkor, ha a szint TWO [KETTÕ]-re van be&aacute;ll&iacute;tva.</p>

<p>&Iacute;gy egy csoportos feladatn&aacute;l, ahol a csoportt&aacute;rsi &eacute;rt&eacute;kel&eacute;sek sz&aacute;ma 5-re van &aacute;ll&iacute;tva, nincs gond abban az esetben, ha a leadott munk&aacute;k egy r&eacute;sze n&eacute;gyszer vesz r&eacute;szt (csoportt&aacute;rsi) &eacute;rt&eacute;kel&eacute;sben, m&aacute;sik r&eacute;sze 5-sz&ouml;r, a t&ouml;bbi pedig 6-szor szerepel, &iacute;gy a feladat &eacute;rt&eacute;kel&eacute;se z&ouml;kken&#337;mentesebben zajlik &eacute;s a tanul&oacute;knak nem kell annyit v&aacute;rni (ha egy&aacute;ltal&aacute;n erre sz&uuml;ks&eacute;g lesz) arra, hogy a t&ouml;bbiek leadj&aacute;k a munk&aacute;t, ha az ar&aacute;nytalans&aacute;gi szint az alap&eacute;rtelmezett nulla &eacute;rt&eacute;kr&#337;l egyre van &aacute;ll&iacute;tva.</p>
