<p align="center"><strong>Tan&aacute;ri p&eacute;lda lead&aacute;sa</strong></p>
<p>Ha a tanul&oacute;knak saj&aacute;t munk&aacute;juk lead&aacute;sa el&#337;tt bizonyos p&eacute;ldamunk&aacute;kat kell &eacute;rt&eacute;kelni&uuml;k, akkor a tan&aacute;r ezt az ugr&oacute;pontot haszn&aacute;lhatja az adott munka lead&aacute;s&aacute;ra. A tan&aacute;r tetsz&#337;leges sz&aacute;m&uacute; munk&aacute;t leadhat. Ha a munk&aacute;k sz&aacute;ma nagyobb, mint az egyes tanul&oacute;k &aacute;ltal &eacute;rt&eacute;kelend&#337; p&eacute;ldamunk&aacute;k&eacute;, akkor a munka kijel&ouml;l&eacute;se v&eacute;letlenszer&#369;, de kiegyens&uacute;lyozott m&oacute;don t&ouml;rt&eacute;nik. A rendszer megk&iacute;s&eacute;rli biztos&iacute;tani azt, hogy minden p&eacute;ld&aacute;t a tanul&oacute;k ugyanannyiszor kapjanak meg. A kijel&ouml;l&eacute;s annyiban v&eacute;letlenszer&#369;, hogy ha - mondjuk - t&iacute;z p&eacute;ld&aacute;t adnak le, akkor kev&eacute;ss&eacute; val&oacute;sz&iacute;n&#369;, hogy az els&#337; tanul&oacute; az 1., 2. &eacute;s 3. leadott munk&aacute;t kapja &eacute;rt&eacute;kel&eacute;sre.</p>

<p>Ha a tan&aacute;r a feladat megfelel&#337; param&eacute;ter&eacute;hez m&eacute;rten kevesebb p&eacute;ld&aacute;t ad le, akkor a tanul&oacute;k csak az adott p&eacute;ld&aacute;kat kapj&aacute;k &eacute;rt&eacute;kel&eacute;sre.</p>
	
<p>Miut&aacute;n a tan&aacute;r leadta a p&eacute;ld&aacute;kat, a tan&aacute;r szempontj&aacute;b&oacute;l &eacute;rdemes a p&eacute;ld&aacute;t &eacute;rt&eacute;kelni, m&eacute;g ha csak r&eacute;szlegesen is. Az ilyen &eacute;rt&eacute;kel&eacute;s a tan&aacute;rra tartozik &eacute;s a tanul&oacute; sz&aacute;m&aacute;ra a feladat sor&aacute;n SOHA nem v&aacute;lik l&aacute;that&oacute;v&aacute;. Ugyanakkor hasznosnak bizonyul, ha a tan&aacute;r a p&eacute;lda tanul&oacute;i &eacute;rt&eacute;kel&eacute;s&eacute;re k&iacute;v&aacute;ncsi. A tanul&oacute;i &eacute;rt&eacute;kel&eacute;s pontoz&aacute;sa sor&aacute;n a tan&aacute;r saj&aacute;t &eacute;rt&eacute;kel&eacute;s&eacute;t a lap tetej&eacute;n, a tanul&oacute; ugyanazon munk&aacute;ra vonatkoz&oacute; &eacute;rt&eacute;kel&eacute;s&eacute;t pedig a lap alj&aacute;n l&aacute;tja. A "plusz" &eacute;rt&eacute;kel&eacute;s hivatkoz&aacute;sk&eacute;nt &eacute;s a p&eacute;ld&aacute;ban l&eacute;v&#337; fontosabb pontok eml&eacute;keztet&#337;jek&eacute;nt szolg&aacute;l. </p>
