<p align="center"><b>Tan&aacute;ri &eacute;rt&eacute;kel&eacute;s s&uacute;lyoz&aacute;sa</b></p>

<p>Ez a rendszerint 1-re &aacute;ll&iacute;tott &eacute;rt&eacute;k haszn&aacute;lhat&oacute; a tan&aacute;r 
b&aacute;rmely &eacute;rt&eacute;kel&eacute;s&eacute;nek a &quot;kikapcsol&aacute;s&aacute;ra&quot;, a tanul&oacute;i &eacute;rt&eacute;kel&eacute;ssel azonos s&uacute;ly
hozz&aacute;rendel&eacute;s&eacute;re, illetve a tanul&oacute;k&eacute;n&aacute;l magasabb s&uacute;ly megad&aacute;s&aacute;ra.</p>

<p>&Eacute;rt&eacute;ke &aacute;ltal&aacute;ban 1. Ezzel a tan&aacute;ri &eacute;rt&eacute;kel&eacute;s a tanul&oacute;ival azonos s&uacute;lyt kap.</p>

<p>El&#337;fordulhatnak helyzetek, amikor a tanul&oacute;k k&ouml;vetkezetesen 
    &quot;f&ouml;l&uuml;l&eacute;rt&eacute;kelik&quot; az &eacute;rt&eacute;kel&eacute;st. El&#337;fordulhat ennek ellenkez&#337;je is, amikor
    a csoportt&aacute;rsi pontok t&uacute;l alacsonyak (de ez ritk&aacute;bban fordul el&#337;). 
    Az alul&eacute;rt&eacute;kel&eacute;s n&eacute;mileg kompenz&aacute;lhat&oacute; ennek az &eacute;rt&eacute;knek a megemel&eacute;s&eacute;vel. 
    Ha p&eacute;ld&aacute;ul az &eacute;rt&eacute;ket 5-re &aacute;ll&iacute;tjuk, ez azt jelenti, hogy ha minden leadott munk&aacute;ra 5 
    tanul&oacute;i &eacute;rt&eacute;kel&eacute;s jut, akkor a tan&aacute;ri &eacute;rt&eacute;kel&eacute;s s&uacute;lya (a gyan&uacute;s 
    &eacute;rt&eacute;kel&eacute;sek kihagy&aacute;sa &eacute;s a pont meg&aacute;llap&iacute;t&aacute;sa tekintet&eacute;ben) azonos
    s&uacute;ly&uacute;, mint az 5 tanul&oacute; &eacute;rt&eacute;kel&eacute;se. Az &eacute;rt&eacute;kel&eacute;sek elemz&eacute;se sor&aacute;n
    a tan&aacute;r&eacute;val nem egyez&#337; tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek nagyobb es&eacute;llyel maradnak ki, ha ez az 
    opci&oacute; 1-n&eacute;l nagyobb. A fennmarad&oacute; &eacute;rt&eacute;kel&eacute;sek k&ouml;zelebb &aacute;llnak a tan&aacute;r&eacute;hoz, 
    &iacute;gy a tan&aacute;ri &eacute;rt&eacute;kel&eacute;s m&eacute;g nagyobb s&uacute;llyal fog szerepelni.</p>

<p>Ezt az opci&oacute;t a feladat sor&aacute;n b&aacute;rmikor m&oacute;dos&iacute;thatjuk.</p>

