<p align="center"><strong>Pontoz&aacute;s n&eacute;lk&uuml;li &eacute;rt&eacute;kel&eacute;s</strong></p>

<p>A tanul&oacute;i &eacute;rt&eacute;kel&eacute;sek &aacute;ltal&aacute;ban a v&eacute;gs&#337; pontsz&aacute;mba 
besz&aacute;m&iacute;t&oacute; jegyeknek egy (csek&eacute;ly) r&eacute;sz&eacute;t teszik ki.
 Ezen &eacute;rt&eacute;kel&eacute;seknek (&eacute;s a tan&aacute;r &eacute;rt&eacute;kel&eacute;seinek) a pontoz&aacute;sa 
 a m&#369;helymodulban a h&aacute;tt&eacute;rben zajlik. Ha egy leadott munk&aacute;t h&aacute;romszor vagy t&ouml;bbsz&ouml;r &eacute;rt&eacute;kelnek, a modul
  megfelel&#337; becsl&eacute;st adhat az &eacute;rt&eacute;kel&eacute;sek &quot;&eacute;rt&eacute;k&eacute;r&#337;l&quot;. 
  (Az egyszer vagy k&eacute;tszer &eacute;rt&eacute;kelt munk&aacute;k eset&eacute;n az &eacute;rt&eacute;kel&eacute;sek a maxim&aacute;lis 
  &quot;pontoz&aacute;si pontot&quot; kapj&aacute;k.) Mivel ez a pontoz&aacute;s rendszeresen ism&eacute;tl&#337;dik, 
  a pontoz&aacute;s n&eacute;lk&uuml;li &eacute;rt&eacute;kel&eacute;sek sz&aacute;ma &aacute;ltal&aacute;ban nulla. (Ne feledje, hogy
  a m&#369;helyekben, ahol az &eacute;rt&eacute;kel&eacute;seket j&oacute;v&aacute; kell hagyatni, a j&oacute;v&aacute; nem 
  hagyott &eacute;rt&eacute;kel&eacute;sek feltehet&#337;leg pontoz&aacute;s n&eacute;lk&uuml;l maradnak. 
  &Iacute;gy az ilyen m&#369;helyfajt&aacute;k eset&eacute;n a pontoz&aacute;s n&eacute;lk&uuml;li &eacute;rt&eacute;kel&eacute;sek 
  sz&aacute;ma feltehet&#337;leg nem lesz nulla, de sz&aacute;muk cs&ouml;kkenni fog, ahogyan az &eacute;rt&eacute;kel&eacute;sek 
  j&oacute;v&aacute;hagy&aacute;sa n&ouml;vekszik.)</p>
    
<p>Ennek az ugr&oacute;pontnak az a szerepe, hogy a pontoz&aacute;si pontokat, azaz az &eacute;rt&eacute;kel&eacute;sekre adott 
pontokat a rendszer &uacute;jrasz&aacute;molja. Erre a tan&aacute;r akkor tarthat ig&eacute;nyt, amikor az al&aacute;bbi k&eacute;t lehet&#337;s&eacute;g
 valamelyike megv&aacute;ltozik:
<ol>
    <li>Az &quot;&Eacute;rt&eacute;kel&eacute;sek &ouml;sszehasonl&iacute;t&aacute;sa&quot;;</li>
    <li>A tan&aacute;ri &eacute;rt&eacute;kel&eacute;sekhez meg&aacute;llap&iacute;tott s&uacute;lyoz&aacute;s.</li> 
</ol>
    Erre a pontra kattintva azonnal megt&ouml;rt&eacute;nik a pontoz&aacute;si pontok friss&iacute;t&eacute;se,
    &iacute;gy megjelennek az adott param&eacute;terek &eacute;rv&eacute;nyes &eacute;rt&eacute;kei. A m&#369;hely egy&eacute;b be&aacute;ll&iacute;t&aacute;sainak, p&eacute;ld&aacute;ul mag&aacute;nak a pontoz&aacute;si pont &eacute;rt&eacute;k&eacute;nek
    a m&oacute;dos&iacute;t&aacute;sa <strong>nem</strong> teszi sz&uuml;ks&eacute;gess&eacute; ezen &uacute;jrasz&aacute;m&iacute;t&aacute;s v&eacute;grehajt&aacute;s&aacute;t.</p>
    
